{
  "id": "8183617",
  "title": "1205UK announces that it will halt sharing information with the United States on drug smuggling oper",
  "url": "https://patriots.win/p/1ARK9l8YuF/uk-announces-that-it-will-halt-s/c",
  "content": "1207 UK announces that it will halt sharing information with the United States on drug smuggling operations in the Caribbean after US strikes on cartel boats. 🔥🏛️ MURDEROUS LEFT 🏛️🔥 posted 1 day ago by DebunkTheLeft 216 comments award share report block Libs of TikTok @libsoftiktok • 1d BREAKING: UK announces that it will halt sharing information with the United States on drug smuggling operations in the Caribbean after US strikes on cartel boats. They don’t want us to defend our nation from drug-smuggling terrorists. The UK loves coddling criminals and\n216 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget FusionBlack 200 points 1 day ago We should halt military protection. I mean they have already been invaded so... permalink award report block reply learntocode 94 points 1 day ago Halt? No, we should take over the country from our well established military footprint all over the U.K. permalink parent award report block reply Tellsyouhow 48 points 1 day ago Please do. (I'm going to get jailed for this.  It's a joke Starmer.....) permalink parent award report block reply Sig229 38 points 24 hours ago The satanic nazi cunts running the British government are the enemy of the British people as well as the American people. Take that from a Brit. permalink parent award report block reply YT45 16 points 24 hours ago Liberating Britain is a foreign war I could be willing to fight, but only if the Brits step up and do their part (as I trust you would). permalink parent award report block reply VictorThomas451 4 points 22 hours ago Facts. permalink parent award report block reply roadrunner0 2 points 20 hours ago The USA does not want to be the main force in yet another European war.. 80 years ago we were protecting you from what your country has become today.. permalink parent award report block reply 1_Badcop 2 points 20 hours ago So how about a 2nd English Civil War? Where is the new Oliver Cromwell? permalink parent award report block reply Maskurbator 2 points 20 hours ago Sigh. If the people in charge of Britain were Nazis, Britain wouldn't have this problem. You think Hitler would have let Europe get over run by hordes of Africans and Jeets and Muzzies? Britain would be better off today if Hitler had won. permalink parent award report block reply view 7 more comments... load 1 more comments... Bidensmellslikepiss 14 points 23 hours ago Hi Starmer. I'm American. We're coming to liberate the UK and fuck your mom. Come get me, bitch. permalink parent award report block reply SuperHonkey 6 points 23 hours ago Oye! 😳 permalink parent award report block reply WassermanSchultz 22 points 1 day ago No thanks.  I'm not interested in another war against sand people. permalink parent award report block reply SaltyArmyChick 13 points 1 day ago Sand fkn ppl 🤣 permalink parent award report block reply zooty 8 points 24 hours ago Always coming back in greater numbers. permalink parent award report block reply view 2 more comments... Run_over_Antifa 6 points 24 hours ago It was fun watching them shoot at pod racers as a sport. permalink parent award report block reply ChimpanzeeFatigue 3 points 24 hours ago I didn’t know that they actually literally fucked farm animals until I saw it. So at least theres that permalink parent award report block reply westrock2000 3 points 24 hours ago Took me a second to get it. Clever girl! 🦖 permalink parent award report block reply Hairytacofanatic 6 points 24 hours ago lol why? So we can fucking feed the brown Muslim horde that has that country occupied? No thanks. permalink parent award report block reply YT45 4 points 24 hours ago I think the point would be to expel/exterminate said horde. permalink parent award report block reply Quietam_Unum 1 points 7 hours ago No, we should take over the country So, \"make the UK landing strip one again\"? permalink parent award report block reply possibletower 16 points 1 day ago I wish Trump would be as firm against China as he is on Canada/UK/NATO countries. He simped hard for Chicom student visas in the recent 60 Minutes interview yet again. We get fucking nothing from China in a compromise over Trump maintaining that he loves having 600,000 Chinese student visas every year. permalink parent award report block reply TheTelltaleFly 20 points 1 day ago Whenever you read “Chinese student” just interchange it for “Chinese spy.” It’s what’s actually going on. We continue to fund our own demise. permalink parent award report block reply TheThreeSeashells 15 points 24 hours ago The worst part is he actually believes we're taking their \"best and brightest\" away from them.  It would be nice if someone informed him that's not how it works. permalink parent award report block reply BidenShowerDrool 5 points 24 hours ago Trump knows that 600K students bring in a lot of GDP especially when it cost them about 100K/year each. This is why he likes the Chinese money. ~60 Billion annually  is a sizable chunk of change for temporary scholastic visas. permalink parent award report block reply peterstrzoked 6 points 22 hours ago “Losing” $60B annually to remove 600k spies seems really cheap to me. I bet our assorted counter intelligence agencies spend way more “per spy” for the ones they catch… if they catch any at all. permalink parent award report block reply Boudica 3 points 23 hours ago The best plan would have been to try and indoctrinate these Chinese \"students\". To teach them how bad communalism is, and how much it has failed over other years. But unfortunately that will not happen. permalink parent award report block reply dunkeaters 0 points 18 hours ago We get hundreds of billions in tariffs from Chinese imports, our companies get far lower tariffs exporting there, and low iq people think Chinese student visas matter? MAGA is doomed once Trump retires if the base is that dumb. permalink parent award report block reply ColonelKlink 9 points 1 day ago I read that our government was paying for their defense, tv/media propaganda, and healthcare scheme. Hopefully, that was all cut off. permalink parent award report block reply Orlando_Doom 8 points 24 hours ago We need out of NATO permalink parent award report block reply Toobigtorig1234 5 points 24 hours ago BBC \"US strikes on alleged drug boats violate law, UN human rights chief says\"....UK cucks all the way https://www.bbc.com/news/articles/cx2nx95pgz7o permalink parent award report block reply tiamat 7 points 24 hours ago Honestly we should remove their nukes, Islamic nations having nukes is never a good thing permalink parent award report block reply load 3 more comments... hughjasske69 94 points 1 day ago Well well well look who's enabling the drug smugglers permalink award report block reply McFatty7 28 points 1 day ago I hate it when the media pushes the narrative that \"President Trump is attacking our allies.\" Because that's just the \"cover\" they use to try to fuck us over in other ways, like this drug smuggling and tariffs. permalink parent award report block reply Orlando_Doom 5 points 24 hours ago We have no allies, just vassals. And of course our ruler, King Netanyahoo. permalink parent award report block reply SilentSniper 61 points 1 day ago So the UK is defending drugs/smugglers?? permalink award report block reply magapatriot_pa 54 points 1 day ago They defend foreign muslims who rape little girls and call anyone who talks about it racist. Is it really that much of a stretch? permalink parent award report block reply IncredibleMrE1 20 points 1 day ago Doesn't just call anyone who talks about it racist, arrests and imprisons them. permalink parent award report block reply SaltyArmyChick 8 points 24 hours ago Ya. Theyre fkn pedo lovers. All the real men died so mostly soft pussy ass bitchz left. Sad… permalink parent award report block reply learntocode 13 points 1 day ago UK has been the original drug smuggler to beat drug smugglers. The British fought multiple wars to maintain their abiity to flood opium into China and other nations. The stash their wealth in offshore banks ... located riiight next to where the U.S. is building up assets \"to invade Venezuela\". permalink parent award report block reply Nibba2 1 points 20 hours ago Doesn’t every Muslim want the US dead? permalink parent award report block reply tw0scoops 60 points 1 day ago What an odd thing to say/do..... permalink award report block reply DingleBalls 44 points 1 day ago Fine then stop cooperating with the UK and start putting them on lists of terrorist and smuggler accomplices permalink award report block reply brainphreeze 11 points 24 hours ago Starmer isn't intelligent enough for this (he's a pathetic weasely loser who wants to appease the EU), but it's possible he's happy to hurt the US alliance so that he has a reason to further push the UK back into the arms of the EU and NATO permalink parent award report block reply SaltyArmyChick 5 points 24 hours ago Agreed 👍 permalink parent award report block reply learntocode 37 points 1 day ago Oh, our Special Relationship isnt so special once we stop your opium war, is that it? U.K. has been an enemy to Americans since before the Revolutionary War. permalink award report block reply that_sound 5 points 22 hours ago Dollars (or pounds) to donuts Christopher Steele's got the ok for his peepee dossier from MI6 and 10 Downing. That was an act of war. And should be dealt with as such. While that gets ignored, this sounds like the perfect time to leave NATO. permalink parent award report block reply Say_what_again 2 points 23 hours ago Finally someone who gets it permalink parent award report block reply Cuetardian 33 points 1 day ago King Charles is a closet muslim along with his friend Keir Starmer. They are a big part of the reason for the horror life in the UK has become. \"The Andrew formerly known as Prince\" is being sacrificed to take the attention off Charles, who is orders of magnitude worse. Look up his best pal Jimmy Savile, just to start with. permalink award report block reply IncredibleMrE1 13 points 1 day ago Does Keir Starmer's jewish wife with whom he celebrates shabbat every week know he's a muzzie? permalink parent award report block reply Orlando_Doom 13 points 24 hours ago Definitely, jews work with muzzies all the time. Only a retarded dumbass doesn't know that. permalink parent award report block reply IncredibleMrE1 4 points 24 hours ago Does Hillary carry hot sauce in her purse? permalink parent award report block reply Orlando_Doom 3 points 23 hours ago Depends on the audience she's trying to con at the time. I'm sure she carries A-1 in Texas. permalink parent award report block reply KernalMustard 5 points 1 day ago I sometimes wonder where they get this stuff. permalink parent award report block reply Porkbut 5 points 24 hours ago Who opened the gates of toledo! (Is this the right way, groypers?) permalink parent award report block reply NZbacon 3 points 23 hours ago Starmer is Jewish, not Muslim. permalink parent award report block reply Cuetardian 5 points 23 hours ago Supposedly, but Starmer sure behaves like a muslim sympathizer. It's the same way King Charles is supposed to be the head of the Church of England but advocates for the invading muslims full time. permalink parent award report block reply NZbacon 2 points 8 hours ago That's what they do. permalink parent award report block reply DefKon1 24 points 1 day ago I wouldn't trust the UK for any kind of intel these days. Look what they did to themselves. How can they possibly help us?🤷 permalink award report block reply steini1904 3 points 23 hours ago UK intel dropped some major insights on the local flora eating up the Ukrainian counter-offensive. Don't come crying for help later when the phytoplankton blooms. permalink parent award report block reply DefKon1 2 points 18 hours ago lmao! Well, OK, then I guess they are the \"go to\" if we get attacked by Giant Protozoa From Outer Space. That's prolly worth a few billion taxpayer dollars anyway..🤷 permalink parent award report block reply SicSemperTyrannis2 2 points 17 hours ago You just wait until the attack of the killer tomatoes! https://m.youtube.com/watch?v=txfdGlxEsG8&pp=ygUeQXR0YWNrIG9mIHRoZSBraWxsZXIgdG9tYXRvZXMg permalink parent award report block reply KungPaoMcChicken 19 points 1 day ago Drug smugglers lives matter! Rofl permalink award report block reply dirtysanchez69 17 points 1 day ago Oh no! Anyway. permalink award report block reply Patrick_Bateman 1 points 21 hours ago Let's just pay Fusion GPS to say they're all drug boats. #winning permalink parent award report block reply madeaprofilejustforu 16 points 1 day ago Fags innit permalink award report block reply SaltyArmyChick 3 points 24 hours ago Yep. Power bottom vibez… permalink parent award report block reply Grindelwald 15 points 1 day ago So the boats were headed toward the UK?  Long boat ride permalink award report block reply RocksCanOnlyWait 7 points 1 day ago Several Caribbean islands are either directly controlled by the UK or in their dominion. permalink parent award report block reply KernalMustard 3 points 1 day ago And during hurricane season. permalink parent award report block reply NoticesBugleOWO 14 points 1 day ago lol like we needed their help. Fucking retards. permalink award report block reply LibertyStillMatters 7 points 1 day ago The managed decline of the U.S is a global joint effort. permalink award report block reply Buff_cousin_Elroy 7 points 1 day ago Uk are mega fags permalink award report block reply RoughBoy 7 points 1 day ago They really need their c0ke permalink award report block reply NZbacon 2 points 23 hours ago European leadership would collapse without it. permalink parent award report block reply AwShitHereWeGoAgain 6 points 1 day ago Fucking limey faggots.  You're next. permalink award report block reply Yawnz13 6 points 1 day ago Libs of TikTok misrepresenting the situation. https://www.washingtonexaminer.com/policy/foreign-policy/3883338/uk-intel-sharing-us-drug-vessel-strikes/ \"Anonymous whistleblowers from the United Kingdom will no longer share crucial intelligence with the United States due to President Donald Trump‘s counternarcotics operations. \" So no official policy has been put out by the UK. permalink award report block reply TheThreeSeashells 4 points 24 hours ago Not necessarily.  The article to which you linked says \"The U.K., which controls a number of intelligence assets in the region, has helped the U.S. locate vessels suspected of carrying drugs so that the U.S. Coast Guard could interdict them, the sources told CNN. U.K. leadership’s decision means they will no longer direct the intelligence they collect to the Joint Interagency Task Force South in South Florida, which comprises representatives from partner nations that combat the international drug trade.\" So, this is not just a handful of \"anonymous whistleblowers\" and is definitely coming from the U.K. government.  It's actually odd that the article phrased it the way they did, except that it's poorly written. Other articles I've come across elsewhere are saying this is definitely coming from the UK government specifically because they are concerned that the attacks violate \"international law\" and they don't want to be considered complicit in the attacks. permalink parent award report block reply Yawnz13 3 points 24 hours ago So, this is not just a handful of \"anonymous whistleblowers\" and is definitely coming from the U.K. government. It's actually odd that the article phrased it the way they did, except that it's poorly written. Clearly not, as the article stated in the quoted section. Your quoted section does not preclude the previously quoted section.  The UK having intel assets in the region does not confirm nor deny the truth of LibsofTikTok, but it does show that she is willing to misrepresent the situation.  Until you have verifiable policy change from the UK government and not mere innuendo, all you've got is talk.  Talk is cheap. Other articles I've come across elsewhere are saying this is definitely coming from the UK government specifically because they are concerned that the attacks violate \"international law\" and they don't want to be considered complicit in the attacks. So link them then. permalink parent award report block reply TheThreeSeashells 2 points 24 hours ago Here you go: https://townhall.com/tipsheet/amy-curtis/2025/11/11/cnn-uk-stop-sharing-intelligence-over-drug-smuggling-airstrikes-n2666269 The United Kingdom is no longer sharing intelligence with the US about suspected drug trafficking vessels in the Caribbean because it does not want to be complicit in US military strikes and believes the attacks are illegal Oh, and that previous section you mentioned?  I didn't mention it because it's a non-statement: “It is our long-standing policy to not comment on intelligence matters,” a U.K. government spokesperson told the Washington Examiner. “The U.S. is our closest ally on security and intelligence. We continue to work together to uphold global peace and security, defend freedom of navigation, and respond to emerging threats.” However, right before that it says: The U.K. has joined an international consensus that Trump’s decisive military action against the international drug dealers is illegal. If they're joining the \"international consensus\" that the military strikes are illegal, that backs the claims that the government is on-board with withholding intelligence.  Not just a few \"whistleblowers.\" Regardless, the Examiner article is still poorly written. permalink parent award report block reply Yawnz13 1 points 24 hours ago Here you go: https://townhall.com/tipsheet/amy-curtis/2025/11/11/cnn-uk-stop-sharing-intelligence-over-drug-smuggling-airstrikes-n2666269 And take a look at their evidence:  A Twitter post from the Breakin911 account.  Said account engages in the same Twitter slop behavior and has presented the same amount of evidence to the claim as LibsoftikTok i.e. none. Oh, and that previous section you mentioned? I didn't mention it because it's a non-statement: That wasn't the \"previous section\" in mentioned.  Had you actually bothered to read my initial post for comprehension, you'd have seen that. There's also no such thing as a \"non-statement\".  That quote is support for the Washington Examiner's article, not LibsofTikTok or Breaking911. If they're joining the \"international consensus\" that the military strikes are illegal, that backs the claims that the government is on-board with withholding intelligence. Not just a few \"whistleblowers.\" Furthermore, since it's \"whistleblowers\", it shows that the UK wasn't officially sharing intel on the matter with the US anyway.  If they were, it'd be through official channels and not \"whistleblowers\". Incorrect.  One does not prove the other.  They can believe that what Trump is doing is wrong, but that doesn't prove that they have made any official policy on the matter.  Until you provide explicit policy on the matter, the Washington Examiner article holds true. Regardless, the Examiner article is still poorly written. According to what objective criteria?  Oh wait, you can't back that up either and are merely making the statement as an attempt to poison the well. permalink parent award report block reply view 4 more comments... SicSemperTyrannis2 2 points 17 hours ago They skeered. They know Islamic jihad is involved somehow, and will retaliate. permalink parent award report block reply Froynlavenfroynlaven 1 points 23 hours ago Bait from LOTT?  I don't believe it! permalink parent award report block reply Yawnz13 1 points 23 hours ago Gotta cash in on the hype train.  Hyperbole sells. permalink parent award report block reply Aggrieved03 5 points 1 day ago Why aren't we striking the drug production facilities in Chyna? permalink award report block reply Agenda47 6 points 1 day ago China has nuclear missiles. permalink parent award report block reply Aggrieved03 3 points 1 day ago What have they killed with fentanyl, way upwards of half a million. permalink parent award report block reply IncredibleMrE1 5 points 1 day ago Sounds like a win for us. permalink award report block reply j2daeww 5 points 1 day ago Hmmm what’s the saying? Follow the money? permalink award report block reply DeepStateParasite 4 points 24 hours ago Keir \"The Muslim's Bitch\" Starmer. Go figure. permalink award report block reply Skywise 4 points 24 hours ago Then why were they sharing it to begin with if they don’t like us doing something with the information?! permalink award report block reply MEME-SUPREME 4 points 24 hours ago Muslims tell Keir Starmer what to do. permalink award report block reply Trump-16-20-24-28-32 4 points 24 hours ago That means, to me, they are protecting their interests... there's no other reason. permalink award report block reply CruzControl 4 points 1 day ago Restore the fort on Water Island. That thing was designed to vaporize any unauthorized vessel that sailed between St. Thomas and St. Croix during WWII permalink award report block reply Goldfinger2211 4 points 1 day ago The US can end their nuclear agreement with the UK Navy for the Trident system, essentially de-arming their ballistic missile subs and deep sixing their nuclear deterrence.  The UK military becomes Sweden. permalink award report block reply MinnieWhittaker 4 points 1 day ago The UK then went back to arresting Britons for complaining about mass rape by Muslim \"refugees.\" permalink award report block reply Than0sIII 4 points 24 hours ago They act like they had MI6 agents on board. Or were the drug providers. permalink award report block reply GuerillaYourDreams 4 points 24 hours ago Brits love narco-terrorists. permalink award report block reply DontTreadOnLego 4 points 1 day ago USA needs to stop sharing any info with the uk permalink award report block reply AbrahamLincoln 4 points 24 hours ago We have satellites.  We don't need their info. permalink award report block reply iamimaginos 3 points 22 hours ago I cant imagine they know anything we dont permalink award report block reply Greenhills 3 points 1 day ago lol. And Pete hegseth laughed. permalink award report block reply IsrorOrca 3 points 24 hours ago The joke is on the UK, everything they \"share\" with us, we provided to them via back channels. They aren't the source of any of it. permalink award report block reply NZbacon 1 points 23 hours ago The way it works is they each spy on the others citizens to allow deniability. permalink parent award report block reply sorrytodisagree 3 points 24 hours ago Their intel is probably as fake as the BBC anyway. permalink award report block reply lixa 3 points 24 hours ago Trump should sanction the UK for their human rights violations. permalink award report block reply SicSemperTyrannis2 1 points 17 hours ago Tariff their cocaine. permalink parent award report block reply The_RedWolf 3 points 24 hours ago they were helping? permalink award report block reply utfanx2 3 points 23 hours ago Starlink goes brrrrrrt. permalink award report block reply Username_here 3 points 1 day ago LOL. Like their intelligence on South American drug operations is worth anything anyway permalink award report block reply borisborscht 3 points 24 hours ago let them do what they want, but they are on their own now. permalink award report block reply reasonablydisturbed 3 points 24 hours ago Fuck it. We'll do it live! permalink award report block reply MJPalazzolo 3 points 16 hours ago The British are still our enemy. permalink award report block reply flashersenpai 2 points 23 hours ago So? Why would the UK be obligated to take part in bombing boats by Venezuela? permalink award report block reply MemoryHoleyeO 2 points 19 hours ago So multiple countries halt Intel sharing based on cartel killing. That's called compromised. That's called meetings happened before permalink award report block reply AVeryNakedMan 2 points 22 hours ago So the UK would rather have US citizens die from drug overdoses, rather than drug runners die. permalink award report block reply tholinz 2 points 22 hours ago Halt all intelligence sharing with them. This sounds like a great excuse to do so. permalink award report block reply nolefthandshakes 2 points 22 hours ago again, sanction the fucking UK. they’re a muslim country. permalink award report block reply Sunnybats2 2 points 20 hours ago Thw UK is history's greatest drug smuggler DUH permalink award report block reply ridge3z 1 points 18 hours ago It was the British who were tasked with the eradication of poppies in Afghanistan and stopping farmers from growing more after the 2001 invasion. But the opposite happened and cultivation only increased. Helmand province, where British troops were heavily deployed from 2006, saw opium production triple compared to when the troops first arrived. Hmm.. permalink parent award report block reply MorningFrost 2 points 22 hours ago And we shall halt military protection. permalink award report block reply MisprisionIsEvil 2 points 22 hours ago The UK has become a criminal, third world shit hole. permalink award report block reply patrioticwinning3 2 points 24 hours ago Kick them out of 5 eyes! permalink award report block reply SicSemperTyrannis2 1 points 17 hours ago Remove ourselves from 5 eyes. permalink parent award report block reply gaijin_ronin 2 points 22 hours ago The mooslimes have fully taken that country. permalink award report block reply KennyKetchem 2 points 1 day ago The UN is making profits off of it and the UK is doing their bidding. So are members of congress and China. Why else would the UN fund the invasion of our border? They are getting kickbacks from the sale of these narcotics and human trafficking. permalink award report block reply CruzControl 2 points 1 day ago Someone quickly discover oil on the BVI. permalink award report block reply roadrunner0 2 points 19 hours ago The USA needs to draw way down from NATO as Europe has become Fascist and Communist so there is nothing left to protect.. Let's cut them off from our surveillance satellites and other intel.. I believe 5 eyes is already down.. permalink award report block reply Bapple 2 points 23 hours ago Stupid.  But also kind of curious what intel they would have here that we wouldn’t?  I guess it’s time for USA to leave NATO, the UN, and the five eyes.  No one is an ally to us, why should we help or cooperate with any of them? permalink award report block reply BrewSwillis 2 points 21 hours ago Maybe we should cut our NATO funding, until they rethink this? permalink award report block reply Znut55 2 points 1 day ago Send the boats to the UK permalink award report block reply Agenda47 2 points 1 day ago Do we have any leverage over them somewhere where we can stop sharing information with them? Something that will really hurt them. permalink award report block reply plateowner2024 2 points 13 hours ago ROTFLMAO. Starmer has a crew in the Caribbean. Hahahahaha! permalink award report block reply ltbadpuppy 2 points 24 hours ago UK: we thought you guys like to watch like us?! permalink award report block reply ImpeachThisBitch 2 points 1 day ago What intelligence? Unless the drug smugglers misgendered someone. permalink award report block reply NewGoldenAge 2 points 24 hours ago Question - were we even needing them before? Here's a thought - throttle NATO. permalink award report block reply Shitnooo 2 points 19 hours ago Wonder what type of kickback UK gets from the drugs being smuggled. permalink award report block reply ridge3z 2 points 18 hours ago The Opium Wars comes to mind. permalink parent award report block reply Tacitus1963 2 points 15 hours ago PDJT, please tariff the UK more.\nHopefully, it will make Starmer even more unpopular to the point where he is run out of town on a rail! permalink award report block reply stillbringingitback 2 points 22 hours ago That’s cool, not like you faggots helped with anything anyways lol. permalink award report block reply cook_does 2 points 19 hours ago UK? To think we sided with those weak faggots over Hitler, for what? permalink award report block reply ridge3z 2 points 18 hours ago We should have just stayed isolationist during WWII permalink parent award report block reply mcoulton 2 points 23 hours ago We can finally go after 5-eyes permalink award report block reply newuser8 2 points 24 hours ago Bunch of cucks permalink award report block reply Beat_to_Quarters 2 points 24 hours ago This is virtue signaling that is so retarded it actually does the opposite of what it's intending to do. If they have intel that, for instance, some of these boats actually aren't drug smuggling assholes and they decide not to share that intel with its so-called ally, then they're going to let the U.S. military strike the boats? Wouldn't sharing intel on, you know, DRUG SMUGGLING OPERATIONS, prevent doing the thing you're protesting? Also fuck the UK. They'll spy on American citizens with their Five Eyes bullshit but this is just too much for them. permalink award report block reply POTUS_DonnieJ 2 points 23 hours ago Remind me why we are still allies with that shithole? Between them locking up their own citizens for speech, allowing themselves to be invaded, meddling in our elections (Starmer sending party members here before last November) and their biggest state owned and state controlled media company deceptively editing Trump's J6 speed, its beyond time to sanction them back to the stone age. permalink award report block reply Ligersrule1 2 points 22 hours ago Reciprocate now! permalink award report block reply FlyCatcher94 1 points 11 hours ago Ok.  We can just stop 5eyes all together and they don’t get shit from us either. permalink award report block reply Crappydatum 1 points 24 hours ago James Bond leaves the chat permalink award report block reply DatabaseCentrals 1 points 24 hours ago Why would UK be tracking drug smuggling operations in the Caribbean permalink award report block reply Lk4000 1 points 24 hours ago We need to liberate the UK permalink award report block reply ridge3z 1 points 18 hours ago We are seeing the true faces of so many nations in their reaction over the USA prioritizing its own well-being after decades of 'free trade' and 'UN' bullshit that only caused our domestic decline. Don't forget that between their liberals and their royals, the UK is every bit as elitist and still have their imperial streak permalink award report block reply RedStoneDeepState 1 points 24 hours ago Give aid to Russia and China in regards to UK military secrets. permalink award report block reply Oodles 1 points 18 hours ago lol Fuck the UK. Stop sharing intel with them, defund the UN, and double UK tariffs permalink award report block reply YodaBannon 1 points 24 hours ago honk honk permalink award report block reply Jmricht 1 points 24 hours ago Can we just stop the drugs for a sec. permalink award report block reply Wtf_socialismreally 1 points 24 hours ago Then we should stop giving any aid whatsoever, including breaking off every alliance we have with them. Part of being our ally is that you give us that information. permalink award report block reply Nerdrem3 1 points 24 hours ago Someone tell them that Venezuelans aren't typically muslim. permalink award report block reply Prof_Smith 1 points 1 day ago What you need to remember is a lot of these drugs getting blown up aren’t for America but actually going to Europe. permalink award report block reply OhhhhNooooThatSucks 1 points 19 hours ago woke retards.  Standing behind literal drug boats. permalink award report block reply ghettometal 1 points 19 hours ago Wait until (((LOTT))) learns, that the Cartels are heavily linked to Israel and jews doing big business to the detriment of Western societies. permalink award report block reply SoyLatte 1 points 11 hours ago Odd when everyone was so squirt during Obamas unconstitutional drone strikes permalink award report block reply dtrap 1 points 24 hours ago Western nation doesn't want to get involved in or become a party to extra-judicial killing. Who could have seen that coming? That was an interesting boat. Where were the crew? It almost looked like one of those drones used for target practice. These aren't death rays. Gather the evidence to show that these operations are what they are said to be. permalink award report block reply asodfiu43253457 1 points 22 hours ago It's because Trump is suing teh Beeb permalink award report block reply TheFountainhead 1 points 21 hours ago Pussies permalink award report block reply Hellsbells00 1 points 20 hours ago The UK has never been a good ally. Fuck the bongs. Let them collapse. Demand back oay for covering their ass. permalink award report block reply ridge3z 1 points 18 hours ago They were at one time to a good degree. But that was during a time long gone. Their liberals and royals think that the USA is their vassal. permalink parent award report block reply Foxbat 1 points 17 hours ago Now we know who is profiting from the drug operations. permalink award report block reply Orlando_Doom 1 points 1 day ago Strike the UK, they've aligned with our enemy. The English must die, finish them off. Nuke that pathetic island of cucks. We bombed Iran for less. We invaded Iraq and Afghanistan for less. The UK is a nuclear-armed islamic threat. They helped create the false conspiracy to overthrow our government in 2020. They are as evil as israel. permalink award report block reply SaltyArmyChick 1 points 24 hours ago He right 🤔 permalink parent award report block reply MagaChamp253 1 points 24 hours ago So they choose the side of drug runners. Ok then... permalink award report block reply finnigan 1 points 9 hours ago Good, dissolve 5 Eyes and be done with Europe. permalink award report block reply KeepMarxInTheGround 1 points 16 hours ago Someone explain to me how these countries are our \"allies.\" permalink award report block reply dr_gonzo 1 points 23 hours ago I have no problem with that. I don't think Trump or anyone else in our idiotic government has the right to dictate what I can and can't ingest into my own body, the same way I don't think they have a right to tell me what I MUST ingest into my own body. The people who were opposed to vax mandates while simultaneously supporting drug prohibition laws have no leg to stand on. You granted government that right. You shouldn't bitch when it predictably backfires in your face. Besides, just like alcohol prohibition, the drug prohibition laws don't work anyway. The Narcotics Act was passed over 50 years ago, and more people do drugs now than they did when Democrats passed it. Nobody can claim those laws are \"protecting people\". The data show that to be entirely false. Besides, in a free society where the individual is superordinate to the state, it's not the responsibility of our SERVANTS in government to protect the individual from themselves. The war on drugs is a counterproductive abysmal failure. Downvote all you want. That won't make that statement any less true. permalink award report block reply Caine 2 points 18 hours ago This isn't like the Reagan-era war on drugs. Fentanyl is being sent here by China to kill as many of us as it can. permalink parent award report block reply OMC-RADIO 1 points 11 hours ago While I agree with body autonomy, a government with borders has every right and obligation to protect its people.  The narcotics industry is a black market, not recognized trade.  Allowing the narcos to sell their unregulated, untested products by crossing the US borders is funding the cartels who sell dangerous products that destroy lives and corrupt government officials.  The US has every reason and right to see the influx of such dangerous, destructive and deadly products as an assault against its people. While most people don’t care what someone else puts in their mouth or body, they don’t want to experience the direct or indirect effects of it either. permalink parent award report block reply NoFats 1 points 24 hours ago The UK needs to be put in its place. permalink award report block reply TearsAficionado 1 points 24 hours ago Confiscate their nukes. Immediately. permalink award report block reply OMC-RADIO 1 points 12 hours ago They are not now, nor have they ever been, our ally. It is hypocrisy for a FREE country to ally with or in any way support tyrannical regimes. permalink award report block reply DlanOdcammron 1 points 19 hours ago The stereotype of Colombians being narcos exists for a reason. permalink award report block reply yukondave 1 points 1 day ago \"UK weighs strategic calculations against aid\nIn the UK, pressures on defence are long-standing. Its Defence Equipment plan has gaps in excess of £15 billion. Its parliament has warned that the military could not sustain a prolonged fight. Its force size is not thought to be enough to meet NATO commitments, let alone any expanded long-term presence in Europe. \" permalink award report block reply MajorClark 1 points 23 hours ago The UN is running human trafficking and drug trafficking through the UK.   They're calling the shots for British just like they did the USA until President Trump came along!   Somebody in parliament is missing their cut of the drug dealers kickbacks.   Starmer needs to stop sucking muslim cock. permalink award report block reply cherbui 1 points 24 hours ago welp since uk has fallen under Islamic control....  we can see why they would defend terrorist permalink award report block reply Canadiapede7 1 points 23 hours ago We know who the money is going to, the UN and Geneva conventions are only followed by one side. War crimes? If we are at war, it is kill or be killed, this bullshit of trying to live peacefully with trash that share no values with us is what has killed the west. Kill every single smuggler, lay waste to these scum bags, it is the only way to stop it. permalink award report block reply TheThreeSeashells 1 points 24 hours ago Stop destroying the boats.  Seize the drugs.  Funnel them to the UK.  If they love the drugs so much, they can have them.  Let the drugs destroy THEIR country.  Or, rather, finish off their country for good.  They're already doing a splendid job destroying it otherwise. permalink award report block reply Shitsbrokeyo 1 points 24 hours ago I bet their intel for smuggling is significant. (Rolls eyes) permalink award report block reply barwhack 1 points 23 hours ago Eh. Just target anything from a narco-state or from Angland . Oops, Starmy, we couldn't tell, because we didn't know where your assets were. --😀 Even if we know. permalink award report block reply patrick_tribett 1 points 12 hours ago I lmfao when I watch these videos. permalink award report block reply ancroidubh 1 points 11 hours ago Didn’t the Steele dossier come from British SIS? Can their other information be trusted? permalink award report block reply Bldg_2019 1 points 24 hours ago Cool. Begin strikes on UK naval vessels and blockade their Caribbean colonies. permalink award report block reply SocraticMethod1 1 points 24 hours ago Wait, the UK has the tech to detect boats trespassing different territories? Can we confirm this as they haven't shown this ability before? permalink award report block reply Justlooking250 1 points 18 hours ago Absolute clown world cunts permalink award report block reply Repentnow 1 points 20 hours ago F̶i̶v̶e̶ Four Eyes permalink award report block reply King_Boobus_Toobus 1 points 21 hours ago I'm sure that's going to make a really big difference.  No more intel from James Bond on the Octopussy. permalink award report block reply LogicalReasoning 1 points 24 hours ago Stopping of information sharing can go both ways permalink award report block reply VirTW 1 points 23 hours ago remind them about ww2 permalink award report block reply redinmn 1 points 24 hours ago No loss. permalink award report block reply RedCalifornia 1 points 24 hours ago Nuke London permalink award report block reply Ostia -1 points 1 day ago You know, our allies and congress might be a little more inclined to go along with us if we provided even the slightest bit of evidence to ANYONE for our claims about these boats. permalink award report block reply Agenda47 1 points 1 day ago Yeah sure the DOD is just bombing random high speed fishing boats for funsies. permalink parent award report block reply Orlando_Doom -2 points 24 hours ago EvIdEnCe Oh, like the yellow cake uranium evidence that got is into iraq? NO! For once in your god damn life the military is actually being used to protect OUR interests. They didn't need to convince the country to go along with it like how we have been gaslit into every other conflict. We weren't relying on dubious information from the hostile israeli government. People are getting killed that mean us harm. I don't need red tape getting in the way of that. I wish Trump would bomb parts of the USA with this efficiency. permalink parent award report block reply\nFusionBlack 200 points 1 day ago We should halt military protection. I mean they have already been invaded so... permalink award report block reply learntocode 94 points 1 day ago Halt? No, we should take over the country from our well established military footprint all over the U.K. permalink parent award report block reply Tellsyouhow 48 points 1 day ago Please do. (I'm going to get jailed for this.  It's a joke Starmer.....) permalink parent award report block reply Sig229 38 points 24 hours ago The satanic nazi cunts running the British government are the enemy of the British people as well as the American people. Take that from a Brit. permalink parent award report block reply YT45 16 points 24 hours ago Liberating Britain is a foreign war I could be willing to fight, but only if the Brits step up and do their part (as I trust you would). permalink parent award report block reply VictorThomas451 4 points 22 hours ago Facts. permalink parent award report block reply roadrunner0 2 points 20 hours ago The USA does not want to be the main force in yet another European war.. 80 years ago we were protecting you from what your country has become today.. permalink parent award report block reply 1_Badcop 2 points 20 hours ago So how about a 2nd English Civil War? Where is the new Oliver Cromwell? permalink parent award report block reply Maskurbator 2 points 20 hours ago Sigh. If the people in charge of Britain were Nazis, Britain wouldn't have this problem. You think Hitler would have let Europe get over run by hordes of Africans and Jeets and Muzzies? Britain would be better off today if Hitler had won. permalink parent award report block reply view 7 more comments... load 1 more comments... Bidensmellslikepiss 14 points 23 hours ago Hi Starmer. I'm American. We're coming to liberate the UK and fuck your mom. Come get me, bitch. permalink parent award report block reply SuperHonkey 6 points 23 hours ago Oye! 😳 permalink parent award report block reply WassermanSchultz 22 points 1 day ago No thanks.  I'm not interested in another war against sand people. permalink parent award report block reply SaltyArmyChick 13 points 1 day ago Sand fkn ppl 🤣 permalink parent award report block reply zooty 8 points 24 hours ago Always coming back in greater numbers. permalink parent award report block reply view 2 more comments... Run_over_Antifa 6 points 24 hours ago It was fun watching them shoot at pod racers as a sport. permalink parent award report block reply ChimpanzeeFatigue 3 points 24 hours ago I didn’t know that they actually literally fucked farm animals until I saw it. So at least theres that permalink parent award report block reply westrock2000 3 points 24 hours ago Took me a second to get it. Clever girl! 🦖 permalink parent award report block reply Hairytacofanatic 6 points 24 hours ago lol why? So we can fucking feed the brown Muslim horde that has that country occupied? No thanks. permalink parent award report block reply YT45 4 points 24 hours ago I think the point would be to expel/exterminate said horde. permalink parent award report block reply Quietam_Unum 1 points 7 hours ago No, we should take over the country So, \"make the UK landing strip one again\"? permalink parent award report block reply possibletower 16 points 1 day ago I wish Trump would be as firm against China as he is on Canada/UK/NATO countries. He simped hard for Chicom student visas in the recent 60 Minutes interview yet again. We get fucking nothing from China in a compromise over Trump maintaining that he loves having 600,000 Chinese student visas every year. permalink parent award report block reply TheTelltaleFly 20 points 1 day ago Whenever you read “Chinese student” just interchange it for “Chinese spy.” It’s what’s actually going on. We continue to fund our own demise. permalink parent award report block reply TheThreeSeashells 15 points 24 hours ago The worst part is he actually believes we're taking their \"best and brightest\" away from them.  It would be nice if someone informed him that's not how it works. permalink parent award report block reply BidenShowerDrool 5 points 24 hours ago Trump knows that 600K students bring in a lot of GDP especially when it cost them about 100K/year each. This is why he likes the Chinese money. ~60 Billion annually  is a sizable chunk of change for temporary scholastic visas. permalink parent award report block reply peterstrzoked 6 points 22 hours ago “Losing” $60B annually to remove 600k spies seems really cheap to me. I bet our assorted counter intelligence agencies spend way more “per spy” for the ones they catch… if they catch any at all. permalink parent award report block reply Boudica 3 points 23 hours ago The best plan would have been to try and indoctrinate these Chinese \"students\". To teach them how bad communalism is, and how much it has failed over other years. But unfortunately that will not happen. permalink parent award report block reply dunkeaters 0 points 18 hours ago We get hundreds of billions in tariffs from Chinese imports, our companies get far lower tariffs exporting there, and low iq people think Chinese student visas matter? MAGA is doomed once Trump retires if the base is that dumb. permalink parent award report block reply ColonelKlink 9 points 1 day ago I read that our government was paying for their defense, tv/media propaganda, and healthcare scheme. Hopefully, that was all cut off. permalink parent award report block reply Orlando_Doom 8 points 24 hours ago We need out of NATO permalink parent award report block reply Toobigtorig1234 5 points 24 hours ago BBC \"US strikes on alleged drug boats violate law, UN human rights chief says\"....UK cucks all the way https://www.bbc.com/news/articles/cx2nx95pgz7o permalink parent award report block reply tiamat 7 points 24 hours ago Honestly we should remove their nukes, Islamic nations having nukes is never a good thing permalink parent award report block reply load 3 more comments...\nlearntocode 94 points 1 day ago Halt? No, we should take over the country from our well established military footprint all over the U.K. permalink parent award report block reply Tellsyouhow 48 points 1 day ago Please do. (I'm going to get jailed for this.  It's a joke Starmer.....) permalink parent award report block reply Sig229 38 points 24 hours ago The satanic nazi cunts running the British government are the enemy of the British people as well as the American people. Take that from a Brit. permalink parent award report block reply YT45 16 points 24 hours ago Liberating Britain is a foreign war I could be willing to fight, but only if the Brits step up and do their part (as I trust you would). permalink parent award report block reply VictorThomas451 4 points 22 hours ago Facts. permalink parent award report block reply roadrunner0 2 points 20 hours ago The USA does not want to be the main force in yet another European war.. 80 years ago we were protecting you from what your country has become today.. permalink parent award report block reply 1_Badcop 2 points 20 hours ago So how about a 2nd English Civil War? Where is the new Oliver Cromwell? permalink parent award report block reply Maskurbator 2 points 20 hours ago Sigh. If the people in charge of Britain were Nazis, Britain wouldn't have this problem. You think Hitler would have let Europe get over run by hordes of Africans and Jeets and Muzzies? Britain would be better off today if Hitler had won. permalink parent award report block reply view 7 more comments... load 1 more comments... Bidensmellslikepiss 14 points 23 hours ago Hi Starmer. I'm American. We're coming to liberate the UK and fuck your mom. Come get me, bitch. permalink parent award report block reply SuperHonkey 6 points 23 hours ago Oye! 😳 permalink parent award report block reply WassermanSchultz 22 points 1 day ago No thanks.  I'm not interested in another war against sand people. permalink parent award report block reply SaltyArmyChick 13 points 1 day ago Sand fkn ppl 🤣 permalink parent award report block reply zooty 8 points 24 hours ago Always coming back in greater numbers. permalink parent award report block reply view 2 more comments... Run_over_Antifa 6 points 24 hours ago It was fun watching them shoot at pod racers as a sport. permalink parent award report block reply ChimpanzeeFatigue 3 points 24 hours ago I didn’t know that they actually literally fucked farm animals until I saw it. So at least theres that permalink parent award report block reply westrock2000 3 points 24 hours ago Took me a second to get it. Clever girl! 🦖 permalink parent award report block reply Hairytacofanatic 6 points 24 hours ago lol why? So we can fucking feed the brown Muslim horde that has that country occupied? No thanks. permalink parent award report block reply YT45 4 points 24 hours ago I think the point would be to expel/exterminate said horde. permalink parent award report block reply Quietam_Unum 1 points 7 hours ago No, we should take over the country So, \"make the UK landing strip one again\"? permalink parent award report block reply\nTellsyouhow 48 points 1 day ago Please do. (I'm going to get jailed for this.  It's a joke Starmer.....) permalink parent award report block reply Sig229 38 points 24 hours ago The satanic nazi cunts running the British government are the enemy of the British people as well as the American people. Take that from a Brit. permalink parent award report block reply YT45 16 points 24 hours ago Liberating Britain is a foreign war I could be willing to fight, but only if the Brits step up and do their part (as I trust you would). permalink parent award report block reply VictorThomas451 4 points 22 hours ago Facts. permalink parent award report block reply roadrunner0 2 points 20 hours ago The USA does not want to be the main force in yet another European war.. 80 years ago we were protecting you from what your country has become today.. permalink parent award report block reply 1_Badcop 2 points 20 hours ago So how about a 2nd English Civil War? Where is the new Oliver Cromwell? permalink parent award report block reply Maskurbator 2 points 20 hours ago Sigh. If the people in charge of Britain were Nazis, Britain wouldn't have this problem. You think Hitler would have let Europe get over run by hordes of Africans and Jeets and Muzzies? Britain would be better off today if Hitler had won. permalink parent award report block reply view 7 more comments... load 1 more comments... Bidensmellslikepiss 14 points 23 hours ago Hi Starmer. I'm American. We're coming to liberate the UK and fuck your mom. Come get me, bitch. permalink parent award report block reply SuperHonkey 6 points 23 hours ago Oye! 😳 permalink parent award report block reply\nSig229 38 points 24 hours ago The satanic nazi cunts running the British government are the enemy of the British people as well as the American people. Take that from a Brit. permalink parent award report block reply YT45 16 points 24 hours ago Liberating Britain is a foreign war I could be willing to fight, but only if the Brits step up and do their part (as I trust you would). permalink parent award report block reply VictorThomas451 4 points 22 hours ago Facts. permalink parent award report block reply roadrunner0 2 points 20 hours ago The USA does not want to be the main force in yet another European war.. 80 years ago we were protecting you from what your country has become today.. permalink parent award report block reply 1_Badcop 2 points 20 hours ago So how about a 2nd English Civil War? Where is the new Oliver Cromwell? permalink parent award report block reply Maskurbator 2 points 20 hours ago Sigh. If the people in charge of Britain were Nazis, Britain wouldn't have this problem. You think Hitler would have let Europe get over run by hordes of Africans and Jeets and Muzzies? Britain would be better off today if Hitler had won. permalink parent award report block reply view 7 more comments... load 1 more comments...\nYT45 16 points 24 hours ago Liberating Britain is a foreign war I could be willing to fight, but only if the Brits step up and do their part (as I trust you would). permalink parent award report block reply\nVictorThomas451 4 points 22 hours ago Facts. permalink parent award report block reply\nroadrunner0 2 points 20 hours ago The USA does not want to be the main force in yet another European war.. 80 years ago we were protecting you from what your country has become today.. permalink parent award report block reply\n1_Badcop 2 points 20 hours ago So how about a 2nd English Civil War? Where is the new Oliver Cromwell? permalink parent award report block reply\nMaskurbator 2 points 20 hours ago Sigh. If the people in charge of Britain were Nazis, Britain wouldn't have this problem. You think Hitler would have let Europe get over run by hordes of Africans and Jeets and Muzzies? Britain would be better off today if Hitler had won. permalink parent award report block reply view 7 more comments...\nBidensmellslikepiss 14 points 23 hours ago Hi Starmer. I'm American. We're coming to liberate the UK and fuck your mom. Come get me, bitch. permalink parent award report block reply\nSuperHonkey 6 points 23 hours ago Oye! 😳 permalink parent award report block reply\nWassermanSchultz 22 points 1 day ago No thanks.  I'm not interested in another war against sand people. permalink parent award report block reply SaltyArmyChick 13 points 1 day ago Sand fkn ppl 🤣 permalink parent award report block reply zooty 8 points 24 hours ago Always coming back in greater numbers. permalink parent award report block reply view 2 more comments... Run_over_Antifa 6 points 24 hours ago It was fun watching them shoot at pod racers as a sport. permalink parent award report block reply ChimpanzeeFatigue 3 points 24 hours ago I didn’t know that they actually literally fucked farm animals until I saw it. So at least theres that permalink parent award report block reply westrock2000 3 points 24 hours ago Took me a second to get it. Clever girl! 🦖 permalink parent award report block reply\nSaltyArmyChick 13 points 1 day ago Sand fkn ppl 🤣 permalink parent award report block reply zooty 8 points 24 hours ago Always coming back in greater numbers. permalink parent award report block reply view 2 more comments... Run_over_Antifa 6 points 24 hours ago It was fun watching them shoot at pod racers as a sport. permalink parent award report block reply\nzooty 8 points 24 hours ago Always coming back in greater numbers. permalink parent award report block reply view 2 more comments...\nRun_over_Antifa 6 points 24 hours ago It was fun watching them shoot at pod racers as a sport. permalink parent award report block reply\nChimpanzeeFatigue 3 points 24 hours ago I didn’t know that they actually literally fucked farm animals until I saw it. So at least theres that permalink parent award report block reply\nwestrock2000 3 points 24 hours ago Took me a second to get it. Clever girl! 🦖 permalink parent award report block reply\nHairytacofanatic 6 points 24 hours ago lol why? So we can fucking feed the brown Muslim horde that has that country occupied? No thanks. permalink parent award report block reply YT45 4 points 24 hours ago I think the point would be to expel/exterminate said horde. permalink parent award report block reply\nYT45 4 points 24 hours ago I think the point would be to expel/exterminate said horde. permalink parent award report block reply\nQuietam_Unum 1 points 7 hours ago No, we should take over the country So, \"make the UK landing strip one again\"? permalink parent award report block reply\npossibletower 16 points 1 day ago I wish Trump would be as firm against China as he is on Canada/UK/NATO countries. He simped hard for Chicom student visas in the recent 60 Minutes interview yet again. We get fucking nothing from China in a compromise over Trump maintaining that he loves having 600,000 Chinese student visas every year. permalink parent award report block reply TheTelltaleFly 20 points 1 day ago Whenever you read “Chinese student” just interchange it for “Chinese spy.” It’s what’s actually going on. We continue to fund our own demise. permalink parent award report block reply TheThreeSeashells 15 points 24 hours ago The worst part is he actually believes we're taking their \"best and brightest\" away from them.  It would be nice if someone informed him that's not how it works. permalink parent award report block reply BidenShowerDrool 5 points 24 hours ago Trump knows that 600K students bring in a lot of GDP especially when it cost them about 100K/year each. This is why he likes the Chinese money. ~60 Billion annually  is a sizable chunk of change for temporary scholastic visas. permalink parent award report block reply peterstrzoked 6 points 22 hours ago “Losing” $60B annually to remove 600k spies seems really cheap to me. I bet our assorted counter intelligence agencies spend way more “per spy” for the ones they catch… if they catch any at all. permalink parent award report block reply Boudica 3 points 23 hours ago The best plan would have been to try and indoctrinate these Chinese \"students\". To teach them how bad communalism is, and how much it has failed over other years. But unfortunately that will not happen. permalink parent award report block reply dunkeaters 0 points 18 hours ago We get hundreds of billions in tariffs from Chinese imports, our companies get far lower tariffs exporting there, and low iq people think Chinese student visas matter? MAGA is doomed once Trump retires if the base is that dumb. permalink parent award report block reply\nTheTelltaleFly 20 points 1 day ago Whenever you read “Chinese student” just interchange it for “Chinese spy.” It’s what’s actually going on. We continue to fund our own demise. permalink parent award report block reply\nTheThreeSeashells 15 points 24 hours ago The worst part is he actually believes we're taking their \"best and brightest\" away from them.  It would be nice if someone informed him that's not how it works. permalink parent award report block reply\nBidenShowerDrool 5 points 24 hours ago Trump knows that 600K students bring in a lot of GDP especially when it cost them about 100K/year each. This is why he likes the Chinese money. ~60 Billion annually  is a sizable chunk of change for temporary scholastic visas. permalink parent award report block reply peterstrzoked 6 points 22 hours ago “Losing” $60B annually to remove 600k spies seems really cheap to me. I bet our assorted counter intelligence agencies spend way more “per spy” for the ones they catch… if they catch any at all. permalink parent award report block reply\npeterstrzoked 6 points 22 hours ago “Losing” $60B annually to remove 600k spies seems really cheap to me. I bet our assorted counter intelligence agencies spend way more “per spy” for the ones they catch… if they catch any at all. permalink parent award report block reply\nBoudica 3 points 23 hours ago The best plan would have been to try and indoctrinate these Chinese \"students\". To teach them how bad communalism is, and how much it has failed over other years. But unfortunately that will not happen. permalink parent award report block reply\ndunkeaters 0 points 18 hours ago We get hundreds of billions in tariffs from Chinese imports, our companies get far lower tariffs exporting there, and low iq people think Chinese student visas matter? MAGA is doomed once Trump retires if the base is that dumb. permalink parent award report block reply\nColonelKlink 9 points 1 day ago I read that our government was paying for their defense, tv/media propaganda, and healthcare scheme. Hopefully, that was all cut off. permalink parent award report block reply\nOrlando_Doom 8 points 24 hours ago We need out of NATO permalink parent award report block reply Toobigtorig1234 5 points 24 hours ago BBC \"US strikes on alleged drug boats violate law, UN human rights chief says\"....UK cucks all the way https://www.bbc.com/news/articles/cx2nx95pgz7o permalink parent award report block reply\nToobigtorig1234 5 points 24 hours ago BBC \"US strikes on alleged drug boats violate law, UN human rights chief says\"....UK cucks all the way https://www.bbc.com/news/articles/cx2nx95pgz7o permalink parent award report block reply\ntiamat 7 points 24 hours ago Honestly we should remove their nukes, Islamic nations having nukes is never a good thing permalink parent award report block reply\nhughjasske69 94 points 1 day ago Well well well look who's enabling the drug smugglers permalink award report block reply McFatty7 28 points 1 day ago I hate it when the media pushes the narrative that \"President Trump is attacking our allies.\" Because that's just the \"cover\" they use to try to fuck us over in other ways, like this drug smuggling and tariffs. permalink parent award report block reply Orlando_Doom 5 points 24 hours ago We have no allies, just vassals. And of course our ruler, King Netanyahoo. permalink parent award report block reply\nMcFatty7 28 points 1 day ago I hate it when the media pushes the narrative that \"President Trump is attacking our allies.\" Because that's just the \"cover\" they use to try to fuck us over in other ways, like this drug smuggling and tariffs. permalink parent award report block reply Orlando_Doom 5 points 24 hours ago We have no allies, just vassals. And of course our ruler, King Netanyahoo. permalink parent award report block reply\nOrlando_Doom 5 points 24 hours ago We have no allies, just vassals. And of course our ruler, King Netanyahoo. permalink parent award report block reply\nSilentSniper 61 points 1 day ago So the UK is defending drugs/smugglers?? permalink award report block reply magapatriot_pa 54 points 1 day ago They defend foreign muslims who rape little girls and call anyone who talks about it racist. Is it really that much of a stretch? permalink parent award report block reply IncredibleMrE1 20 points 1 day ago Doesn't just call anyone who talks about it racist, arrests and imprisons them. permalink parent award report block reply SaltyArmyChick 8 points 24 hours ago Ya. Theyre fkn pedo lovers. All the real men died so mostly soft pussy ass bitchz left. Sad… permalink parent award report block reply learntocode 13 points 1 day ago UK has been the original drug smuggler to beat drug smugglers. The British fought multiple wars to maintain their abiity to flood opium into China and other nations. The stash their wealth in offshore banks ... located riiight next to where the U.S. is building up assets \"to invade Venezuela\". permalink parent award report block reply Nibba2 1 points 20 hours ago Doesn’t every Muslim want the US dead? permalink parent award report block reply\nmagapatriot_pa 54 points 1 day ago They defend foreign muslims who rape little girls and call anyone who talks about it racist. Is it really that much of a stretch? permalink parent award report block reply IncredibleMrE1 20 points 1 day ago Doesn't just call anyone who talks about it racist, arrests and imprisons them. permalink parent award report block reply SaltyArmyChick 8 points 24 hours ago Ya. Theyre fkn pedo lovers. All the real men died so mostly soft pussy ass bitchz left. Sad… permalink parent award report block reply\nIncredibleMrE1 20 points 1 day ago Doesn't just call anyone who talks about it racist, arrests and imprisons them. permalink parent award report block reply\nSaltyArmyChick 8 points 24 hours ago Ya. Theyre fkn pedo lovers. All the real men died so mostly soft pussy ass bitchz left. Sad… permalink parent award report block reply\nlearntocode 13 points 1 day ago UK has been the original drug smuggler to beat drug smugglers. The British fought multiple wars to maintain their abiity to flood opium into China and other nations. The stash their wealth in offshore banks ... located riiight next to where the U.S. is building up assets \"to invade Venezuela\". permalink parent award report block reply\nNibba2 1 points 20 hours ago Doesn’t every Muslim want the US dead? permalink parent award report block reply\ntw0scoops 60 points 1 day ago What an odd thing to say/do..... permalink award report block reply\nDingleBalls 44 points 1 day ago Fine then stop cooperating with the UK and start putting them on lists of terrorist and smuggler accomplices permalink award report block reply brainphreeze 11 points 24 hours ago Starmer isn't intelligent enough for this (he's a pathetic weasely loser who wants to appease the EU), but it's possible he's happy to hurt the US alliance so that he has a reason to further push the UK back into the arms of the EU and NATO permalink parent award report block reply SaltyArmyChick 5 points 24 hours ago Agreed 👍 permalink parent award report block reply\nbrainphreeze 11 points 24 hours ago Starmer isn't intelligent enough for this (he's a pathetic weasely loser who wants to appease the EU), but it's possible he's happy to hurt the US alliance so that he has a reason to further push the UK back into the arms of the EU and NATO permalink parent award report block reply\nSaltyArmyChick 5 points 24 hours ago Agreed 👍 permalink parent award report block reply\nlearntocode 37 points 1 day ago Oh, our Special Relationship isnt so special once we stop your opium war, is that it? U.K. has been an enemy to Americans since before the Revolutionary War. permalink award report block reply that_sound 5 points 22 hours ago Dollars (or pounds) to donuts Christopher Steele's got the ok for his peepee dossier from MI6 and 10 Downing. That was an act of war. And should be dealt with as such. While that gets ignored, this sounds like the perfect time to leave NATO. permalink parent award report block reply Say_what_again 2 points 23 hours ago Finally someone who gets it permalink parent award report block reply\nthat_sound 5 points 22 hours ago Dollars (or pounds) to donuts Christopher Steele's got the ok for his peepee dossier from MI6 and 10 Downing. That was an act of war. And should be dealt with as such. While that gets ignored, this sounds like the perfect time to leave NATO. permalink parent award report block reply\nSay_what_again 2 points 23 hours ago Finally someone who gets it permalink parent award report block reply\nCuetardian 33 points 1 day ago King Charles is a closet muslim along with his friend Keir Starmer. They are a big part of the reason for the horror life in the UK has become. \"The Andrew formerly known as Prince\" is being sacrificed to take the attention off Charles, who is orders of magnitude worse. Look up his best pal Jimmy Savile, just to start with. permalink award report block reply IncredibleMrE1 13 points 1 day ago Does Keir Starmer's jewish wife with whom he celebrates shabbat every week know he's a muzzie? permalink parent award report block reply Orlando_Doom 13 points 24 hours ago Definitely, jews work with muzzies all the time. Only a retarded dumbass doesn't know that. permalink parent award report block reply IncredibleMrE1 4 points 24 hours ago Does Hillary carry hot sauce in her purse? permalink parent award report block reply Orlando_Doom 3 points 23 hours ago Depends on the audience she's trying to con at the time. I'm sure she carries A-1 in Texas. permalink parent award report block reply KernalMustard 5 points 1 day ago I sometimes wonder where they get this stuff. permalink parent award report block reply Porkbut 5 points 24 hours ago Who opened the gates of toledo! (Is this the right way, groypers?) permalink parent award report block reply NZbacon 3 points 23 hours ago Starmer is Jewish, not Muslim. permalink parent award report block reply Cuetardian 5 points 23 hours ago Supposedly, but Starmer sure behaves like a muslim sympathizer. It's the same way King Charles is supposed to be the head of the Church of England but advocates for the invading muslims full time. permalink parent award report block reply NZbacon 2 points 8 hours ago That's what they do. permalink parent award report block reply\nIncredibleMrE1 13 points 1 day ago Does Keir Starmer's jewish wife with whom he celebrates shabbat every week know he's a muzzie? permalink parent award report block reply Orlando_Doom 13 points 24 hours ago Definitely, jews work with muzzies all the time. Only a retarded dumbass doesn't know that. permalink parent award report block reply IncredibleMrE1 4 points 24 hours ago Does Hillary carry hot sauce in her purse? permalink parent award report block reply Orlando_Doom 3 points 23 hours ago Depends on the audience she's trying to con at the time. I'm sure she carries A-1 in Texas. permalink parent award report block reply KernalMustard 5 points 1 day ago I sometimes wonder where they get this stuff. permalink parent award report block reply Porkbut 5 points 24 hours ago Who opened the gates of toledo! (Is this the right way, groypers?) permalink parent award report block reply\nOrlando_Doom 13 points 24 hours ago Definitely, jews work with muzzies all the time. Only a retarded dumbass doesn't know that. permalink parent award report block reply IncredibleMrE1 4 points 24 hours ago Does Hillary carry hot sauce in her purse? permalink parent award report block reply Orlando_Doom 3 points 23 hours ago Depends on the audience she's trying to con at the time. I'm sure she carries A-1 in Texas. permalink parent award report block reply\nIncredibleMrE1 4 points 24 hours ago Does Hillary carry hot sauce in her purse? permalink parent award report block reply Orlando_Doom 3 points 23 hours ago Depends on the audience she's trying to con at the time. I'm sure she carries A-1 in Texas. permalink parent award report block reply\nOrlando_Doom 3 points 23 hours ago Depends on the audience she's trying to con at the time. I'm sure she carries A-1 in Texas. permalink parent award report block reply\nKernalMustard 5 points 1 day ago I sometimes wonder where they get this stuff. permalink parent award report block reply\nPorkbut 5 points 24 hours ago Who opened the gates of toledo! (Is this the right way, groypers?) permalink parent award report block reply\nNZbacon 3 points 23 hours ago Starmer is Jewish, not Muslim. permalink parent award report block reply Cuetardian 5 points 23 hours ago Supposedly, but Starmer sure behaves like a muslim sympathizer. It's the same way King Charles is supposed to be the head of the Church of England but advocates for the invading muslims full time. permalink parent award report block reply NZbacon 2 points 8 hours ago That's what they do. permalink parent award report block reply\nCuetardian 5 points 23 hours ago Supposedly, but Starmer sure behaves like a muslim sympathizer. It's the same way King Charles is supposed to be the head of the Church of England but advocates for the invading muslims full time. permalink parent award report block reply NZbacon 2 points 8 hours ago That's what they do. permalink parent award report block reply\nNZbacon 2 points 8 hours ago That's what they do. permalink parent award report block reply\nDefKon1 24 points 1 day ago I wouldn't trust the UK for any kind of intel these days. Look what they did to themselves. How can they possibly help us?🤷 permalink award report block reply steini1904 3 points 23 hours ago UK intel dropped some major insights on the local flora eating up the Ukrainian counter-offensive. Don't come crying for help later when the phytoplankton blooms. permalink parent award report block reply DefKon1 2 points 18 hours ago lmao! Well, OK, then I guess they are the \"go to\" if we get attacked by Giant Protozoa From Outer Space. That's prolly worth a few billion taxpayer dollars anyway..🤷 permalink parent award report block reply SicSemperTyrannis2 2 points 17 hours ago You just wait until the attack of the killer tomatoes! https://m.youtube.com/watch?v=txfdGlxEsG8&pp=ygUeQXR0YWNrIG9mIHRoZSBraWxsZXIgdG9tYXRvZXMg permalink parent award report block reply\nsteini1904 3 points 23 hours ago UK intel dropped some major insights on the local flora eating up the Ukrainian counter-offensive. Don't come crying for help later when the phytoplankton blooms. permalink parent award report block reply DefKon1 2 points 18 hours ago lmao! Well, OK, then I guess they are the \"go to\" if we get attacked by Giant Protozoa From Outer Space. That's prolly worth a few billion taxpayer dollars anyway..🤷 permalink parent award report block reply SicSemperTyrannis2 2 points 17 hours ago You just wait until the attack of the killer tomatoes! https://m.youtube.com/watch?v=txfdGlxEsG8&pp=ygUeQXR0YWNrIG9mIHRoZSBraWxsZXIgdG9tYXRvZXMg permalink parent award report block reply\nDefKon1 2 points 18 hours ago lmao! Well, OK, then I guess they are the \"go to\" if we get attacked by Giant Protozoa From Outer Space. That's prolly worth a few billion taxpayer dollars anyway..🤷 permalink parent award report block reply SicSemperTyrannis2 2 points 17 hours ago You just wait until the attack of the killer tomatoes! https://m.youtube.com/watch?v=txfdGlxEsG8&pp=ygUeQXR0YWNrIG9mIHRoZSBraWxsZXIgdG9tYXRvZXMg permalink parent award report block reply\nSicSemperTyrannis2 2 points 17 hours ago You just wait until the attack of the killer tomatoes! https://m.youtube.com/watch?v=txfdGlxEsG8&pp=ygUeQXR0YWNrIG9mIHRoZSBraWxsZXIgdG9tYXRvZXMg permalink parent award report block reply\nKungPaoMcChicken 19 points 1 day ago Drug smugglers lives matter! Rofl permalink award report block reply\ndirtysanchez69 17 points 1 day ago Oh no! Anyway. permalink award report block reply Patrick_Bateman 1 points 21 hours ago Let's just pay Fusion GPS to say they're all drug boats. #winning permalink parent award report block reply\nPatrick_Bateman 1 points 21 hours ago Let's just pay Fusion GPS to say they're all drug boats. #winning permalink parent award report block reply\nmadeaprofilejustforu 16 points 1 day ago Fags innit permalink award report block reply SaltyArmyChick 3 points 24 hours ago Yep. Power bottom vibez… permalink parent award report block reply\nSaltyArmyChick 3 points 24 hours ago Yep. Power bottom vibez… permalink parent award report block reply\nGrindelwald 15 points 1 day ago So the boats were headed toward the UK?  Long boat ride permalink award report block reply RocksCanOnlyWait 7 points 1 day ago Several Caribbean islands are either directly controlled by the UK or in their dominion. permalink parent award report block reply KernalMustard 3 points 1 day ago And during hurricane season. permalink parent award report block reply\nRocksCanOnlyWait 7 points 1 day ago Several Caribbean islands are either directly controlled by the UK or in their dominion. permalink parent award report block reply\nKernalMustard 3 points 1 day ago And during hurricane season. permalink parent award report block reply\nNoticesBugleOWO 14 points 1 day ago lol like we needed their help. Fucking retards. permalink award report block reply\nLibertyStillMatters 7 points 1 day ago The managed decline of the U.S is a global joint effort. permalink award report block reply\nBuff_cousin_Elroy 7 points 1 day ago Uk are mega fags permalink award report block reply\nRoughBoy 7 points 1 day ago They really need their c0ke permalink award report block reply NZbacon 2 points 23 hours ago European leadership would collapse without it. permalink parent award report block reply\nNZbacon 2 points 23 hours ago European leadership would collapse without it. permalink parent award report block reply\nAwShitHereWeGoAgain 6 points 1 day ago Fucking limey faggots.  You're next. permalink award report block reply\nYawnz13 6 points 1 day ago Libs of TikTok misrepresenting the situation. https://www.washingtonexaminer.com/policy/foreign-policy/3883338/uk-intel-sharing-us-drug-vessel-strikes/ \"Anonymous whistleblowers from the United Kingdom will no longer share crucial intelligence with the United States due to President Donald Trump‘s counternarcotics operations. \" So no official policy has been put out by the UK. permalink award report block reply TheThreeSeashells 4 points 24 hours ago Not necessarily.  The article to which you linked says \"The U.K., which controls a number of intelligence assets in the region, has helped the U.S. locate vessels suspected of carrying drugs so that the U.S. Coast Guard could interdict them, the sources told CNN. U.K. leadership’s decision means they will no longer direct the intelligence they collect to the Joint Interagency Task Force South in South Florida, which comprises representatives from partner nations that combat the international drug trade.\" So, this is not just a handful of \"anonymous whistleblowers\" and is definitely coming from the U.K. government.  It's actually odd that the article phrased it the way they did, except that it's poorly written. Other articles I've come across elsewhere are saying this is definitely coming from the UK government specifically because they are concerned that the attacks violate \"international law\" and they don't want to be considered complicit in the attacks. permalink parent award report block reply Yawnz13 3 points 24 hours ago So, this is not just a handful of \"anonymous whistleblowers\" and is definitely coming from the U.K. government. It's actually odd that the article phrased it the way they did, except that it's poorly written. Clearly not, as the article stated in the quoted section. Your quoted section does not preclude the previously quoted section.  The UK having intel assets in the region does not confirm nor deny the truth of LibsofTikTok, but it does show that she is willing to misrepresent the situation.  Until you have verifiable policy change from the UK government and not mere innuendo, all you've got is talk.  Talk is cheap. Other articles I've come across elsewhere are saying this is definitely coming from the UK government specifically because they are concerned that the attacks violate \"international law\" and they don't want to be considered complicit in the attacks. So link them then. permalink parent award report block reply TheThreeSeashells 2 points 24 hours ago Here you go: https://townhall.com/tipsheet/amy-curtis/2025/11/11/cnn-uk-stop-sharing-intelligence-over-drug-smuggling-airstrikes-n2666269 The United Kingdom is no longer sharing intelligence with the US about suspected drug trafficking vessels in the Caribbean because it does not want to be complicit in US military strikes and believes the attacks are illegal Oh, and that previous section you mentioned?  I didn't mention it because it's a non-statement: “It is our long-standing policy to not comment on intelligence matters,” a U.K. government spokesperson told the Washington Examiner. “The U.S. is our closest ally on security and intelligence. We continue to work together to uphold global peace and security, defend freedom of navigation, and respond to emerging threats.” However, right before that it says: The U.K. has joined an international consensus that Trump’s decisive military action against the international drug dealers is illegal. If they're joining the \"international consensus\" that the military strikes are illegal, that backs the claims that the government is on-board with withholding intelligence.  Not just a few \"whistleblowers.\" Regardless, the Examiner article is still poorly written. permalink parent award report block reply Yawnz13 1 points 24 hours ago Here you go: https://townhall.com/tipsheet/amy-curtis/2025/11/11/cnn-uk-stop-sharing-intelligence-over-drug-smuggling-airstrikes-n2666269 And take a look at their evidence:  A Twitter post from the Breakin911 account.  Said account engages in the same Twitter slop behavior and has presented the same amount of evidence to the claim as LibsoftikTok i.e. none. Oh, and that previous section you mentioned? I didn't mention it because it's a non-statement: That wasn't the \"previous section\" in mentioned.  Had you actually bothered to read my initial post for comprehension, you'd have seen that. There's also no such thing as a \"non-statement\".  That quote is support for the Washington Examiner's article, not LibsofTikTok or Breaking911. If they're joining the \"international consensus\" that the military strikes are illegal, that backs the claims that the government is on-board with withholding intelligence. Not just a few \"whistleblowers.\" Furthermore, since it's \"whistleblowers\", it shows that the UK wasn't officially sharing intel on the matter with the US anyway.  If they were, it'd be through official channels and not \"whistleblowers\". Incorrect.  One does not prove the other.  They can believe that what Trump is doing is wrong, but that doesn't prove that they have made any official policy on the matter.  Until you provide explicit policy on the matter, the Washington Examiner article holds true. Regardless, the Examiner article is still poorly written. According to what objective criteria?  Oh wait, you can't back that up either and are merely making the statement as an attempt to poison the well. permalink parent award report block reply view 4 more comments... SicSemperTyrannis2 2 points 17 hours ago They skeered. They know Islamic jihad is involved somehow, and will retaliate. permalink parent award report block reply Froynlavenfroynlaven 1 points 23 hours ago Bait from LOTT?  I don't believe it! permalink parent award report block reply Yawnz13 1 points 23 hours ago Gotta cash in on the hype train.  Hyperbole sells. permalink parent award report block reply\nTheThreeSeashells 4 points 24 hours ago Not necessarily.  The article to which you linked says \"The U.K., which controls a number of intelligence assets in the region, has helped the U.S. locate vessels suspected of carrying drugs so that the U.S. Coast Guard could interdict them, the sources told CNN. U.K. leadership’s decision means they will no longer direct the intelligence they collect to the Joint Interagency Task Force South in South Florida, which comprises representatives from partner nations that combat the international drug trade.\" So, this is not just a handful of \"anonymous whistleblowers\" and is definitely coming from the U.K. government.  It's actually odd that the article phrased it the way they did, except that it's poorly written. Other articles I've come across elsewhere are saying this is definitely coming from the UK government specifically because they are concerned that the attacks violate \"international law\" and they don't want to be considered complicit in the attacks. permalink parent award report block reply Yawnz13 3 points 24 hours ago So, this is not just a handful of \"anonymous whistleblowers\" and is definitely coming from the U.K. government. It's actually odd that the article phrased it the way they did, except that it's poorly written. Clearly not, as the article stated in the quoted section. Your quoted section does not preclude the previously quoted section.  The UK having intel assets in the region does not confirm nor deny the truth of LibsofTikTok, but it does show that she is willing to misrepresent the situation.  Until you have verifiable policy change from the UK government and not mere innuendo, all you've got is talk.  Talk is cheap. Other articles I've come across elsewhere are saying this is definitely coming from the UK government specifically because they are concerned that the attacks violate \"international law\" and they don't want to be considered complicit in the attacks. So link them then. permalink parent award report block reply TheThreeSeashells 2 points 24 hours ago Here you go: https://townhall.com/tipsheet/amy-curtis/2025/11/11/cnn-uk-stop-sharing-intelligence-over-drug-smuggling-airstrikes-n2666269 The United Kingdom is no longer sharing intelligence with the US about suspected drug trafficking vessels in the Caribbean because it does not want to be complicit in US military strikes and believes the attacks are illegal Oh, and that previous section you mentioned?  I didn't mention it because it's a non-statement: “It is our long-standing policy to not comment on intelligence matters,” a U.K. government spokesperson told the Washington Examiner. “The U.S. is our closest ally on security and intelligence. We continue to work together to uphold global peace and security, defend freedom of navigation, and respond to emerging threats.” However, right before that it says: The U.K. has joined an international consensus that Trump’s decisive military action against the international drug dealers is illegal. If they're joining the \"international consensus\" that the military strikes are illegal, that backs the claims that the government is on-board with withholding intelligence.  Not just a few \"whistleblowers.\" Regardless, the Examiner article is still poorly written. permalink parent award report block reply Yawnz13 1 points 24 hours ago Here you go: https://townhall.com/tipsheet/amy-curtis/2025/11/11/cnn-uk-stop-sharing-intelligence-over-drug-smuggling-airstrikes-n2666269 And take a look at their evidence:  A Twitter post from the Breakin911 account.  Said account engages in the same Twitter slop behavior and has presented the same amount of evidence to the claim as LibsoftikTok i.e. none. Oh, and that previous section you mentioned? I didn't mention it because it's a non-statement: That wasn't the \"previous section\" in mentioned.  Had you actually bothered to read my initial post for comprehension, you'd have seen that. There's also no such thing as a \"non-statement\".  That quote is support for the Washington Examiner's article, not LibsofTikTok or Breaking911. If they're joining the \"international consensus\" that the military strikes are illegal, that backs the claims that the government is on-board with withholding intelligence. Not just a few \"whistleblowers.\" Furthermore, since it's \"whistleblowers\", it shows that the UK wasn't officially sharing intel on the matter with the US anyway.  If they were, it'd be through official channels and not \"whistleblowers\". Incorrect.  One does not prove the other.  They can believe that what Trump is doing is wrong, but that doesn't prove that they have made any official policy on the matter.  Until you provide explicit policy on the matter, the Washington Examiner article holds true. Regardless, the Examiner article is still poorly written. According to what objective criteria?  Oh wait, you can't back that up either and are merely making the statement as an attempt to poison the well. permalink parent award report block reply view 4 more comments... SicSemperTyrannis2 2 points 17 hours ago They skeered. They know Islamic jihad is involved somehow, and will retaliate. permalink parent award report block reply\nYawnz13 3 points 24 hours ago So, this is not just a handful of \"anonymous whistleblowers\" and is definitely coming from the U.K. government. It's actually odd that the article phrased it the way they did, except that it's poorly written. Clearly not, as the article stated in the quoted section. Your quoted section does not preclude the previously quoted section.  The UK having intel assets in the region does not confirm nor deny the truth of LibsofTikTok, but it does show that she is willing to misrepresent the situation.  Until you have verifiable policy change from the UK government and not mere innuendo, all you've got is talk.  Talk is cheap. Other articles I've come across elsewhere are saying this is definitely coming from the UK government specifically because they are concerned that the attacks violate \"international law\" and they don't want to be considered complicit in the attacks. So link them then. permalink parent award report block reply TheThreeSeashells 2 points 24 hours ago Here you go: https://townhall.com/tipsheet/amy-curtis/2025/11/11/cnn-uk-stop-sharing-intelligence-over-drug-smuggling-airstrikes-n2666269 The United Kingdom is no longer sharing intelligence with the US about suspected drug trafficking vessels in the Caribbean because it does not want to be complicit in US military strikes and believes the attacks are illegal Oh, and that previous section you mentioned?  I didn't mention it because it's a non-statement: “It is our long-standing policy to not comment on intelligence matters,” a U.K. government spokesperson told the Washington Examiner. “The U.S. is our closest ally on security and intelligence. We continue to work together to uphold global peace and security, defend freedom of navigation, and respond to emerging threats.” However, right before that it says: The U.K. has joined an international consensus that Trump’s decisive military action against the international drug dealers is illegal. If they're joining the \"international consensus\" that the military strikes are illegal, that backs the claims that the government is on-board with withholding intelligence.  Not just a few \"whistleblowers.\" Regardless, the Examiner article is still poorly written. permalink parent award report block reply Yawnz13 1 points 24 hours ago Here you go: https://townhall.com/tipsheet/amy-curtis/2025/11/11/cnn-uk-stop-sharing-intelligence-over-drug-smuggling-airstrikes-n2666269 And take a look at their evidence:  A Twitter post from the Breakin911 account.  Said account engages in the same Twitter slop behavior and has presented the same amount of evidence to the claim as LibsoftikTok i.e. none. Oh, and that previous section you mentioned? I didn't mention it because it's a non-statement: That wasn't the \"previous section\" in mentioned.  Had you actually bothered to read my initial post for comprehension, you'd have seen that. There's also no such thing as a \"non-statement\".  That quote is support for the Washington Examiner's article, not LibsofTikTok or Breaking911. If they're joining the \"international consensus\" that the military strikes are illegal, that backs the claims that the government is on-board with withholding intelligence. Not just a few \"whistleblowers.\" Furthermore, since it's \"whistleblowers\", it shows that the UK wasn't officially sharing intel on the matter with the US anyway.  If they were, it'd be through official channels and not \"whistleblowers\". Incorrect.  One does not prove the other.  They can believe that what Trump is doing is wrong, but that doesn't prove that they have made any official policy on the matter.  Until you provide explicit policy on the matter, the Washington Examiner article holds true. Regardless, the Examiner article is still poorly written. According to what objective criteria?  Oh wait, you can't back that up either and are merely making the statement as an attempt to poison the well. permalink parent award report block reply view 4 more comments...\nTheThreeSeashells 2 points 24 hours ago Here you go: https://townhall.com/tipsheet/amy-curtis/2025/11/11/cnn-uk-stop-sharing-intelligence-over-drug-smuggling-airstrikes-n2666269 The United Kingdom is no longer sharing intelligence with the US about suspected drug trafficking vessels in the Caribbean because it does not want to be complicit in US military strikes and believes the attacks are illegal Oh, and that previous section you mentioned?  I didn't mention it because it's a non-statement: “It is our long-standing policy to not comment on intelligence matters,” a U.K. government spokesperson told the Washington Examiner. “The U.S. is our closest ally on security and intelligence. We continue to work together to uphold global peace and security, defend freedom of navigation, and respond to emerging threats.” However, right before that it says: The U.K. has joined an international consensus that Trump’s decisive military action against the international drug dealers is illegal. If they're joining the \"international consensus\" that the military strikes are illegal, that backs the claims that the government is on-board with withholding intelligence.  Not just a few \"whistleblowers.\" Regardless, the Examiner article is still poorly written. permalink parent award report block reply Yawnz13 1 points 24 hours ago Here you go: https://townhall.com/tipsheet/amy-curtis/2025/11/11/cnn-uk-stop-sharing-intelligence-over-drug-smuggling-airstrikes-n2666269 And take a look at their evidence:  A Twitter post from the Breakin911 account.  Said account engages in the same Twitter slop behavior and has presented the same amount of evidence to the claim as LibsoftikTok i.e. none. Oh, and that previous section you mentioned? I didn't mention it because it's a non-statement: That wasn't the \"previous section\" in mentioned.  Had you actually bothered to read my initial post for comprehension, you'd have seen that. There's also no such thing as a \"non-statement\".  That quote is support for the Washington Examiner's article, not LibsofTikTok or Breaking911. If they're joining the \"international consensus\" that the military strikes are illegal, that backs the claims that the government is on-board with withholding intelligence. Not just a few \"whistleblowers.\" Furthermore, since it's \"whistleblowers\", it shows that the UK wasn't officially sharing intel on the matter with the US anyway.  If they were, it'd be through official channels and not \"whistleblowers\". Incorrect.  One does not prove the other.  They can believe that what Trump is doing is wrong, but that doesn't prove that they have made any official policy on the matter.  Until you provide explicit policy on the matter, the Washington Examiner article holds true. Regardless, the Examiner article is still poorly written. According to what objective criteria?  Oh wait, you can't back that up either and are merely making the statement as an attempt to poison the well. permalink parent award report block reply view 4 more comments...\nYawnz13 1 points 24 hours ago Here you go: https://townhall.com/tipsheet/amy-curtis/2025/11/11/cnn-uk-stop-sharing-intelligence-over-drug-smuggling-airstrikes-n2666269 And take a look at their evidence:  A Twitter post from the Breakin911 account.  Said account engages in the same Twitter slop behavior and has presented the same amount of evidence to the claim as LibsoftikTok i.e. none. Oh, and that previous section you mentioned? I didn't mention it because it's a non-statement: That wasn't the \"previous section\" in mentioned.  Had you actually bothered to read my initial post for comprehension, you'd have seen that. There's also no such thing as a \"non-statement\".  That quote is support for the Washington Examiner's article, not LibsofTikTok or Breaking911. If they're joining the \"international consensus\" that the military strikes are illegal, that backs the claims that the government is on-board with withholding intelligence. Not just a few \"whistleblowers.\" Furthermore, since it's \"whistleblowers\", it shows that the UK wasn't officially sharing intel on the matter with the US anyway.  If they were, it'd be through official channels and not \"whistleblowers\". Incorrect.  One does not prove the other.  They can believe that what Trump is doing is wrong, but that doesn't prove that they have made any official policy on the matter.  Until you provide explicit policy on the matter, the Washington Examiner article holds true. Regardless, the Examiner article is still poorly written. According to what objective criteria?  Oh wait, you can't back that up either and are merely making the statement as an attempt to poison the well. permalink parent award report block reply view 4 more comments...\nSicSemperTyrannis2 2 points 17 hours ago They skeered. They know Islamic jihad is involved somehow, and will retaliate. permalink parent award report block reply\nFroynlavenfroynlaven 1 points 23 hours ago Bait from LOTT?  I don't believe it! permalink parent award report block reply Yawnz13 1 points 23 hours ago Gotta cash in on the hype train.  Hyperbole sells. permalink parent award report block reply\nYawnz13 1 points 23 hours ago Gotta cash in on the hype train.  Hyperbole sells. permalink parent award report block reply\nAggrieved03 5 points 1 day ago Why aren't we striking the drug production facilities in Chyna? permalink award report block reply Agenda47 6 points 1 day ago China has nuclear missiles. permalink parent award report block reply Aggrieved03 3 points 1 day ago What have they killed with fentanyl, way upwards of half a million. permalink parent award report block reply\nAgenda47 6 points 1 day ago China has nuclear missiles. permalink parent award report block reply Aggrieved03 3 points 1 day ago What have they killed with fentanyl, way upwards of half a million. permalink parent award report block reply\nAggrieved03 3 points 1 day ago What have they killed with fentanyl, way upwards of half a million. permalink parent award report block reply\nIncredibleMrE1 5 points 1 day ago Sounds like a win for us. permalink award report block reply\nj2daeww 5 points 1 day ago Hmmm what’s the saying? Follow the money? permalink award report block reply\nDeepStateParasite 4 points 24 hours ago Keir \"The Muslim's Bitch\" Starmer. Go figure. permalink award report block reply\nSkywise 4 points 24 hours ago Then why were they sharing it to begin with if they don’t like us doing something with the information?! permalink award report block reply\nMEME-SUPREME 4 points 24 hours ago Muslims tell Keir Starmer what to do. permalink award report block reply\nTrump-16-20-24-28-32 4 points 24 hours ago That means, to me, they are protecting their interests... there's no other reason. permalink award report block reply\nCruzControl 4 points 1 day ago Restore the fort on Water Island. That thing was designed to vaporize any unauthorized vessel that sailed between St. Thomas and St. Croix during WWII permalink award report block reply\nGoldfinger2211 4 points 1 day ago The US can end their nuclear agreement with the UK Navy for the Trident system, essentially de-arming their ballistic missile subs and deep sixing their nuclear deterrence.  The UK military becomes Sweden. permalink award report block reply\nMinnieWhittaker 4 points 1 day ago The UK then went back to arresting Britons for complaining about mass rape by Muslim \"refugees.\" permalink award report block reply\nThan0sIII 4 points 24 hours ago They act like they had MI6 agents on board. Or were the drug providers. permalink award report block reply\nGuerillaYourDreams 4 points 24 hours ago Brits love narco-terrorists. permalink award report block reply\nDontTreadOnLego 4 points 1 day ago USA needs to stop sharing any info with the uk permalink award report block reply\nAbrahamLincoln 4 points 24 hours ago We have satellites.  We don't need their info. permalink award report block reply\niamimaginos 3 points 22 hours ago I cant imagine they know anything we dont permalink award report block reply\nGreenhills 3 points 1 day ago lol. And Pete hegseth laughed. permalink award report block reply\nIsrorOrca 3 points 24 hours ago The joke is on the UK, everything they \"share\" with us, we provided to them via back channels. They aren't the source of any of it. permalink award report block reply NZbacon 1 points 23 hours ago The way it works is they each spy on the others citizens to allow deniability. permalink parent award report block reply\nNZbacon 1 points 23 hours ago The way it works is they each spy on the others citizens to allow deniability. permalink parent award report block reply\nsorrytodisagree 3 points 24 hours ago Their intel is probably as fake as the BBC anyway. permalink award report block reply\nlixa 3 points 24 hours ago Trump should sanction the UK for their human rights violations. permalink award report block reply SicSemperTyrannis2 1 points 17 hours ago Tariff their cocaine. permalink parent award report block reply\nSicSemperTyrannis2 1 points 17 hours ago Tariff their cocaine. permalink parent award report block reply\nThe_RedWolf 3 points 24 hours ago they were helping? permalink award report block reply\nutfanx2 3 points 23 hours ago Starlink goes brrrrrrt. permalink award report block reply\nUsername_here 3 points 1 day ago LOL. Like their intelligence on South American drug operations is worth anything anyway permalink award report block reply\nborisborscht 3 points 24 hours ago let them do what they want, but they are on their own now. permalink award report block reply\nreasonablydisturbed 3 points 24 hours ago Fuck it. We'll do it live! permalink award report block reply\nMJPalazzolo 3 points 16 hours ago The British are still our enemy. permalink award report block reply\nflashersenpai 2 points 23 hours ago So? Why would the UK be obligated to take part in bombing boats by Venezuela? permalink award report block reply\nMemoryHoleyeO 2 points 19 hours ago So multiple countries halt Intel sharing based on cartel killing. That's called compromised. That's called meetings happened before permalink award report block reply\nAVeryNakedMan 2 points 22 hours ago So the UK would rather have US citizens die from drug overdoses, rather than drug runners die. permalink award report block reply\ntholinz 2 points 22 hours ago Halt all intelligence sharing with them. This sounds like a great excuse to do so. permalink award report block reply\nnolefthandshakes 2 points 22 hours ago again, sanction the fucking UK. they’re a muslim country. permalink award report block reply\nSunnybats2 2 points 20 hours ago Thw UK is history's greatest drug smuggler DUH permalink award report block reply ridge3z 1 points 18 hours ago It was the British who were tasked with the eradication of poppies in Afghanistan and stopping farmers from growing more after the 2001 invasion. But the opposite happened and cultivation only increased. Helmand province, where British troops were heavily deployed from 2006, saw opium production triple compared to when the troops first arrived. Hmm.. permalink parent award report block reply\nridge3z 1 points 18 hours ago It was the British who were tasked with the eradication of poppies in Afghanistan and stopping farmers from growing more after the 2001 invasion. But the opposite happened and cultivation only increased. Helmand province, where British troops were heavily deployed from 2006, saw opium production triple compared to when the troops first arrived. Hmm.. permalink parent award report block reply\nMorningFrost 2 points 22 hours ago And we shall halt military protection. permalink award report block reply\nMisprisionIsEvil 2 points 22 hours ago The UK has become a criminal, third world shit hole. permalink award report block reply\npatrioticwinning3 2 points 24 hours ago Kick them out of 5 eyes! permalink award report block reply SicSemperTyrannis2 1 points 17 hours ago Remove ourselves from 5 eyes. permalink parent award report block reply\nSicSemperTyrannis2 1 points 17 hours ago Remove ourselves from 5 eyes. permalink parent award report block reply\ngaijin_ronin 2 points 22 hours ago The mooslimes have fully taken that country. permalink award report block reply\nKennyKetchem 2 points 1 day ago The UN is making profits off of it and the UK is doing their bidding. So are members of congress and China. Why else would the UN fund the invasion of our border? They are getting kickbacks from the sale of these narcotics and human trafficking. permalink award report block reply\nCruzControl 2 points 1 day ago Someone quickly discover oil on the BVI. permalink award report block reply\nroadrunner0 2 points 19 hours ago The USA needs to draw way down from NATO as Europe has become Fascist and Communist so there is nothing left to protect.. Let's cut them off from our surveillance satellites and other intel.. I believe 5 eyes is already down.. permalink award report block reply\nBapple 2 points 23 hours ago Stupid.  But also kind of curious what intel they would have here that we wouldn’t?  I guess it’s time for USA to leave NATO, the UN, and the five eyes.  No one is an ally to us, why should we help or cooperate with any of them? permalink award report block reply\nBrewSwillis 2 points 21 hours ago Maybe we should cut our NATO funding, until they rethink this? permalink award report block reply\nZnut55 2 points 1 day ago Send the boats to the UK permalink award report block reply\nAgenda47 2 points 1 day ago Do we have any leverage over them somewhere where we can stop sharing information with them? Something that will really hurt them. permalink award report block reply\nplateowner2024 2 points 13 hours ago ROTFLMAO. Starmer has a crew in the Caribbean. Hahahahaha! permalink award report block reply\nltbadpuppy 2 points 24 hours ago UK: we thought you guys like to watch like us?! permalink award report block reply\nImpeachThisBitch 2 points 1 day ago What intelligence? Unless the drug smugglers misgendered someone. permalink award report block reply\nNewGoldenAge 2 points 24 hours ago Question - were we even needing them before? Here's a thought - throttle NATO. permalink award report block reply\nShitnooo 2 points 19 hours ago Wonder what type of kickback UK gets from the drugs being smuggled. permalink award report block reply ridge3z 2 points 18 hours ago The Opium Wars comes to mind. permalink parent award report block reply\nridge3z 2 points 18 hours ago The Opium Wars comes to mind. permalink parent award report block reply\nTacitus1963 2 points 15 hours ago PDJT, please tariff the UK more.\nHopefully, it will make Starmer even more unpopular to the point where he is run out of town on a rail! permalink award report block reply\nstillbringingitback 2 points 22 hours ago That’s cool, not like you faggots helped with anything anyways lol. permalink award report block reply\ncook_does 2 points 19 hours ago UK? To think we sided with those weak faggots over Hitler, for what? permalink award report block reply ridge3z 2 points 18 hours ago We should have just stayed isolationist during WWII permalink parent award report block reply\nridge3z 2 points 18 hours ago We should have just stayed isolationist during WWII permalink parent award report block reply\nmcoulton 2 points 23 hours ago We can finally go after 5-eyes permalink award report block reply\nnewuser8 2 points 24 hours ago Bunch of cucks permalink award report block reply\nBeat_to_Quarters 2 points 24 hours ago This is virtue signaling that is so retarded it actually does the opposite of what it's intending to do. If they have intel that, for instance, some of these boats actually aren't drug smuggling assholes and they decide not to share that intel with its so-called ally, then they're going to let the U.S. military strike the boats? Wouldn't sharing intel on, you know, DRUG SMUGGLING OPERATIONS, prevent doing the thing you're protesting? Also fuck the UK. They'll spy on American citizens with their Five Eyes bullshit but this is just too much for them. permalink award report block reply\nPOTUS_DonnieJ 2 points 23 hours ago Remind me why we are still allies with that shithole? Between them locking up their own citizens for speech, allowing themselves to be invaded, meddling in our elections (Starmer sending party members here before last November) and their biggest state owned and state controlled media company deceptively editing Trump's J6 speed, its beyond time to sanction them back to the stone age. permalink award report block reply\nLigersrule1 2 points 22 hours ago Reciprocate now! permalink award report block reply\nFlyCatcher94 1 points 11 hours ago Ok.  We can just stop 5eyes all together and they don’t get shit from us either. permalink award report block reply\nCrappydatum 1 points 24 hours ago James Bond leaves the chat permalink award report block reply\nDatabaseCentrals 1 points 24 hours ago Why would UK be tracking drug smuggling operations in the Caribbean permalink award report block reply\nLk4000 1 points 24 hours ago We need to liberate the UK permalink award report block reply\nridge3z 1 points 18 hours ago We are seeing the true faces of so many nations in their reaction over the USA prioritizing its own well-being after decades of 'free trade' and 'UN' bullshit that only caused our domestic decline. Don't forget that between their liberals and their royals, the UK is every bit as elitist and still have their imperial streak permalink award report block reply\nRedStoneDeepState 1 points 24 hours ago Give aid to Russia and China in regards to UK military secrets. permalink award report block reply\nOodles 1 points 18 hours ago lol Fuck the UK. Stop sharing intel with them, defund the UN, and double UK tariffs permalink award report block reply\nYodaBannon 1 points 24 hours ago honk honk permalink award report block reply\nJmricht 1 points 24 hours ago Can we just stop the drugs for a sec. permalink award report block reply\nWtf_socialismreally 1 points 24 hours ago Then we should stop giving any aid whatsoever, including breaking off every alliance we have with them. Part of being our ally is that you give us that information. permalink award report block reply\nNerdrem3 1 points 24 hours ago Someone tell them that Venezuelans aren't typically muslim. permalink award report block reply\nProf_Smith 1 points 1 day ago What you need to remember is a lot of these drugs getting blown up aren’t for America but actually going to Europe. permalink award report block reply\nOhhhhNooooThatSucks 1 points 19 hours ago woke retards.  Standing behind literal drug boats. permalink award report block reply\nghettometal 1 points 19 hours ago Wait until (((LOTT))) learns, that the Cartels are heavily linked to Israel and jews doing big business to the detriment of Western societies. permalink award report block reply\nSoyLatte 1 points 11 hours ago Odd when everyone was so squirt during Obamas unconstitutional drone strikes permalink award report block reply\ndtrap 1 points 24 hours ago Western nation doesn't want to get involved in or become a party to extra-judicial killing. Who could have seen that coming? That was an interesting boat. Where were the crew? It almost looked like one of those drones used for target practice. These aren't death rays. Gather the evidence to show that these operations are what they are said to be. permalink award report block reply\nasodfiu43253457 1 points 22 hours ago It's because Trump is suing teh Beeb permalink award report block reply\nTheFountainhead 1 points 21 hours ago Pussies permalink award report block reply\nHellsbells00 1 points 20 hours ago The UK has never been a good ally. Fuck the bongs. Let them collapse. Demand back oay for covering their ass. permalink award report block reply ridge3z 1 points 18 hours ago They were at one time to a good degree. But that was during a time long gone. Their liberals and royals think that the USA is their vassal. permalink parent award report block reply\nridge3z 1 points 18 hours ago They were at one time to a good degree. But that was during a time long gone. Their liberals and royals think that the USA is their vassal. permalink parent award report block reply\nFoxbat 1 points 17 hours ago Now we know who is profiting from the drug operations. permalink award report block reply\nOrlando_Doom 1 points 1 day ago Strike the UK, they've aligned with our enemy. The English must die, finish them off. Nuke that pathetic island of cucks. We bombed Iran for less. We invaded Iraq and Afghanistan for less. The UK is a nuclear-armed islamic threat. They helped create the false conspiracy to overthrow our government in 2020. They are as evil as israel. permalink award report block reply SaltyArmyChick 1 points 24 hours ago He right 🤔 permalink parent award report block reply\nSaltyArmyChick 1 points 24 hours ago He right 🤔 permalink parent award report block reply\nMagaChamp253 1 points 24 hours ago So they choose the side of drug runners. Ok then... permalink award report block reply\nfinnigan 1 points 9 hours ago Good, dissolve 5 Eyes and be done with Europe. permalink award report block reply\nKeepMarxInTheGround 1 points 16 hours ago Someone explain to me how these countries are our \"allies.\" permalink award report block reply\ndr_gonzo 1 points 23 hours ago I have no problem with that. I don't think Trump or anyone else in our idiotic government has the right to dictate what I can and can't ingest into my own body, the same way I don't think they have a right to tell me what I MUST ingest into my own body. The people who were opposed to vax mandates while simultaneously supporting drug prohibition laws have no leg to stand on. You granted government that right. You shouldn't bitch when it predictably backfires in your face. Besides, just like alcohol prohibition, the drug prohibition laws don't work anyway. The Narcotics Act was passed over 50 years ago, and more people do drugs now than they did when Democrats passed it. Nobody can claim those laws are \"protecting people\". The data show that to be entirely false. Besides, in a free society where the individual is superordinate to the state, it's not the responsibility of our SERVANTS in government to protect the individual from themselves. The war on drugs is a counterproductive abysmal failure. Downvote all you want. That won't make that statement any less true. permalink award report block reply Caine 2 points 18 hours ago This isn't like the Reagan-era war on drugs. Fentanyl is being sent here by China to kill as many of us as it can. permalink parent award report block reply OMC-RADIO 1 points 11 hours ago While I agree with body autonomy, a government with borders has every right and obligation to protect its people.  The narcotics industry is a black market, not recognized trade.  Allowing the narcos to sell their unregulated, untested products by crossing the US borders is funding the cartels who sell dangerous products that destroy lives and corrupt government officials.  The US has every reason and right to see the influx of such dangerous, destructive and deadly products as an assault against its people. While most people don’t care what someone else puts in their mouth or body, they don’t want to experience the direct or indirect effects of it either. permalink parent award report block reply\nCaine 2 points 18 hours ago This isn't like the Reagan-era war on drugs. Fentanyl is being sent here by China to kill as many of us as it can. permalink parent award report block reply\nOMC-RADIO 1 points 11 hours ago While I agree with body autonomy, a government with borders has every right and obligation to protect its people.  The narcotics industry is a black market, not recognized trade.  Allowing the narcos to sell their unregulated, untested products by crossing the US borders is funding the cartels who sell dangerous products that destroy lives and corrupt government officials.  The US has every reason and right to see the influx of such dangerous, destructive and deadly products as an assault against its people. While most people don’t care what someone else puts in their mouth or body, they don’t want to experience the direct or indirect effects of it either. permalink parent award report block reply\nNoFats 1 points 24 hours ago The UK needs to be put in its place. permalink award report block reply\nTearsAficionado 1 points 24 hours ago Confiscate their nukes. Immediately. permalink award report block reply\nOMC-RADIO 1 points 12 hours ago They are not now, nor have they ever been, our ally. It is hypocrisy for a FREE country to ally with or in any way support tyrannical regimes. permalink award report block reply\nDlanOdcammron 1 points 19 hours ago The stereotype of Colombians being narcos exists for a reason. permalink award report block reply\nyukondave 1 points 1 day ago \"UK weighs strategic calculations against aid\nIn the UK, pressures on defence are long-standing. Its Defence Equipment plan has gaps in excess of £15 billion. Its parliament has warned that the military could not sustain a prolonged fight. Its force size is not thought to be enough to meet NATO commitments, let alone any expanded long-term presence in Europe. \" permalink award report block reply\nMajorClark 1 points 23 hours ago The UN is running human trafficking and drug trafficking through the UK.   They're calling the shots for British just like they did the USA until President Trump came along!   Somebody in parliament is missing their cut of the drug dealers kickbacks.   Starmer needs to stop sucking muslim cock. permalink award report block reply\ncherbui 1 points 24 hours ago welp since uk has fallen under Islamic control....  we can see why they would defend terrorist permalink award report block reply\nCanadiapede7 1 points 23 hours ago We know who the money is going to, the UN and Geneva conventions are only followed by one side. War crimes? If we are at war, it is kill or be killed, this bullshit of trying to live peacefully with trash that share no values with us is what has killed the west. Kill every single smuggler, lay waste to these scum bags, it is the only way to stop it. permalink award report block reply\nTheThreeSeashells 1 points 24 hours ago Stop destroying the boats.  Seize the drugs.  Funnel them to the UK.  If they love the drugs so much, they can have them.  Let the drugs destroy THEIR country.  Or, rather, finish off their country for good.  They're already doing a splendid job destroying it otherwise. permalink award report block reply\nShitsbrokeyo 1 points 24 hours ago I bet their intel for smuggling is significant. (Rolls eyes) permalink award report block reply\nbarwhack 1 points 23 hours ago Eh. Just target anything from a narco-state or from Angland . Oops, Starmy, we couldn't tell, because we didn't know where your assets were. --😀 Even if we know. permalink award report block reply\npatrick_tribett 1 points 12 hours ago I lmfao when I watch these videos. permalink award report block reply\nancroidubh 1 points 11 hours ago Didn’t the Steele dossier come from British SIS? Can their other information be trusted? permalink award report block reply\nBldg_2019 1 points 24 hours ago Cool. Begin strikes on UK naval vessels and blockade their Caribbean colonies. permalink award report block reply\nSocraticMethod1 1 points 24 hours ago Wait, the UK has the tech to detect boats trespassing different territories? Can we confirm this as they haven't shown this ability before? permalink award report block reply\nJustlooking250 1 points 18 hours ago Absolute clown world cunts permalink award report block reply\nRepentnow 1 points 20 hours ago F̶i̶v̶e̶ Four Eyes permalink award report block reply\nKing_Boobus_Toobus 1 points 21 hours ago I'm sure that's going to make a really big difference.  No more intel from James Bond on the Octopussy. permalink award report block reply\nLogicalReasoning 1 points 24 hours ago Stopping of information sharing can go both ways permalink award report block reply\nVirTW 1 points 23 hours ago remind them about ww2 permalink award report block reply\nredinmn 1 points 24 hours ago No loss. permalink award report block reply\nRedCalifornia 1 points 24 hours ago Nuke London permalink award report block reply\nOstia -1 points 1 day ago You know, our allies and congress might be a little more inclined to go along with us if we provided even the slightest bit of evidence to ANYONE for our claims about these boats. permalink award report block reply Agenda47 1 points 1 day ago Yeah sure the DOD is just bombing random high speed fishing boats for funsies. permalink parent award report block reply Orlando_Doom -2 points 24 hours ago EvIdEnCe Oh, like the yellow cake uranium evidence that got is into iraq? NO! For once in your god damn life the military is actually being used to protect OUR interests. They didn't need to convince the country to go along with it like how we have been gaslit into every other conflict. We weren't relying on dubious information from the hostile israeli government. People are getting killed that mean us harm. I don't need red tape getting in the way of that. I wish Trump would bomb parts of the USA with this efficiency. permalink parent award report block reply\nAgenda47 1 points 1 day ago Yeah sure the DOD is just bombing random high speed fishing boats for funsies. permalink parent award report block reply\nOrlando_Doom -2 points 24 hours ago EvIdEnCe Oh, like the yellow cake uranium evidence that got is into iraq? NO! For once in your god damn life the military is actually being used to protect OUR interests. They didn't need to convince the country to go along with it like how we have been gaslit into every other conflict. We weren't relying on dubious information from the hostile israeli government. People are getting killed that mean us harm. I don't need red tape getting in the way of that. I wish Trump would bomb parts of the USA with this efficiency. permalink parent award report block reply",
  "fetched_at": "2025-11-12T22:56:43.584096Z"
}