{
  "id": "1ARK56kO03",
  "url": "https://patriots.win/p/1ARK56kO03/until-the-prostate-exam/c",
  "content": "249 Until the prostate exam. posted 5 days ago by blue5707 5 comments award share report block Tim Burchett @timburchett • 5d Until the prostate exam. Dr Helen Webberley (she/her) @HelenWebberley • 6d Trans women are women. Full stop.\n5 comments Sort by Top Top New Worst Old Save KilroyJCNJ 9 points 5 days ago And the Male Pattern Baldness permalink award report block reply HockeyMom4Trump 3 points 4 days ago Chromosomes don’t lie. Trust the science, retards. permalink award report block reply TearsAficionado 2 points 4 days ago What is a woman? permalink award report block reply Mestroisfils 2 points 4 days ago I pray no female actually use her services. permalink award report block reply ancroidubh 1 points 4 days ago You have never had a medical procedure like a prostate biopsy. Imagine having a baseball bat shoved up your ass and, just when you thought it couldn’t get any worse, what seems like red-hot nails shoot out of the bat. All F to M cross-dressers should have this done, just to be sure.. permalink award report block reply\nKilroyJCNJ 9 points 5 days ago And the Male Pattern Baldness permalink award report block reply\nHockeyMom4Trump 3 points 4 days ago Chromosomes don’t lie. Trust the science, retards. permalink award report block reply\nTearsAficionado 2 points 4 days ago What is a woman? permalink award report block reply\nMestroisfils 2 points 4 days ago I pray no female actually use her services. permalink award report block reply\nancroidubh 1 points 4 days ago You have never had a medical procedure like a prostate biopsy. Imagine having a baseball bat shoved up your ass and, just when you thought it couldn’t get any worse, what seems like red-hot nails shoot out of the bat. All F to M cross-dressers should have this done, just to be sure.. permalink award report block reply",
  "fetched_at": "2025-11-12T23:16:56.907988Z"
}