{
  "id": "1ARK56keut",
  "url": "https://patriots.win/p/1ARK56keut/lmfao-no-kings-democrats-in-an-u/c",
  "content": "407 LMFAO, NO KINGS! Democrats in an uproar as the Supreme Court rules that Trump can't hand out SNAP benefits. posted 4 days ago by restless57 7 comments award share download report block\n7 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Michalusmichalus 7 points 4 days ago Miseducated intentionally. permalink award report block reply snoopy3210 5 points 4 days ago Propaganda always go full circle permalink parent award report block reply Michalusmichalus 2 points 4 days ago The killbox was traced to 1913 last I checked. This is the long con. permalink parent award report block reply Oldman1234 5 points 4 days ago The \"No Kings\" Left are perfectly happy whenever an unelected radical activist District Court Judge (who supports the Left's agenda) issues yet another \"Royal Edict\" which must be followed by everyone under threat of being held in contempt and sent to jail... until it gets overturned by the Supreme Court for being yet another unconstitutional encroachment on the Executive Branch. permalink award report block reply snoopy3210 3 points 4 days ago They want a democrat King who hasn’t been elected democratically like Biden to spend money that wasn’t even appropriated by the elected Congress representative of the people..\nRemember how they loved the Covid emergency rule and didn’t want Biden to give it up even in 2023. They’re tyrants. permalink award report block reply Shih_Tabed 1 points 4 days ago \"Supreme Court rules\"  That is the key.  Its the Supreme Court, not Trump that made the ruling.  democrats could have people eating right now, but they continue to make people starve. permalink award report block reply QSWO1 -2 points 4 days ago Fuckin tards like the new commenter's here. permalink award report block reply\nMichalusmichalus 7 points 4 days ago Miseducated intentionally. permalink award report block reply snoopy3210 5 points 4 days ago Propaganda always go full circle permalink parent award report block reply Michalusmichalus 2 points 4 days ago The killbox was traced to 1913 last I checked. This is the long con. permalink parent award report block reply\nsnoopy3210 5 points 4 days ago Propaganda always go full circle permalink parent award report block reply Michalusmichalus 2 points 4 days ago The killbox was traced to 1913 last I checked. This is the long con. permalink parent award report block reply\nMichalusmichalus 2 points 4 days ago The killbox was traced to 1913 last I checked. This is the long con. permalink parent award report block reply\nOldman1234 5 points 4 days ago The \"No Kings\" Left are perfectly happy whenever an unelected radical activist District Court Judge (who supports the Left's agenda) issues yet another \"Royal Edict\" which must be followed by everyone under threat of being held in contempt and sent to jail... until it gets overturned by the Supreme Court for being yet another unconstitutional encroachment on the Executive Branch. permalink award report block reply\nsnoopy3210 3 points 4 days ago They want a democrat King who hasn’t been elected democratically like Biden to spend money that wasn’t even appropriated by the elected Congress representative of the people..\nRemember how they loved the Covid emergency rule and didn’t want Biden to give it up even in 2023. They’re tyrants. permalink award report block reply\nShih_Tabed 1 points 4 days ago \"Supreme Court rules\"  That is the key.  Its the Supreme Court, not Trump that made the ruling.  democrats could have people eating right now, but they continue to make people starve. permalink award report block reply\nQSWO1 -2 points 4 days ago Fuckin tards like the new commenter's here. permalink award report block reply",
  "fetched_at": "2025-11-12T23:13:26.698681Z"
}