{
  "id": "8185618",
  "title": "445San Diego hires inspectors to snoop in residents' garbage cans to make sure they're recycling pro",
  "url": "https://patriots.win/p/1ARK9nPLwm/san-diego-hires-inspectors-to-sn/c",
  "content": "822 San Diego hires inspectors to snoop in residents' garbage cans to make sure they're recycling properly posted 6 hours ago by CounterStrike 140 comments award share download report block\n140 comments Sort by Top Top New Worst Old Save Around the Web Seniors Born 1939-1969 Receive 11 Benefits This Month If They Ask Super Saving Online Apersonofinterest 111 points 6 hours ago You go through the effort of sorting your trash and then they pick it up and throw it all in one dump. This is just another way to shake the taxpayers down. I bet they don't do these inspections in the ghettos and barrios. They're going where the money is. permalink award report block reply Danofdestiny 48 points 6 hours ago The police don't cite or arrest homeless people for most crimes where I live, they reserve that privilege for the people who have something to lose. permalink parent award report block reply gunteh 28 points 6 hours ago The homeless literally poisoned the water table with their toxic campsites, and yet you know who the city inspectors go after? The guy with his shrubs 1 inch over the city sidewalk... permalink parent award report block reply edxzxz 5 points 5 hours ago Wait until that 'city sidewalk' in front of your house has weeds growing out of the cracks or is tilted from a tree root - then the city will cite you for not fixing it. permalink parent award report block reply least_counties_ever 34 points 6 hours ago Performative “recycling” is to satisfy California Karens. This added inspection is just more environmental theater to shore up their base. permalink parent award report block reply gunteh 19 points 5 hours ago They do recycling bins everywhere, not just California, but recycling is a scam, anybody who even knows what happens to the recycling after it's picked up will know that you feel like you're saving the planet while you spent so much time for stuff to end up on the same landfill as the regular stuff... permalink parent award report block reply SneakyWino 5 points 5 hours ago True.  The only thing worth maybe recycling is glass but you would have to sort it by color. permalink parent award report block reply _Sully_ 4 points 5 hours ago Let's not forget that the plastic bag ban lead to 100,000 more tons of plastic in CA landfills. I kept telling people that's what will happen and you'll just lose money for no reason. Nope, they care only about the theater. permalink parent award report block reply Apersonofinterest 6 points 6 hours ago Are there going to be fines associated with these inspections? permalink parent award report block reply Suckitreddit 4 points 6 hours ago Yup permalink parent award report block reply shadowbanana 3 points 6 hours ago So it's a tax for non-compliance. permalink parent award report block reply Yaemz123 3 points 3 hours ago San Diego has had fines for putting recyclables in regular trash for over a decade. The inspection walks are new, but the idiotic rules and fines are not. permalink parent award report block reply HRpumpanddump 4 points 5 hours ago Karens = Borderline Personality Disorder. permalink parent award report block reply Rudy_DankMemer 13 points 5 hours ago You go through the effort of sorting your trash and then they pick it up and throw it all in one dump. This is exactly how it really is. This is just another way to shake the taxpayers down. Seattle suburbs were inspecting trash in the 90's after they made recycling mandatory... fines started at $125 in Bellevue. One of my PT employees worked full time at Waste fucking Management - he told everyone he knew that it was all bullshit. I bet they don't do these inspections in the ghettos and barrios. Recycling is only racist, when white people DON'T do it. permalink parent award report block reply edxzxz 2 points 5 hours ago Decades ago when mandatory recycling had only been around a short time, the NYT Sunday magazine had a long article detailing how retarded it was, factoring in a second set of trucks, separate sets of cans, sorting and there being no viable market to actually re use the materials.  They've known it's stupid since the beginning. permalink parent award report block reply PhilipeNegro 7 points 6 hours ago They’ve been doing this in Philadelphia for decades. The fine structure was passed before any plan was made to properly sort recyclables (still hasn’t), and they’ll happily slip a ticket through your mail slot for violating. To add, it used to cost $35 for a brittle plastic bin, which was always too small, had to be purchased in-person waaaay out in an area filled with junkyards (and dead bodies, too), and the lovely trash men would just chuck it over the row of parked cars onto the sidewalk. I think the longest one ever lasted was 8 months. Now we’re out in the boonies, and the recycling crew is three guys that sort your bin right in your driveway. permalink parent award report block reply IBentMyWookie 7 points 5 hours ago Yup, I watch the recycling guys yeet the blue bin 10 feet every week until it’s completely cracked and useless. I shred everything including junk mail so that nothing with my name or address on it ends up in the trash whole. If I ever get that fine I’ll demand they prove it was my trash, which they can’t. Anyone can put trash in any curb. I doubt it’d repeal the ticket but always fight every ticket from the nanny state. permalink parent award report block reply Awan-CIA-Car-Lot 3 points 5 hours ago Do they steal the aluminum cans? That was the first thing I wondered about when I saw that there are people scrounging around in people's trash! Lol. permalink parent award report block reply Remember_the_Alamo 5 points 6 hours ago The precious BIPOCs or whatever they're called this week probably won't be bothered. permalink parent award report block reply load 6 more comments... SickIcarus 36 points 6 hours ago Recycling is such a scam - just a bunch of virtue-signaling feel-good bullshit: “I’m doing my part!” It all goes to the same landfill. Recycleable materials used to be sold to China, then they decided they didn’t want them because it didn’t make financial sense. Want to really make recycling work? Have garbage sorted at the transfer station! They’re already set up for it, already staffed for it, and it would actually be effective. Did you know you can’t recycle pizza boxes? The cardboard is “contaminated” by the food waste stuck to the inside of the box. When I lived in California, they were talking about starting to fine you something like $5 for sorting and recycling “improperly.” Ok then, if tomato paste contaminates recyclables, then I put everything in the garbage can and poured a 25-cent can of tomato soup over the top - cheaper than the fine and they can’t complain. Fuck em. permalink award report block reply Suckitreddit 12 points 6 hours ago I like your problem solving style, pede. I like it! permalink parent award report block reply IBentMyWookie 5 points 5 hours ago Modern problems. Modern solutions! permalink parent award report block reply DontTreadOnLego 5 points 5 hours ago I like that idea; pour cheap icky stuff on the top so they can't go through it. permalink parent award report block reply XlDEN 4 points 5 hours ago Yes. Go to any big company and they’ll have separate bins for garbage and recycling. Ask janitors at any of these companies and they will tell you it all goes into the same dumpster. The recycling is just to make the employees happy. It’s the same at any resort as well. It’s just to make the guests feel good and that their recycling has somehow environmentally balanced out whatever they did for entertainment. A lot of communities actually pay companies to haul away their recyclables. These companies then pay other companies to take it from them. It goes down the line like that until it winds up in places like Africa and India where it just gets dumped into the ocean. permalink parent award report block reply _Sully_ 3 points 5 hours ago There is actual money in some recycling but it's as you say done be a line of brokers essentially. They then store just aluminum, for instance, until the price is right and someone can process it at a profit. It's so inconsistent that it's nearly never worth it. permalink parent award report block reply XlDEN 2 points 4 hours ago Yes, by the time it gets dumped into the ocean just about all that’s left is the plastic. permalink parent award report block reply SickIcarus 2 points 5 hours ago My favorite is when the trash can has openings for trash and recycling, but only one garbage bag. permalink parent award report block reply XlDEN 1 points 4 hours ago BlueGreen Resorts actually has separate bins for every type of recycling. You’ll have one bin for paper, another for plastic, another for glass and another for metal cans. Housekeeping will just pick up all the bags and throw them away together with the garbage. This way they can waste five mostly empty garbage bags instead of just using one like with your example. permalink parent award report block reply BLMTrying2GetUrGuns 2 points 5 hours ago It all goes to the same landfill. Recycleable materials used to be sold to China, then they decided they didn’t want them because it didn’t make financial sense. I read an article on this a while back (don't have it available right now): China used to take the recycling for 'free' (there were empty shipping containers coming back anyhow, so it just went in them.) They eventually started charging the US for them to take it. Once they had a 'supply' line of their own built up of cardboard/plastic/glass/etc, then they said, \"no thanks, we don't want it.\" permalink parent award report block reply SpellingContable 1 points 5 hours ago Public trash cans are never sorted for recyclables. Straight to the dump for everything. These 'lid lifter' faggots should be fining themselves. permalink parent award report block reply load 3 more comments... TheMustacheBandit 12 points 6 hours ago I don't even bother sorting. Everything goes into trash until its full, then the rest will go into recycle.  It all goes to same place, they can sort it themselves if they want to. permalink award report block reply BLMTrying2GetUrGuns 3 points 5 hours ago I sort it, only because I can get rid of it for free. I live in the country, so I don't get 'free' trash service....I bag up my trash and toss it into a local store's can. permalink parent award report block reply nolefthandshakes 1 points 2 hours ago do you burn? permalink parent award report block reply ImYourHuckleberry24 1 points 3 hours ago When I lived in CA I placed bags of dog shit in the recycle bin if it was closest to the gate. I knew for many years it was all getting dumped together. It's all a scam. permalink parent award report block reply TheGunFairy 11 points 6 hours ago Jokes on them hobos already dig for cans because CA pays for them. permalink award report block reply Apersonofinterest 6 points 6 hours ago Our trash cans get sweeped at least 3 times a day. The early bums get the cans. permalink parent award report block reply Grindelwald 9 points 6 hours ago I have a wife for that, Oops, that did not sound right.  But she corrects my error in the kitchen.  So I have no liability. permalink award report block reply Hydris 1 points 2 hours ago My wife was all about recycling. I had to tell her i could not give the slightest shit about recycling. If she wants to sort it after i throw things out thats on her. All the recycling can does is give me a second garbage can every other week. permalink parent award report block reply Crappydatum 8 points 6 hours ago They literally have cameras on the trucks that can look at the recycling as it's being dumped. My son got a fine from Seattle refuse over a decade ago for something wrong in his recycle bin. Used the Ring camera to prove it was a neighbor putting the offending garbage in the recycle bin. Did Seattle refuse care? Oh hell no, fine stuck and he left that hellhole. Not even jobs at the big three (Google, Microsoft, Amazon) could keep him there. He makes 25% of what he used to and is 4 times happier now. permalink award report block reply OutlawPurpleHairDye 7 points 6 hours ago No surprise that the same places emptying the prisons of actual criminals and shielding illegal invaders loves harassing the actual taxpaying citizens with stupid shit like this. permalink award report block reply NOTWOKE 6 points 6 hours ago Rub shit on the container handles. permalink award report block reply FredRedd 2 points 6 hours ago THIS is the way! permalink parent award report block reply IBentMyWookie 1 points 5 hours ago It’s Cali, I’m SURE some homeless fent fiend took care of that already. permalink parent award report block reply BigMikesSwingingCock 6 points 6 hours ago Just dump a mound of chicken shit in them. permalink award report block reply PhilipeNegro 5 points 6 hours ago Poop in it. Make them not want to come to work ever again. permalink parent award report block reply BigMikesSwingingCock 4 points 5 hours ago If you're going to do that, go the extra mile and just shit on top of it. permalink parent award report block reply edxzxz 2 points 5 hours ago Live raccoons and bungee the lid shut? permalink parent award report block reply ImYourHuckleberry24 1 points 3 hours ago That's what I used to do. Plus sprinkled dog shit for good measure. permalink parent award report block reply SDsc0rch 4 points 6 hours ago \"recycling is garbage\" https://archive.is/N8h4b permalink award report block reply CounterStrike OP 4 points 6 hours ago https://www.dailymail.co.uk/news/article-15281479/san-diego-garbage-inspectors-recycling.html permalink award report block reply Shitsbrokeyo 4 points 6 hours ago Recycling is already inefficient and now, they increase thru a salary for rediculousness. Also that's my trash until you pick it up to dump it. Trespassing. permalink award report block reply FearGodTheAlmighty 4 points 6 hours ago Your tax dollars at work permalink award report block reply Lol_Garrus 3 points 5 hours ago \"You're hiding plastic bottles in the trash can, aren't you?\" permalink award report block reply NoWorries77 3 points 4 hours ago You must know that San Diego shut down it’s waste recycling plant… this is for control & taxes. And is another reason why we left San Diego in the rearview mirror. permalink award report block reply QueensOwn 3 points 6 hours ago Uh, NYC has been doing this for a few years already. Think of it as the ultimate revenue generator for the socialist utopia. There are 4 separate bins. The latest is food waste. I don’t live there (my mother does) but it is IMPOSSIBLE to know and follow all the rules. These Sanitation “inspectors” are super aggressive and regularly issue fines. Now try getting an elderly old lady to follow these rules. The Sanitation GESTAPO are real. permalink award report block reply PMSocks 3 points 5 hours ago My area required clear garbage bags so you could see inside ... I always thought 2 pints of ketchup and a baby doll could be entertaining in a bag. permalink award report block reply pococurante 2 points 6 hours ago San Francisco must hire toilet inspectors to ensure people are shitting in them properly. It's the only solution to all of the shitting on the sidewalks. permalink award report block reply slander 1 points 3 hours ago There will be a maximum limit on the amount allowed to be disposed of in the toilet.  Any excess must be left on the sidewalk. permalink parent award report block reply BrewSwillis 2 points 3 hours ago They need this in my neighborhood. Lots of Arabs, and I think they are retarded. They just use the recycling bin as another trash bin. Not that recycling is real anyway. permalink award report block reply Mega_MAGA 2 points 3 hours ago Except there is no recycling. permalink award report block reply CrankyCrab 2 points 3 hours ago My city has been doing this shit for years.  I don't know how often as I have never been cited.  I recently received a notice that residents can no longer throw plastic bags in the recycling bin. One of my neighbors makes a point to put a week's worth of dog and cat shit right at the top. permalink award report block reply Seruna_Kanus 2 points 2 hours ago Why not hire 3 times as many to have workers that can sort trash at the waste management company? permalink award report block reply DeltaSierra 2 points 6 hours ago Not complicated.  Once it is in their bin it belongs to them.  Most places have an option to take it down to the trash dump yourself. permalink award report block reply Rudy_DankMemer 2 points 5 hours ago Most places have an option to take it down to the trash dump yourself. Twenty-seven (27) states and the District of Columbia have at least one mandatory recycling requirement. https://www.nerc.org/disposal-bans-mandatory-recycling permalink parent award report block reply DeltaSierra 1 points 5 hours ago I am pretty sure my trash collectors would be much more upset at having trash thrown in the recycle bin than having recyclables thrown with the trash.  These guys don’t give a fuk about climate change. permalink parent award report block reply RudeFrog 2 points 5 hours ago They should have to pay you for your recycling. You're giving them resources for free. permalink award report block reply barwhack 2 points 6 hours ago Dead rats. permalink award report block reply Goatboy66 2 points 6 hours ago All a Kickback SCAM. permalink award report block reply IBentMyWookie 2 points 6 hours ago The biggest joke is that most of the recycling in programs ends up in a landfill or garage to China anyhow. They just want a reason to search and fine people into poverty. permalink award report block reply MAGA-Fett 2 points 1 hour ago They already do this in my city in Arizona. They will put a warning label on your garbage can if you have the wrong stuff in there.  It’s so stupid since 99% of so-called “recyclable” trash cannot actually be recycled for anything. It’s all a scam. permalink award report block reply cross_bearer_02 2 points 6 hours ago Nothing else better to do than rifle through someone's garbage, is it? permalink award report block reply FredRedd 2 points 5 hours ago And euthanizing pet squirrels. permalink parent award report block reply nats1mom 2 points 6 hours ago Doing the same in Scottsdale, AZ!!!! They remove nonrecycling items and then throw the items on the ground in front of recycle bin. permalink award report block reply ImYourHuckleberry24 1 points 3 hours ago I can believe it about Scottdale. I'm way south and don't have trash service, but the dump isn't far. My loads have never exceeded the $8 minimum. permalink parent award report block reply Danofdestiny 2 points 6 hours ago Sacramento already does this. permalink award report block reply BoomShtick 1 points 5 hours ago When did that start? permalink parent award report block reply Danofdestiny 1 points 5 hours ago Sometime this year. I've had two friends who told me that they received written warnings from the city waste dept about separating their trash and putting it in the designated can with a printed guide. Supposedly all food waste is supposed to go in the yard waste can so if you don't have much of a yard, like myself, you can have rotting food in a can on the side of your house for weeks while the yard clippings slowly accumulate. I don't participate, but I haven't been warned yet either. permalink parent award report block reply AlmostFullyDilated 2 points 3 hours ago it all ends up at the same place permalink award report block reply rebuildingMyself 2 points 5 hours ago Yes please spend city funds on another way to Karen out at your neighbor all so the recycling bins contents can go to the same fucking dump as the other trash. permalink award report block reply mikejones 2 points 5 hours ago I always thought recycling was a scam. I have never recycled and at work I toss shit straight into the trash as they only separate cardboard from everything else. I would never survive in a blue city. permalink award report block reply Hikedelics 2 points 5 hours ago Lmfao Who wants to start putting glass bottles. aluminum cans, and fucking baby seals in some prominent assholes garbage cans? permalink award report block reply penguinjay1212 1 points 4 hours ago You dont understand, there will be some people that are safe. Even if they put the baby seals there themselves, they'd explain how homeless or maga did it. Not even joking 1 bit. Disparity in enforcement is one of USAs biggest problems, and California is too! permalink parent award report block reply Owmyballz 2 points 6 hours ago I'd break out the burn barrel before I'd submit to that shit. permalink award report block reply s27zw7M1h62lURPyezOa PRO 1 points 2 hours ago Libs not happy. https://www.reddit.com/r/sandiego/comments/1omrvk8/teams_of_lid_lifters_begin_enforcement_of_city_of/ permalink award report block reply Toddyoungsvagina 1 points 6 hours ago Well i guess I’d be taking a dump in the trash from now on permalink award report block reply mateus 1 points 5 hours ago More gestapo tactics from the greenies and the same people bitching about \"authoritarianism.\" Put the trash out just as the trucks\nare coming lol. permalink award report block reply Big_dick_cheney 1 points 4 hours ago Tax dollars hard at work permalink award report block reply ChyNahAzzWhole1 1 points 2 hours ago it all goes to the same place. Yes? or No? If it does... Then this is a criminal scam run with tax payer money to extort money from Citizens through punishable regulations. Malfeasance and Negligence. permalink award report block reply alucard13mmfmj 1 points 35 minutes ago Dont companies export and sell the recyclables to china where china sorts it? They recycle all the material and just dump the non recyclable stuff. permalink award report block reply Spacemonkey 1 points 3 hours ago To be fair once trash is moved from your house to the curb it becomes public domain and anyone can go through it but if it's still up on your property like say by your garage and they try to go and look through it then that's a bullet. permalink award report block reply Mintap 1 points 2 hours ago Good place and time to start distributing my \"You Lid Lifters are Faggots\" craft beer branding and label idea. permalink award report block reply utfanx2 1 points 5 hours ago They were just whining about unreasonable seach and seizure for illegal aliens. permalink award report block reply aloha_snackbar22 1 points 2 hours ago San Diego used to be a beautiful and conservative city. Now is becoming just another LA. permalink award report block reply TexasBrowncoat 1 points 4 hours ago California was going to weigh you recycling bin to see if you were recycling enough material. If not, they would bill you for the amount that they thought you should have recycled. permalink award report block reply boredrandomguy 1 points 2 hours ago They did it in Michigan.  I didn't put out my cart during that month at all. In fact, it was locked in my garage out of site the entire time. permalink award report block reply TwoArizonaPedes 1 points 6 hours ago And if they determine you're not recycling \"enough\" what happens? permalink award report block reply blueeyephoto 1 points 5 hours ago Big Govt is watching you permalink award report block reply contender 1 points 4 hours ago most trash goes to a sorting center before the dump all cans go to the same place permalink award report block reply MatterThatMetals 1 points 4 hours ago Wow. That's retarded. permalink award report block reply IvIA6A 1 points 5 hours ago Watch penn and teller bullshit episode on recycling. It's all a grift to enrich these city managers and these recycling companies. The only profitable thing that is recycled is aluminum cans, and all the new paper that is made is from specially grown forests for the wood pulp. We're not clear-cutting trees for any of that. It's a scam. On a sidenote, those recycling bins at the grocery store for plastic bags all get thrown away. permalink award report block reply redditadminssuckit 1 points 5 hours ago Keep the can on your property until the last minute permalink award report block reply DingDongDitch 1 points 5 hours ago H1-Bs dont give a fucccckkkk. Have fun in the Hindu hoods permalink award report block reply BillyBillington 1 points 6 hours ago Gotta be sure all the plastic going to India is legit permalink award report block reply GuerillaYourDreams 1 points 6 hours ago I'm not a bit surprised. I lived there from 2005-2007 and back then you would be FINED if you didn't recycle properly. Asshoes. permalink award report block reply one_cool 1 points 5 hours ago Seattle was doing this to make sure the garbage was \"clean\" of compostable organics.  F'd leftist neuroticism on full display. permalink award report block reply Tokens_Worth 1 points 2 hours ago I love that I live in an area, free disposal. Paid for by my (cheap) property taxes.\nFuck Democrats. permalink award report block reply SPEDMan64 1 points 4 hours ago Who is snooping at the recyclers to make sure they're recycling properly? permalink award report block reply Dantalian 1 points 2 hours ago Recycling is only feasible when energy is CHEAP - which is never the case in these Leftist jurisdictions that cater to the Green Grift. permalink award report block reply Shaffro 1 points 4 hours ago Now California has trash Nazis. 😂 permalink award report block reply tiamat 1 points 1 hour ago I thought san Diego was more red leaning, or atleast used to be permalink award report block reply Formerlurker92 1 points 6 hours ago I give it two months before one of these inspectors is caught applying for a credit card using someone else's id permalink award report block reply hughjasske69 1 points 5 hours ago TIME TO SHIT IN THE DUMPSTERS permalink award report block reply JamesBond007 1 points 5 hours ago Snakes. Snakes in all my trash. permalink award report block reply gustodog 1 points 1 hour ago This seems like a job that could be hazardous in more ways than one. permalink award report block reply IsrorOrca 1 points 5 hours ago Self manufactured problems for CA - not my problem. permalink award report block reply Koikatrose 1 points 5 hours ago So glad I don't live in that stupid state.\nNext they will be inspecting your toilet flushes. permalink award report block reply LLP2 1 points 3 hours ago Bitch-ass street people and illegal chinese pickers make a big mess moving my sorted garbage out of the way to get to the bottom soda can and then don't put it all back. permalink award report block reply hillaryforprison 1 points 3 hours ago Recycling basically does nothing. It usually goes to the same dump which has a totally different way of doing things. They made twice as many plastic containers for 'recycling'  manufactured and distributed across the world in order to 'save the planet'. People fly on jets burning tons of fuel in order to get to these climate summits to virtue signal about how awesome they are with the planet and how everyone else must obey their words. permalink award report block reply Hangmhigh 1 points 5 hours ago Sawzall the recycling bin and put it in\nthe trash. permalink award report block reply bagel_fragility 1 points 6 hours ago reminds me of a trailer park boys episode permalink award report block reply 2025WhatIsTrue 1 points 6 hours ago Typical woke LIB nitwittery.  What absolute worthless fools. permalink award report block reply DeplorableKatie 1 points 4 hours ago I don’t mind recycling but sometimes I’ll toss something that seems to be more wasteful to recycle than trash. For example a plastic kefir jug, how much clean tap water do I need to use to rinse it out in order to recycle. I’d challenge that it’s more environmentally wasteful to use all that clean water than to just trash the one plastic item that’s hard to rinse. Would some inspector understand that or just gleefully jab a finger at the #2 jug in the waste bin and write me a fine. Speaking of #2….. permalink award report block reply hairless_ap3 1 points 1 hour ago This is gay af and those faggots let this happen to themselves permalink award report block reply penguinjay1212 1 points 5 hours ago Win win. They can now get warrants for actual productive people's homes over a junkie throwing something in their garbage. Beautiful! That junkie could even be the cop. If I had a garbage can, I discreetly get a cam on it asap. Might be matter of freedom. Wtf is this??? Such an intrusion. Everyone will just litter anything remotely sketchy waaaaay harder now. Opposite effect incoming. Just as intended. If these people are failing this hard on accident, well, one could hardly even suspend their disbelief. Everything the govt does is underhanded, bc a mf would wanna shoot em over the shit they do. Even the freedom loving non recycler or someone's crazy grandma who actually tries but cant get it right. They are gonna fine her? California is fucking evil. Retards x evil govt = this I'm sure my state will do the same in 15 years or so... permalink award report block reply Shakakka99 1 points 5 hours ago Showtime: Penn & Teller: Bullshit! • Season 2 S2 E5: Recycling FIND IT.  WATCH IT.  LAUGH YOUR ASS OFF. permalink award report block reply DingleBalls 1 points 6 hours ago Violates illegal search and seizure permalink award report block reply bluewhiteandred 1 points 3 hours ago tangential but composting is a top way to reduce the waste you might otherwise throw away According to the [EPA], food scraps and yard waste make up about 30% of materials sent to landfills, and composting significantly cuts down on this volume by diverting organic materials from landfill disposal. permalink award report block reply MJK1 1 points 5 hours ago Our little bit of recycling isn't going to save the world anyway. permalink award report block reply ckover9000 1 points 5 hours ago They do this here in Va. $50 if they find a non-recyclable in your bin. $150 if they find it again. I just put everything recyclable in my regular trash and never touch the stupid recycle bin. Next they'll start going thru your regular trash slicing open bags to see if anything recyclable in there and fine you. permalink award report block reply Mrwhitepants 1 points 49 minutes ago ya Phoenix az does this. For months i received notes with a red check mark on my bin saying soft plastic bad, hard plastic okay, then one day they moved on to a different neighborhood. permalink award report block reply NotYourMan 1 points 5 hours ago Big government everywhere.  In San Jose, CA the city has people driving around looking for \"upgrades\" to single family homes to make sure they get the regulation fees and inspection fees.  California is a socialist society by city, county, state regulations. permalink award report block reply s27zw7M1h62lURPyezOa PRO 1 points 2 hours ago From  r/sandiago\nIm generally a pro government liberal but this shit is so insanely dumb lol… like just indefensible waste of taxpayer dollars\nShit like is just free ammunition for the MAGA crowd. Embarrassing.\n10d ago\nIt doesn't help that the then Senator that introduced the bill, Ricardo Lara, is currently caught up in a couple scandals including using taxpayer money for trips.\nThe Republicans are gonna flame us for this one lol permalink award report block reply Suckitreddit 1 points 6 hours ago They do this in Reno. Don’t know if there is a camera on the truck or what. If the can isn’t locked, how can you blame the resident? And…what a great way to spend money! Meanwhile the homeless are so neat and tidy. permalink award report block reply f_bastiat 0 points 31 minutes ago I know a lot of recycling ends up at the dump, but it's a special type of asshole that uses the recycle bin as a second trash can, I yelled at a neighbor for doing it one time. permalink award report block reply\nApersonofinterest 111 points 6 hours ago You go through the effort of sorting your trash and then they pick it up and throw it all in one dump. This is just another way to shake the taxpayers down. I bet they don't do these inspections in the ghettos and barrios. They're going where the money is. permalink award report block reply Danofdestiny 48 points 6 hours ago The police don't cite or arrest homeless people for most crimes where I live, they reserve that privilege for the people who have something to lose. permalink parent award report block reply gunteh 28 points 6 hours ago The homeless literally poisoned the water table with their toxic campsites, and yet you know who the city inspectors go after? The guy with his shrubs 1 inch over the city sidewalk... permalink parent award report block reply edxzxz 5 points 5 hours ago Wait until that 'city sidewalk' in front of your house has weeds growing out of the cracks or is tilted from a tree root - then the city will cite you for not fixing it. permalink parent award report block reply least_counties_ever 34 points 6 hours ago Performative “recycling” is to satisfy California Karens. This added inspection is just more environmental theater to shore up their base. permalink parent award report block reply gunteh 19 points 5 hours ago They do recycling bins everywhere, not just California, but recycling is a scam, anybody who even knows what happens to the recycling after it's picked up will know that you feel like you're saving the planet while you spent so much time for stuff to end up on the same landfill as the regular stuff... permalink parent award report block reply SneakyWino 5 points 5 hours ago True.  The only thing worth maybe recycling is glass but you would have to sort it by color. permalink parent award report block reply _Sully_ 4 points 5 hours ago Let's not forget that the plastic bag ban lead to 100,000 more tons of plastic in CA landfills. I kept telling people that's what will happen and you'll just lose money for no reason. Nope, they care only about the theater. permalink parent award report block reply Apersonofinterest 6 points 6 hours ago Are there going to be fines associated with these inspections? permalink parent award report block reply Suckitreddit 4 points 6 hours ago Yup permalink parent award report block reply shadowbanana 3 points 6 hours ago So it's a tax for non-compliance. permalink parent award report block reply Yaemz123 3 points 3 hours ago San Diego has had fines for putting recyclables in regular trash for over a decade. The inspection walks are new, but the idiotic rules and fines are not. permalink parent award report block reply HRpumpanddump 4 points 5 hours ago Karens = Borderline Personality Disorder. permalink parent award report block reply Rudy_DankMemer 13 points 5 hours ago You go through the effort of sorting your trash and then they pick it up and throw it all in one dump. This is exactly how it really is. This is just another way to shake the taxpayers down. Seattle suburbs were inspecting trash in the 90's after they made recycling mandatory... fines started at $125 in Bellevue. One of my PT employees worked full time at Waste fucking Management - he told everyone he knew that it was all bullshit. I bet they don't do these inspections in the ghettos and barrios. Recycling is only racist, when white people DON'T do it. permalink parent award report block reply edxzxz 2 points 5 hours ago Decades ago when mandatory recycling had only been around a short time, the NYT Sunday magazine had a long article detailing how retarded it was, factoring in a second set of trucks, separate sets of cans, sorting and there being no viable market to actually re use the materials.  They've known it's stupid since the beginning. permalink parent award report block reply PhilipeNegro 7 points 6 hours ago They’ve been doing this in Philadelphia for decades. The fine structure was passed before any plan was made to properly sort recyclables (still hasn’t), and they’ll happily slip a ticket through your mail slot for violating. To add, it used to cost $35 for a brittle plastic bin, which was always too small, had to be purchased in-person waaaay out in an area filled with junkyards (and dead bodies, too), and the lovely trash men would just chuck it over the row of parked cars onto the sidewalk. I think the longest one ever lasted was 8 months. Now we’re out in the boonies, and the recycling crew is three guys that sort your bin right in your driveway. permalink parent award report block reply IBentMyWookie 7 points 5 hours ago Yup, I watch the recycling guys yeet the blue bin 10 feet every week until it’s completely cracked and useless. I shred everything including junk mail so that nothing with my name or address on it ends up in the trash whole. If I ever get that fine I’ll demand they prove it was my trash, which they can’t. Anyone can put trash in any curb. I doubt it’d repeal the ticket but always fight every ticket from the nanny state. permalink parent award report block reply Awan-CIA-Car-Lot 3 points 5 hours ago Do they steal the aluminum cans? That was the first thing I wondered about when I saw that there are people scrounging around in people's trash! Lol. permalink parent award report block reply Remember_the_Alamo 5 points 6 hours ago The precious BIPOCs or whatever they're called this week probably won't be bothered. permalink parent award report block reply load 6 more comments...\nDanofdestiny 48 points 6 hours ago The police don't cite or arrest homeless people for most crimes where I live, they reserve that privilege for the people who have something to lose. permalink parent award report block reply gunteh 28 points 6 hours ago The homeless literally poisoned the water table with their toxic campsites, and yet you know who the city inspectors go after? The guy with his shrubs 1 inch over the city sidewalk... permalink parent award report block reply edxzxz 5 points 5 hours ago Wait until that 'city sidewalk' in front of your house has weeds growing out of the cracks or is tilted from a tree root - then the city will cite you for not fixing it. permalink parent award report block reply\ngunteh 28 points 6 hours ago The homeless literally poisoned the water table with their toxic campsites, and yet you know who the city inspectors go after? The guy with his shrubs 1 inch over the city sidewalk... permalink parent award report block reply edxzxz 5 points 5 hours ago Wait until that 'city sidewalk' in front of your house has weeds growing out of the cracks or is tilted from a tree root - then the city will cite you for not fixing it. permalink parent award report block reply\nedxzxz 5 points 5 hours ago Wait until that 'city sidewalk' in front of your house has weeds growing out of the cracks or is tilted from a tree root - then the city will cite you for not fixing it. permalink parent award report block reply\nleast_counties_ever 34 points 6 hours ago Performative “recycling” is to satisfy California Karens. This added inspection is just more environmental theater to shore up their base. permalink parent award report block reply gunteh 19 points 5 hours ago They do recycling bins everywhere, not just California, but recycling is a scam, anybody who even knows what happens to the recycling after it's picked up will know that you feel like you're saving the planet while you spent so much time for stuff to end up on the same landfill as the regular stuff... permalink parent award report block reply SneakyWino 5 points 5 hours ago True.  The only thing worth maybe recycling is glass but you would have to sort it by color. permalink parent award report block reply _Sully_ 4 points 5 hours ago Let's not forget that the plastic bag ban lead to 100,000 more tons of plastic in CA landfills. I kept telling people that's what will happen and you'll just lose money for no reason. Nope, they care only about the theater. permalink parent award report block reply Apersonofinterest 6 points 6 hours ago Are there going to be fines associated with these inspections? permalink parent award report block reply Suckitreddit 4 points 6 hours ago Yup permalink parent award report block reply shadowbanana 3 points 6 hours ago So it's a tax for non-compliance. permalink parent award report block reply Yaemz123 3 points 3 hours ago San Diego has had fines for putting recyclables in regular trash for over a decade. The inspection walks are new, but the idiotic rules and fines are not. permalink parent award report block reply HRpumpanddump 4 points 5 hours ago Karens = Borderline Personality Disorder. permalink parent award report block reply\ngunteh 19 points 5 hours ago They do recycling bins everywhere, not just California, but recycling is a scam, anybody who even knows what happens to the recycling after it's picked up will know that you feel like you're saving the planet while you spent so much time for stuff to end up on the same landfill as the regular stuff... permalink parent award report block reply SneakyWino 5 points 5 hours ago True.  The only thing worth maybe recycling is glass but you would have to sort it by color. permalink parent award report block reply _Sully_ 4 points 5 hours ago Let's not forget that the plastic bag ban lead to 100,000 more tons of plastic in CA landfills. I kept telling people that's what will happen and you'll just lose money for no reason. Nope, they care only about the theater. permalink parent award report block reply\nSneakyWino 5 points 5 hours ago True.  The only thing worth maybe recycling is glass but you would have to sort it by color. permalink parent award report block reply\n_Sully_ 4 points 5 hours ago Let's not forget that the plastic bag ban lead to 100,000 more tons of plastic in CA landfills. I kept telling people that's what will happen and you'll just lose money for no reason. Nope, they care only about the theater. permalink parent award report block reply\nApersonofinterest 6 points 6 hours ago Are there going to be fines associated with these inspections? permalink parent award report block reply Suckitreddit 4 points 6 hours ago Yup permalink parent award report block reply shadowbanana 3 points 6 hours ago So it's a tax for non-compliance. permalink parent award report block reply Yaemz123 3 points 3 hours ago San Diego has had fines for putting recyclables in regular trash for over a decade. The inspection walks are new, but the idiotic rules and fines are not. permalink parent award report block reply\nSuckitreddit 4 points 6 hours ago Yup permalink parent award report block reply shadowbanana 3 points 6 hours ago So it's a tax for non-compliance. permalink parent award report block reply\nshadowbanana 3 points 6 hours ago So it's a tax for non-compliance. permalink parent award report block reply\nYaemz123 3 points 3 hours ago San Diego has had fines for putting recyclables in regular trash for over a decade. The inspection walks are new, but the idiotic rules and fines are not. permalink parent award report block reply\nHRpumpanddump 4 points 5 hours ago Karens = Borderline Personality Disorder. permalink parent award report block reply\nRudy_DankMemer 13 points 5 hours ago You go through the effort of sorting your trash and then they pick it up and throw it all in one dump. This is exactly how it really is. This is just another way to shake the taxpayers down. Seattle suburbs were inspecting trash in the 90's after they made recycling mandatory... fines started at $125 in Bellevue. One of my PT employees worked full time at Waste fucking Management - he told everyone he knew that it was all bullshit. I bet they don't do these inspections in the ghettos and barrios. Recycling is only racist, when white people DON'T do it. permalink parent award report block reply edxzxz 2 points 5 hours ago Decades ago when mandatory recycling had only been around a short time, the NYT Sunday magazine had a long article detailing how retarded it was, factoring in a second set of trucks, separate sets of cans, sorting and there being no viable market to actually re use the materials.  They've known it's stupid since the beginning. permalink parent award report block reply\nedxzxz 2 points 5 hours ago Decades ago when mandatory recycling had only been around a short time, the NYT Sunday magazine had a long article detailing how retarded it was, factoring in a second set of trucks, separate sets of cans, sorting and there being no viable market to actually re use the materials.  They've known it's stupid since the beginning. permalink parent award report block reply\nPhilipeNegro 7 points 6 hours ago They’ve been doing this in Philadelphia for decades. The fine structure was passed before any plan was made to properly sort recyclables (still hasn’t), and they’ll happily slip a ticket through your mail slot for violating. To add, it used to cost $35 for a brittle plastic bin, which was always too small, had to be purchased in-person waaaay out in an area filled with junkyards (and dead bodies, too), and the lovely trash men would just chuck it over the row of parked cars onto the sidewalk. I think the longest one ever lasted was 8 months. Now we’re out in the boonies, and the recycling crew is three guys that sort your bin right in your driveway. permalink parent award report block reply IBentMyWookie 7 points 5 hours ago Yup, I watch the recycling guys yeet the blue bin 10 feet every week until it’s completely cracked and useless. I shred everything including junk mail so that nothing with my name or address on it ends up in the trash whole. If I ever get that fine I’ll demand they prove it was my trash, which they can’t. Anyone can put trash in any curb. I doubt it’d repeal the ticket but always fight every ticket from the nanny state. permalink parent award report block reply Awan-CIA-Car-Lot 3 points 5 hours ago Do they steal the aluminum cans? That was the first thing I wondered about when I saw that there are people scrounging around in people's trash! Lol. permalink parent award report block reply\nIBentMyWookie 7 points 5 hours ago Yup, I watch the recycling guys yeet the blue bin 10 feet every week until it’s completely cracked and useless. I shred everything including junk mail so that nothing with my name or address on it ends up in the trash whole. If I ever get that fine I’ll demand they prove it was my trash, which they can’t. Anyone can put trash in any curb. I doubt it’d repeal the ticket but always fight every ticket from the nanny state. permalink parent award report block reply\nAwan-CIA-Car-Lot 3 points 5 hours ago Do they steal the aluminum cans? That was the first thing I wondered about when I saw that there are people scrounging around in people's trash! Lol. permalink parent award report block reply\nRemember_the_Alamo 5 points 6 hours ago The precious BIPOCs or whatever they're called this week probably won't be bothered. permalink parent award report block reply\nSickIcarus 36 points 6 hours ago Recycling is such a scam - just a bunch of virtue-signaling feel-good bullshit: “I’m doing my part!” It all goes to the same landfill. Recycleable materials used to be sold to China, then they decided they didn’t want them because it didn’t make financial sense. Want to really make recycling work? Have garbage sorted at the transfer station! They’re already set up for it, already staffed for it, and it would actually be effective. Did you know you can’t recycle pizza boxes? The cardboard is “contaminated” by the food waste stuck to the inside of the box. When I lived in California, they were talking about starting to fine you something like $5 for sorting and recycling “improperly.” Ok then, if tomato paste contaminates recyclables, then I put everything in the garbage can and poured a 25-cent can of tomato soup over the top - cheaper than the fine and they can’t complain. Fuck em. permalink award report block reply Suckitreddit 12 points 6 hours ago I like your problem solving style, pede. I like it! permalink parent award report block reply IBentMyWookie 5 points 5 hours ago Modern problems. Modern solutions! permalink parent award report block reply DontTreadOnLego 5 points 5 hours ago I like that idea; pour cheap icky stuff on the top so they can't go through it. permalink parent award report block reply XlDEN 4 points 5 hours ago Yes. Go to any big company and they’ll have separate bins for garbage and recycling. Ask janitors at any of these companies and they will tell you it all goes into the same dumpster. The recycling is just to make the employees happy. It’s the same at any resort as well. It’s just to make the guests feel good and that their recycling has somehow environmentally balanced out whatever they did for entertainment. A lot of communities actually pay companies to haul away their recyclables. These companies then pay other companies to take it from them. It goes down the line like that until it winds up in places like Africa and India where it just gets dumped into the ocean. permalink parent award report block reply _Sully_ 3 points 5 hours ago There is actual money in some recycling but it's as you say done be a line of brokers essentially. They then store just aluminum, for instance, until the price is right and someone can process it at a profit. It's so inconsistent that it's nearly never worth it. permalink parent award report block reply XlDEN 2 points 4 hours ago Yes, by the time it gets dumped into the ocean just about all that’s left is the plastic. permalink parent award report block reply SickIcarus 2 points 5 hours ago My favorite is when the trash can has openings for trash and recycling, but only one garbage bag. permalink parent award report block reply XlDEN 1 points 4 hours ago BlueGreen Resorts actually has separate bins for every type of recycling. You’ll have one bin for paper, another for plastic, another for glass and another for metal cans. Housekeeping will just pick up all the bags and throw them away together with the garbage. This way they can waste five mostly empty garbage bags instead of just using one like with your example. permalink parent award report block reply BLMTrying2GetUrGuns 2 points 5 hours ago It all goes to the same landfill. Recycleable materials used to be sold to China, then they decided they didn’t want them because it didn’t make financial sense. I read an article on this a while back (don't have it available right now): China used to take the recycling for 'free' (there were empty shipping containers coming back anyhow, so it just went in them.) They eventually started charging the US for them to take it. Once they had a 'supply' line of their own built up of cardboard/plastic/glass/etc, then they said, \"no thanks, we don't want it.\" permalink parent award report block reply SpellingContable 1 points 5 hours ago Public trash cans are never sorted for recyclables. Straight to the dump for everything. These 'lid lifter' faggots should be fining themselves. permalink parent award report block reply load 3 more comments...\nSuckitreddit 12 points 6 hours ago I like your problem solving style, pede. I like it! permalink parent award report block reply IBentMyWookie 5 points 5 hours ago Modern problems. Modern solutions! permalink parent award report block reply\nIBentMyWookie 5 points 5 hours ago Modern problems. Modern solutions! permalink parent award report block reply\nDontTreadOnLego 5 points 5 hours ago I like that idea; pour cheap icky stuff on the top so they can't go through it. permalink parent award report block reply\nXlDEN 4 points 5 hours ago Yes. Go to any big company and they’ll have separate bins for garbage and recycling. Ask janitors at any of these companies and they will tell you it all goes into the same dumpster. The recycling is just to make the employees happy. It’s the same at any resort as well. It’s just to make the guests feel good and that their recycling has somehow environmentally balanced out whatever they did for entertainment. A lot of communities actually pay companies to haul away their recyclables. These companies then pay other companies to take it from them. It goes down the line like that until it winds up in places like Africa and India where it just gets dumped into the ocean. permalink parent award report block reply _Sully_ 3 points 5 hours ago There is actual money in some recycling but it's as you say done be a line of brokers essentially. They then store just aluminum, for instance, until the price is right and someone can process it at a profit. It's so inconsistent that it's nearly never worth it. permalink parent award report block reply XlDEN 2 points 4 hours ago Yes, by the time it gets dumped into the ocean just about all that’s left is the plastic. permalink parent award report block reply SickIcarus 2 points 5 hours ago My favorite is when the trash can has openings for trash and recycling, but only one garbage bag. permalink parent award report block reply XlDEN 1 points 4 hours ago BlueGreen Resorts actually has separate bins for every type of recycling. You’ll have one bin for paper, another for plastic, another for glass and another for metal cans. Housekeeping will just pick up all the bags and throw them away together with the garbage. This way they can waste five mostly empty garbage bags instead of just using one like with your example. permalink parent award report block reply\n_Sully_ 3 points 5 hours ago There is actual money in some recycling but it's as you say done be a line of brokers essentially. They then store just aluminum, for instance, until the price is right and someone can process it at a profit. It's so inconsistent that it's nearly never worth it. permalink parent award report block reply XlDEN 2 points 4 hours ago Yes, by the time it gets dumped into the ocean just about all that’s left is the plastic. permalink parent award report block reply\nXlDEN 2 points 4 hours ago Yes, by the time it gets dumped into the ocean just about all that’s left is the plastic. permalink parent award report block reply\nSickIcarus 2 points 5 hours ago My favorite is when the trash can has openings for trash and recycling, but only one garbage bag. permalink parent award report block reply XlDEN 1 points 4 hours ago BlueGreen Resorts actually has separate bins for every type of recycling. You’ll have one bin for paper, another for plastic, another for glass and another for metal cans. Housekeeping will just pick up all the bags and throw them away together with the garbage. This way they can waste five mostly empty garbage bags instead of just using one like with your example. permalink parent award report block reply\nXlDEN 1 points 4 hours ago BlueGreen Resorts actually has separate bins for every type of recycling. You’ll have one bin for paper, another for plastic, another for glass and another for metal cans. Housekeeping will just pick up all the bags and throw them away together with the garbage. This way they can waste five mostly empty garbage bags instead of just using one like with your example. permalink parent award report block reply\nBLMTrying2GetUrGuns 2 points 5 hours ago It all goes to the same landfill. Recycleable materials used to be sold to China, then they decided they didn’t want them because it didn’t make financial sense. I read an article on this a while back (don't have it available right now): China used to take the recycling for 'free' (there were empty shipping containers coming back anyhow, so it just went in them.) They eventually started charging the US for them to take it. Once they had a 'supply' line of their own built up of cardboard/plastic/glass/etc, then they said, \"no thanks, we don't want it.\" permalink parent award report block reply\nSpellingContable 1 points 5 hours ago Public trash cans are never sorted for recyclables. Straight to the dump for everything. These 'lid lifter' faggots should be fining themselves. permalink parent award report block reply\nTheMustacheBandit 12 points 6 hours ago I don't even bother sorting. Everything goes into trash until its full, then the rest will go into recycle.  It all goes to same place, they can sort it themselves if they want to. permalink award report block reply BLMTrying2GetUrGuns 3 points 5 hours ago I sort it, only because I can get rid of it for free. I live in the country, so I don't get 'free' trash service....I bag up my trash and toss it into a local store's can. permalink parent award report block reply nolefthandshakes 1 points 2 hours ago do you burn? permalink parent award report block reply ImYourHuckleberry24 1 points 3 hours ago When I lived in CA I placed bags of dog shit in the recycle bin if it was closest to the gate. I knew for many years it was all getting dumped together. It's all a scam. permalink parent award report block reply\nBLMTrying2GetUrGuns 3 points 5 hours ago I sort it, only because I can get rid of it for free. I live in the country, so I don't get 'free' trash service....I bag up my trash and toss it into a local store's can. permalink parent award report block reply nolefthandshakes 1 points 2 hours ago do you burn? permalink parent award report block reply\nnolefthandshakes 1 points 2 hours ago do you burn? permalink parent award report block reply\nImYourHuckleberry24 1 points 3 hours ago When I lived in CA I placed bags of dog shit in the recycle bin if it was closest to the gate. I knew for many years it was all getting dumped together. It's all a scam. permalink parent award report block reply\nTheGunFairy 11 points 6 hours ago Jokes on them hobos already dig for cans because CA pays for them. permalink award report block reply Apersonofinterest 6 points 6 hours ago Our trash cans get sweeped at least 3 times a day. The early bums get the cans. permalink parent award report block reply\nApersonofinterest 6 points 6 hours ago Our trash cans get sweeped at least 3 times a day. The early bums get the cans. permalink parent award report block reply\nGrindelwald 9 points 6 hours ago I have a wife for that, Oops, that did not sound right.  But she corrects my error in the kitchen.  So I have no liability. permalink award report block reply Hydris 1 points 2 hours ago My wife was all about recycling. I had to tell her i could not give the slightest shit about recycling. If she wants to sort it after i throw things out thats on her. All the recycling can does is give me a second garbage can every other week. permalink parent award report block reply\nHydris 1 points 2 hours ago My wife was all about recycling. I had to tell her i could not give the slightest shit about recycling. If she wants to sort it after i throw things out thats on her. All the recycling can does is give me a second garbage can every other week. permalink parent award report block reply\nCrappydatum 8 points 6 hours ago They literally have cameras on the trucks that can look at the recycling as it's being dumped. My son got a fine from Seattle refuse over a decade ago for something wrong in his recycle bin. Used the Ring camera to prove it was a neighbor putting the offending garbage in the recycle bin. Did Seattle refuse care? Oh hell no, fine stuck and he left that hellhole. Not even jobs at the big three (Google, Microsoft, Amazon) could keep him there. He makes 25% of what he used to and is 4 times happier now. permalink award report block reply\nOutlawPurpleHairDye 7 points 6 hours ago No surprise that the same places emptying the prisons of actual criminals and shielding illegal invaders loves harassing the actual taxpaying citizens with stupid shit like this. permalink award report block reply\nNOTWOKE 6 points 6 hours ago Rub shit on the container handles. permalink award report block reply FredRedd 2 points 6 hours ago THIS is the way! permalink parent award report block reply IBentMyWookie 1 points 5 hours ago It’s Cali, I’m SURE some homeless fent fiend took care of that already. permalink parent award report block reply\nFredRedd 2 points 6 hours ago THIS is the way! permalink parent award report block reply\nIBentMyWookie 1 points 5 hours ago It’s Cali, I’m SURE some homeless fent fiend took care of that already. permalink parent award report block reply\nBigMikesSwingingCock 6 points 6 hours ago Just dump a mound of chicken shit in them. permalink award report block reply PhilipeNegro 5 points 6 hours ago Poop in it. Make them not want to come to work ever again. permalink parent award report block reply BigMikesSwingingCock 4 points 5 hours ago If you're going to do that, go the extra mile and just shit on top of it. permalink parent award report block reply edxzxz 2 points 5 hours ago Live raccoons and bungee the lid shut? permalink parent award report block reply ImYourHuckleberry24 1 points 3 hours ago That's what I used to do. Plus sprinkled dog shit for good measure. permalink parent award report block reply\nPhilipeNegro 5 points 6 hours ago Poop in it. Make them not want to come to work ever again. permalink parent award report block reply BigMikesSwingingCock 4 points 5 hours ago If you're going to do that, go the extra mile and just shit on top of it. permalink parent award report block reply\nBigMikesSwingingCock 4 points 5 hours ago If you're going to do that, go the extra mile and just shit on top of it. permalink parent award report block reply\nedxzxz 2 points 5 hours ago Live raccoons and bungee the lid shut? permalink parent award report block reply\nImYourHuckleberry24 1 points 3 hours ago That's what I used to do. Plus sprinkled dog shit for good measure. permalink parent award report block reply\nSDsc0rch 4 points 6 hours ago \"recycling is garbage\" https://archive.is/N8h4b permalink award report block reply\nCounterStrike OP 4 points 6 hours ago https://www.dailymail.co.uk/news/article-15281479/san-diego-garbage-inspectors-recycling.html permalink award report block reply\nShitsbrokeyo 4 points 6 hours ago Recycling is already inefficient and now, they increase thru a salary for rediculousness. Also that's my trash until you pick it up to dump it. Trespassing. permalink award report block reply\nFearGodTheAlmighty 4 points 6 hours ago Your tax dollars at work permalink award report block reply\nLol_Garrus 3 points 5 hours ago \"You're hiding plastic bottles in the trash can, aren't you?\" permalink award report block reply\nNoWorries77 3 points 4 hours ago You must know that San Diego shut down it’s waste recycling plant… this is for control & taxes. And is another reason why we left San Diego in the rearview mirror. permalink award report block reply\nQueensOwn 3 points 6 hours ago Uh, NYC has been doing this for a few years already. Think of it as the ultimate revenue generator for the socialist utopia. There are 4 separate bins. The latest is food waste. I don’t live there (my mother does) but it is IMPOSSIBLE to know and follow all the rules. These Sanitation “inspectors” are super aggressive and regularly issue fines. Now try getting an elderly old lady to follow these rules. The Sanitation GESTAPO are real. permalink award report block reply\nPMSocks 3 points 5 hours ago My area required clear garbage bags so you could see inside ... I always thought 2 pints of ketchup and a baby doll could be entertaining in a bag. permalink award report block reply\npococurante 2 points 6 hours ago San Francisco must hire toilet inspectors to ensure people are shitting in them properly. It's the only solution to all of the shitting on the sidewalks. permalink award report block reply slander 1 points 3 hours ago There will be a maximum limit on the amount allowed to be disposed of in the toilet.  Any excess must be left on the sidewalk. permalink parent award report block reply\nslander 1 points 3 hours ago There will be a maximum limit on the amount allowed to be disposed of in the toilet.  Any excess must be left on the sidewalk. permalink parent award report block reply\nBrewSwillis 2 points 3 hours ago They need this in my neighborhood. Lots of Arabs, and I think they are retarded. They just use the recycling bin as another trash bin. Not that recycling is real anyway. permalink award report block reply\nMega_MAGA 2 points 3 hours ago Except there is no recycling. permalink award report block reply\nCrankyCrab 2 points 3 hours ago My city has been doing this shit for years.  I don't know how often as I have never been cited.  I recently received a notice that residents can no longer throw plastic bags in the recycling bin. One of my neighbors makes a point to put a week's worth of dog and cat shit right at the top. permalink award report block reply\nSeruna_Kanus 2 points 2 hours ago Why not hire 3 times as many to have workers that can sort trash at the waste management company? permalink award report block reply\nDeltaSierra 2 points 6 hours ago Not complicated.  Once it is in their bin it belongs to them.  Most places have an option to take it down to the trash dump yourself. permalink award report block reply Rudy_DankMemer 2 points 5 hours ago Most places have an option to take it down to the trash dump yourself. Twenty-seven (27) states and the District of Columbia have at least one mandatory recycling requirement. https://www.nerc.org/disposal-bans-mandatory-recycling permalink parent award report block reply DeltaSierra 1 points 5 hours ago I am pretty sure my trash collectors would be much more upset at having trash thrown in the recycle bin than having recyclables thrown with the trash.  These guys don’t give a fuk about climate change. permalink parent award report block reply\nRudy_DankMemer 2 points 5 hours ago Most places have an option to take it down to the trash dump yourself. Twenty-seven (27) states and the District of Columbia have at least one mandatory recycling requirement. https://www.nerc.org/disposal-bans-mandatory-recycling permalink parent award report block reply DeltaSierra 1 points 5 hours ago I am pretty sure my trash collectors would be much more upset at having trash thrown in the recycle bin than having recyclables thrown with the trash.  These guys don’t give a fuk about climate change. permalink parent award report block reply\nDeltaSierra 1 points 5 hours ago I am pretty sure my trash collectors would be much more upset at having trash thrown in the recycle bin than having recyclables thrown with the trash.  These guys don’t give a fuk about climate change. permalink parent award report block reply\nRudeFrog 2 points 5 hours ago They should have to pay you for your recycling. You're giving them resources for free. permalink award report block reply\nbarwhack 2 points 6 hours ago Dead rats. permalink award report block reply\nGoatboy66 2 points 6 hours ago All a Kickback SCAM. permalink award report block reply\nIBentMyWookie 2 points 6 hours ago The biggest joke is that most of the recycling in programs ends up in a landfill or garage to China anyhow. They just want a reason to search and fine people into poverty. permalink award report block reply\nMAGA-Fett 2 points 1 hour ago They already do this in my city in Arizona. They will put a warning label on your garbage can if you have the wrong stuff in there.  It’s so stupid since 99% of so-called “recyclable” trash cannot actually be recycled for anything. It’s all a scam. permalink award report block reply\ncross_bearer_02 2 points 6 hours ago Nothing else better to do than rifle through someone's garbage, is it? permalink award report block reply FredRedd 2 points 5 hours ago And euthanizing pet squirrels. permalink parent award report block reply\nFredRedd 2 points 5 hours ago And euthanizing pet squirrels. permalink parent award report block reply\nnats1mom 2 points 6 hours ago Doing the same in Scottsdale, AZ!!!! They remove nonrecycling items and then throw the items on the ground in front of recycle bin. permalink award report block reply ImYourHuckleberry24 1 points 3 hours ago I can believe it about Scottdale. I'm way south and don't have trash service, but the dump isn't far. My loads have never exceeded the $8 minimum. permalink parent award report block reply\nImYourHuckleberry24 1 points 3 hours ago I can believe it about Scottdale. I'm way south and don't have trash service, but the dump isn't far. My loads have never exceeded the $8 minimum. permalink parent award report block reply\nDanofdestiny 2 points 6 hours ago Sacramento already does this. permalink award report block reply BoomShtick 1 points 5 hours ago When did that start? permalink parent award report block reply Danofdestiny 1 points 5 hours ago Sometime this year. I've had two friends who told me that they received written warnings from the city waste dept about separating their trash and putting it in the designated can with a printed guide. Supposedly all food waste is supposed to go in the yard waste can so if you don't have much of a yard, like myself, you can have rotting food in a can on the side of your house for weeks while the yard clippings slowly accumulate. I don't participate, but I haven't been warned yet either. permalink parent award report block reply\nBoomShtick 1 points 5 hours ago When did that start? permalink parent award report block reply Danofdestiny 1 points 5 hours ago Sometime this year. I've had two friends who told me that they received written warnings from the city waste dept about separating their trash and putting it in the designated can with a printed guide. Supposedly all food waste is supposed to go in the yard waste can so if you don't have much of a yard, like myself, you can have rotting food in a can on the side of your house for weeks while the yard clippings slowly accumulate. I don't participate, but I haven't been warned yet either. permalink parent award report block reply\nDanofdestiny 1 points 5 hours ago Sometime this year. I've had two friends who told me that they received written warnings from the city waste dept about separating their trash and putting it in the designated can with a printed guide. Supposedly all food waste is supposed to go in the yard waste can so if you don't have much of a yard, like myself, you can have rotting food in a can on the side of your house for weeks while the yard clippings slowly accumulate. I don't participate, but I haven't been warned yet either. permalink parent award report block reply\nAlmostFullyDilated 2 points 3 hours ago it all ends up at the same place permalink award report block reply\nrebuildingMyself 2 points 5 hours ago Yes please spend city funds on another way to Karen out at your neighbor all so the recycling bins contents can go to the same fucking dump as the other trash. permalink award report block reply\nmikejones 2 points 5 hours ago I always thought recycling was a scam. I have never recycled and at work I toss shit straight into the trash as they only separate cardboard from everything else. I would never survive in a blue city. permalink award report block reply\nHikedelics 2 points 5 hours ago Lmfao Who wants to start putting glass bottles. aluminum cans, and fucking baby seals in some prominent assholes garbage cans? permalink award report block reply penguinjay1212 1 points 4 hours ago You dont understand, there will be some people that are safe. Even if they put the baby seals there themselves, they'd explain how homeless or maga did it. Not even joking 1 bit. Disparity in enforcement is one of USAs biggest problems, and California is too! permalink parent award report block reply\npenguinjay1212 1 points 4 hours ago You dont understand, there will be some people that are safe. Even if they put the baby seals there themselves, they'd explain how homeless or maga did it. Not even joking 1 bit. Disparity in enforcement is one of USAs biggest problems, and California is too! permalink parent award report block reply\nOwmyballz 2 points 6 hours ago I'd break out the burn barrel before I'd submit to that shit. permalink award report block reply\ns27zw7M1h62lURPyezOa PRO 1 points 2 hours ago Libs not happy. https://www.reddit.com/r/sandiego/comments/1omrvk8/teams_of_lid_lifters_begin_enforcement_of_city_of/ permalink award report block reply\nToddyoungsvagina 1 points 6 hours ago Well i guess I’d be taking a dump in the trash from now on permalink award report block reply\nmateus 1 points 5 hours ago More gestapo tactics from the greenies and the same people bitching about \"authoritarianism.\" Put the trash out just as the trucks\nare coming lol. permalink award report block reply\nBig_dick_cheney 1 points 4 hours ago Tax dollars hard at work permalink award report block reply\nChyNahAzzWhole1 1 points 2 hours ago it all goes to the same place. Yes? or No? If it does... Then this is a criminal scam run with tax payer money to extort money from Citizens through punishable regulations. Malfeasance and Negligence. permalink award report block reply\nalucard13mmfmj 1 points 35 minutes ago Dont companies export and sell the recyclables to china where china sorts it? They recycle all the material and just dump the non recyclable stuff. permalink award report block reply\nSpacemonkey 1 points 3 hours ago To be fair once trash is moved from your house to the curb it becomes public domain and anyone can go through it but if it's still up on your property like say by your garage and they try to go and look through it then that's a bullet. permalink award report block reply\nMintap 1 points 2 hours ago Good place and time to start distributing my \"You Lid Lifters are Faggots\" craft beer branding and label idea. permalink award report block reply\nutfanx2 1 points 5 hours ago They were just whining about unreasonable seach and seizure for illegal aliens. permalink award report block reply\naloha_snackbar22 1 points 2 hours ago San Diego used to be a beautiful and conservative city. Now is becoming just another LA. permalink award report block reply\nTexasBrowncoat 1 points 4 hours ago California was going to weigh you recycling bin to see if you were recycling enough material. If not, they would bill you for the amount that they thought you should have recycled. permalink award report block reply\nboredrandomguy 1 points 2 hours ago They did it in Michigan.  I didn't put out my cart during that month at all. In fact, it was locked in my garage out of site the entire time. permalink award report block reply\nTwoArizonaPedes 1 points 6 hours ago And if they determine you're not recycling \"enough\" what happens? permalink award report block reply\nblueeyephoto 1 points 5 hours ago Big Govt is watching you permalink award report block reply\ncontender 1 points 4 hours ago most trash goes to a sorting center before the dump all cans go to the same place permalink award report block reply\nMatterThatMetals 1 points 4 hours ago Wow. That's retarded. permalink award report block reply\nIvIA6A 1 points 5 hours ago Watch penn and teller bullshit episode on recycling. It's all a grift to enrich these city managers and these recycling companies. The only profitable thing that is recycled is aluminum cans, and all the new paper that is made is from specially grown forests for the wood pulp. We're not clear-cutting trees for any of that. It's a scam. On a sidenote, those recycling bins at the grocery store for plastic bags all get thrown away. permalink award report block reply\nredditadminssuckit 1 points 5 hours ago Keep the can on your property until the last minute permalink award report block reply\nDingDongDitch 1 points 5 hours ago H1-Bs dont give a fucccckkkk. Have fun in the Hindu hoods permalink award report block reply\nBillyBillington 1 points 6 hours ago Gotta be sure all the plastic going to India is legit permalink award report block reply\nGuerillaYourDreams 1 points 6 hours ago I'm not a bit surprised. I lived there from 2005-2007 and back then you would be FINED if you didn't recycle properly. Asshoes. permalink award report block reply\none_cool 1 points 5 hours ago Seattle was doing this to make sure the garbage was \"clean\" of compostable organics.  F'd leftist neuroticism on full display. permalink award report block reply\nTokens_Worth 1 points 2 hours ago I love that I live in an area, free disposal. Paid for by my (cheap) property taxes.\nFuck Democrats. permalink award report block reply\nSPEDMan64 1 points 4 hours ago Who is snooping at the recyclers to make sure they're recycling properly? permalink award report block reply\nDantalian 1 points 2 hours ago Recycling is only feasible when energy is CHEAP - which is never the case in these Leftist jurisdictions that cater to the Green Grift. permalink award report block reply\nShaffro 1 points 4 hours ago Now California has trash Nazis. 😂 permalink award report block reply\ntiamat 1 points 1 hour ago I thought san Diego was more red leaning, or atleast used to be permalink award report block reply\nFormerlurker92 1 points 6 hours ago I give it two months before one of these inspectors is caught applying for a credit card using someone else's id permalink award report block reply\nhughjasske69 1 points 5 hours ago TIME TO SHIT IN THE DUMPSTERS permalink award report block reply\nJamesBond007 1 points 5 hours ago Snakes. Snakes in all my trash. permalink award report block reply\ngustodog 1 points 1 hour ago This seems like a job that could be hazardous in more ways than one. permalink award report block reply\nIsrorOrca 1 points 5 hours ago Self manufactured problems for CA - not my problem. permalink award report block reply\nKoikatrose 1 points 5 hours ago So glad I don't live in that stupid state.\nNext they will be inspecting your toilet flushes. permalink award report block reply\nLLP2 1 points 3 hours ago Bitch-ass street people and illegal chinese pickers make a big mess moving my sorted garbage out of the way to get to the bottom soda can and then don't put it all back. permalink award report block reply\nhillaryforprison 1 points 3 hours ago Recycling basically does nothing. It usually goes to the same dump which has a totally different way of doing things. They made twice as many plastic containers for 'recycling'  manufactured and distributed across the world in order to 'save the planet'. People fly on jets burning tons of fuel in order to get to these climate summits to virtue signal about how awesome they are with the planet and how everyone else must obey their words. permalink award report block reply\nHangmhigh 1 points 5 hours ago Sawzall the recycling bin and put it in\nthe trash. permalink award report block reply\nbagel_fragility 1 points 6 hours ago reminds me of a trailer park boys episode permalink award report block reply\n2025WhatIsTrue 1 points 6 hours ago Typical woke LIB nitwittery.  What absolute worthless fools. permalink award report block reply\nDeplorableKatie 1 points 4 hours ago I don’t mind recycling but sometimes I’ll toss something that seems to be more wasteful to recycle than trash. For example a plastic kefir jug, how much clean tap water do I need to use to rinse it out in order to recycle. I’d challenge that it’s more environmentally wasteful to use all that clean water than to just trash the one plastic item that’s hard to rinse. Would some inspector understand that or just gleefully jab a finger at the #2 jug in the waste bin and write me a fine. Speaking of #2….. permalink award report block reply\nhairless_ap3 1 points 1 hour ago This is gay af and those faggots let this happen to themselves permalink award report block reply\npenguinjay1212 1 points 5 hours ago Win win. They can now get warrants for actual productive people's homes over a junkie throwing something in their garbage. Beautiful! That junkie could even be the cop. If I had a garbage can, I discreetly get a cam on it asap. Might be matter of freedom. Wtf is this??? Such an intrusion. Everyone will just litter anything remotely sketchy waaaaay harder now. Opposite effect incoming. Just as intended. If these people are failing this hard on accident, well, one could hardly even suspend their disbelief. Everything the govt does is underhanded, bc a mf would wanna shoot em over the shit they do. Even the freedom loving non recycler or someone's crazy grandma who actually tries but cant get it right. They are gonna fine her? California is fucking evil. Retards x evil govt = this I'm sure my state will do the same in 15 years or so... permalink award report block reply\nShakakka99 1 points 5 hours ago Showtime: Penn & Teller: Bullshit! • Season 2 S2 E5: Recycling FIND IT.  WATCH IT.  LAUGH YOUR ASS OFF. permalink award report block reply\nDingleBalls 1 points 6 hours ago Violates illegal search and seizure permalink award report block reply\nbluewhiteandred 1 points 3 hours ago tangential but composting is a top way to reduce the waste you might otherwise throw away According to the [EPA], food scraps and yard waste make up about 30% of materials sent to landfills, and composting significantly cuts down on this volume by diverting organic materials from landfill disposal. permalink award report block reply\nMJK1 1 points 5 hours ago Our little bit of recycling isn't going to save the world anyway. permalink award report block reply\nckover9000 1 points 5 hours ago They do this here in Va. $50 if they find a non-recyclable in your bin. $150 if they find it again. I just put everything recyclable in my regular trash and never touch the stupid recycle bin. Next they'll start going thru your regular trash slicing open bags to see if anything recyclable in there and fine you. permalink award report block reply\nMrwhitepants 1 points 49 minutes ago ya Phoenix az does this. For months i received notes with a red check mark on my bin saying soft plastic bad, hard plastic okay, then one day they moved on to a different neighborhood. permalink award report block reply\nNotYourMan 1 points 5 hours ago Big government everywhere.  In San Jose, CA the city has people driving around looking for \"upgrades\" to single family homes to make sure they get the regulation fees and inspection fees.  California is a socialist society by city, county, state regulations. permalink award report block reply\ns27zw7M1h62lURPyezOa PRO 1 points 2 hours ago From  r/sandiago\nThe Republicans are gonna flame us for this one lol permalink award report block reply\nSuckitreddit 1 points 6 hours ago They do this in Reno. Don’t know if there is a camera on the truck or what. If the can isn’t locked, how can you blame the resident? And…what a great way to spend money! Meanwhile the homeless are so neat and tidy. permalink award report block reply\nf_bastiat 0 points 31 minutes ago I know a lot of recycling ends up at the dump, but it's a special type of asshole that uses the recycle bin as a second trash can, I yelled at a neighbor for doing it one time. permalink award report block reply",
  "fetched_at": "2025-11-12T23:38:50.605248Z"
}