{
  "id": "1ARK9l7C3m",
  "url": "https://patriots.win/p/1ARK9l7C3m/mr-president-you-were-elected-to/c",
  "content": "266 Mr. President, you were elected to take a wrecking ball to the status quo BE  LESS  RETARDED posted 1 day ago by mohel 25 comments award share download report block\n25 comments Sort by Top Top New Worst Old Save UntakenUsername 10 points 1 day ago I think MAGA has jumped the shark. It seems that it all started to unravel and get weird during the Epstein debacle.\nA huge problem is that I don't see anyone on the horizon who will actually end the Deep State/Swamp. Vance? Best he can do is endless H1Bs. DeSantis? Better on H1B but enjoys red flag laws and hates \"antisemitism\" (won't be America First). Any ideas? permalink award report block reply DrCowboyPresident 15 points 1 day ago The answer nobody wants to hear is that you're never changing this system by working within it. Its self preservation will always be its highest priority. permalink parent award report block reply UntakenUsername 6 points 1 day ago This is exactly right. permalink parent award report block reply America_No_1 4 points 1 day ago And nothing will ever change, just as long as we're all spread out.And only connected via the internet.  We must get back to building tight knit communities with shared beliefs, or it all ends permalink parent award report block reply chickeninoven 4 points 24 hours ago Hello, fellow tightly knit community members! Where will we be meeting next? permalink parent award report block reply America_No_1 4 points 23 hours ago Your mom's house =) permalink parent award report block reply TrumpSaysNoMAGA4u 1 points 24 hours ago Comment removed upon the user being banned. permalink parent award report block reply DeaduponArousal 2 points 22 hours ago Jumped the shark? Every single evil entity has been trying to inject itself and subvert the movement. They can’t have a populist movement succeed otherwise their world takeover loses. Whether or not they got to Trump or he was a setup the entire time doesn’t matter. He’s clearly abandoned his base for foreigners at this point. Burn it all down kick out the foreigners and traitors. There’s no political solution at this point. permalink parent award report block reply Girthquakes -9 points 1 day ago You faggots are always welcome to jump ship and go make your own party. None of this faux concern is going to convince us to abandon GEOTUS. Your \"death by a thousand cuts\" will fail, just like every other attempt to subvert this forum and the MAGA movement as a whole. Lefty faggots can get fucked. permalink parent award report block reply UntakenUsername 9 points 1 day ago Nobody is trying to convince you to abandon anything. If you can't see, you can't see. \"There are those who see, those who can see when shown, and those who will never see.\" I do admire your unending loyalty for Trump and his administration, however.  I predict that, at some point, even people like yourself will have to look at reality for what it is.  I love President Trump and his family and have voted for him every time and would do it again. But, his administration, while doing more that any US President we have ever seen, has failed to do the one thing that would fix everything. They didn't drain The Swamp. Is it because of Bondi or Patel? Maybe so, but the buck stops at the Oval Office. He has shown public frustration with Bondi, but hasn't fired/replace her with someone who will be as ruthless as is required. It's on him, ultimately. He would say exactly the same thing about a leader in his same position. permalink parent award report block reply staroframphansbhole 6 points 1 day ago It’s because the poster you’re replying to drinks milkshakes laden with shabbat splooge if you know what I’m saying permalink parent award report block reply NazisWereSocialist 3 points 1 day ago Ok grandpa permalink parent award report block reply Alpha_Lemming 6 points 1 day ago The only \"solutions\" that are acceptable in a debt based system are the ones that involve more debt. With this, debts are created and sold through various financial instruments where the consumer \"saves\" $300 per month, but pays an additional couple hundred grand over the term. Meanwhile, the lender takes their cut and then peddles the note through the pupeline to let it explode on somebody else's ledger. Half of the houses built in the last 20 years won't last 50 years. permalink award report block reply mohel OP 4 points 1 day ago Let's print more money permalink parent award report block reply LauraCoomer 5 points 1 day ago It's been so painful. permalink award report block reply LiquidSun 9 points 1 day ago I've largely just stopped caring. I'll do what I can in my own life, but I don't know that I'll bother voting again. It may be too early to say, but it does feel as though we've been duped. permalink parent award report block reply Be_The_Change 2 points 1 day ago Comment removed by community moderators. permalink parent award report block reply NazisWereSocialist 4 points 1 day ago The 50 year mortgage thing is fucking retarded. permalink award report block reply rockaustin 4 points 1 day ago Gets shot at and raises fist to look strong and ends up being a gigantic pussy. What a waste of time all of this was. permalink award report block reply Crappydatum -2 points 1 day ago Get your own sorry ass shot and get back to us permalink parent award report block reply rockaustin 1 points 24 hours ago Ok, I guess being an absolute failure and letting the country fall to communists and illegals is the proper reaction, instead of becoming an American legend and destroying our enemies. permalink parent award report block reply booblitchutz 2 points 21 hours ago 50 year mortgages is retarded. It will increase demand without a change to supply. That means prices go up. That’s retarded. permalink award report block reply AmericanMestizo 2 points 19 hours ago The economy is so fucking broken and fake that any attempt to fix it will likely crash the economy worse than 2008. No politician wants to be blamed for that. That's the crux of the matter the moves to fix anything is painful. Most voters are ignorant and short sighted. The moment there is any pain they will simply blame those in charge and blibdly vote in the other guy. The strategy of the elites is to do everything in there power to keep the current system humming along. The corporate elite like it because it makes them richer at the expense of the common man and the politicians like it because they want to avoid another crash. The problem is none of this is sustainable in the long run. I'm kind of amazed they've kept things going as long as they have. permalink award report block reply Crappydatum 1 points 1 day ago This site is overrun with retards permalink award report block reply HeavenlyTrumpets -2 points 1 day ago I mean, it is a wrecking ball to the status quo lol... Perhaps it's all a big misunderstanding? Ha permalink award report block reply NazisWereSocialist 3 points 1 day ago bankers are rubbing their greasy little hands together at the thought of 50 year mortgages permalink parent award report block reply\nUntakenUsername 10 points 1 day ago I think MAGA has jumped the shark. It seems that it all started to unravel and get weird during the Epstein debacle.\nA huge problem is that I don't see anyone on the horizon who will actually end the Deep State/Swamp. Vance? Best he can do is endless H1Bs. DeSantis? Better on H1B but enjoys red flag laws and hates \"antisemitism\" (won't be America First). Any ideas? permalink award report block reply DrCowboyPresident 15 points 1 day ago The answer nobody wants to hear is that you're never changing this system by working within it. Its self preservation will always be its highest priority. permalink parent award report block reply UntakenUsername 6 points 1 day ago This is exactly right. permalink parent award report block reply America_No_1 4 points 1 day ago And nothing will ever change, just as long as we're all spread out.And only connected via the internet.  We must get back to building tight knit communities with shared beliefs, or it all ends permalink parent award report block reply chickeninoven 4 points 24 hours ago Hello, fellow tightly knit community members! Where will we be meeting next? permalink parent award report block reply America_No_1 4 points 23 hours ago Your mom's house =) permalink parent award report block reply TrumpSaysNoMAGA4u 1 points 24 hours ago Comment removed upon the user being banned. permalink parent award report block reply DeaduponArousal 2 points 22 hours ago Jumped the shark? Every single evil entity has been trying to inject itself and subvert the movement. They can’t have a populist movement succeed otherwise their world takeover loses. Whether or not they got to Trump or he was a setup the entire time doesn’t matter. He’s clearly abandoned his base for foreigners at this point. Burn it all down kick out the foreigners and traitors. There’s no political solution at this point. permalink parent award report block reply Girthquakes -9 points 1 day ago You faggots are always welcome to jump ship and go make your own party. None of this faux concern is going to convince us to abandon GEOTUS. Your \"death by a thousand cuts\" will fail, just like every other attempt to subvert this forum and the MAGA movement as a whole. Lefty faggots can get fucked. permalink parent award report block reply UntakenUsername 9 points 1 day ago Nobody is trying to convince you to abandon anything. If you can't see, you can't see. \"There are those who see, those who can see when shown, and those who will never see.\" I do admire your unending loyalty for Trump and his administration, however.  I predict that, at some point, even people like yourself will have to look at reality for what it is.  I love President Trump and his family and have voted for him every time and would do it again. But, his administration, while doing more that any US President we have ever seen, has failed to do the one thing that would fix everything. They didn't drain The Swamp. Is it because of Bondi or Patel? Maybe so, but the buck stops at the Oval Office. He has shown public frustration with Bondi, but hasn't fired/replace her with someone who will be as ruthless as is required. It's on him, ultimately. He would say exactly the same thing about a leader in his same position. permalink parent award report block reply staroframphansbhole 6 points 1 day ago It’s because the poster you’re replying to drinks milkshakes laden with shabbat splooge if you know what I’m saying permalink parent award report block reply NazisWereSocialist 3 points 1 day ago Ok grandpa permalink parent award report block reply\nDrCowboyPresident 15 points 1 day ago The answer nobody wants to hear is that you're never changing this system by working within it. Its self preservation will always be its highest priority. permalink parent award report block reply UntakenUsername 6 points 1 day ago This is exactly right. permalink parent award report block reply America_No_1 4 points 1 day ago And nothing will ever change, just as long as we're all spread out.And only connected via the internet.  We must get back to building tight knit communities with shared beliefs, or it all ends permalink parent award report block reply chickeninoven 4 points 24 hours ago Hello, fellow tightly knit community members! Where will we be meeting next? permalink parent award report block reply America_No_1 4 points 23 hours ago Your mom's house =) permalink parent award report block reply TrumpSaysNoMAGA4u 1 points 24 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nUntakenUsername 6 points 1 day ago This is exactly right. permalink parent award report block reply\nAmerica_No_1 4 points 1 day ago And nothing will ever change, just as long as we're all spread out.And only connected via the internet.  We must get back to building tight knit communities with shared beliefs, or it all ends permalink parent award report block reply chickeninoven 4 points 24 hours ago Hello, fellow tightly knit community members! Where will we be meeting next? permalink parent award report block reply America_No_1 4 points 23 hours ago Your mom's house =) permalink parent award report block reply\nchickeninoven 4 points 24 hours ago Hello, fellow tightly knit community members! Where will we be meeting next? permalink parent award report block reply America_No_1 4 points 23 hours ago Your mom's house =) permalink parent award report block reply\nAmerica_No_1 4 points 23 hours ago Your mom's house =) permalink parent award report block reply\nTrumpSaysNoMAGA4u 1 points 24 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nDeaduponArousal 2 points 22 hours ago Jumped the shark? Every single evil entity has been trying to inject itself and subvert the movement. They can’t have a populist movement succeed otherwise their world takeover loses. Whether or not they got to Trump or he was a setup the entire time doesn’t matter. He’s clearly abandoned his base for foreigners at this point. Burn it all down kick out the foreigners and traitors. There’s no political solution at this point. permalink parent award report block reply\nGirthquakes -9 points 1 day ago You faggots are always welcome to jump ship and go make your own party. None of this faux concern is going to convince us to abandon GEOTUS. Your \"death by a thousand cuts\" will fail, just like every other attempt to subvert this forum and the MAGA movement as a whole. Lefty faggots can get fucked. permalink parent award report block reply UntakenUsername 9 points 1 day ago Nobody is trying to convince you to abandon anything. If you can't see, you can't see. \"There are those who see, those who can see when shown, and those who will never see.\" I do admire your unending loyalty for Trump and his administration, however.  I predict that, at some point, even people like yourself will have to look at reality for what it is.  I love President Trump and his family and have voted for him every time and would do it again. But, his administration, while doing more that any US President we have ever seen, has failed to do the one thing that would fix everything. They didn't drain The Swamp. Is it because of Bondi or Patel? Maybe so, but the buck stops at the Oval Office. He has shown public frustration with Bondi, but hasn't fired/replace her with someone who will be as ruthless as is required. It's on him, ultimately. He would say exactly the same thing about a leader in his same position. permalink parent award report block reply staroframphansbhole 6 points 1 day ago It’s because the poster you’re replying to drinks milkshakes laden with shabbat splooge if you know what I’m saying permalink parent award report block reply NazisWereSocialist 3 points 1 day ago Ok grandpa permalink parent award report block reply\nUntakenUsername 9 points 1 day ago Nobody is trying to convince you to abandon anything. If you can't see, you can't see. \"There are those who see, those who can see when shown, and those who will never see.\" I do admire your unending loyalty for Trump and his administration, however.  I predict that, at some point, even people like yourself will have to look at reality for what it is.  I love President Trump and his family and have voted for him every time and would do it again. But, his administration, while doing more that any US President we have ever seen, has failed to do the one thing that would fix everything. They didn't drain The Swamp. Is it because of Bondi or Patel? Maybe so, but the buck stops at the Oval Office. He has shown public frustration with Bondi, but hasn't fired/replace her with someone who will be as ruthless as is required. It's on him, ultimately. He would say exactly the same thing about a leader in his same position. permalink parent award report block reply staroframphansbhole 6 points 1 day ago It’s because the poster you’re replying to drinks milkshakes laden with shabbat splooge if you know what I’m saying permalink parent award report block reply\nstaroframphansbhole 6 points 1 day ago It’s because the poster you’re replying to drinks milkshakes laden with shabbat splooge if you know what I’m saying permalink parent award report block reply\nNazisWereSocialist 3 points 1 day ago Ok grandpa permalink parent award report block reply\nAlpha_Lemming 6 points 1 day ago The only \"solutions\" that are acceptable in a debt based system are the ones that involve more debt. With this, debts are created and sold through various financial instruments where the consumer \"saves\" $300 per month, but pays an additional couple hundred grand over the term. Meanwhile, the lender takes their cut and then peddles the note through the pupeline to let it explode on somebody else's ledger. Half of the houses built in the last 20 years won't last 50 years. permalink award report block reply mohel OP 4 points 1 day ago Let's print more money permalink parent award report block reply\nmohel OP 4 points 1 day ago Let's print more money permalink parent award report block reply\nLauraCoomer 5 points 1 day ago It's been so painful. permalink award report block reply LiquidSun 9 points 1 day ago I've largely just stopped caring. I'll do what I can in my own life, but I don't know that I'll bother voting again. It may be too early to say, but it does feel as though we've been duped. permalink parent award report block reply Be_The_Change 2 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nLiquidSun 9 points 1 day ago I've largely just stopped caring. I'll do what I can in my own life, but I don't know that I'll bother voting again. It may be too early to say, but it does feel as though we've been duped. permalink parent award report block reply\nBe_The_Change 2 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nNazisWereSocialist 4 points 1 day ago The 50 year mortgage thing is fucking retarded. permalink award report block reply\nrockaustin 4 points 1 day ago Gets shot at and raises fist to look strong and ends up being a gigantic pussy. What a waste of time all of this was. permalink award report block reply Crappydatum -2 points 1 day ago Get your own sorry ass shot and get back to us permalink parent award report block reply rockaustin 1 points 24 hours ago Ok, I guess being an absolute failure and letting the country fall to communists and illegals is the proper reaction, instead of becoming an American legend and destroying our enemies. permalink parent award report block reply\nCrappydatum -2 points 1 day ago Get your own sorry ass shot and get back to us permalink parent award report block reply rockaustin 1 points 24 hours ago Ok, I guess being an absolute failure and letting the country fall to communists and illegals is the proper reaction, instead of becoming an American legend and destroying our enemies. permalink parent award report block reply\nrockaustin 1 points 24 hours ago Ok, I guess being an absolute failure and letting the country fall to communists and illegals is the proper reaction, instead of becoming an American legend and destroying our enemies. permalink parent award report block reply\nbooblitchutz 2 points 21 hours ago 50 year mortgages is retarded. It will increase demand without a change to supply. That means prices go up. That’s retarded. permalink award report block reply\nAmericanMestizo 2 points 19 hours ago The economy is so fucking broken and fake that any attempt to fix it will likely crash the economy worse than 2008. No politician wants to be blamed for that. That's the crux of the matter the moves to fix anything is painful. Most voters are ignorant and short sighted. The moment there is any pain they will simply blame those in charge and blibdly vote in the other guy. The strategy of the elites is to do everything in there power to keep the current system humming along. The corporate elite like it because it makes them richer at the expense of the common man and the politicians like it because they want to avoid another crash. The problem is none of this is sustainable in the long run. I'm kind of amazed they've kept things going as long as they have. permalink award report block reply\nCrappydatum 1 points 1 day ago This site is overrun with retards permalink award report block reply\nHeavenlyTrumpets -2 points 1 day ago I mean, it is a wrecking ball to the status quo lol... Perhaps it's all a big misunderstanding? Ha permalink award report block reply NazisWereSocialist 3 points 1 day ago bankers are rubbing their greasy little hands together at the thought of 50 year mortgages permalink parent award report block reply\nNazisWereSocialist 3 points 1 day ago bankers are rubbing their greasy little hands together at the thought of 50 year mortgages permalink parent award report block reply",
  "fetched_at": "2025-11-12T21:03:17.296029Z"
}