{
  "id": "1ARK9oWNM8",
  "url": "https://patriots.win/p/1ARK9oWNM8/fire-pam-bondi-why-are-we-still-/c",
  "content": "58 FIRE PAM BONDI: Why are we still getting beat up in the streets of America by legally classified domestic terrorists? posted 2 hours ago by AmannamedRJ 4 comments award share download report block\n4 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style 2021is1776-2 0 points 2 hours ago Why are you just sitting on your ass bitching. Toss on a mask and crack some fucking skulls or shut up. permalink award report block reply AmannamedRJ OP 1 points 2 hours ago Well, that might be the most retarded thing anybody's ever commented to me, and boy you had some competition. permalink parent award report block reply Mhmm2MoreWeeks -1 points 1 hour ago Trump is not serious about bringing Traitors to Justice. WHY???? Because he does not want his family looking over their shoulders for the rest of their lives.... You still do not understand. None of this is resolved with an election. permalink award report block reply Surfsup 1 points 54 minutes ago You're right. It's solved with hangings permalink parent award report block reply\n2021is1776-2 0 points 2 hours ago Why are you just sitting on your ass bitching. Toss on a mask and crack some fucking skulls or shut up. permalink award report block reply AmannamedRJ OP 1 points 2 hours ago Well, that might be the most retarded thing anybody's ever commented to me, and boy you had some competition. permalink parent award report block reply\nAmannamedRJ OP 1 points 2 hours ago Well, that might be the most retarded thing anybody's ever commented to me, and boy you had some competition. permalink parent award report block reply\nMhmm2MoreWeeks -1 points 1 hour ago Trump is not serious about bringing Traitors to Justice. WHY???? Because he does not want his family looking over their shoulders for the rest of their lives.... You still do not understand. None of this is resolved with an election. permalink award report block reply Surfsup 1 points 54 minutes ago You're right. It's solved with hangings permalink parent award report block reply\nSurfsup 1 points 54 minutes ago You're right. It's solved with hangings permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:25:00.394369Z"
}