{
  "id": "1ARK0Ub4j2",
  "url": "https://patriots.win/p/1ARK0Ub4j2/-update-zohran-mamdani-shocks-hi/c",
  "content": "319 🚨 UPDATE: Zohran Mamdani shocks his supporters by admitting things CANNOT be free. \"Remember how I told you to stop sending me money? You can start again. I hope you will make a donation.\" Imagine that. He's one big scam, begging the working class to fund his \"transition.\" posted 7 days ago by DeusVult1096 11 comments award share report block Eric Daugherty @EricLDaugh • 7d 🚨 UPDATE: Zohran Mamdani shocks his supporters by admitting things CANNOT be free \"Remember how I told you to stop sending me money? You can start again. I hope you will make a donation.\" Imagine that. He's one big scam, begging the working class to fund his \"transition.\"\n11 comments Sort by Top Top New Worst Old Save Around the Web Salt Lake City's Hair Growth Method Breaks All Records! HaloGrow h203h 10 points 7 days ago Fund for his dirty disgusting mosques. Fuck Islam permalink award report block reply DingleBalls 8 points 7 days ago Bait/Switch permalink award report block reply Be_The_Change 2 points 7 days ago You really think Soros would fund a candidate who (honestly) promises to bankrupt billionaires? permalink award report block reply goodguy 2 points 6 days ago used car salesman constant hand gestures - cringe permalink award report block reply OkieDoker 2 points 6 days ago So blatant hahaha what a crook permalink award report block reply FlyCatcher94 2 points 6 days ago TAQIYA permalink award report block reply onesummerdream 1 points 6 days ago Remember now, everything a leftist says, the exact opposite will be the truth. permalink award report block reply maggiemay 1 points 6 days ago You'd think after he promised New Yorkers he could make everything free, he could figure out a way to make his transition free.  Seems like small potatoes compared to trying to make groceries and buses free. permalink award report block reply booblitchutz 1 points 6 days ago Meet the new boss, same as the old boss The lyrics of that song are relevant once again. permalink award report block reply nemonster 1 points 7 days ago I m all in for his transtion. I ll pay good money to have his dick cut off permalink award report block reply TeeRoyAL 1 points 7 days ago wow, he filmed this the next morning after winning, or was pre and knew he was going to beg for money permalink award report block reply\nh203h 10 points 7 days ago Fund for his dirty disgusting mosques. Fuck Islam permalink award report block reply\nDingleBalls 8 points 7 days ago Bait/Switch permalink award report block reply\nBe_The_Change 2 points 7 days ago You really think Soros would fund a candidate who (honestly) promises to bankrupt billionaires? permalink award report block reply\ngoodguy 2 points 6 days ago used car salesman constant hand gestures - cringe permalink award report block reply\nOkieDoker 2 points 6 days ago So blatant hahaha what a crook permalink award report block reply\nFlyCatcher94 2 points 6 days ago TAQIYA permalink award report block reply\nonesummerdream 1 points 6 days ago Remember now, everything a leftist says, the exact opposite will be the truth. permalink award report block reply\nmaggiemay 1 points 6 days ago You'd think after he promised New Yorkers he could make everything free, he could figure out a way to make his transition free.  Seems like small potatoes compared to trying to make groceries and buses free. permalink award report block reply\nbooblitchutz 1 points 6 days ago Meet the new boss, same as the old boss The lyrics of that song are relevant once again. permalink award report block reply\nnemonster 1 points 7 days ago I m all in for his transtion. I ll pay good money to have his dick cut off permalink award report block reply\nTeeRoyAL 1 points 7 days ago wow, he filmed this the next morning after winning, or was pre and knew he was going to beg for money permalink award report block reply",
  "fetched_at": "2025-11-12T20:54:36.405783Z"
}