{
  "id": "8185046",
  "title": "157Ed Martin Says J6/Pipe Bomber Investigations Developing Over Months/Years (Statute of Limitations",
  "url": "https://patriots.win/p/1ARK9nNhqw/ed-martin-says-j6pipe-bomber-inv/c",
  "content": "184 Ed Martin Says J6/Pipe Bomber Investigations Developing Over Months/Years (Statute of Limitations Expires in 8 Weeks) posted 10 hours ago by flashersenpai 12 comments award share report block 🇺🇸 @FreeStateWill • 1d I hate to break it to the Bondi DOJ, but you don't have \"months and years.\" The statute of limitations expires in eight weeks. You've wasted ten months and failed to bring in the expertise needed to speed the J6 investigation. You deserve all the criticism that's coming to you! Benny Johnson @bennyjohnson • 1d DOJ Pardon Attorney Ed Martin says he spoke with Deputy FBI Director Dan Bongino over the weekend, who gave him a very promising update on January 6th and the pipe bomber: \"I spoke to Bongino and he said 'We are in this completely. It's not off the radar.' I know we are making\n12 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno RudeFrog 6 points 10 hours ago Sorry, statute of limitations on terrorism? Our justice system is completely fucking retarded. Being able to bury your crime for a few years shouldn't get you off on a technicality. permalink award report block reply deleted 1 points 9 hours ago flashersenpai OP -1 points 9 hours ago afraid to type retarded on an internet forum conspiracy charges don’t start the statute of limitations clock Except they had to scramble to charge Comey. The point is it's almost an entire year of the \"most transparent\" administration who was elected to exact revenge on the deep state. No such thing has happened. permalink parent award report block reply liberpede 1 points 8 hours ago They had to scramble to charge Comey for a specific act of perjury that he was stupid enough to commit outside the protection of the DC circuit judicial cartel's monopoly jurisdiction. That does not mean that a government conspiracy to plant explosives or even to plant fake explosives in order to abet their weaponization of federal law enforcement against patriotic Americans has that kind of timer. They've specifically told us it doesn't. Don't take it as gospel when some unknown Twitter account makes claims about federal criminal law. permalink parent award report block reply SpeekFreely 4 points 10 hours ago They didn’t waste or fail anything, it’s a coverup for the Praetorian Guard. permalink award report block reply TheSwampThang 2 points 9 hours ago The punishment will be letting her resign with full pension and a cushy new job. permalink award report block reply liberpede 0 points 8 hours ago If that's what Trump wanted to do, he would not have hired Dan Bongino. Dan loves and supports Trump, but he would (figuratively) burn down the administration on his way out the door if he was ordered to let this go. permalink parent award report block reply TheSwampThang 2 points 8 hours ago Why would he care? He's rich and gets a pass from his audience.   Not only will he not burn down anything on the way out, he'll leverage his time in the administration to make more money.   Because why wouldn't he? permalink parent award report block reply liberpede 1 points 8 hours ago Because he's not motivated by money or fame. I know it's not fashionable to have faith in anything these days, but I don't believe he left his multi-million dollar podcasting gig to go work for peanuts in government because he cares primarily about money. permalink parent award report block reply TheSwampThang 2 points 8 hours ago He has done nothing but cover up.  Remember when he said \"there is no there, there.\"? And then proceeded to lecture anyone that doubted the official story permalink parent award report block reply 24NoMoreBullshit 1 points 3 hours ago Ongoing coverup of Conspiracy negates statute of limitations of original crime. All of the events are one big related Conspiracy, still desperately being covered up. permalink award report block reply chickeninoven 1 points 8 hours ago \"It's not off the radar\" is very promising? 🤣😄 permalink award report block reply\nRudeFrog 6 points 10 hours ago Sorry, statute of limitations on terrorism? Our justice system is completely fucking retarded. Being able to bury your crime for a few years shouldn't get you off on a technicality. permalink award report block reply deleted 1 points 9 hours ago flashersenpai OP -1 points 9 hours ago afraid to type retarded on an internet forum conspiracy charges don’t start the statute of limitations clock Except they had to scramble to charge Comey. The point is it's almost an entire year of the \"most transparent\" administration who was elected to exact revenge on the deep state. No such thing has happened. permalink parent award report block reply liberpede 1 points 8 hours ago They had to scramble to charge Comey for a specific act of perjury that he was stupid enough to commit outside the protection of the DC circuit judicial cartel's monopoly jurisdiction. That does not mean that a government conspiracy to plant explosives or even to plant fake explosives in order to abet their weaponization of federal law enforcement against patriotic Americans has that kind of timer. They've specifically told us it doesn't. Don't take it as gospel when some unknown Twitter account makes claims about federal criminal law. permalink parent award report block reply\ndeleted 1 points 9 hours ago flashersenpai OP -1 points 9 hours ago afraid to type retarded on an internet forum conspiracy charges don’t start the statute of limitations clock Except they had to scramble to charge Comey. The point is it's almost an entire year of the \"most transparent\" administration who was elected to exact revenge on the deep state. No such thing has happened. permalink parent award report block reply liberpede 1 points 8 hours ago They had to scramble to charge Comey for a specific act of perjury that he was stupid enough to commit outside the protection of the DC circuit judicial cartel's monopoly jurisdiction. That does not mean that a government conspiracy to plant explosives or even to plant fake explosives in order to abet their weaponization of federal law enforcement against patriotic Americans has that kind of timer. They've specifically told us it doesn't. Don't take it as gospel when some unknown Twitter account makes claims about federal criminal law. permalink parent award report block reply\nflashersenpai OP -1 points 9 hours ago afraid to type retarded on an internet forum conspiracy charges don’t start the statute of limitations clock Except they had to scramble to charge Comey. The point is it's almost an entire year of the \"most transparent\" administration who was elected to exact revenge on the deep state. No such thing has happened. permalink parent award report block reply liberpede 1 points 8 hours ago They had to scramble to charge Comey for a specific act of perjury that he was stupid enough to commit outside the protection of the DC circuit judicial cartel's monopoly jurisdiction. That does not mean that a government conspiracy to plant explosives or even to plant fake explosives in order to abet their weaponization of federal law enforcement against patriotic Americans has that kind of timer. They've specifically told us it doesn't. Don't take it as gospel when some unknown Twitter account makes claims about federal criminal law. permalink parent award report block reply\nliberpede 1 points 8 hours ago They had to scramble to charge Comey for a specific act of perjury that he was stupid enough to commit outside the protection of the DC circuit judicial cartel's monopoly jurisdiction. That does not mean that a government conspiracy to plant explosives or even to plant fake explosives in order to abet their weaponization of federal law enforcement against patriotic Americans has that kind of timer. They've specifically told us it doesn't. Don't take it as gospel when some unknown Twitter account makes claims about federal criminal law. permalink parent award report block reply\nSpeekFreely 4 points 10 hours ago They didn’t waste or fail anything, it’s a coverup for the Praetorian Guard. permalink award report block reply\nTheSwampThang 2 points 9 hours ago The punishment will be letting her resign with full pension and a cushy new job. permalink award report block reply liberpede 0 points 8 hours ago If that's what Trump wanted to do, he would not have hired Dan Bongino. Dan loves and supports Trump, but he would (figuratively) burn down the administration on his way out the door if he was ordered to let this go. permalink parent award report block reply TheSwampThang 2 points 8 hours ago Why would he care? He's rich and gets a pass from his audience.   Not only will he not burn down anything on the way out, he'll leverage his time in the administration to make more money.   Because why wouldn't he? permalink parent award report block reply liberpede 1 points 8 hours ago Because he's not motivated by money or fame. I know it's not fashionable to have faith in anything these days, but I don't believe he left his multi-million dollar podcasting gig to go work for peanuts in government because he cares primarily about money. permalink parent award report block reply TheSwampThang 2 points 8 hours ago He has done nothing but cover up.  Remember when he said \"there is no there, there.\"? And then proceeded to lecture anyone that doubted the official story permalink parent award report block reply\nliberpede 0 points 8 hours ago If that's what Trump wanted to do, he would not have hired Dan Bongino. Dan loves and supports Trump, but he would (figuratively) burn down the administration on his way out the door if he was ordered to let this go. permalink parent award report block reply TheSwampThang 2 points 8 hours ago Why would he care? He's rich and gets a pass from his audience.   Not only will he not burn down anything on the way out, he'll leverage his time in the administration to make more money.   Because why wouldn't he? permalink parent award report block reply liberpede 1 points 8 hours ago Because he's not motivated by money or fame. I know it's not fashionable to have faith in anything these days, but I don't believe he left his multi-million dollar podcasting gig to go work for peanuts in government because he cares primarily about money. permalink parent award report block reply TheSwampThang 2 points 8 hours ago He has done nothing but cover up.  Remember when he said \"there is no there, there.\"? And then proceeded to lecture anyone that doubted the official story permalink parent award report block reply\nTheSwampThang 2 points 8 hours ago Why would he care? He's rich and gets a pass from his audience.   Not only will he not burn down anything on the way out, he'll leverage his time in the administration to make more money.   Because why wouldn't he? permalink parent award report block reply liberpede 1 points 8 hours ago Because he's not motivated by money or fame. I know it's not fashionable to have faith in anything these days, but I don't believe he left his multi-million dollar podcasting gig to go work for peanuts in government because he cares primarily about money. permalink parent award report block reply TheSwampThang 2 points 8 hours ago He has done nothing but cover up.  Remember when he said \"there is no there, there.\"? And then proceeded to lecture anyone that doubted the official story permalink parent award report block reply\nliberpede 1 points 8 hours ago Because he's not motivated by money or fame. I know it's not fashionable to have faith in anything these days, but I don't believe he left his multi-million dollar podcasting gig to go work for peanuts in government because he cares primarily about money. permalink parent award report block reply TheSwampThang 2 points 8 hours ago He has done nothing but cover up.  Remember when he said \"there is no there, there.\"? And then proceeded to lecture anyone that doubted the official story permalink parent award report block reply\nTheSwampThang 2 points 8 hours ago He has done nothing but cover up.  Remember when he said \"there is no there, there.\"? And then proceeded to lecture anyone that doubted the official story permalink parent award report block reply\n24NoMoreBullshit 1 points 3 hours ago Ongoing coverup of Conspiracy negates statute of limitations of original crime. All of the events are one big related Conspiracy, still desperately being covered up. permalink award report block reply\nchickeninoven 1 points 8 hours ago \"It's not off the radar\" is very promising? 🤣😄 permalink award report block reply",
  "fetched_at": "2025-11-12T23:45:08.059262Z"
}