{
  "id": "8176320",
  "title": "1291The Oklahoma Highway Patrol and ICE arrested 70 illegals this week on Interstate 40 in eastern O",
  "url": "https://patriots.win/p/1ARK57rgBs/the-oklahoma-highway-patrol-and-/c",
  "content": "1291 The Oklahoma Highway Patrol and ICE arrested 70 illegals this week on Interstate 40 in eastern Oklahoma — 34 of them were driving semi’s or large commercial vehicles. posted 4 days ago by basedboston 41 comments award share report block Election Wizard @ElectionWiz • 4d REPORT: The Oklahoma Highway Patrol and ICE arrested 70 illegals this week on Interstate 40 in eastern Oklahoma — 34 of them were driving semi’s or large commercial vehicles. The people arrested originally came from Tajikistan, India, Montenegro, El Salvador, Uzbekistan,\n41 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style MinnieWhittaker 30 points 4 days ago Good work, OHP and ICE. Keep it up! permalink award report block reply basedboston OP 25 points 4 days ago The people arrested originally came from Tajikistan, India, Montenegro, El Salvador, Uzbekistan, Georgia, Kyrgyzstan, Kazakhstan, China, Pakistan, Russia, Belarus, Haiti, Ukraine, Turkiye, Mauritania, Cuba, Guatemala, Venezuela, Nicaragua, Honduras, Colombia, and Mexico. permalink award report block reply Shitsbrokeyo 19 points 4 days ago Fucking 0bama. permalink parent award report block reply MR__K 6 points 4 days ago I can't imagine why Americans are struggling to find work. I want my jobs back. permalink parent award report block reply Hanging_Chad 2 points 4 days ago ordered from most to least, or? permalink parent award report block reply SpellingContable 2 points 4 days ago 23 different countries. permalink parent award report block reply Cyer6 2 points 4 days ago If they towed those big rigs, which they most likely had to due to liability, that's going to be some BIG $$ to release. Whoever employed them is going to pay out the nose. permalink parent award report block reply john9985 19 points 4 days ago I drove through AZ / NM last month on I40 and at least 80% of them were clearly foreign and 99% of the ones driving like shit permalink award report block reply Choppermagic 16 points 4 days ago ARREST the company owners!  They keep hiring them! permalink award report block reply BoomShtick 15 points 4 days ago Confiscate the loads, impound the trucks, fine trucking company, and deport the shitbag permalink award report block reply JustAnotherPsyopNPC 11 points 4 days ago Now do CA lol permalink award report block reply Mega_MAGA 8 points 4 days ago I want to see 700 permalink award report block reply h3xAd3c1m4L 8 points 4 days ago Would love to see more of an effort to get the illegals driving for Uber & Lyft off the roads. permalink award report block reply JackOfAllTirades 7 points 4 days ago In the past when I encountered an 18 wheeler on the highway I assumed that they were well trained and as long as I used reasonable caution and gave the truck sufficient space between my vehicle and theirs, that the odds of a trucker killing me due to their negligence was minimal. They are all suspect to me now. permalink award report block reply DirtyDiaperJoe 2 points 4 days ago I travel on an interstate, which runs right through our city, that's the main truck route going east/west across the country, on a daily basis. At least once, if not twice a week, there's a major accident on that 7 mile stretch I drive daily, that involves a semi.  It didn't used to be this way...and it's fucking ridiculous. permalink parent award report block reply SideofB33f 7 points 4 days ago Go after the truck company that hired them permalink award report block reply Jaunty_Haul 6 points 4 days ago PROSECUTE THE EMPLOYERS. permalink award report block reply Serulin 6 points 4 days ago Why are they not just auto checked at weighing stations? You know the ones they are forced to go through? permalink award report block reply Trooph-Hurts 6 points 4 days ago Illegals, meaning non licensed drivers  from other countries I’m assuming!….. slave labor permalink award report block reply thisisatestof2 4 points 4 days ago Based Oklahoma highway patrol.   I always loved watching them when they were featured on live PD. They seemed stern, yet professional, and understanding when necessary permalink award report block reply Gilliais 3 points 4 days ago And the rest, I presume, were driving passenger vehicles? Just as dangerous but not as newsworthy as semi crashes. permalink award report block reply FusionBlack 2 points 4 days ago So what happened to thier employer's? Thought so. permalink award report block reply HKFan 2 points 4 days ago California CDL's.  DoT should absolutely yank California's ability to issue them and if possible go as far as regular licenses permalink award report block reply deleted 2 points 4 days ago HKFan 2 points 4 days ago I think it's going to happen.  Florida was first doing it and now Oklahoma.  Just need a couple forward thinking states to come up with the strategy/tactics permalink parent award report block reply PillarOfWisdom 2 points 4 days ago That’s the last place in the US you want to mess around on the interstate. Go OK. permalink award report block reply Tookens 2 points 4 days ago And they followed up by going to the companies who hired these illegals and ARRESTING THE COMPANY OWNERS, right?  RIGHT? permalink award report block reply OkieDoker 1 points 4 days ago Get them all guys permalink award report block reply AfterGlow 1 points 4 days ago How many of those illegal CDL's were issued in California? And Newscum wants to be President. permalink award report block reply ToodeepinCA 1 points 4 days ago They just need to patrol 35 and 44, gota up those numbers permalink award report block reply SimaYi 1 points 4 days ago We'll keep the White ones. permalink award report block reply Comeon4954 1 points 4 days ago God’s country permalink award report block reply GoUSA 1 points 4 days ago There's a far more efficient way to do this but that of course would involve punishing the business owners who created this situation by knowingly hiring illegals permalink award report block reply KABOOKIE 1 points 4 days ago BOOMER! permalink award report block reply hughjasske69 1 points 4 days ago Stop every truck at every weigh station permalink award report block reply johnparker 1 points 4 days ago Let the local municipality take ownership of the cargo.  That would motivate every town to put cops on the highways to pull trucks over for citizenship checks. permalink award report block reply Skinagrizz 1 points 4 days ago I posted this the other day but ok permalink award report block reply BlueKentuckyGirl 1 points 4 days ago That’s a good start! Keep up the great work! Thank you. permalink award report block reply journalist 1 points 4 days ago Besides India I’d assume those countries have good truck drivers. permalink award report block reply Speedgraphic69 1 points 4 days ago Knee cap them and give them a bus ride south permalink award report block reply SuperHonkey 1 points 4 days ago That's a loooong way from the fuckin border permalink award report block reply\nMinnieWhittaker 30 points 4 days ago Good work, OHP and ICE. Keep it up! permalink award report block reply\nbasedboston OP 25 points 4 days ago The people arrested originally came from Tajikistan, India, Montenegro, El Salvador, Uzbekistan, Georgia, Kyrgyzstan, Kazakhstan, China, Pakistan, Russia, Belarus, Haiti, Ukraine, Turkiye, Mauritania, Cuba, Guatemala, Venezuela, Nicaragua, Honduras, Colombia, and Mexico. permalink award report block reply Shitsbrokeyo 19 points 4 days ago Fucking 0bama. permalink parent award report block reply MR__K 6 points 4 days ago I can't imagine why Americans are struggling to find work. I want my jobs back. permalink parent award report block reply Hanging_Chad 2 points 4 days ago ordered from most to least, or? permalink parent award report block reply SpellingContable 2 points 4 days ago 23 different countries. permalink parent award report block reply Cyer6 2 points 4 days ago If they towed those big rigs, which they most likely had to due to liability, that's going to be some BIG $$ to release. Whoever employed them is going to pay out the nose. permalink parent award report block reply\nShitsbrokeyo 19 points 4 days ago Fucking 0bama. permalink parent award report block reply\nMR__K 6 points 4 days ago I can't imagine why Americans are struggling to find work. I want my jobs back. permalink parent award report block reply\nHanging_Chad 2 points 4 days ago ordered from most to least, or? permalink parent award report block reply\nSpellingContable 2 points 4 days ago 23 different countries. permalink parent award report block reply\nCyer6 2 points 4 days ago If they towed those big rigs, which they most likely had to due to liability, that's going to be some BIG $$ to release. Whoever employed them is going to pay out the nose. permalink parent award report block reply\njohn9985 19 points 4 days ago I drove through AZ / NM last month on I40 and at least 80% of them were clearly foreign and 99% of the ones driving like shit permalink award report block reply\nChoppermagic 16 points 4 days ago ARREST the company owners!  They keep hiring them! permalink award report block reply\nBoomShtick 15 points 4 days ago Confiscate the loads, impound the trucks, fine trucking company, and deport the shitbag permalink award report block reply\nJustAnotherPsyopNPC 11 points 4 days ago Now do CA lol permalink award report block reply\nMega_MAGA 8 points 4 days ago I want to see 700 permalink award report block reply\nh3xAd3c1m4L 8 points 4 days ago Would love to see more of an effort to get the illegals driving for Uber & Lyft off the roads. permalink award report block reply\nJackOfAllTirades 7 points 4 days ago In the past when I encountered an 18 wheeler on the highway I assumed that they were well trained and as long as I used reasonable caution and gave the truck sufficient space between my vehicle and theirs, that the odds of a trucker killing me due to their negligence was minimal. They are all suspect to me now. permalink award report block reply DirtyDiaperJoe 2 points 4 days ago I travel on an interstate, which runs right through our city, that's the main truck route going east/west across the country, on a daily basis. At least once, if not twice a week, there's a major accident on that 7 mile stretch I drive daily, that involves a semi.  It didn't used to be this way...and it's fucking ridiculous. permalink parent award report block reply\nDirtyDiaperJoe 2 points 4 days ago I travel on an interstate, which runs right through our city, that's the main truck route going east/west across the country, on a daily basis. At least once, if not twice a week, there's a major accident on that 7 mile stretch I drive daily, that involves a semi.  It didn't used to be this way...and it's fucking ridiculous. permalink parent award report block reply\nSideofB33f 7 points 4 days ago Go after the truck company that hired them permalink award report block reply\nJaunty_Haul 6 points 4 days ago PROSECUTE THE EMPLOYERS. permalink award report block reply\nSerulin 6 points 4 days ago Why are they not just auto checked at weighing stations? You know the ones they are forced to go through? permalink award report block reply\nTrooph-Hurts 6 points 4 days ago Illegals, meaning non licensed drivers  from other countries I’m assuming!….. slave labor permalink award report block reply\nthisisatestof2 4 points 4 days ago Based Oklahoma highway patrol.   I always loved watching them when they were featured on live PD. They seemed stern, yet professional, and understanding when necessary permalink award report block reply\nGilliais 3 points 4 days ago And the rest, I presume, were driving passenger vehicles? Just as dangerous but not as newsworthy as semi crashes. permalink award report block reply\nFusionBlack 2 points 4 days ago So what happened to thier employer's? Thought so. permalink award report block reply\nHKFan 2 points 4 days ago California CDL's.  DoT should absolutely yank California's ability to issue them and if possible go as far as regular licenses permalink award report block reply\ndeleted 2 points 4 days ago HKFan 2 points 4 days ago I think it's going to happen.  Florida was first doing it and now Oklahoma.  Just need a couple forward thinking states to come up with the strategy/tactics permalink parent award report block reply\nHKFan 2 points 4 days ago I think it's going to happen.  Florida was first doing it and now Oklahoma.  Just need a couple forward thinking states to come up with the strategy/tactics permalink parent award report block reply\nPillarOfWisdom 2 points 4 days ago That’s the last place in the US you want to mess around on the interstate. Go OK. permalink award report block reply\nTookens 2 points 4 days ago And they followed up by going to the companies who hired these illegals and ARRESTING THE COMPANY OWNERS, right?  RIGHT? permalink award report block reply\nOkieDoker 1 points 4 days ago Get them all guys permalink award report block reply\nAfterGlow 1 points 4 days ago How many of those illegal CDL's were issued in California? And Newscum wants to be President. permalink award report block reply\nToodeepinCA 1 points 4 days ago They just need to patrol 35 and 44, gota up those numbers permalink award report block reply\nSimaYi 1 points 4 days ago We'll keep the White ones. permalink award report block reply\nComeon4954 1 points 4 days ago God’s country permalink award report block reply\nGoUSA 1 points 4 days ago There's a far more efficient way to do this but that of course would involve punishing the business owners who created this situation by knowingly hiring illegals permalink award report block reply\nKABOOKIE 1 points 4 days ago BOOMER! permalink award report block reply\nhughjasske69 1 points 4 days ago Stop every truck at every weigh station permalink award report block reply\njohnparker 1 points 4 days ago Let the local municipality take ownership of the cargo.  That would motivate every town to put cops on the highways to pull trucks over for citizenship checks. permalink award report block reply\nSkinagrizz 1 points 4 days ago I posted this the other day but ok permalink award report block reply\nBlueKentuckyGirl 1 points 4 days ago That’s a good start! Keep up the great work! Thank you. permalink award report block reply\njournalist 1 points 4 days ago Besides India I’d assume those countries have good truck drivers. permalink award report block reply\nSpeedgraphic69 1 points 4 days ago Knee cap them and give them a bus ride south permalink award report block reply\nSuperHonkey 1 points 4 days ago That's a loooong way from the fuckin border permalink award report block reply",
  "fetched_at": "2025-11-12T20:10:37.172240Z"
}