{
  "id": "1ARK5BHQBS",
  "url": "https://patriots.win/p/1ARK5BHQBS/we-are-trump-supporters--have-be/c",
  "content": "423 \"We are Trump supporters.  Have been from day one.  We are hurting.  We are still significantly financially behind where we were 5 years ago ago.  Number one reason is H1B visa.  My husband had to take  30% pay cut to find a job after he was laid off. Terminate ALL foreign worker visas\" posted 3 days ago by bleeje 6 comments award share report block Sara Lane @TheMoose1775 • 7d @PressSec We are Trump supporters.  Have been from day one.  We are hurting.  We are still significantly financially behind where we were 5 years ago ago.  Number one reason is H1B visa.  My husband had to take  30% pay cut to find a job after he was laid off.  Terminate ALL foreign worker\n6 comments Sort by Top Top New Worst Old Save Disinformation_Mnstr 10 points 3 days ago I feel ya...Took a 35% to stay employed with another company because I was a target.  Effectively, I make less now than 2019. permalink award report block reply sixfingerdildo 1 points 3 days ago a kid got an opportunity to apprentice in a trade. he quit after a week cause he couldn't stand the heat; working in miserably hot, stuffy, unsafe conditions. shit, i autta osha that shit... but only the illegals who risked heat stroke get rewarded... permalink parent award report block reply Disinformation_Mnstr 1 points 3 days ago So one guy taps, and that justifies the entire H1B program? permalink parent award report block reply sixfingerdildo 4 points 3 days ago no, that wasn't my point at all. there's a few parameters that go into the calculus, one of which being the illegals don't know what osha is, don't know what worker safety is and the employers who take advantage of it. can employers be forced off their addiction to slave labor? this is civil war territory again. the pervasiveness of slave labor is far greater than we realized, it's not just a matter of shutting off h1b and deporting everyone; your buddies, neighbors, bosses and church brothers are all impacted, on one side or the other... : this really needs to be called what it is, slavery. fuck the cute names, fuck the wordsmithing. i don't give a fuck about the slaves, but i do give a fuck about us all being reduced to slaves because of the pervasive and increasing use of slaves. permalink parent award report block reply LaptopDied 3 points 3 days ago Yes. Do that. permalink award report block reply greatpumpkin 3 points 2 days ago Welcome to the party. permalink award report block reply\nDisinformation_Mnstr 10 points 3 days ago I feel ya...Took a 35% to stay employed with another company because I was a target.  Effectively, I make less now than 2019. permalink award report block reply sixfingerdildo 1 points 3 days ago a kid got an opportunity to apprentice in a trade. he quit after a week cause he couldn't stand the heat; working in miserably hot, stuffy, unsafe conditions. shit, i autta osha that shit... but only the illegals who risked heat stroke get rewarded... permalink parent award report block reply Disinformation_Mnstr 1 points 3 days ago So one guy taps, and that justifies the entire H1B program? permalink parent award report block reply sixfingerdildo 4 points 3 days ago no, that wasn't my point at all. there's a few parameters that go into the calculus, one of which being the illegals don't know what osha is, don't know what worker safety is and the employers who take advantage of it. can employers be forced off their addiction to slave labor? this is civil war territory again. the pervasiveness of slave labor is far greater than we realized, it's not just a matter of shutting off h1b and deporting everyone; your buddies, neighbors, bosses and church brothers are all impacted, on one side or the other... : this really needs to be called what it is, slavery. fuck the cute names, fuck the wordsmithing. i don't give a fuck about the slaves, but i do give a fuck about us all being reduced to slaves because of the pervasive and increasing use of slaves. permalink parent award report block reply\nsixfingerdildo 1 points 3 days ago a kid got an opportunity to apprentice in a trade. he quit after a week cause he couldn't stand the heat; working in miserably hot, stuffy, unsafe conditions. shit, i autta osha that shit... but only the illegals who risked heat stroke get rewarded... permalink parent award report block reply Disinformation_Mnstr 1 points 3 days ago So one guy taps, and that justifies the entire H1B program? permalink parent award report block reply sixfingerdildo 4 points 3 days ago no, that wasn't my point at all. there's a few parameters that go into the calculus, one of which being the illegals don't know what osha is, don't know what worker safety is and the employers who take advantage of it. can employers be forced off their addiction to slave labor? this is civil war territory again. the pervasiveness of slave labor is far greater than we realized, it's not just a matter of shutting off h1b and deporting everyone; your buddies, neighbors, bosses and church brothers are all impacted, on one side or the other... : this really needs to be called what it is, slavery. fuck the cute names, fuck the wordsmithing. i don't give a fuck about the slaves, but i do give a fuck about us all being reduced to slaves because of the pervasive and increasing use of slaves. permalink parent award report block reply\nDisinformation_Mnstr 1 points 3 days ago So one guy taps, and that justifies the entire H1B program? permalink parent award report block reply sixfingerdildo 4 points 3 days ago no, that wasn't my point at all. there's a few parameters that go into the calculus, one of which being the illegals don't know what osha is, don't know what worker safety is and the employers who take advantage of it. can employers be forced off their addiction to slave labor? this is civil war territory again. the pervasiveness of slave labor is far greater than we realized, it's not just a matter of shutting off h1b and deporting everyone; your buddies, neighbors, bosses and church brothers are all impacted, on one side or the other... : this really needs to be called what it is, slavery. fuck the cute names, fuck the wordsmithing. i don't give a fuck about the slaves, but i do give a fuck about us all being reduced to slaves because of the pervasive and increasing use of slaves. permalink parent award report block reply\nsixfingerdildo 4 points 3 days ago no, that wasn't my point at all. there's a few parameters that go into the calculus, one of which being the illegals don't know what osha is, don't know what worker safety is and the employers who take advantage of it. can employers be forced off their addiction to slave labor? this is civil war territory again. the pervasiveness of slave labor is far greater than we realized, it's not just a matter of shutting off h1b and deporting everyone; your buddies, neighbors, bosses and church brothers are all impacted, on one side or the other... : this really needs to be called what it is, slavery. fuck the cute names, fuck the wordsmithing. i don't give a fuck about the slaves, but i do give a fuck about us all being reduced to slaves because of the pervasive and increasing use of slaves. permalink parent award report block reply\nLaptopDied 3 points 3 days ago Yes. Do that. permalink award report block reply\ngreatpumpkin 3 points 2 days ago Welcome to the party. permalink award report block reply",
  "fetched_at": "2025-11-12T20:45:34.810069Z"
}