{
  "id": "8184839",
  "title": "406Man who attacked Charlie Kirk supporter at Berkeley is a Muslim rapper named ‘Jihad.’posted9 hour",
  "url": "https://patriots.win/p/1ARK9mHVer/man-who-attacked-charlie-kirk-su/c",
  "content": "793 Man who attacked Charlie Kirk supporter at Berkeley is a Muslim rapper named ‘Jihad.’ posted 13 hours ago by kinbergfan 59 comments award share report block Andy Ngo @MrAndyNgo • 1d A Muslim far-left extremist who severely beat a TPUSA attendee on the face after robbing him at UC Berkeley has been identified as Jihad Dphrepaulezz. The 25-year-old listed @CAPublicHealth as his employer. Dphrepaulezz is a rapper known as \"A.R. The Believer.\" He tried Andy Ngo @MrAndyNgo • 2d UC Berkeley (Nov. 10) — A far-left extremist stole a conservative man's necklace & then punched him repeatedly in the face when he tried to take it back outside the TPUSA event. The victim was bloodied, and the leftists racially mocked him for being white.\n59 comments Sort by Top Top New Worst Old Save SuperDuperBasedMD 44 points 13 hours ago denaturalize and deport permalink award report block reply rebuildingMyself 20 points 10 hours ago His victim wasn't Jewish so I'm not optimistic permalink parent award report block reply God-is-good 12 points 9 hours ago I heard the necklace was a cross and the punched man was Christian. permalink parent award report block reply Bboop 2 points 2 hours ago Crucifix permalink parent award report block reply Mhmm2MoreWeeks -5 points 3 hours ago If you were to study history you would know that those who go against Jews have lost every single time. The enemies of the Jews are against God. The trend will continue. permalink parent award report block reply vongregormench 9 points 3 hours ago Then how did the Jews get run out of the Middle East? Israel is a conquered nation in most of the Bible. Jews that are faithful to god get god’s blessing. Globalist atheist Jews that wage covert ethnic wars against others do not get god’s blessing. permalink parent award report block reply shadypollster 3 points 2 hours ago Nice distinction. Because it's true. permalink parent award report block reply diverscale 1 points 2 hours ago Well said permalink parent award report block reply jadepoemm 2 points 3 hours ago Better check for any gas leaks in his house, cant be too careful! permalink parent award report block reply MissingTrump 2 points 3 hours ago And maybe not import any retards named Jihad? permalink parent award report block reply Prandogolio 1 points 2 hours ago I'm over that.  Hang them. permalink parent award report block reply twentytwentyfourr 19 points 12 hours ago works for the gov, shocker permalink award report block reply God-is-good 11 points 9 hours ago Lots coming out recently about the government funding degenerate rappers. With usaid drying up the billboards have been absent rap mysteriously. https://www.cbc.ca/arts/commotion/how-did-rap-fall-out-of-the-billboard-top-40-9.6974039 permalink parent award report block reply LearnAboutRoaches 3 points 2 hours ago Hilarious how a bored person of color playing on his phone for a couple hours one night instantly gives them the title of \"rapper\" USAid drying up? Lol no this pos is not a rapper, has nothing to do with rap as a genre and even less to do with billboard permalink parent award report block reply rebuildingMyself 2 points 6 hours ago Tax dollars hard at work as always permalink parent award report block reply Bigstick7 12 points 8 hours ago Conservatives need to start training with firearms and hand to hand (boxing, jit jitsu, something), and stay frosty. permalink award report block reply penguinjay1212 3 points 6 hours ago Why do you say he wasnt? Dude had 3 to 4 different fights. Supporting each other under lopsided ruling in crazed jurisdictions seems way more important. Dont put yourself in that situation to begin with. Dude shoulda had like 10 friends ready to stomp the life out of those people. Don't go protesting alone. Buddy system minimum. permalink parent award report block reply AlmostFullyDilated 0 points 3 hours ago why are you gay? permalink parent award report block reply Bigstick7 1 points 2 hours ago Good one. permalink parent award report block reply Badfinz_FL 12 points 13 hours ago Time for jihad to be deported to GITMO permalink award report block reply BoomShtick 3 points 3 hours ago Deport to the gulf of America permalink parent award report block reply RudeFrog 8 points 10 hours ago Will he even be arrested? permalink award report block reply RedStoneDeepState 3 points 3 hours ago He was already. The cops arrested everyone involved, then charged this guy and released the victim. permalink parent award report block reply trumpORbust 3 points 2 hours ago Charges will be dropped in a few days when everyone has moved on permalink parent award report block reply chuey_316 8 points 7 hours ago The left have openly and fully demonstrated that they cannot control their mental illness and are threats. Anyone who can legally carry needs to stay strapped. The victim would have been completely justified in giving this goat fucker a hole in the chest. permalink award report block reply rebuildingMyself 1 points 6 hours ago At this point I think even the Democrat machine knows they lost control of the radicals on their side permalink parent award report block reply Dev404 5 points 8 hours ago Gee, another beloved muslim animal that leftists eagerly bend over for. How surprising. permalink award report block reply Pats5x 5 points 8 hours ago they all work in academia, ngos or in government permalink award report block reply TwoArizonaPedes 2 points 3 hours ago Or medicine. permalink parent award report block reply BBvarn 4 points 10 hours ago Perfect resume for democrat politician. permalink award report block reply Shitsbrokeyo 4 points 7 hours ago Criminal offense. Deport permalink award report block reply FailSayf 2 points 2 hours ago Looks like a cave man. They’re all so ugly. permalink award report block reply SpellingContable 2 points 6 hours ago \"dEvErSiTy iS oUr sTrEnGtH\" permalink award report block reply Oleander 3 points 3 hours ago When they say \"our\", they aren't including you. For them it is a strength, to use against you. permalink parent award report block reply SpellingContable 1 points 3 hours ago \"gAyS fOr iSlAm\" permalink parent award report block reply hansgruber7 2 points 3 hours ago DOJ needs to make an example of him under Antifa terrorism federal charges.  Enough tolerating Leftist terrorist violence like this. permalink award report block reply TwoArizonaPedes 2 points 3 hours ago Dphrepaulezz is a rapper known as \"A.R. The Believer.\" Music, musical instruments and singing are haram according to the Quran and sunnah. permalink award report block reply redditadminssuckit 2 points 3 hours ago Sue the state for knowingly employing a terrorist permalink award report block reply blueballs43 1 points 2 hours ago SO THIS IS A SURPRISE? REALLY???\nKENITIC-MATH IS COMING permalink award report block reply Treefiddydiddy 1 points 3 hours ago thank fuck i'm sitting down otherwise i'd have fallen over with the shawk permalink award report block reply PatriotDescendant 1 points 2 hours ago That motherfucker needs hard time! permalink award report block reply dres3 1 points 2 hours ago If you try to sound it out, it sounds like trying to do 'Jihad Da Rapper' but thick on the accent. permalink award report block reply Lady_MaGa 1 points 3 hours ago My first reaction upon seeing that guy's face was:  Charles Manson? permalink award report block reply TDAF 1 points 3 hours ago The victim reminds me of Reginald Denny. permalink parent award report block reply SavingPrivateGrace 1 points 3 hours ago I support it but I'm not a huge fan of sticking restickies more than 6 hours old.  Mostly because what I said hours ago...the news might have changed and maybe I'm not here to defend myself.  Is there a way to \"flair\" this post and those in the future?  It just something I don't trust and may stop me from contributing on Hot in the moment. permalink award report block reply 26magarat 1 points 2 hours ago If this was fiction, the editor would gently point out that a name change might be more convincing. permalink award report block reply taytaytay 1 points 2 hours ago Motherfucker has them AOC eyes permalink award report block reply learntocode 1 points 2 hours ago Did someone yell \"Here comes the paaaaiiiinnn!!!\" Snake Eyes (1998) permalink award report block reply npc_1234 1 points 17 minutes ago dirka dirka permalink award report block reply projectarcturus1 1 points 2 hours ago These inbred psychopaths need to be deported. permalink award report block reply Prandogolio 1 points 2 hours ago No, they need to be exterminated. permalink parent award report block reply yarg 1 points 3 hours ago If your first name is Jihad, you should be the first to go, \"legal citizen\" or not. permalink award report block reply malooch 1 points 2 hours ago There’s some real fucking scum that we’ve allowed into our country permalink award report block reply NoWorries77 0 points 3 hours ago Is this Ireland? permalink award report block reply Ugh3rdaccount -3 points 12 hours ago Trump just said we need him though because we’re stupid. 🤷🏼‍♂️ permalink award report block reply ThisTrainHasNoBrakes -1 points 3 hours ago Down voters are fags…this comment isn’t far off reality and it was obviously not meant to be literal. Maybe “Jihad” can help us process our 80 year mortgages. permalink parent award report block reply LearnAboutRoaches 0 points 3 hours ago There is no verifiable evidence that Donald Trump said, \"We need him though because we're stupid\". This quote is very similar to a long-running, widely debunked internet meme that falsely attributes a statement to Trump from a supposed 1998 People magazine interview: \"If I were to run, I'd run as a Republican. They're the dumbest group of voters in the country. They believe anything on Fox News. I could lie and they'd still eat it up. I bet my numbers would be terrific\". Fact-checking organizations, including Snopes and FactCheck.org, have confirmed this specific quote is fake and does not appear in any known source. If you heard this quote recently, it is likely a misattribution or a fabricated statement, as no credible news sources have reported him saying this. permalink parent award report block reply ThisTrainHasNoBrakes 1 points 1 hour ago Are you retarded, or just ignorant?  The original comment I replied to was obvious hyperbole - not intended to be literal.  But it expressed a pretty general idea of what he said. I stated as much. Go watch Trump’s interview with Laura Ingram.  It’s awful and the worst I’ve heard from him in 10 years.  Then come tell me we are mischaracterizing what he said this week. permalink parent award report block reply LearnAboutRoaches 1 points 45 minutes ago Shut the fuck up you fucking ass clown. (not intended to be taken literally) permalink parent award report block reply AlmostFullyDilated 1 points 3 hours ago Comment removed by community moderators. permalink award report block reply\nSuperDuperBasedMD 44 points 13 hours ago denaturalize and deport permalink award report block reply rebuildingMyself 20 points 10 hours ago His victim wasn't Jewish so I'm not optimistic permalink parent award report block reply God-is-good 12 points 9 hours ago I heard the necklace was a cross and the punched man was Christian. permalink parent award report block reply Bboop 2 points 2 hours ago Crucifix permalink parent award report block reply Mhmm2MoreWeeks -5 points 3 hours ago If you were to study history you would know that those who go against Jews have lost every single time. The enemies of the Jews are against God. The trend will continue. permalink parent award report block reply vongregormench 9 points 3 hours ago Then how did the Jews get run out of the Middle East? Israel is a conquered nation in most of the Bible. Jews that are faithful to god get god’s blessing. Globalist atheist Jews that wage covert ethnic wars against others do not get god’s blessing. permalink parent award report block reply shadypollster 3 points 2 hours ago Nice distinction. Because it's true. permalink parent award report block reply diverscale 1 points 2 hours ago Well said permalink parent award report block reply jadepoemm 2 points 3 hours ago Better check for any gas leaks in his house, cant be too careful! permalink parent award report block reply MissingTrump 2 points 3 hours ago And maybe not import any retards named Jihad? permalink parent award report block reply Prandogolio 1 points 2 hours ago I'm over that.  Hang them. permalink parent award report block reply\nrebuildingMyself 20 points 10 hours ago His victim wasn't Jewish so I'm not optimistic permalink parent award report block reply God-is-good 12 points 9 hours ago I heard the necklace was a cross and the punched man was Christian. permalink parent award report block reply Bboop 2 points 2 hours ago Crucifix permalink parent award report block reply Mhmm2MoreWeeks -5 points 3 hours ago If you were to study history you would know that those who go against Jews have lost every single time. The enemies of the Jews are against God. The trend will continue. permalink parent award report block reply vongregormench 9 points 3 hours ago Then how did the Jews get run out of the Middle East? Israel is a conquered nation in most of the Bible. Jews that are faithful to god get god’s blessing. Globalist atheist Jews that wage covert ethnic wars against others do not get god’s blessing. permalink parent award report block reply shadypollster 3 points 2 hours ago Nice distinction. Because it's true. permalink parent award report block reply diverscale 1 points 2 hours ago Well said permalink parent award report block reply\nGod-is-good 12 points 9 hours ago I heard the necklace was a cross and the punched man was Christian. permalink parent award report block reply Bboop 2 points 2 hours ago Crucifix permalink parent award report block reply\nBboop 2 points 2 hours ago Crucifix permalink parent award report block reply\nMhmm2MoreWeeks -5 points 3 hours ago If you were to study history you would know that those who go against Jews have lost every single time. The enemies of the Jews are against God. The trend will continue. permalink parent award report block reply vongregormench 9 points 3 hours ago Then how did the Jews get run out of the Middle East? Israel is a conquered nation in most of the Bible. Jews that are faithful to god get god’s blessing. Globalist atheist Jews that wage covert ethnic wars against others do not get god’s blessing. permalink parent award report block reply shadypollster 3 points 2 hours ago Nice distinction. Because it's true. permalink parent award report block reply diverscale 1 points 2 hours ago Well said permalink parent award report block reply\nvongregormench 9 points 3 hours ago Then how did the Jews get run out of the Middle East? Israel is a conquered nation in most of the Bible. Jews that are faithful to god get god’s blessing. Globalist atheist Jews that wage covert ethnic wars against others do not get god’s blessing. permalink parent award report block reply shadypollster 3 points 2 hours ago Nice distinction. Because it's true. permalink parent award report block reply diverscale 1 points 2 hours ago Well said permalink parent award report block reply\nshadypollster 3 points 2 hours ago Nice distinction. Because it's true. permalink parent award report block reply\ndiverscale 1 points 2 hours ago Well said permalink parent award report block reply\njadepoemm 2 points 3 hours ago Better check for any gas leaks in his house, cant be too careful! permalink parent award report block reply\nMissingTrump 2 points 3 hours ago And maybe not import any retards named Jihad? permalink parent award report block reply\nPrandogolio 1 points 2 hours ago I'm over that.  Hang them. permalink parent award report block reply\ntwentytwentyfourr 19 points 12 hours ago works for the gov, shocker permalink award report block reply God-is-good 11 points 9 hours ago Lots coming out recently about the government funding degenerate rappers. With usaid drying up the billboards have been absent rap mysteriously. https://www.cbc.ca/arts/commotion/how-did-rap-fall-out-of-the-billboard-top-40-9.6974039 permalink parent award report block reply LearnAboutRoaches 3 points 2 hours ago Hilarious how a bored person of color playing on his phone for a couple hours one night instantly gives them the title of \"rapper\" USAid drying up? Lol no this pos is not a rapper, has nothing to do with rap as a genre and even less to do with billboard permalink parent award report block reply rebuildingMyself 2 points 6 hours ago Tax dollars hard at work as always permalink parent award report block reply\nGod-is-good 11 points 9 hours ago Lots coming out recently about the government funding degenerate rappers. With usaid drying up the billboards have been absent rap mysteriously. https://www.cbc.ca/arts/commotion/how-did-rap-fall-out-of-the-billboard-top-40-9.6974039 permalink parent award report block reply LearnAboutRoaches 3 points 2 hours ago Hilarious how a bored person of color playing on his phone for a couple hours one night instantly gives them the title of \"rapper\" USAid drying up? Lol no this pos is not a rapper, has nothing to do with rap as a genre and even less to do with billboard permalink parent award report block reply\nLearnAboutRoaches 3 points 2 hours ago Hilarious how a bored person of color playing on his phone for a couple hours one night instantly gives them the title of \"rapper\" USAid drying up? Lol no this pos is not a rapper, has nothing to do with rap as a genre and even less to do with billboard permalink parent award report block reply\nrebuildingMyself 2 points 6 hours ago Tax dollars hard at work as always permalink parent award report block reply\nBigstick7 12 points 8 hours ago Conservatives need to start training with firearms and hand to hand (boxing, jit jitsu, something), and stay frosty. permalink award report block reply penguinjay1212 3 points 6 hours ago Why do you say he wasnt? Dude had 3 to 4 different fights. Supporting each other under lopsided ruling in crazed jurisdictions seems way more important. Dont put yourself in that situation to begin with. Dude shoulda had like 10 friends ready to stomp the life out of those people. Don't go protesting alone. Buddy system minimum. permalink parent award report block reply AlmostFullyDilated 0 points 3 hours ago why are you gay? permalink parent award report block reply Bigstick7 1 points 2 hours ago Good one. permalink parent award report block reply\npenguinjay1212 3 points 6 hours ago Why do you say he wasnt? Dude had 3 to 4 different fights. Supporting each other under lopsided ruling in crazed jurisdictions seems way more important. Dont put yourself in that situation to begin with. Dude shoulda had like 10 friends ready to stomp the life out of those people. Don't go protesting alone. Buddy system minimum. permalink parent award report block reply\nAlmostFullyDilated 0 points 3 hours ago why are you gay? permalink parent award report block reply Bigstick7 1 points 2 hours ago Good one. permalink parent award report block reply\nBigstick7 1 points 2 hours ago Good one. permalink parent award report block reply\nBadfinz_FL 12 points 13 hours ago Time for jihad to be deported to GITMO permalink award report block reply BoomShtick 3 points 3 hours ago Deport to the gulf of America permalink parent award report block reply\nBoomShtick 3 points 3 hours ago Deport to the gulf of America permalink parent award report block reply\nRudeFrog 8 points 10 hours ago Will he even be arrested? permalink award report block reply RedStoneDeepState 3 points 3 hours ago He was already. The cops arrested everyone involved, then charged this guy and released the victim. permalink parent award report block reply trumpORbust 3 points 2 hours ago Charges will be dropped in a few days when everyone has moved on permalink parent award report block reply\nRedStoneDeepState 3 points 3 hours ago He was already. The cops arrested everyone involved, then charged this guy and released the victim. permalink parent award report block reply trumpORbust 3 points 2 hours ago Charges will be dropped in a few days when everyone has moved on permalink parent award report block reply\ntrumpORbust 3 points 2 hours ago Charges will be dropped in a few days when everyone has moved on permalink parent award report block reply\nchuey_316 8 points 7 hours ago The left have openly and fully demonstrated that they cannot control their mental illness and are threats. Anyone who can legally carry needs to stay strapped. The victim would have been completely justified in giving this goat fucker a hole in the chest. permalink award report block reply rebuildingMyself 1 points 6 hours ago At this point I think even the Democrat machine knows they lost control of the radicals on their side permalink parent award report block reply\nrebuildingMyself 1 points 6 hours ago At this point I think even the Democrat machine knows they lost control of the radicals on their side permalink parent award report block reply\nDev404 5 points 8 hours ago Gee, another beloved muslim animal that leftists eagerly bend over for. How surprising. permalink award report block reply\nPats5x 5 points 8 hours ago they all work in academia, ngos or in government permalink award report block reply TwoArizonaPedes 2 points 3 hours ago Or medicine. permalink parent award report block reply\nTwoArizonaPedes 2 points 3 hours ago Or medicine. permalink parent award report block reply\nBBvarn 4 points 10 hours ago Perfect resume for democrat politician. permalink award report block reply\nShitsbrokeyo 4 points 7 hours ago Criminal offense. Deport permalink award report block reply\nFailSayf 2 points 2 hours ago Looks like a cave man. They’re all so ugly. permalink award report block reply\nSpellingContable 2 points 6 hours ago \"dEvErSiTy iS oUr sTrEnGtH\" permalink award report block reply Oleander 3 points 3 hours ago When they say \"our\", they aren't including you. For them it is a strength, to use against you. permalink parent award report block reply SpellingContable 1 points 3 hours ago \"gAyS fOr iSlAm\" permalink parent award report block reply\nOleander 3 points 3 hours ago When they say \"our\", they aren't including you. For them it is a strength, to use against you. permalink parent award report block reply SpellingContable 1 points 3 hours ago \"gAyS fOr iSlAm\" permalink parent award report block reply\nSpellingContable 1 points 3 hours ago \"gAyS fOr iSlAm\" permalink parent award report block reply\nhansgruber7 2 points 3 hours ago DOJ needs to make an example of him under Antifa terrorism federal charges.  Enough tolerating Leftist terrorist violence like this. permalink award report block reply\nTwoArizonaPedes 2 points 3 hours ago Dphrepaulezz is a rapper known as \"A.R. The Believer.\" Music, musical instruments and singing are haram according to the Quran and sunnah. permalink award report block reply\nredditadminssuckit 2 points 3 hours ago Sue the state for knowingly employing a terrorist permalink award report block reply\nblueballs43 1 points 2 hours ago SO THIS IS A SURPRISE? REALLY???\nKENITIC-MATH IS COMING permalink award report block reply\nTreefiddydiddy 1 points 3 hours ago thank fuck i'm sitting down otherwise i'd have fallen over with the shawk permalink award report block reply\nPatriotDescendant 1 points 2 hours ago That motherfucker needs hard time! permalink award report block reply\ndres3 1 points 2 hours ago If you try to sound it out, it sounds like trying to do 'Jihad Da Rapper' but thick on the accent. permalink award report block reply\nLady_MaGa 1 points 3 hours ago My first reaction upon seeing that guy's face was:  Charles Manson? permalink award report block reply TDAF 1 points 3 hours ago The victim reminds me of Reginald Denny. permalink parent award report block reply\nTDAF 1 points 3 hours ago The victim reminds me of Reginald Denny. permalink parent award report block reply\nSavingPrivateGrace 1 points 3 hours ago I support it but I'm not a huge fan of sticking restickies more than 6 hours old.  Mostly because what I said hours ago...the news might have changed and maybe I'm not here to defend myself.  Is there a way to \"flair\" this post and those in the future?  It just something I don't trust and may stop me from contributing on Hot in the moment. permalink award report block reply\n26magarat 1 points 2 hours ago If this was fiction, the editor would gently point out that a name change might be more convincing. permalink award report block reply\ntaytaytay 1 points 2 hours ago Motherfucker has them AOC eyes permalink award report block reply\nlearntocode 1 points 2 hours ago Did someone yell \"Here comes the paaaaiiiinnn!!!\" Snake Eyes (1998) permalink award report block reply\nnpc_1234 1 points 17 minutes ago dirka dirka permalink award report block reply\nprojectarcturus1 1 points 2 hours ago These inbred psychopaths need to be deported. permalink award report block reply Prandogolio 1 points 2 hours ago No, they need to be exterminated. permalink parent award report block reply\nPrandogolio 1 points 2 hours ago No, they need to be exterminated. permalink parent award report block reply\nyarg 1 points 3 hours ago If your first name is Jihad, you should be the first to go, \"legal citizen\" or not. permalink award report block reply\nmalooch 1 points 2 hours ago There’s some real fucking scum that we’ve allowed into our country permalink award report block reply\nNoWorries77 0 points 3 hours ago Is this Ireland? permalink award report block reply\nUgh3rdaccount -3 points 12 hours ago Trump just said we need him though because we’re stupid. 🤷🏼‍♂️ permalink award report block reply ThisTrainHasNoBrakes -1 points 3 hours ago Down voters are fags…this comment isn’t far off reality and it was obviously not meant to be literal. Maybe “Jihad” can help us process our 80 year mortgages. permalink parent award report block reply LearnAboutRoaches 0 points 3 hours ago There is no verifiable evidence that Donald Trump said, \"We need him though because we're stupid\". This quote is very similar to a long-running, widely debunked internet meme that falsely attributes a statement to Trump from a supposed 1998 People magazine interview: \"If I were to run, I'd run as a Republican. They're the dumbest group of voters in the country. They believe anything on Fox News. I could lie and they'd still eat it up. I bet my numbers would be terrific\". Fact-checking organizations, including Snopes and FactCheck.org, have confirmed this specific quote is fake and does not appear in any known source. If you heard this quote recently, it is likely a misattribution or a fabricated statement, as no credible news sources have reported him saying this. permalink parent award report block reply ThisTrainHasNoBrakes 1 points 1 hour ago Are you retarded, or just ignorant?  The original comment I replied to was obvious hyperbole - not intended to be literal.  But it expressed a pretty general idea of what he said. I stated as much. Go watch Trump’s interview with Laura Ingram.  It’s awful and the worst I’ve heard from him in 10 years.  Then come tell me we are mischaracterizing what he said this week. permalink parent award report block reply LearnAboutRoaches 1 points 45 minutes ago Shut the fuck up you fucking ass clown. (not intended to be taken literally) permalink parent award report block reply\nThisTrainHasNoBrakes -1 points 3 hours ago Down voters are fags…this comment isn’t far off reality and it was obviously not meant to be literal. Maybe “Jihad” can help us process our 80 year mortgages. permalink parent award report block reply LearnAboutRoaches 0 points 3 hours ago There is no verifiable evidence that Donald Trump said, \"We need him though because we're stupid\". This quote is very similar to a long-running, widely debunked internet meme that falsely attributes a statement to Trump from a supposed 1998 People magazine interview: \"If I were to run, I'd run as a Republican. They're the dumbest group of voters in the country. They believe anything on Fox News. I could lie and they'd still eat it up. I bet my numbers would be terrific\". Fact-checking organizations, including Snopes and FactCheck.org, have confirmed this specific quote is fake and does not appear in any known source. If you heard this quote recently, it is likely a misattribution or a fabricated statement, as no credible news sources have reported him saying this. permalink parent award report block reply ThisTrainHasNoBrakes 1 points 1 hour ago Are you retarded, or just ignorant?  The original comment I replied to was obvious hyperbole - not intended to be literal.  But it expressed a pretty general idea of what he said. I stated as much. Go watch Trump’s interview with Laura Ingram.  It’s awful and the worst I’ve heard from him in 10 years.  Then come tell me we are mischaracterizing what he said this week. permalink parent award report block reply LearnAboutRoaches 1 points 45 minutes ago Shut the fuck up you fucking ass clown. (not intended to be taken literally) permalink parent award report block reply\nLearnAboutRoaches 0 points 3 hours ago There is no verifiable evidence that Donald Trump said, \"We need him though because we're stupid\". This quote is very similar to a long-running, widely debunked internet meme that falsely attributes a statement to Trump from a supposed 1998 People magazine interview: \"If I were to run, I'd run as a Republican. They're the dumbest group of voters in the country. They believe anything on Fox News. I could lie and they'd still eat it up. I bet my numbers would be terrific\". Fact-checking organizations, including Snopes and FactCheck.org, have confirmed this specific quote is fake and does not appear in any known source. If you heard this quote recently, it is likely a misattribution or a fabricated statement, as no credible news sources have reported him saying this. permalink parent award report block reply ThisTrainHasNoBrakes 1 points 1 hour ago Are you retarded, or just ignorant?  The original comment I replied to was obvious hyperbole - not intended to be literal.  But it expressed a pretty general idea of what he said. I stated as much. Go watch Trump’s interview with Laura Ingram.  It’s awful and the worst I’ve heard from him in 10 years.  Then come tell me we are mischaracterizing what he said this week. permalink parent award report block reply LearnAboutRoaches 1 points 45 minutes ago Shut the fuck up you fucking ass clown. (not intended to be taken literally) permalink parent award report block reply\nThisTrainHasNoBrakes 1 points 1 hour ago Are you retarded, or just ignorant?  The original comment I replied to was obvious hyperbole - not intended to be literal.  But it expressed a pretty general idea of what he said. I stated as much. Go watch Trump’s interview with Laura Ingram.  It’s awful and the worst I’ve heard from him in 10 years.  Then come tell me we are mischaracterizing what he said this week. permalink parent award report block reply LearnAboutRoaches 1 points 45 minutes ago Shut the fuck up you fucking ass clown. (not intended to be taken literally) permalink parent award report block reply\nLearnAboutRoaches 1 points 45 minutes ago Shut the fuck up you fucking ass clown. (not intended to be taken literally) permalink parent award report block reply\nAlmostFullyDilated 1 points 3 hours ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:43:10.414385Z"
}