{
  "id": "8185590",
  "title": "57Dear President Trump. I am one of your biggest supporter. Please stop lying to us.posted2 hours ag",
  "url": "https://patriots.win/p/1ARK9nP5Qe/dear-president-trump-i-am-one-of/c",
  "content": "58 Dear President Trump. I am one of your biggest supporter. Please stop lying to us. posted 2 hours ago by diestanding 21 comments award share report block You say Thanksgiving is 25% off and its the biggest in history. I am out of a job and day after day I apply and call people looking for one. Yes, it is all Biden's fault but you are our greatest president. Don't lie to us. I know you are giving your all but the people are suffering. Most of my neighbors are out of work. All the illegals are everywhere. Indians have over $100k jobs while we are trying to make ends meet. I have been cutting back meals to feed my child. We don't get handouts.\n21 comments Sort by Top Top New Worst Old Save fightfightfightx 5 points 46 minutes ago he answers to Israel so he doesnt care wish reality was different but the US was taken over by Bolsheviks (infinitely worse than nazis, btw) over the last 100 years and Trump ain't fixing it permalink award report block reply starjello 2 points 39 minutes ago Well golly gee. Trump lied and q-tarts died permalink award report block reply tt777 2 points 45 minutes ago Send that to the white house. permalink award report block reply GeorgeBailey 2 points 2 hours ago This exactly describes what me and many of my white male peers are going through. We were laid off and replaced with H1-Bs, and now those H1-Bs are buying new homes and cars while us Americans are looking for jobs and tightening our belts on spending. If Trump wants America to be more like India and China, he’s gonna get it. permalink award report block reply Madman13 1 points 2 hours ago That's because you have no talent permalink award report block reply fskfsk -2 points 2 hours ago The reasons Indians have $100k+ jobs they aren't qualified for is that Indians always look out for other Indians, and only hire other Indians.  If White people want a decent living, they should start their own country rather than whining about Indian-controlled countries like the USA. permalink award report block reply sobriquet 1 points 27 minutes ago I hear Argentina is nice this time of year. permalink parent award report block reply possibletower -9 points 2 hours ago Go move back to Europe, stormfag permalink parent award report block reply possibletower -5 points 2 hours ago Ron DeFaggot will never be your POTUS permalink award report block reply Grindelwald -7 points 2 hours ago Doomer.  Go to stupid schools, come out stupid.  Let corporations outsource to find cheap labor, they get cheap labor. Indians hire Indians.  They are ruthless and do not care about DEI (non-Indians) after they infiltrate businesses. permalink award report block reply Marat1792 5 points 2 hours ago shut the fuck up. permalink parent award report block reply Grindelwald -2 points 2 hours ago Get a real job permalink parent award report block reply Nezmith 3 points 2 hours ago Groomer permalink parent award report block reply possibletower 0 points 2 hours ago OP is a DeSimp. They really wanted the shutdown to continue because they wanted EBT riots to happen so they can blame Trump. Notice how after Trump solved that they now want us to forget the humiliation of Schumer and the Democrats so they throw shit at the wall and hope it sticks regarding whining about Trump. Gaslighting SOBs who are DeSimps permalink parent award report block reply MrUnderhill 1 points 1 minute ago Lots of whining, pissing and moaning lately. It's like PDW is infested. permalink parent award report block reply Scipio_Americanus 1 points 2 hours ago I wanted EBT riots because I was hoping the 'boons would end each other and raise the national IQ. permalink parent award report block reply davidanderson90 0 points 2 hours ago Are you seriously equating education with intelligence? Universities are centers for leftist indoctrination. The higher one advances, the stupider he or she becomes. permalink parent award report block reply Grindelwald 1 points 2 hours ago No.  I am speaking about fixing the “education” system so that student get a useful and intelligent education.  They come out stupid today.  Everyone at Harvard gets an A  in sanctimonious degrees like “sustainability” Until then we need to immediately fill the void. permalink parent award report block reply davidanderson90 1 points 2 hours ago There are plenty of White coders and engineers already here. There is no void. It is artificial and done either by those who sell us out to save money on cheaper labor or those who want us replaced permalink parent award report block reply Grindelwald 1 points 2 hours ago Apparently not. permalink parent award report block reply view 1 more comments...\nfightfightfightx 5 points 46 minutes ago he answers to Israel so he doesnt care wish reality was different but the US was taken over by Bolsheviks (infinitely worse than nazis, btw) over the last 100 years and Trump ain't fixing it permalink award report block reply\nstarjello 2 points 39 minutes ago Well golly gee. Trump lied and q-tarts died permalink award report block reply\ntt777 2 points 45 minutes ago Send that to the white house. permalink award report block reply\nGeorgeBailey 2 points 2 hours ago This exactly describes what me and many of my white male peers are going through. We were laid off and replaced with H1-Bs, and now those H1-Bs are buying new homes and cars while us Americans are looking for jobs and tightening our belts on spending. If Trump wants America to be more like India and China, he’s gonna get it. permalink award report block reply\nMadman13 1 points 2 hours ago That's because you have no talent permalink award report block reply\nfskfsk -2 points 2 hours ago The reasons Indians have $100k+ jobs they aren't qualified for is that Indians always look out for other Indians, and only hire other Indians.  If White people want a decent living, they should start their own country rather than whining about Indian-controlled countries like the USA. permalink award report block reply sobriquet 1 points 27 minutes ago I hear Argentina is nice this time of year. permalink parent award report block reply possibletower -9 points 2 hours ago Go move back to Europe, stormfag permalink parent award report block reply\nsobriquet 1 points 27 minutes ago I hear Argentina is nice this time of year. permalink parent award report block reply\npossibletower -9 points 2 hours ago Go move back to Europe, stormfag permalink parent award report block reply\npossibletower -5 points 2 hours ago Ron DeFaggot will never be your POTUS permalink award report block reply\nGrindelwald -7 points 2 hours ago Doomer.  Go to stupid schools, come out stupid.  Let corporations outsource to find cheap labor, they get cheap labor. Indians hire Indians.  They are ruthless and do not care about DEI (non-Indians) after they infiltrate businesses. permalink award report block reply Marat1792 5 points 2 hours ago shut the fuck up. permalink parent award report block reply Grindelwald -2 points 2 hours ago Get a real job permalink parent award report block reply Nezmith 3 points 2 hours ago Groomer permalink parent award report block reply possibletower 0 points 2 hours ago OP is a DeSimp. They really wanted the shutdown to continue because they wanted EBT riots to happen so they can blame Trump. Notice how after Trump solved that they now want us to forget the humiliation of Schumer and the Democrats so they throw shit at the wall and hope it sticks regarding whining about Trump. Gaslighting SOBs who are DeSimps permalink parent award report block reply MrUnderhill 1 points 1 minute ago Lots of whining, pissing and moaning lately. It's like PDW is infested. permalink parent award report block reply Scipio_Americanus 1 points 2 hours ago I wanted EBT riots because I was hoping the 'boons would end each other and raise the national IQ. permalink parent award report block reply davidanderson90 0 points 2 hours ago Are you seriously equating education with intelligence? Universities are centers for leftist indoctrination. The higher one advances, the stupider he or she becomes. permalink parent award report block reply Grindelwald 1 points 2 hours ago No.  I am speaking about fixing the “education” system so that student get a useful and intelligent education.  They come out stupid today.  Everyone at Harvard gets an A  in sanctimonious degrees like “sustainability” Until then we need to immediately fill the void. permalink parent award report block reply davidanderson90 1 points 2 hours ago There are plenty of White coders and engineers already here. There is no void. It is artificial and done either by those who sell us out to save money on cheaper labor or those who want us replaced permalink parent award report block reply Grindelwald 1 points 2 hours ago Apparently not. permalink parent award report block reply view 1 more comments...\nMarat1792 5 points 2 hours ago shut the fuck up. permalink parent award report block reply Grindelwald -2 points 2 hours ago Get a real job permalink parent award report block reply\nGrindelwald -2 points 2 hours ago Get a real job permalink parent award report block reply\nNezmith 3 points 2 hours ago Groomer permalink parent award report block reply\npossibletower 0 points 2 hours ago OP is a DeSimp. They really wanted the shutdown to continue because they wanted EBT riots to happen so they can blame Trump. Notice how after Trump solved that they now want us to forget the humiliation of Schumer and the Democrats so they throw shit at the wall and hope it sticks regarding whining about Trump. Gaslighting SOBs who are DeSimps permalink parent award report block reply MrUnderhill 1 points 1 minute ago Lots of whining, pissing and moaning lately. It's like PDW is infested. permalink parent award report block reply Scipio_Americanus 1 points 2 hours ago I wanted EBT riots because I was hoping the 'boons would end each other and raise the national IQ. permalink parent award report block reply\nMrUnderhill 1 points 1 minute ago Lots of whining, pissing and moaning lately. It's like PDW is infested. permalink parent award report block reply\nScipio_Americanus 1 points 2 hours ago I wanted EBT riots because I was hoping the 'boons would end each other and raise the national IQ. permalink parent award report block reply\ndavidanderson90 0 points 2 hours ago Are you seriously equating education with intelligence? Universities are centers for leftist indoctrination. The higher one advances, the stupider he or she becomes. permalink parent award report block reply Grindelwald 1 points 2 hours ago No.  I am speaking about fixing the “education” system so that student get a useful and intelligent education.  They come out stupid today.  Everyone at Harvard gets an A  in sanctimonious degrees like “sustainability” Until then we need to immediately fill the void. permalink parent award report block reply davidanderson90 1 points 2 hours ago There are plenty of White coders and engineers already here. There is no void. It is artificial and done either by those who sell us out to save money on cheaper labor or those who want us replaced permalink parent award report block reply Grindelwald 1 points 2 hours ago Apparently not. permalink parent award report block reply view 1 more comments...\nGrindelwald 1 points 2 hours ago No.  I am speaking about fixing the “education” system so that student get a useful and intelligent education.  They come out stupid today.  Everyone at Harvard gets an A  in sanctimonious degrees like “sustainability” Until then we need to immediately fill the void. permalink parent award report block reply davidanderson90 1 points 2 hours ago There are plenty of White coders and engineers already here. There is no void. It is artificial and done either by those who sell us out to save money on cheaper labor or those who want us replaced permalink parent award report block reply Grindelwald 1 points 2 hours ago Apparently not. permalink parent award report block reply view 1 more comments...\ndavidanderson90 1 points 2 hours ago There are plenty of White coders and engineers already here. There is no void. It is artificial and done either by those who sell us out to save money on cheaper labor or those who want us replaced permalink parent award report block reply Grindelwald 1 points 2 hours ago Apparently not. permalink parent award report block reply view 1 more comments...\nGrindelwald 1 points 2 hours ago Apparently not. permalink parent award report block reply view 1 more comments..."
}