{
  "id": "1ARK56kfNn",
  "url": "https://patriots.win/p/1ARK56kfNn/immigration-should-be-limited-ex/c",
  "content": "675 Immigration should be limited exclusively the countries who have the same cultures and values as ours posted 4 days ago by Govtizbad 40 comments award share download report block\n40 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Bullet3250 22 points 4 days ago Pre 1965 Immigration Act. !! A Law passed by the work of Ted Kennedy - while the Nation was still in shock/mourning/recovering from the JFK assassination. it's is what the DEMOCRATS DO ALL THE TIME - they take advantage during 'emotionally weak period' for Americans.... throwing shit on the walls hoping something sticks. Begging, lying, intimidating, - anything to get what they want, which is always something BAD for AMERICA. And now the Damage is clear. permalink award report block reply TrumpAndGodWin 2 points 4 days ago There's a recording of a lesser elite named George Green talking about being in depopulation club with Ted. Ted asked to rape his young daughter, other members were hard drug users etc so he quit once he realized they're worse than the people they wanted to depopulate. permalink parent award report block reply MastaJoda 13 points 4 days ago Ron DeStiltshoes is 100% correct. permalink award report block reply Iremembermypassword 3 points 4 days ago He has been taking his Based pills again. permalink parent award report block reply Pearcesarrow 3 points 4 days ago It’s getting close to who I would support more in ‘28, Vance or DeSantis. I Love Vance and he probably has a much better chance in the general but damn does DeSantis keep doing the real work of governing down here. It sucks you can’t 100% trust any politician though permalink parent award report block reply Filo76 6 points 4 days ago DeSantis is a great governor. But he is a terrible presidential candidate. He was a puppet for the establishment when he ran against Trump. No way I’m voting for him as president because he would sell out in a heartbeat. permalink parent award report block reply Pearcesarrow 3 points 4 days ago I get it. It took me a long time to mellow on that. I think he got some bad advice from hs wife. I wouldn’t trust either one  totally but at least we’ve seen DeSantis govern. He is a terrible candidate though permalink parent award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply HockeyMom4Trump 8 points 4 days ago It’s not good. We imported the Third World. There is a reason they were Third World. permalink award report block reply BenDoverAssho 7 points 4 days ago The problem is that Communist Democrats have a very different culture and set of values than America First Constitutionalists/MAGA. Now that the Democrats have formed a, \" Communist-\nIslamist Coalition,  they are ACTIVELY facilitating the importation of goatfucking Middle Eastern street shitters. permalink award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply ModernKnight 6 points 4 days ago There is a bit of nuance here.  You CAN take in a VERY LIMITED number of high-achieving people from other cultures.  However, the numbers HAVE to be very small- as in there should never be less than 98% of the local culture, and those you bring in CAN NOT be put in close proximity to others of their culture.  It has to be set up so that following their own culture makes them completely alone in their practices.  It makes it so they MUST integrate in order to have any kind of community. permalink award report block reply BenDoverAssho 2 points 4 days ago This! permalink parent award report block reply Hoodlum 2 points 4 days ago It's not worth the effort to sift through shit to find a golden nugget. It would be infinitely better to stick to only allowing countries with similar cultures to come to the US. It would be even better than that to just halt ALL immigration indefinitely. permalink parent award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply UnknownUserName 6 points 4 days ago Ron is much more MAGA than the guy married to the indian permalink award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply Aggrieved03 5 points 4 days ago I know 2 other people with a blood feud who should all be deported. permalink award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply DITTOPatriot 4 points 4 days ago Damn he used the word tribal. What about the tribe that hates Christians? permalink award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply AgnesDomini 3 points 4 days ago Where's the lie? permalink award report block reply knnbccb 3 points 4 days ago No third world black/brown trash. And start thinning the herd already in the country. Their kind breeds like rabbits, and worse, your taxpayer money probably helps to feed and raise their brats. If you let them be, in one generation the country will be reduced to their level. It's a numbers game, and if you can't outbreeed them, deport or cull them. Many ways to thin the herd, many ways to skin the cat. You can find a way if you are determined enough. permalink award report block reply HairSniffer 3 points 4 days ago https://x.com/RonDeSantis/status/1986906445707956723 permalink award report block reply deleted 3 points 4 days ago the-new-style 2 points 4 days ago Even as a Brit, came to post same. There's a reason we are called \"two nations divided by a common language\". And what about former PM Rishi Sunak, is he part of this \"common culture\"? Or Jeremy \"our friends Hamas\" Corbyn permalink parent award report block reply DJTXLV 2 points 4 days ago Ron is ramping up. permalink award report block reply greatpumpkin 2 points 4 days ago Immigration should be ~ limited exclusively the countries who have the same cultures and values as ours ~ eliminated. Fixed it. permalink award report block reply Dantalian 2 points 4 days ago That's EXACTLY how our immigration laws worked, until the Democrats' 1965 Hart-Cellar Act!!!! permalink award report block reply Upset_Grape 2 points 4 days ago I would deport an atheist citizen and replace them with an Orthodox Christian immigrant in my ideal immigration law. Everything is filtered first through your fundamental worldview. permalink award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply Mungo 1 points 4 days ago The races were never meant to mix long term. Period. permalink award report block reply mullethawk 1 points 4 days ago That's a spicy meatball! permalink award report block reply weltallic 1 points 4 days ago Recommending permalink award report block reply Crappydatum 1 points 4 days ago \"Mass\" immigration of Any kind is a problem No Republican ever claimed that, it's a disingenuous statement permalink award report block reply pepewarrior0102 1 points 4 days ago Genetics* permalink award report block reply IncensedThurible 1 points 4 days ago Can we limit NYC Immigrants to FL? permalink award report block reply 2016TrumpMAGA 1 points 4 days ago Too bad there are no countries like that left because they all imported mass amounts of third world scum. permalink award report block reply Bilbobaggins 1 points 4 days ago So…. No immigration then? No other countries share my interpretation of what a constitutional republic should be permalink award report block reply 1True-translation 0 points 4 days ago Quoting OP from another thread: \"Nobody is America first. Everybody knows America sucks and both Israel and Palestine are better countries than America\" Btw, this guy is formerly u/hillaryizgay . He's likely not actually pro Israel (or anything) he's just here to stir shit and cause trouble. This guy was banned then unbanned within an hour. Who is this guy mods? permalink award report block reply\nBullet3250 22 points 4 days ago Pre 1965 Immigration Act. !! A Law passed by the work of Ted Kennedy - while the Nation was still in shock/mourning/recovering from the JFK assassination. it's is what the DEMOCRATS DO ALL THE TIME - they take advantage during 'emotionally weak period' for Americans.... throwing shit on the walls hoping something sticks. Begging, lying, intimidating, - anything to get what they want, which is always something BAD for AMERICA. And now the Damage is clear. permalink award report block reply TrumpAndGodWin 2 points 4 days ago There's a recording of a lesser elite named George Green talking about being in depopulation club with Ted. Ted asked to rape his young daughter, other members were hard drug users etc so he quit once he realized they're worse than the people they wanted to depopulate. permalink parent award report block reply\nTrumpAndGodWin 2 points 4 days ago There's a recording of a lesser elite named George Green talking about being in depopulation club with Ted. Ted asked to rape his young daughter, other members were hard drug users etc so he quit once he realized they're worse than the people they wanted to depopulate. permalink parent award report block reply\nMastaJoda 13 points 4 days ago Ron DeStiltshoes is 100% correct. permalink award report block reply Iremembermypassword 3 points 4 days ago He has been taking his Based pills again. permalink parent award report block reply Pearcesarrow 3 points 4 days ago It’s getting close to who I would support more in ‘28, Vance or DeSantis. I Love Vance and he probably has a much better chance in the general but damn does DeSantis keep doing the real work of governing down here. It sucks you can’t 100% trust any politician though permalink parent award report block reply Filo76 6 points 4 days ago DeSantis is a great governor. But he is a terrible presidential candidate. He was a puppet for the establishment when he ran against Trump. No way I’m voting for him as president because he would sell out in a heartbeat. permalink parent award report block reply Pearcesarrow 3 points 4 days ago I get it. It took me a long time to mellow on that. I think he got some bad advice from hs wife. I wouldn’t trust either one  totally but at least we’ve seen DeSantis govern. He is a terrible candidate though permalink parent award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nIremembermypassword 3 points 4 days ago He has been taking his Based pills again. permalink parent award report block reply Pearcesarrow 3 points 4 days ago It’s getting close to who I would support more in ‘28, Vance or DeSantis. I Love Vance and he probably has a much better chance in the general but damn does DeSantis keep doing the real work of governing down here. It sucks you can’t 100% trust any politician though permalink parent award report block reply Filo76 6 points 4 days ago DeSantis is a great governor. But he is a terrible presidential candidate. He was a puppet for the establishment when he ran against Trump. No way I’m voting for him as president because he would sell out in a heartbeat. permalink parent award report block reply Pearcesarrow 3 points 4 days ago I get it. It took me a long time to mellow on that. I think he got some bad advice from hs wife. I wouldn’t trust either one  totally but at least we’ve seen DeSantis govern. He is a terrible candidate though permalink parent award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nPearcesarrow 3 points 4 days ago It’s getting close to who I would support more in ‘28, Vance or DeSantis. I Love Vance and he probably has a much better chance in the general but damn does DeSantis keep doing the real work of governing down here. It sucks you can’t 100% trust any politician though permalink parent award report block reply Filo76 6 points 4 days ago DeSantis is a great governor. But he is a terrible presidential candidate. He was a puppet for the establishment when he ran against Trump. No way I’m voting for him as president because he would sell out in a heartbeat. permalink parent award report block reply Pearcesarrow 3 points 4 days ago I get it. It took me a long time to mellow on that. I think he got some bad advice from hs wife. I wouldn’t trust either one  totally but at least we’ve seen DeSantis govern. He is a terrible candidate though permalink parent award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nFilo76 6 points 4 days ago DeSantis is a great governor. But he is a terrible presidential candidate. He was a puppet for the establishment when he ran against Trump. No way I’m voting for him as president because he would sell out in a heartbeat. permalink parent award report block reply Pearcesarrow 3 points 4 days ago I get it. It took me a long time to mellow on that. I think he got some bad advice from hs wife. I wouldn’t trust either one  totally but at least we’ve seen DeSantis govern. He is a terrible candidate though permalink parent award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nPearcesarrow 3 points 4 days ago I get it. It took me a long time to mellow on that. I think he got some bad advice from hs wife. I wouldn’t trust either one  totally but at least we’ve seen DeSantis govern. He is a terrible candidate though permalink parent award report block reply\nGovtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nHockeyMom4Trump 8 points 4 days ago It’s not good. We imported the Third World. There is a reason they were Third World. permalink award report block reply\nBenDoverAssho 7 points 4 days ago The problem is that Communist Democrats have a very different culture and set of values than America First Constitutionalists/MAGA. Now that the Democrats have formed a, \" Communist-\nIslamist Coalition,  they are ACTIVELY facilitating the importation of goatfucking Middle Eastern street shitters. permalink award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nGovtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nModernKnight 6 points 4 days ago There is a bit of nuance here.  You CAN take in a VERY LIMITED number of high-achieving people from other cultures.  However, the numbers HAVE to be very small- as in there should never be less than 98% of the local culture, and those you bring in CAN NOT be put in close proximity to others of their culture.  It has to be set up so that following their own culture makes them completely alone in their practices.  It makes it so they MUST integrate in order to have any kind of community. permalink award report block reply BenDoverAssho 2 points 4 days ago This! permalink parent award report block reply Hoodlum 2 points 4 days ago It's not worth the effort to sift through shit to find a golden nugget. It would be infinitely better to stick to only allowing countries with similar cultures to come to the US. It would be even better than that to just halt ALL immigration indefinitely. permalink parent award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nBenDoverAssho 2 points 4 days ago This! permalink parent award report block reply\nHoodlum 2 points 4 days ago It's not worth the effort to sift through shit to find a golden nugget. It would be infinitely better to stick to only allowing countries with similar cultures to come to the US. It would be even better than that to just halt ALL immigration indefinitely. permalink parent award report block reply\nGovtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nUnknownUserName 6 points 4 days ago Ron is much more MAGA than the guy married to the indian permalink award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nGovtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nAggrieved03 5 points 4 days ago I know 2 other people with a blood feud who should all be deported. permalink award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nGovtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nDITTOPatriot 4 points 4 days ago Damn he used the word tribal. What about the tribe that hates Christians? permalink award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nGovtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nAgnesDomini 3 points 4 days ago Where's the lie? permalink award report block reply\nknnbccb 3 points 4 days ago No third world black/brown trash. And start thinning the herd already in the country. Their kind breeds like rabbits, and worse, your taxpayer money probably helps to feed and raise their brats. If you let them be, in one generation the country will be reduced to their level. It's a numbers game, and if you can't outbreeed them, deport or cull them. Many ways to thin the herd, many ways to skin the cat. You can find a way if you are determined enough. permalink award report block reply\nHairSniffer 3 points 4 days ago https://x.com/RonDeSantis/status/1986906445707956723 permalink award report block reply\ndeleted 3 points 4 days ago the-new-style 2 points 4 days ago Even as a Brit, came to post same. There's a reason we are called \"two nations divided by a common language\". And what about former PM Rishi Sunak, is he part of this \"common culture\"? Or Jeremy \"our friends Hamas\" Corbyn permalink parent award report block reply\nthe-new-style 2 points 4 days ago Even as a Brit, came to post same. There's a reason we are called \"two nations divided by a common language\". And what about former PM Rishi Sunak, is he part of this \"common culture\"? Or Jeremy \"our friends Hamas\" Corbyn permalink parent award report block reply\nDJTXLV 2 points 4 days ago Ron is ramping up. permalink award report block reply\ngreatpumpkin 2 points 4 days ago Immigration should be ~ limited exclusively the countries who have the same cultures and values as ours ~ eliminated. Fixed it. permalink award report block reply\nDantalian 2 points 4 days ago That's EXACTLY how our immigration laws worked, until the Democrats' 1965 Hart-Cellar Act!!!! permalink award report block reply\nUpset_Grape 2 points 4 days ago I would deport an atheist citizen and replace them with an Orthodox Christian immigrant in my ideal immigration law. Everything is filtered first through your fundamental worldview. permalink award report block reply Govtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nGovtizbad OP 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nMungo 1 points 4 days ago The races were never meant to mix long term. Period. permalink award report block reply\nmullethawk 1 points 4 days ago That's a spicy meatball! permalink award report block reply\nweltallic 1 points 4 days ago Recommending permalink award report block reply\nCrappydatum 1 points 4 days ago \"Mass\" immigration of Any kind is a problem No Republican ever claimed that, it's a disingenuous statement permalink award report block reply\npepewarrior0102 1 points 4 days ago Genetics* permalink award report block reply\nIncensedThurible 1 points 4 days ago Can we limit NYC Immigrants to FL? permalink award report block reply\n2016TrumpMAGA 1 points 4 days ago Too bad there are no countries like that left because they all imported mass amounts of third world scum. permalink award report block reply\nBilbobaggins 1 points 4 days ago So…. No immigration then? No other countries share my interpretation of what a constitutional republic should be permalink award report block reply\n1True-translation 0 points 4 days ago Quoting OP from another thread: \"Nobody is America first. Everybody knows America sucks and both Israel and Palestine are better countries than America\" Btw, this guy is formerly u/hillaryizgay . He's likely not actually pro Israel (or anything) he's just here to stir shit and cause trouble. This guy was banned then unbanned within an hour. Who is this guy mods? permalink award report block reply",
  "fetched_at": "2025-11-12T21:18:37.039973Z"
}