{
  "id": "1ARK9hjeSc",
  "url": "https://patriots.win/p/1ARK9hjeSc/tulsi-gabbard-obama-ordered-the-/c",
  "content": "371 Tulsi Gabbard: “Obama Ordered the Overthrow of the U.S. Government!” (sunnysjournal.com) TREASON posted 2 days ago by Trick 16 comments award share report block Tulsi Gabbard: “Obama Ordered the Overthrow of the U.S. Government!” TULSI GABBARD: “OBAMA ORDERED THE OVERTHROW OF THE U.S. GOVERNMENT” 🔥 Only 38 seconds — and it changes everything. Former DNI Tulsi Gabbard just said it out loud: “Barack Hussein Obama ordered the overthrow of the United States government — on behalf of H... sunnysjournal.com\n16 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style TrumpLandslide20201 12 points 2 days ago Might want to arrest someone for doing such a thing. permalink award report block reply DaninElkhart 4 points 2 days ago Hey now! Stop with the Ray-cisms, Bigot! permalink parent award report block reply patrioticwinning3 2 points 2 days ago How Dare you!  Trump says Bondi and her DOJ are, \"Doing a great job!\" :p permalink parent award report block reply snoopy3210 1 points 2 days ago It was the CIA and MI6 first that did the coup against Trump because as Trump was talking about “working with Russia to fight ISIS” the CIA and MI6 were secretly training the Ukrainian army that were murdering the (Russian) donbass people. Trump was disrupting their non declared war against Russians in Ukraine and later disrupted their plan to takeover the mines (Asking questions about Burisma when the CIA was on the board of Burisma and a partner of Burisma). Immediate impeachment. permalink parent award report block reply FlgPole 8 points 2 days ago no shit and... The US Military did nothing. permalink award report block reply HumphreyPlowjogger 4 points 2 days ago Former DNI Tulsi Gabbard? permalink award report block reply Chemical 3 points 2 days ago Exactly what I came here to say lol, wtf permalink parent award report block reply Standingoak 1 points 2 days ago It was just time.  And \"timing is everything\" Military Precision. permalink parent award report block reply Steve56775 2 points 2 days ago They are need to hang for treason. This will deter them in the future. permalink award report block reply NotYourMan 2 points 2 days ago Oh my, taking down Obama is going to be huge.  I was glad that removed his $2 million in ACA fees.  Yup, the government was paying Obama $2 million for the ACA law.  You know that ACA was a terrible law; steal from the middle class and give to the poor free stuff.  The other goal of ACA was the make health insurance executives very, very rich so that their stock would go way up and congress could make millions on the stock.  United Health Group stock went up 1177% since ACA was put into law.  Its a scam to steal from the people. permalink award report block reply Maxmax 2 points 2 days ago Obama illegally spied on American citizens…then Hillary lost.  It all was to cover up the spying.  Bastards! permalink award report block reply Liberalism_is_mental 2 points 2 days ago Arrest and indict him permalink award report block reply Bicentennial76 1 points 2 days ago ...and got away scott free.  Sigh permalink award report block reply AR_MAGA 1 points 2 days ago Two more weeks and he'll be in jail. Just wait. permalink award report block reply bill_in_texas 1 points 2 days ago .....and he would have gotten away with it if it wasn't for those meddling.......oh, wait......they DID get away with it.  This almost feels like a humiliation ritual by Tulsi and others.....showing you that yes, they fucked Trump and all of us, how they did it, and then we see that nothing will be done about it. permalink award report block reply 2016TrumpMAGA 1 points 2 days ago Fucker needs to swing. permalink award report block reply\nTrumpLandslide20201 12 points 2 days ago Might want to arrest someone for doing such a thing. permalink award report block reply DaninElkhart 4 points 2 days ago Hey now! Stop with the Ray-cisms, Bigot! permalink parent award report block reply patrioticwinning3 2 points 2 days ago How Dare you!  Trump says Bondi and her DOJ are, \"Doing a great job!\" :p permalink parent award report block reply snoopy3210 1 points 2 days ago It was the CIA and MI6 first that did the coup against Trump because as Trump was talking about “working with Russia to fight ISIS” the CIA and MI6 were secretly training the Ukrainian army that were murdering the (Russian) donbass people. Trump was disrupting their non declared war against Russians in Ukraine and later disrupted their plan to takeover the mines (Asking questions about Burisma when the CIA was on the board of Burisma and a partner of Burisma). Immediate impeachment. permalink parent award report block reply\nDaninElkhart 4 points 2 days ago Hey now! Stop with the Ray-cisms, Bigot! permalink parent award report block reply\npatrioticwinning3 2 points 2 days ago How Dare you!  Trump says Bondi and her DOJ are, \"Doing a great job!\" :p permalink parent award report block reply\nsnoopy3210 1 points 2 days ago It was the CIA and MI6 first that did the coup against Trump because as Trump was talking about “working with Russia to fight ISIS” the CIA and MI6 were secretly training the Ukrainian army that were murdering the (Russian) donbass people. Trump was disrupting their non declared war against Russians in Ukraine and later disrupted their plan to takeover the mines (Asking questions about Burisma when the CIA was on the board of Burisma and a partner of Burisma). Immediate impeachment. permalink parent award report block reply\nFlgPole 8 points 2 days ago no shit and... The US Military did nothing. permalink award report block reply\nHumphreyPlowjogger 4 points 2 days ago Former DNI Tulsi Gabbard? permalink award report block reply Chemical 3 points 2 days ago Exactly what I came here to say lol, wtf permalink parent award report block reply Standingoak 1 points 2 days ago It was just time.  And \"timing is everything\" Military Precision. permalink parent award report block reply\nChemical 3 points 2 days ago Exactly what I came here to say lol, wtf permalink parent award report block reply\nStandingoak 1 points 2 days ago It was just time.  And \"timing is everything\" Military Precision. permalink parent award report block reply\nSteve56775 2 points 2 days ago They are need to hang for treason. This will deter them in the future. permalink award report block reply\nNotYourMan 2 points 2 days ago Oh my, taking down Obama is going to be huge.  I was glad that removed his $2 million in ACA fees.  Yup, the government was paying Obama $2 million for the ACA law.  You know that ACA was a terrible law; steal from the middle class and give to the poor free stuff.  The other goal of ACA was the make health insurance executives very, very rich so that their stock would go way up and congress could make millions on the stock.  United Health Group stock went up 1177% since ACA was put into law.  Its a scam to steal from the people. permalink award report block reply\nMaxmax 2 points 2 days ago Obama illegally spied on American citizens…then Hillary lost.  It all was to cover up the spying.  Bastards! permalink award report block reply\nLiberalism_is_mental 2 points 2 days ago Arrest and indict him permalink award report block reply\nBicentennial76 1 points 2 days ago ...and got away scott free.  Sigh permalink award report block reply\nAR_MAGA 1 points 2 days ago Two more weeks and he'll be in jail. Just wait. permalink award report block reply\nbill_in_texas 1 points 2 days ago .....and he would have gotten away with it if it wasn't for those meddling.......oh, wait......they DID get away with it.  This almost feels like a humiliation ritual by Tulsi and others.....showing you that yes, they fucked Trump and all of us, how they did it, and then we see that nothing will be done about it. permalink award report block reply\n2016TrumpMAGA 1 points 2 days ago Fucker needs to swing. permalink award report block reply",
  "fetched_at": "2025-11-12T23:09:50.075559Z"
}