{
  "id": "1ARK9nPczn",
  "url": "https://patriots.win/p/1ARK9nPczn/jd-vance-on-h1bs-literally-a-mon/c",
  "content": "289 JD Vance on H1-Bs literally a month ago: \"This idea that American citizens don't have the talent to do great things, that you have to import a foreign class of servants and... professors to do these things… I reject that.\" posted 5 hours ago by Thatunknownguy 28 comments award share report block Defiant L’s @DefiantLs • 28d JD Vance: \"This idea that American citizens don't have the talent to do great things, that you have to import a foreign class of servants and... professors to do these things… I reject that.\"\n28 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style TheJakeFroggy 36 points 5 hours ago He said this not even a month ago. I think he needs to have a talk with Trump. permalink award report block reply Trooph-Hurts 24 points 5 hours ago Having worked in MFG for 45 years I can tell you H1B workers have ZERO to offer where we want MFG to go in America…. India and China are the most backwards places of low skill workers you can ever imagine….. they get the job done only through brute force…… they are dangerous, unsafe unskilled! ,,,,, the only thing they are is CHEAP permalink award report block reply coffee_grdr 5 points 4 hours ago \"they get the job done only through brute force\"  is the truest statement ever made regarding foreign workers. its a shame so many people think they are talented and beneficial! permalink parent award report block reply Trooph-Hurts 4 points 3 hours ago Yup, to be practical, they are more trouble than they are worth….. I’ve worked in semiconductors, oil tools, aerospace, medical…… it takes literate people who are proud of what they do! permalink parent award report block reply coffee_grdr 1 points 2 hours ago \"people who are proud of what they do\" another absolute banger of a statement.  that seems to be lost in todays society, and i believe its because it was replaced with \"diversity is our strength\". i interact with a group from india and its a struggle to get them to slow down and produce better work.  its like they only care about getting it done fast!  quality means nothing to them! i live in a neighborhood with a lot of new development,  its all spanish-only speaking mexicans.  yeah, they work fast, but i can see how angles dont line up, foundations are uneven, trash everywhere.  and when they're done, they just cover the leftover construction material and water bottles with sod!  they literally dont care how this thing they worked on turned out.  unbelievable! permalink parent award report block reply Trooph-Hurts 1 points 1 hour ago I hear ya and they still want to get paid top dollar for that kind of trash work…. But let’s face it. They’re really aren’t very many cultures in the world that appreciate master craftsman or exquisite craftsmanship unless they came from Europe or Russia…. I think Japan has some, but China long ago killed off their talents, India has their own set of problems, Mexico doesn’t Africa doesn’t the Middle East does not unless you count Iran and Tehran and then it’s just painting walls…. But true appreciation for The master craftsman is what made America what it is or what it was…. Fine arts too!…….. permalink parent award report block reply Trooph-Hurts 1 points 1 hour ago Here another data point…. For the past 15 years Indian and Chinese companies have been hiring people that I’ve trained in Houston. What they do is buy equipment In Houston and they have an identical facility in China or India…. They hire talented people to show them how to make the parts in Houston then ship the material and process information on how to make it in India and China….. once that’s done we never see the work in Houston ever again! permalink parent award report block reply RedStoneDeepState 4 points 4 hours ago Yep. I have worked with skilled people in manufacturing who were immigrants... They are Israeli, Japanese, Korean, German or Soviet-Sphere. Not Indian, not Chinese. permalink parent award report block reply Trooph-Hurts 5 points 4 hours ago Exactly!  Those countries aren’t going to let all their people leave to work here…. India and China and 3rd world countries have NOTHING TO OFFER permalink parent award report block reply Truthisunpopular 3 points 4 hours ago Oh, they have plenty to offer, but all of it is bad. permalink parent award report block reply RedStoneDeepState 1 points 4 hours ago The only jobs I have seen that Indians are good at is effectively numbers on paper. That is something to offer... But that can be in India. permalink parent award report block reply Trooph-Hurts 1 points 4 hours ago Trump wants to grow the economy…. To my knowledge that can only be done by IMPORTING people….. they want to import consumers to get out of debt….. but it’s not going to happen like that! These people aren’t like Americans, they don’t work like us, they don’t want to work like us…. It’s just putting us in a worse situation trying to fix what they broke already permalink parent award report block reply view 4 more comments... genericamerican69 2 points 2 hours ago Trump isnt promoting h1bs because he thinks they have something to offer. His corporate friends got in his ear and manipulated him. 10% of intel. Intel is all indians and h1bs permalink parent award report block reply JBlaze056 10 points 4 hours ago It is no coincidence why the same zionists going after Tucker are also going after JD.  That is likely their actual goal to either get him in line or get him off the ticket by 2028.  I think, and hope, the zionists are going to find themselves outside the party this time. permalink award report block reply Appeal2Heaven98 5 points 4 hours ago For the last time, stop noticing. permalink parent award report block reply JBlaze056 4 points 4 hours ago That may happen when I die, but definitely never before that time. permalink parent award report block reply genericamerican69 -1 points 2 hours ago None of anything in that video has anything to do with any zionists whatsoever. You dont even know what the term means. You just want to inject your psychotic obsession into everything. Hopefully the time will come when you are made to pay for your behavior. permalink parent award report block reply sleepinggiant 4 points 4 hours ago We have an h1b analyst.....dont listen to him permalink award report block reply Double_D 4 points 4 hours ago Sounds like an anti Trump doomer… permalink award report block reply OpusX 3 points 3 hours ago If America is behind in specialized manufacturing and trade skills, the answer isn't to import our labor from foreign countries, it's to create a pipeline for Americans to get the training they need to enter the workforce as quickly as possible, while incentivizing American companies through various trade deals and tax breaks to hire only Americans. President Trump couldn't be further from the mark on this. permalink award report block reply ACActual 1 points 35 minutes ago Obviously Antisemetic permalink award report block reply blitzkrieg1 1 points 4 hours ago This was posted and may help/ https://patriots.win/p/1ARK9nP4pY/trumps-remarks-explained/c permalink award report block reply Electricutie 3 points 4 hours ago If this is the case, it needs to be clarified immediately. permalink parent award report block reply dems_be_crazy 1 points 3 hours ago It was an example. Now, counterpoint - the H1B system doesn't have a mechanisms to make companies train American workers and while it does set an initial 6 year (3 years + 3 year extension) limitation on duration, there is the PERM process leading to I-140 Green cards. In 2022, India made up 74% (320k) of all H1B visas accepted and  58% (78k) of initial employment H1B visas (source: https://timesofindia.indiatimes.com/nri/us-canada-news/with-3-20-lakh-h-1b-visas-bagged-in-fy-2022-indians-continue-to-top-the-charts/articleshow/100772292.cms ) while China came in 2nd with 12% (55k). That same year, we granted 72k I-140 Green cards to Indians (that had been here multiple years)(source: https://www.adhikarilaw.com/adjust-of-status/approved-i-140-petitions-and-pending-i-485-applications-data-indicate-that-eb-2-and-eb-3-immmigrant-visa-applicants-will-still-face-a-significant-wait-time/ ).  So, roughly the same amount of of initial employment (not extensions) H1B visas and I-140 Green Cards were granted. I don't know if you can find how many I-140 accepeted applicants were H1B's, it doesn't much matter. 2022 saw 150K new Indian workers, half of which are permanent. The half that are not will be in the next few years. It may not be the exact individuals, but for each of those who leave or time out of H1B, another becomes a permanent resident. permalink parent award report block reply genericamerican69 1 points 2 hours ago This isn't india. Thats it. Plain and simple. No wall of text needed. permalink parent award report block reply\nTheJakeFroggy 36 points 5 hours ago He said this not even a month ago. I think he needs to have a talk with Trump. permalink award report block reply\nTrooph-Hurts 24 points 5 hours ago Having worked in MFG for 45 years I can tell you H1B workers have ZERO to offer where we want MFG to go in America…. India and China are the most backwards places of low skill workers you can ever imagine….. they get the job done only through brute force…… they are dangerous, unsafe unskilled! ,,,,, the only thing they are is CHEAP permalink award report block reply coffee_grdr 5 points 4 hours ago \"they get the job done only through brute force\"  is the truest statement ever made regarding foreign workers. its a shame so many people think they are talented and beneficial! permalink parent award report block reply Trooph-Hurts 4 points 3 hours ago Yup, to be practical, they are more trouble than they are worth….. I’ve worked in semiconductors, oil tools, aerospace, medical…… it takes literate people who are proud of what they do! permalink parent award report block reply coffee_grdr 1 points 2 hours ago \"people who are proud of what they do\" another absolute banger of a statement.  that seems to be lost in todays society, and i believe its because it was replaced with \"diversity is our strength\". i interact with a group from india and its a struggle to get them to slow down and produce better work.  its like they only care about getting it done fast!  quality means nothing to them! i live in a neighborhood with a lot of new development,  its all spanish-only speaking mexicans.  yeah, they work fast, but i can see how angles dont line up, foundations are uneven, trash everywhere.  and when they're done, they just cover the leftover construction material and water bottles with sod!  they literally dont care how this thing they worked on turned out.  unbelievable! permalink parent award report block reply Trooph-Hurts 1 points 1 hour ago I hear ya and they still want to get paid top dollar for that kind of trash work…. But let’s face it. They’re really aren’t very many cultures in the world that appreciate master craftsman or exquisite craftsmanship unless they came from Europe or Russia…. I think Japan has some, but China long ago killed off their talents, India has their own set of problems, Mexico doesn’t Africa doesn’t the Middle East does not unless you count Iran and Tehran and then it’s just painting walls…. But true appreciation for The master craftsman is what made America what it is or what it was…. Fine arts too!…….. permalink parent award report block reply Trooph-Hurts 1 points 1 hour ago Here another data point…. For the past 15 years Indian and Chinese companies have been hiring people that I’ve trained in Houston. What they do is buy equipment In Houston and they have an identical facility in China or India…. They hire talented people to show them how to make the parts in Houston then ship the material and process information on how to make it in India and China….. once that’s done we never see the work in Houston ever again! permalink parent award report block reply RedStoneDeepState 4 points 4 hours ago Yep. I have worked with skilled people in manufacturing who were immigrants... They are Israeli, Japanese, Korean, German or Soviet-Sphere. Not Indian, not Chinese. permalink parent award report block reply Trooph-Hurts 5 points 4 hours ago Exactly!  Those countries aren’t going to let all their people leave to work here…. India and China and 3rd world countries have NOTHING TO OFFER permalink parent award report block reply Truthisunpopular 3 points 4 hours ago Oh, they have plenty to offer, but all of it is bad. permalink parent award report block reply RedStoneDeepState 1 points 4 hours ago The only jobs I have seen that Indians are good at is effectively numbers on paper. That is something to offer... But that can be in India. permalink parent award report block reply Trooph-Hurts 1 points 4 hours ago Trump wants to grow the economy…. To my knowledge that can only be done by IMPORTING people….. they want to import consumers to get out of debt….. but it’s not going to happen like that! These people aren’t like Americans, they don’t work like us, they don’t want to work like us…. It’s just putting us in a worse situation trying to fix what they broke already permalink parent award report block reply view 4 more comments... genericamerican69 2 points 2 hours ago Trump isnt promoting h1bs because he thinks they have something to offer. His corporate friends got in his ear and manipulated him. 10% of intel. Intel is all indians and h1bs permalink parent award report block reply\ncoffee_grdr 5 points 4 hours ago \"they get the job done only through brute force\"  is the truest statement ever made regarding foreign workers. its a shame so many people think they are talented and beneficial! permalink parent award report block reply Trooph-Hurts 4 points 3 hours ago Yup, to be practical, they are more trouble than they are worth….. I’ve worked in semiconductors, oil tools, aerospace, medical…… it takes literate people who are proud of what they do! permalink parent award report block reply coffee_grdr 1 points 2 hours ago \"people who are proud of what they do\" another absolute banger of a statement.  that seems to be lost in todays society, and i believe its because it was replaced with \"diversity is our strength\". i interact with a group from india and its a struggle to get them to slow down and produce better work.  its like they only care about getting it done fast!  quality means nothing to them! i live in a neighborhood with a lot of new development,  its all spanish-only speaking mexicans.  yeah, they work fast, but i can see how angles dont line up, foundations are uneven, trash everywhere.  and when they're done, they just cover the leftover construction material and water bottles with sod!  they literally dont care how this thing they worked on turned out.  unbelievable! permalink parent award report block reply Trooph-Hurts 1 points 1 hour ago I hear ya and they still want to get paid top dollar for that kind of trash work…. But let’s face it. They’re really aren’t very many cultures in the world that appreciate master craftsman or exquisite craftsmanship unless they came from Europe or Russia…. I think Japan has some, but China long ago killed off their talents, India has their own set of problems, Mexico doesn’t Africa doesn’t the Middle East does not unless you count Iran and Tehran and then it’s just painting walls…. But true appreciation for The master craftsman is what made America what it is or what it was…. Fine arts too!…….. permalink parent award report block reply Trooph-Hurts 1 points 1 hour ago Here another data point…. For the past 15 years Indian and Chinese companies have been hiring people that I’ve trained in Houston. What they do is buy equipment In Houston and they have an identical facility in China or India…. They hire talented people to show them how to make the parts in Houston then ship the material and process information on how to make it in India and China….. once that’s done we never see the work in Houston ever again! permalink parent award report block reply\nTrooph-Hurts 4 points 3 hours ago Yup, to be practical, they are more trouble than they are worth….. I’ve worked in semiconductors, oil tools, aerospace, medical…… it takes literate people who are proud of what they do! permalink parent award report block reply coffee_grdr 1 points 2 hours ago \"people who are proud of what they do\" another absolute banger of a statement.  that seems to be lost in todays society, and i believe its because it was replaced with \"diversity is our strength\". i interact with a group from india and its a struggle to get them to slow down and produce better work.  its like they only care about getting it done fast!  quality means nothing to them! i live in a neighborhood with a lot of new development,  its all spanish-only speaking mexicans.  yeah, they work fast, but i can see how angles dont line up, foundations are uneven, trash everywhere.  and when they're done, they just cover the leftover construction material and water bottles with sod!  they literally dont care how this thing they worked on turned out.  unbelievable! permalink parent award report block reply Trooph-Hurts 1 points 1 hour ago I hear ya and they still want to get paid top dollar for that kind of trash work…. But let’s face it. They’re really aren’t very many cultures in the world that appreciate master craftsman or exquisite craftsmanship unless they came from Europe or Russia…. I think Japan has some, but China long ago killed off their talents, India has their own set of problems, Mexico doesn’t Africa doesn’t the Middle East does not unless you count Iran and Tehran and then it’s just painting walls…. But true appreciation for The master craftsman is what made America what it is or what it was…. Fine arts too!…….. permalink parent award report block reply Trooph-Hurts 1 points 1 hour ago Here another data point…. For the past 15 years Indian and Chinese companies have been hiring people that I’ve trained in Houston. What they do is buy equipment In Houston and they have an identical facility in China or India…. They hire talented people to show them how to make the parts in Houston then ship the material and process information on how to make it in India and China….. once that’s done we never see the work in Houston ever again! permalink parent award report block reply\ncoffee_grdr 1 points 2 hours ago \"people who are proud of what they do\" another absolute banger of a statement.  that seems to be lost in todays society, and i believe its because it was replaced with \"diversity is our strength\". i interact with a group from india and its a struggle to get them to slow down and produce better work.  its like they only care about getting it done fast!  quality means nothing to them! i live in a neighborhood with a lot of new development,  its all spanish-only speaking mexicans.  yeah, they work fast, but i can see how angles dont line up, foundations are uneven, trash everywhere.  and when they're done, they just cover the leftover construction material and water bottles with sod!  they literally dont care how this thing they worked on turned out.  unbelievable! permalink parent award report block reply Trooph-Hurts 1 points 1 hour ago I hear ya and they still want to get paid top dollar for that kind of trash work…. But let’s face it. They’re really aren’t very many cultures in the world that appreciate master craftsman or exquisite craftsmanship unless they came from Europe or Russia…. I think Japan has some, but China long ago killed off their talents, India has their own set of problems, Mexico doesn’t Africa doesn’t the Middle East does not unless you count Iran and Tehran and then it’s just painting walls…. But true appreciation for The master craftsman is what made America what it is or what it was…. Fine arts too!…….. permalink parent award report block reply Trooph-Hurts 1 points 1 hour ago Here another data point…. For the past 15 years Indian and Chinese companies have been hiring people that I’ve trained in Houston. What they do is buy equipment In Houston and they have an identical facility in China or India…. They hire talented people to show them how to make the parts in Houston then ship the material and process information on how to make it in India and China….. once that’s done we never see the work in Houston ever again! permalink parent award report block reply\nTrooph-Hurts 1 points 1 hour ago I hear ya and they still want to get paid top dollar for that kind of trash work…. But let’s face it. They’re really aren’t very many cultures in the world that appreciate master craftsman or exquisite craftsmanship unless they came from Europe or Russia…. I think Japan has some, but China long ago killed off their talents, India has their own set of problems, Mexico doesn’t Africa doesn’t the Middle East does not unless you count Iran and Tehran and then it’s just painting walls…. But true appreciation for The master craftsman is what made America what it is or what it was…. Fine arts too!…….. permalink parent award report block reply\nTrooph-Hurts 1 points 1 hour ago Here another data point…. For the past 15 years Indian and Chinese companies have been hiring people that I’ve trained in Houston. What they do is buy equipment In Houston and they have an identical facility in China or India…. They hire talented people to show them how to make the parts in Houston then ship the material and process information on how to make it in India and China….. once that’s done we never see the work in Houston ever again! permalink parent award report block reply\nRedStoneDeepState 4 points 4 hours ago Yep. I have worked with skilled people in manufacturing who were immigrants... They are Israeli, Japanese, Korean, German or Soviet-Sphere. Not Indian, not Chinese. permalink parent award report block reply Trooph-Hurts 5 points 4 hours ago Exactly!  Those countries aren’t going to let all their people leave to work here…. India and China and 3rd world countries have NOTHING TO OFFER permalink parent award report block reply Truthisunpopular 3 points 4 hours ago Oh, they have plenty to offer, but all of it is bad. permalink parent award report block reply RedStoneDeepState 1 points 4 hours ago The only jobs I have seen that Indians are good at is effectively numbers on paper. That is something to offer... But that can be in India. permalink parent award report block reply Trooph-Hurts 1 points 4 hours ago Trump wants to grow the economy…. To my knowledge that can only be done by IMPORTING people….. they want to import consumers to get out of debt….. but it’s not going to happen like that! These people aren’t like Americans, they don’t work like us, they don’t want to work like us…. It’s just putting us in a worse situation trying to fix what they broke already permalink parent award report block reply view 4 more comments...\nTrooph-Hurts 5 points 4 hours ago Exactly!  Those countries aren’t going to let all their people leave to work here…. India and China and 3rd world countries have NOTHING TO OFFER permalink parent award report block reply Truthisunpopular 3 points 4 hours ago Oh, they have plenty to offer, but all of it is bad. permalink parent award report block reply RedStoneDeepState 1 points 4 hours ago The only jobs I have seen that Indians are good at is effectively numbers on paper. That is something to offer... But that can be in India. permalink parent award report block reply Trooph-Hurts 1 points 4 hours ago Trump wants to grow the economy…. To my knowledge that can only be done by IMPORTING people….. they want to import consumers to get out of debt….. but it’s not going to happen like that! These people aren’t like Americans, they don’t work like us, they don’t want to work like us…. It’s just putting us in a worse situation trying to fix what they broke already permalink parent award report block reply view 4 more comments...\nTruthisunpopular 3 points 4 hours ago Oh, they have plenty to offer, but all of it is bad. permalink parent award report block reply\nRedStoneDeepState 1 points 4 hours ago The only jobs I have seen that Indians are good at is effectively numbers on paper. That is something to offer... But that can be in India. permalink parent award report block reply Trooph-Hurts 1 points 4 hours ago Trump wants to grow the economy…. To my knowledge that can only be done by IMPORTING people….. they want to import consumers to get out of debt….. but it’s not going to happen like that! These people aren’t like Americans, they don’t work like us, they don’t want to work like us…. It’s just putting us in a worse situation trying to fix what they broke already permalink parent award report block reply view 4 more comments...\nTrooph-Hurts 1 points 4 hours ago Trump wants to grow the economy…. To my knowledge that can only be done by IMPORTING people….. they want to import consumers to get out of debt….. but it’s not going to happen like that! These people aren’t like Americans, they don’t work like us, they don’t want to work like us…. It’s just putting us in a worse situation trying to fix what they broke already permalink parent award report block reply view 4 more comments...\ngenericamerican69 2 points 2 hours ago Trump isnt promoting h1bs because he thinks they have something to offer. His corporate friends got in his ear and manipulated him. 10% of intel. Intel is all indians and h1bs permalink parent award report block reply\nJBlaze056 10 points 4 hours ago It is no coincidence why the same zionists going after Tucker are also going after JD.  That is likely their actual goal to either get him in line or get him off the ticket by 2028.  I think, and hope, the zionists are going to find themselves outside the party this time. permalink award report block reply Appeal2Heaven98 5 points 4 hours ago For the last time, stop noticing. permalink parent award report block reply JBlaze056 4 points 4 hours ago That may happen when I die, but definitely never before that time. permalink parent award report block reply genericamerican69 -1 points 2 hours ago None of anything in that video has anything to do with any zionists whatsoever. You dont even know what the term means. You just want to inject your psychotic obsession into everything. Hopefully the time will come when you are made to pay for your behavior. permalink parent award report block reply\nAppeal2Heaven98 5 points 4 hours ago For the last time, stop noticing. permalink parent award report block reply JBlaze056 4 points 4 hours ago That may happen when I die, but definitely never before that time. permalink parent award report block reply\nJBlaze056 4 points 4 hours ago That may happen when I die, but definitely never before that time. permalink parent award report block reply\ngenericamerican69 -1 points 2 hours ago None of anything in that video has anything to do with any zionists whatsoever. You dont even know what the term means. You just want to inject your psychotic obsession into everything. Hopefully the time will come when you are made to pay for your behavior. permalink parent award report block reply\nsleepinggiant 4 points 4 hours ago We have an h1b analyst.....dont listen to him permalink award report block reply\nDouble_D 4 points 4 hours ago Sounds like an anti Trump doomer… permalink award report block reply\nOpusX 3 points 3 hours ago If America is behind in specialized manufacturing and trade skills, the answer isn't to import our labor from foreign countries, it's to create a pipeline for Americans to get the training they need to enter the workforce as quickly as possible, while incentivizing American companies through various trade deals and tax breaks to hire only Americans. President Trump couldn't be further from the mark on this. permalink award report block reply\nACActual 1 points 35 minutes ago Obviously Antisemetic permalink award report block reply\nblitzkrieg1 1 points 4 hours ago This was posted and may help/ https://patriots.win/p/1ARK9nP4pY/trumps-remarks-explained/c permalink award report block reply Electricutie 3 points 4 hours ago If this is the case, it needs to be clarified immediately. permalink parent award report block reply dems_be_crazy 1 points 3 hours ago It was an example. Now, counterpoint - the H1B system doesn't have a mechanisms to make companies train American workers and while it does set an initial 6 year (3 years + 3 year extension) limitation on duration, there is the PERM process leading to I-140 Green cards. In 2022, India made up 74% (320k) of all H1B visas accepted and  58% (78k) of initial employment H1B visas (source: https://timesofindia.indiatimes.com/nri/us-canada-news/with-3-20-lakh-h-1b-visas-bagged-in-fy-2022-indians-continue-to-top-the-charts/articleshow/100772292.cms ) while China came in 2nd with 12% (55k). That same year, we granted 72k I-140 Green cards to Indians (that had been here multiple years)(source: https://www.adhikarilaw.com/adjust-of-status/approved-i-140-petitions-and-pending-i-485-applications-data-indicate-that-eb-2-and-eb-3-immmigrant-visa-applicants-will-still-face-a-significant-wait-time/ ).  So, roughly the same amount of of initial employment (not extensions) H1B visas and I-140 Green Cards were granted. I don't know if you can find how many I-140 accepeted applicants were H1B's, it doesn't much matter. 2022 saw 150K new Indian workers, half of which are permanent. The half that are not will be in the next few years. It may not be the exact individuals, but for each of those who leave or time out of H1B, another becomes a permanent resident. permalink parent award report block reply genericamerican69 1 points 2 hours ago This isn't india. Thats it. Plain and simple. No wall of text needed. permalink parent award report block reply\nElectricutie 3 points 4 hours ago If this is the case, it needs to be clarified immediately. permalink parent award report block reply dems_be_crazy 1 points 3 hours ago It was an example. Now, counterpoint - the H1B system doesn't have a mechanisms to make companies train American workers and while it does set an initial 6 year (3 years + 3 year extension) limitation on duration, there is the PERM process leading to I-140 Green cards. In 2022, India made up 74% (320k) of all H1B visas accepted and  58% (78k) of initial employment H1B visas (source: https://timesofindia.indiatimes.com/nri/us-canada-news/with-3-20-lakh-h-1b-visas-bagged-in-fy-2022-indians-continue-to-top-the-charts/articleshow/100772292.cms ) while China came in 2nd with 12% (55k). That same year, we granted 72k I-140 Green cards to Indians (that had been here multiple years)(source: https://www.adhikarilaw.com/adjust-of-status/approved-i-140-petitions-and-pending-i-485-applications-data-indicate-that-eb-2-and-eb-3-immmigrant-visa-applicants-will-still-face-a-significant-wait-time/ ).  So, roughly the same amount of of initial employment (not extensions) H1B visas and I-140 Green Cards were granted. I don't know if you can find how many I-140 accepeted applicants were H1B's, it doesn't much matter. 2022 saw 150K new Indian workers, half of which are permanent. The half that are not will be in the next few years. It may not be the exact individuals, but for each of those who leave or time out of H1B, another becomes a permanent resident. permalink parent award report block reply genericamerican69 1 points 2 hours ago This isn't india. Thats it. Plain and simple. No wall of text needed. permalink parent award report block reply\ndems_be_crazy 1 points 3 hours ago It was an example. Now, counterpoint - the H1B system doesn't have a mechanisms to make companies train American workers and while it does set an initial 6 year (3 years + 3 year extension) limitation on duration, there is the PERM process leading to I-140 Green cards. In 2022, India made up 74% (320k) of all H1B visas accepted and  58% (78k) of initial employment H1B visas (source: https://timesofindia.indiatimes.com/nri/us-canada-news/with-3-20-lakh-h-1b-visas-bagged-in-fy-2022-indians-continue-to-top-the-charts/articleshow/100772292.cms ) while China came in 2nd with 12% (55k). That same year, we granted 72k I-140 Green cards to Indians (that had been here multiple years)(source: https://www.adhikarilaw.com/adjust-of-status/approved-i-140-petitions-and-pending-i-485-applications-data-indicate-that-eb-2-and-eb-3-immmigrant-visa-applicants-will-still-face-a-significant-wait-time/ ).  So, roughly the same amount of of initial employment (not extensions) H1B visas and I-140 Green Cards were granted. I don't know if you can find how many I-140 accepeted applicants were H1B's, it doesn't much matter. 2022 saw 150K new Indian workers, half of which are permanent. The half that are not will be in the next few years. It may not be the exact individuals, but for each of those who leave or time out of H1B, another becomes a permanent resident. permalink parent award report block reply genericamerican69 1 points 2 hours ago This isn't india. Thats it. Plain and simple. No wall of text needed. permalink parent award report block reply\ngenericamerican69 1 points 2 hours ago This isn't india. Thats it. Plain and simple. No wall of text needed. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:16:55.500860Z"
}