{
  "id": "1ARK5A91jJ",
  "url": "https://patriots.win/p/1ARK5A91jJ/muslims-trying-to-take-over-japa/c",
  "content": "442 Muslims trying to take over Japan DEPORT posted 3 days ago by dirtysanchez69 32 comments award share download report block\n32 comments Sort by Top Top New Worst Old Save TwoArizonaPedes 44 points 3 days ago If they want halal meals they can go live in a Muslim country. In Japan you eat Japanese meals. permalink award report block reply BlackJack1776 21 points 3 days ago Worse. The Muzzy's went after Japan's soy sauce. Big OOF . permalink parent award report block reply TwoArizonaPedes 10 points 3 days ago Wow! That's really stupid of them. permalink parent award report block reply Ligersrule1 8 points 3 days ago The inbreeding of moslems dramatically lowers their  IQ permalink parent award report block reply Standingoak 2 points 3 days ago Appears to be a widespread problem among many groups. permalink parent award report block reply Nellie_the_Beaut 6 points 3 days ago And the Japanese love pork and seafood dishes. permalink parent award report block reply mydogma8yourkarma 22 points 3 days ago Throughout history it has always been the 0.3% that fucks it up for everyone else. permalink award report block reply canada_is_communist 9 points 3 days ago And also the 13%....................... permalink parent award report block reply BidenShowerDrool 17 points 3 days ago Halal is a horrible and most inhumane way to kill animals. permalink award report block reply MakingArrowsOrange 10 points 3 days ago That's probably the point. permalink parent award report block reply MAGALADON9 8 points 3 days ago They do this in every country Halal food = muslim only food work = government contracts for schools and prisons = a powerful foothold in an industry. They do this everytime permalink parent award report block reply Standingoak 2 points 3 days ago Not Kosher permalink parent award report block reply zooty 16 points 3 days ago Lefties for the last 50 years of my life: Meat is cruel. If we must have meat, it should be raised in an ethical manner and slaughtered humanely. Muslims: Hold my knife... Lefties: Stunning and brave. permalink award report block reply MAGALADON9 12 points 3 days ago Food is a traditional wedge issues for islamofication You see by claiming it's just better quality etc you get them to agree and then ONLY MUSLIMS CAN WORK IN HALAL FOOD so you carve out schools and other government areas like prisons and now you have a corner on food and a Muslim only job program and grift opportunities permalink award report block reply Shih_Tabed 12 points 3 days ago Hopefully the Yakuza is still the Yakuza. permalink award report block reply LeRiverDanube 11 points 3 days ago they're getting thwarted once sanseito got elected in. Though would be nice if kurd population drops to 0% permalink award report block reply MakingArrowsOrange 8 points 3 days ago Why the hell does Japan have a .3% muslim population? That's what i want to know. permalink award report block reply Standingoak 1 points 3 days ago Indonesians permalink parent award report block reply _Sully_ 7 points 3 days ago Yeah, how about they eat their own shit. Don't even move a single inch for these people. permalink award report block reply NYforTrump 5 points 3 days ago Is that a Japanese woman in a hijab?  What a disgrace.   Worthy of seppuku. permalink award report block reply SuperSilly 5 points 3 days ago I used to go to a place called Pei Wei for their sweet and sour pork.... one day, I went in there and they said.... no more pork!!!! I was like waaaa? And another time I went to a small gas station and couldn't find pork rinds! The hispanic girl behind the counter rolled her eyes and said \"stupid Muslim owner, no more chicharrones! permalink award report block reply Nellie_the_Beaut 4 points 3 days ago We have one legacy diner in the middle of town.  It has been in operation for 45 years.  Traditional place with red booths, bright lights, lots of windows, checkered floor. Known for their big breakfasts of bacon & egg breakfast burritos, biscuits and sausage gravy, ham steaks with fried eggs, pork chops smothered in gravy.  The owners retired last year and sold it to an out of towner.  Turns out he was Muslim and the menu radically changed and all pork was taken off the menu. Bacon replaced with some awful “beef bacon”, no gravy, nasty tasting stuff.  Without telling customers.  People noticed quickly and stopped going there.  It was just sold again to some other Muslims who turned it into a shake and burger drive up.  No pork on the menu.  Nobody’s going there still.  We’ll see how long that lasts. permalink parent award report block reply morememesplz 2 points 2 days ago Panda Express used to sell char siu pork. Delicious. Then I guess they caved to offended Muslims and got rid of it? That's the rumor. No more pork items. They claim because of price volatility of pork but every Chinese restaurants serve pork! permalink parent award report block reply fluffykitten 4 points 3 days ago I support halal pork only permalink award report block reply South_Florida_Guy 4 points 3 days ago Jizzlam is a virus that needs to be eradicated permalink award report block reply Nomad899 2 points 3 days ago Like HIV it infects and kills the host permalink parent award report block reply Sicsempertyrannis76 1 points 3 days ago is Halal similar to Kosher permalink award report block reply Nomad899 2 points 3 days ago Yes permalink parent award report block reply socrates2 1 points 3 days ago They have the healthiest population diet wise in the world. Their school lunches are fresh made and they dont allow students to bring lunch from home. Their childhood obesity as a result (not genetics - see japanese fatsos in Hawaii) is zero due to these food policies. For them to change the entire schools lunch for some nonsense is a crime. permalink award report block reply Mike_Hoxbigg 1 points 2 days ago Stand strong, Japan. DO NOT bend to the will of the foreigner, especially the backwater MUSLIM who does not respect any culture but his own. Show the world how a monoculture stays great by preventing foreign influence. permalink award report block reply freedom4Speech 1 points 3 days ago Comment removed by community moderators. permalink award report block reply\nTwoArizonaPedes 44 points 3 days ago If they want halal meals they can go live in a Muslim country. In Japan you eat Japanese meals. permalink award report block reply BlackJack1776 21 points 3 days ago Worse. The Muzzy's went after Japan's soy sauce. Big OOF . permalink parent award report block reply TwoArizonaPedes 10 points 3 days ago Wow! That's really stupid of them. permalink parent award report block reply Ligersrule1 8 points 3 days ago The inbreeding of moslems dramatically lowers their  IQ permalink parent award report block reply Standingoak 2 points 3 days ago Appears to be a widespread problem among many groups. permalink parent award report block reply Nellie_the_Beaut 6 points 3 days ago And the Japanese love pork and seafood dishes. permalink parent award report block reply\nBlackJack1776 21 points 3 days ago Worse. The Muzzy's went after Japan's soy sauce. Big OOF . permalink parent award report block reply TwoArizonaPedes 10 points 3 days ago Wow! That's really stupid of them. permalink parent award report block reply Ligersrule1 8 points 3 days ago The inbreeding of moslems dramatically lowers their  IQ permalink parent award report block reply Standingoak 2 points 3 days ago Appears to be a widespread problem among many groups. permalink parent award report block reply\nTwoArizonaPedes 10 points 3 days ago Wow! That's really stupid of them. permalink parent award report block reply Ligersrule1 8 points 3 days ago The inbreeding of moslems dramatically lowers their  IQ permalink parent award report block reply Standingoak 2 points 3 days ago Appears to be a widespread problem among many groups. permalink parent award report block reply\nLigersrule1 8 points 3 days ago The inbreeding of moslems dramatically lowers their  IQ permalink parent award report block reply Standingoak 2 points 3 days ago Appears to be a widespread problem among many groups. permalink parent award report block reply\nStandingoak 2 points 3 days ago Appears to be a widespread problem among many groups. permalink parent award report block reply\nNellie_the_Beaut 6 points 3 days ago And the Japanese love pork and seafood dishes. permalink parent award report block reply\nmydogma8yourkarma 22 points 3 days ago Throughout history it has always been the 0.3% that fucks it up for everyone else. permalink award report block reply canada_is_communist 9 points 3 days ago And also the 13%....................... permalink parent award report block reply\ncanada_is_communist 9 points 3 days ago And also the 13%....................... permalink parent award report block reply\nBidenShowerDrool 17 points 3 days ago Halal is a horrible and most inhumane way to kill animals. permalink award report block reply MakingArrowsOrange 10 points 3 days ago That's probably the point. permalink parent award report block reply MAGALADON9 8 points 3 days ago They do this in every country Halal food = muslim only food work = government contracts for schools and prisons = a powerful foothold in an industry. They do this everytime permalink parent award report block reply Standingoak 2 points 3 days ago Not Kosher permalink parent award report block reply\nMakingArrowsOrange 10 points 3 days ago That's probably the point. permalink parent award report block reply MAGALADON9 8 points 3 days ago They do this in every country Halal food = muslim only food work = government contracts for schools and prisons = a powerful foothold in an industry. They do this everytime permalink parent award report block reply\nMAGALADON9 8 points 3 days ago They do this in every country Halal food = muslim only food work = government contracts for schools and prisons = a powerful foothold in an industry. They do this everytime permalink parent award report block reply\nStandingoak 2 points 3 days ago Not Kosher permalink parent award report block reply\nzooty 16 points 3 days ago Lefties for the last 50 years of my life: Meat is cruel. If we must have meat, it should be raised in an ethical manner and slaughtered humanely. Muslims: Hold my knife... Lefties: Stunning and brave. permalink award report block reply\nMAGALADON9 12 points 3 days ago Food is a traditional wedge issues for islamofication You see by claiming it's just better quality etc you get them to agree and then ONLY MUSLIMS CAN WORK IN HALAL FOOD so you carve out schools and other government areas like prisons and now you have a corner on food and a Muslim only job program and grift opportunities permalink award report block reply\nShih_Tabed 12 points 3 days ago Hopefully the Yakuza is still the Yakuza. permalink award report block reply\nLeRiverDanube 11 points 3 days ago they're getting thwarted once sanseito got elected in. Though would be nice if kurd population drops to 0% permalink award report block reply\nMakingArrowsOrange 8 points 3 days ago Why the hell does Japan have a .3% muslim population? That's what i want to know. permalink award report block reply Standingoak 1 points 3 days ago Indonesians permalink parent award report block reply\nStandingoak 1 points 3 days ago Indonesians permalink parent award report block reply\n_Sully_ 7 points 3 days ago Yeah, how about they eat their own shit. Don't even move a single inch for these people. permalink award report block reply\nNYforTrump 5 points 3 days ago Is that a Japanese woman in a hijab?  What a disgrace.   Worthy of seppuku. permalink award report block reply\nSuperSilly 5 points 3 days ago I used to go to a place called Pei Wei for their sweet and sour pork.... one day, I went in there and they said.... no more pork!!!! I was like waaaa? And another time I went to a small gas station and couldn't find pork rinds! The hispanic girl behind the counter rolled her eyes and said \"stupid Muslim owner, no more chicharrones! permalink award report block reply Nellie_the_Beaut 4 points 3 days ago We have one legacy diner in the middle of town.  It has been in operation for 45 years.  Traditional place with red booths, bright lights, lots of windows, checkered floor. Known for their big breakfasts of bacon & egg breakfast burritos, biscuits and sausage gravy, ham steaks with fried eggs, pork chops smothered in gravy.  The owners retired last year and sold it to an out of towner.  Turns out he was Muslim and the menu radically changed and all pork was taken off the menu. Bacon replaced with some awful “beef bacon”, no gravy, nasty tasting stuff.  Without telling customers.  People noticed quickly and stopped going there.  It was just sold again to some other Muslims who turned it into a shake and burger drive up.  No pork on the menu.  Nobody’s going there still.  We’ll see how long that lasts. permalink parent award report block reply morememesplz 2 points 2 days ago Panda Express used to sell char siu pork. Delicious. Then I guess they caved to offended Muslims and got rid of it? That's the rumor. No more pork items. They claim because of price volatility of pork but every Chinese restaurants serve pork! permalink parent award report block reply\nNellie_the_Beaut 4 points 3 days ago We have one legacy diner in the middle of town.  It has been in operation for 45 years.  Traditional place with red booths, bright lights, lots of windows, checkered floor. Known for their big breakfasts of bacon & egg breakfast burritos, biscuits and sausage gravy, ham steaks with fried eggs, pork chops smothered in gravy.  The owners retired last year and sold it to an out of towner.  Turns out he was Muslim and the menu radically changed and all pork was taken off the menu. Bacon replaced with some awful “beef bacon”, no gravy, nasty tasting stuff.  Without telling customers.  People noticed quickly and stopped going there.  It was just sold again to some other Muslims who turned it into a shake and burger drive up.  No pork on the menu.  Nobody’s going there still.  We’ll see how long that lasts. permalink parent award report block reply\nmorememesplz 2 points 2 days ago Panda Express used to sell char siu pork. Delicious. Then I guess they caved to offended Muslims and got rid of it? That's the rumor. No more pork items. They claim because of price volatility of pork but every Chinese restaurants serve pork! permalink parent award report block reply\nfluffykitten 4 points 3 days ago I support halal pork only permalink award report block reply\nSouth_Florida_Guy 4 points 3 days ago Jizzlam is a virus that needs to be eradicated permalink award report block reply Nomad899 2 points 3 days ago Like HIV it infects and kills the host permalink parent award report block reply\nNomad899 2 points 3 days ago Like HIV it infects and kills the host permalink parent award report block reply\nSicsempertyrannis76 1 points 3 days ago is Halal similar to Kosher permalink award report block reply Nomad899 2 points 3 days ago Yes permalink parent award report block reply\nNomad899 2 points 3 days ago Yes permalink parent award report block reply\nsocrates2 1 points 3 days ago They have the healthiest population diet wise in the world. Their school lunches are fresh made and they dont allow students to bring lunch from home. Their childhood obesity as a result (not genetics - see japanese fatsos in Hawaii) is zero due to these food policies. For them to change the entire schools lunch for some nonsense is a crime. permalink award report block reply\nMike_Hoxbigg 1 points 2 days ago Stand strong, Japan. DO NOT bend to the will of the foreigner, especially the backwater MUSLIM who does not respect any culture but his own. Show the world how a monoculture stays great by preventing foreign influence. permalink award report block reply\nfreedom4Speech 1 points 3 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T21:03:11.682163Z"
}