{
  "id": "8175301",
  "title": "1228🇺🇸 Age of first-time home buyers:posted5 days agobyPiratePatriotParrot192 commentsawardsharerepo",
  "url": "https://patriots.win/p/1ARK56jHXN/-age-of-firsttime-home-buyers/c",
  "content": "1228 🇺🇸 Age of first-time home buyers: posted 5 days ago by PiratePatriotParrot 192 comments award share report block End Wokeness @EndWokeness • 5d 🇺🇸 Age of first-time home buyers: 1981: 29 1991: 28 2001: 31 2011: 30 2021: 33 <— Biden’s $2 trillion ARP 2022: 36 2023: 35 2024: 38 NOW: 40 The median age surged from 33 to 40 in 5 years following Biden's spending. A total catastrophe.\n192 comments Sort by Top Top New Worst Old Save Greenhills 68 points 5 days ago The DOJs next conspiracy investigation should be hedge funds buying up entire neighborhoods of new communities to artificially inflate prices. That is if they can complete the investigation without rando hitmen walking into buildings in NY looking for “the NFL commissioner”. I wonder if that was Wesley Lapatner’s code name when she turned states evidence. permalink award report block reply Bramage 34 points 5 days ago The doj is waiting to fuck GEOTUS again after he leaves office. permalink parent award report block reply Andover 13 points 5 days ago Perhaps we should stop giving away trillions to lsraeI, billions to Ukraine and billions to Argentina? The $40 billion to Argentina was called an \"investment\", but that's what they said when we gave Argentina $20 billion in 2015 and not a single dollar of that has been repaid. We'll never see any of that money again. As for lsraeI, yes - Trillions with T if you include not only all of the military aid they greedily snatch from us every year as they spin on Christian Americans in the streets of Tel-Aviv, but also the additional military expenses we spend support them (such as the deploying two aircraft carriers for them earlier this year) AND the indirect funding from all of their pro-lsraeI foundations AND the total costs of all their needless wars they rope us into (such as Iran for Netanyahu's WMD hoax). We pay for lsraeI's free healthcare and free college and all of their wars, while most of us can't afford gas and rent. While our Federal Reserve debt skyrockets like never before. Something needs to change quickly or we won't survive this, even if it makes Miriam Adelson and her $600 million votes unhappy. permalink parent award report block reply lostremote- -3 points 4 days ago Its taking you guys longer and longer to tell us how these things are Israels fault.  I had to dig several comments down to find this one!  Get better! permalink parent award report block reply YouEssAye 65 points 5 days ago Uhhh sorry this has been deboonked. I've been reliably informed on this site that this is due to the fact that all young people are lazy, there were no cell phones in the 70s, and  young people are lazy. It has nothing to do with the economy or population increase or money printing. It's that I just don't work as hard as boomers did. permalink award report block reply LordKuroTheGreat 39 points 5 days ago Also avocado toast, that terrible bane of civilizations. permalink parent award report block reply Filo76 15 points 5 days ago /sad ¡Jeb! noises permalink parent award report block reply DT170x 13 points 5 days ago please clap permalink parent award report block reply LookFatty 3 points 5 days ago Jeb! permalink parent award report block reply hzuiel 4 points 5 days ago There is nothing wrong with the dish itself. The whole point is that it is a cheap food that could be made at home really easily for like $1 per serving, and instead these kids who have to check to make sure theres actually money in their account before they swipe, are paying like 10-12 and another 5-8 for a coffee and they're just going to be hungry again in an hour because theres no protein in it. Leading to them doordashing food 2 hours later.... The point is living beyond your means. You cant really afford to spend like $60 a day on food for one person if you make like 90k a year. Instead you have the receptionist at the law firm trying to live like theyre a managing senior partner. People like Dave Ramsey, Caleb Hammer, and other financial advice shows can get guests all day long who live like this and believe they deserve it and wont change a thing about their consumption habits. permalink parent award report block reply thearizonaindy 8 points 5 days ago I think it’s partly because the bigger dreams are so far out of reach. When you’re truly never going to be able to afford a house or retirement, what do you have to feel like you’re really saving for? permalink parent award report block reply Hellsbells00 7 points 4 days ago Retards being bad with money aren't doing it out of nihilistic ennui. They're just retarded. I'm not defending the abysmal state of the housing market, either. Even for intelligent people that save, home ownership is not as easy as it was. But people living paycheck to paycheck pissing away money on garbage are fucking morons, and a huge percentage of the population lives like that. You need savings MORE in shittier economic times, when you're damn near obligated to maintain a car and a smartphone, and medicine is expensive. permalink parent award report block reply view 1 more comments... Goozmania 2 points 5 days ago WOOSH permalink parent award report block reply hzuiel 1 points 4 days ago Just because you dont agree thst doesnt mean that I just dont understand. I understand exactly what theyre saying, ehich is why i smashed their BS with a thorough reply. permalink parent award report block reply snoopy3210 3 points 4 days ago Biden: I spend like FDR ! I am FDR !!! permalink parent award report block reply Bouldabassed 32 points 5 days ago Yeah get into the wrong thread full of enough boomers on here and they'll go full MSM mode and try to cram that narrative down your throat. permalink parent award report block reply SanityGumby -1 points 5 days ago Tons of them are too lazy and/or too retarded to save to strive for anything meaningful. It doesn’t mean there aren’t issues for the ones trying to. permalink parent award report block reply Goozmania 7 points 5 days ago Yeah, save that $40 a month you spend on \"luxuries.\" You'll own a house in no time. GTFOH permalink parent award report block reply ArtLife 3 points 4 days ago The reality is that is the practical mindset. People are nickel and diming themselves into the poorhouse. That said, the behavior of the crony capitalists makes it very difficult. The things that should be cheap aren't, and the things that should be luxuries are often necessities. permalink parent award report block reply SanityGumby -4 points 4 days ago Yes low IQ faggot. That's how it works. permalink parent award report block reply view 1 more comments... Laquandavious 21 points 5 days ago I was too lazy to read this comment.  When is Mamdani giving me a mansion? permalink parent award report block reply Rock9Head 10 points 5 days ago First he has to take it forcefully from a white family. permalink parent award report block reply tpactionchasethevote 9 points 5 days ago There was also something about the standard 15 year mortgage being changed to 30 years by the government.  Once borrowers could take out 30 year mortgages, they could afford more, and prices went up.  It's hard to get good information on this though so if anyone has more details, please let me know. permalink parent award report block reply NoStepNovember 5 points 4 days ago 100% and even at a 6% mortgage, you are paying mostly interest for the first 10-15 years. It's not the banks offered 30 year loan to \"help the customer afford it\" it is they did it to increase their interest payments when most people  sell their house in 5-10 years. permalink parent award report block reply NonbinaryPotatohead 5 points 5 days ago LOL. I need to take up a third job...I was the lazy one...it's how I don't have any stock market funny money yet. permalink parent award report block reply load 18 more comments... invalid_data 40 points 5 days ago All I see being built right now are endless amount of Apartments. Its straight turning into the Soviet Union everywhere. People will only be living in communist blocks soon if Trump doesn't kick out the third world. permalink award report block reply Krat 15 points 5 days ago This x10000 permalink parent award report block reply YesImWhite 11 points 5 days ago THey have overtaken my suburb \"city\". Everywhere. permalink parent award report block reply terribletwos 3 points 5 days ago They straight up rezoned all the single family home properties in my area to be multi unit and now these weird gross things are popping up everywhere that smell like California but don't match the climate. Things are like two feet from the street so that it looks like that scene from Brazil when you drive by. Some aren't just apartments they're like multiple connected houses, so they can get paid out multiple times on a single property. Things go for a million dollars or more and they're basically town homes. permalink parent award report block reply Zelda 1 points 4 days ago Because they passed this stupid affordable housing bill that forces communities to include affordable housing in all new developments. permalink parent award report block reply Shitsbrokeyo 21 points 5 days ago Interesting.  How did it go backwards in 91? permalink award report block reply AgnesDomini 25 points 5 days ago Reagan had been in office for eight years in that ten-year span. permalink parent award report block reply Shitsbrokeyo 20 points 5 days ago That chart combined with your answer really illustrates the impact and value of a strong republican/capitalist presidency. permalink parent award report block reply Skogin 7 points 5 days ago Unfortunately an attention span is required to comprehend that. permalink parent award report block reply NomadicKrow2 7 points 5 days ago On that note, the 2011 to 2021 span, Donald Trump had a significant impact during the later half of those years. permalink parent award report block reply ShitFromShinola 1 points 5 days ago No. In 2019 and 2020 the average was 33. Just like it was in 2021. There's a reason why OP left that info out. It's bullshit. Presidents have as much control over shit like this as they do the fucking price of oil. permalink parent award report block reply NomadicKrow2 2 points 5 days ago They control the price of oil very closely, it turns out. And OP \"left that info out\" because it charts by the decade you stupid fuck, up to the point where the median age surges to 40, then you get it year by year, because it was such a huge movement in such a short timespan compared to everything else. permalink parent award report block reply view 3 more comments... HuggableBear 9 points 5 days ago Same way it did in 2011. It's been hovering around 30 for decades. The news isn't one year here or there, it's that it held steady for 50 years and jumped up by ten years in 5. permalink parent award report block reply ShitFromShinola 8 points 5 days ago Look at the stratification of wealth during that same period. There is your fucking answer. permalink parent award report block reply IncredibleMrE1 21 points 5 days ago It's only a catastrophe unless you realize it worked exactly as intended. permalink award report block reply TrumpAndGodWin 17 points 5 days ago The plan is to make you a serf in a 200sq ft apartment in a 'fifteen minute city (minimum security prison) eating bugs while dying of cancer as they extract any wealth you had through their medical system. permalink parent award report block reply LineInTheSand 12 points 5 days ago \"Wow, a whole 200 square feet!  My 6'x8' apartment with AI-controlled bed, TV, nutrient dispenser, and remote work terminal would be jealous of such spaciousness.\" - person from 50 years in the future, probably permalink parent award report block reply ConvergenceMan 2 points 5 days ago I really despise the comparison game that spineless people play; a race to the bottom. \"It could always be worse!\" permalink parent award report block reply RememberCharlieKirk 6 points 5 days ago Well, it could. We could be just disembodied but alive heads floating in jugs of liquid set to an unpleasant but non-fatal temperature, while our only view is that of a blank yellow wall. permalink parent award report block reply view 1 more comments... IncredibleMrE1 8 points 5 days ago 200sq ft? That much? You're optimistic. permalink parent award report block reply I_Am_John_Galt 18 points 5 days ago I know I'm going to get shit on here for this, but does anyone remember Blackrock, State Street and every foreigner buying property at outrageous prices then? permalink award report block reply aoneleggedduck 4 points 4 days ago Not sure why you think that'd be a hot take around here worthy of getting shit on. Sounds pretty damn reasonable to me, lol. permalink parent award report block reply Formerlurker92 17 points 5 days ago Sometimes I look back at my life and realize I got the metaphorical last chopper out of nam permalink award report block reply Jamps 9 points 5 days ago I feel you.   Same. permalink parent award report block reply American-Patriot 17 points 5 days ago 7 fucking years in increase hot damn since 2022 permalink award report block reply BloodElfSupporter 14 points 5 days ago Isn’t it the price us average Americans pay for these fucking useless politicians and illegals? permalink parent award report block reply SavingPrivateGrace 11 points 5 days ago 33 should be the average, 10 years after college is plenty of time to save for a house.  They're not able to save because everything else is too expensive, utilities, rent, groceries, insurance, automobile, etc. permalink award report block reply Donmartin 10 points 5 days ago You will need to factor in education loans that need to be paid off as well. This will add to the delay. This has increased significantly. Also some of the other items that contribute to cost of living may not have increased much in real terms like clothes and electronics. Even certain groceries if one is not brand loyal permalink parent award report block reply SimaYi 7 points 4 days ago You're still having boomer brain thinking everyone has to dump 80k into \"college\". You should be able to buy a house when you're 18 and get married. Get rid of the foreigners. permalink parent award report block reply HeatherSwanson 10 points 5 days ago Blackrock and Blackstone happened. Private equity accelerated the hording of SFH, artificially inflating their value making it easier for leverage buyout of homes. Make it illegal to own more than one home. Period permalink award report block reply Patrick_Bateman 11 points 5 days ago An easier and less communist solution is to just prevent anyone other than individuals from owning single family dwellings. 95%+ of Americans would support that. permalink parent award report block reply Bullet_Tooth_Tony 2 points 4 days ago Such an easy work around to that through family members and friends. Give people the cash to buy homes for you essentially. permalink parent award report block reply Patrick_Bateman 1 points 4 days ago No, that's not an easy workaround. The tax implications of that make it basically pointless to even do it. permalink parent award report block reply ShitFromShinola 3 points 5 days ago They do that in communist countries, Komrad. permalink parent award report block reply Beaverstatemilitia 10 points 5 days ago I don’t know I am I. The rental business and a lot of the people we talk to and rent to are very successful people who just don’t want the headaches. We have lawyers engineers and even a doctor that rents from us. They want to be free to do shit like go to Europe and to the Bahamas. Go out to eat all the time. They drive really nice cars and don’t care to have to take care of a house. So a lot of these people probably eventually grow up a little meet someone and want to settle down at a later date. Ie buying houses in the 40’s permalink award report block reply YesImWhite 7 points 5 days ago They are probably more broke than you think. Keeping up with the Joneses. permalink parent award report block reply Beaverstatemilitia 1 points 5 days ago They’re probably not permalink parent award report block reply YesImWhite 1 points 4 days ago I dont know them lol Im just saying. Its way more common than the latter. permalink parent award report block reply MathletesFoot 10 points 5 days ago Houses were unaffordable before Biden. The 2008 wealth transfer killed all affordability, and it was honestly not great since the dot.com crash. permalink award report block reply tpactionchasethevote 4 points 5 days ago The bailout? permalink parent award report block reply DEPORT50M 9 points 5 days ago This is largely because of illegals the boomers love reducing supply and the devaluing of the dollar increasing the cost. But it's mostly the 110 million brown people to make boomers feel like \"they make good real estate decisions\" permalink award report block reply patrioticwinning3 9 points 5 days ago Thanks boomers :p permalink award report block reply The_Yakuza 8 points 5 days ago Just bought one at 30. Wish me luck guys permalink award report block reply tpactionchasethevote 3 points 5 days ago 🤩 permalink parent award report block reply PapaPepe 7 points 5 days ago I'm waiting for the boomers to all come in and blame it on everyone else. permalink award report block reply SimaYi 6 points 4 days ago The boomers will be dead in 10 years. permalink parent award report block reply Bullet_Tooth_Tony 3 points 4 days ago They blame it on the generation they raised 😂 after breaking every mirror in their five vacation homes. permalink parent award report block reply asdrubael_was_right 6 points 5 days ago Yup. 45. Bought my first home last year. And I was grateful to be able to afford it. If the globalists are left in charge American home ownership will vanish entirely. permalink award report block reply latain 5 points 5 days ago I am a millenial that bought a home at 29 and it’ll be fully paid off by the time I’m 40. Thank God for my smart, hardworking husband that keeps us on the right path. permalink award report block reply Rock9Head 5 points 5 days ago Are they taking out 20 year mortgages? Because they will pay a mortgage into retirement with a 30. permalink award report block reply PiratePatriotParrot OP 5 points 5 days ago I think it's about corporations or other countries buying up the houses. permalink award report block reply Zippythekid 5 points 5 days ago This is pretty accurate I bought my first house at 29 in 1996 permalink award report block reply raptormissle 4 points 5 days ago That retard's Build Back Better was always Destroy Things Faster permalink award report block reply AmericanMan00 4 points 5 days ago In that same period, Boomers killed the house building industry with the spotted owl, taking millions of acres of harvestable timber off the market , spiking prices(which turned out to be a lie, 40 yrs later) Enacted growth boundaries to prevent urban sprawl, managed growth by the government.  Prices doubled, even tripled in my neck of the woods overnight. Imported half of the world with H1B's. permalink award report block reply tpactionchasethevote 1 points 5 days ago What was the spotted owl lie? permalink parent award report block reply Donmartin 4 points 5 days ago It is not a single factor problem. Even though money printing is a macro problem. The time the current generation spends in schools have also lengthen and significantly inefficient. The money thus misallocated to school will delay ability to acquire a home. One major problem i feel is the strange brainwashing that has happened that people feel a need to congregate at certain urban centers thus pushing up the price in specific areas Yet America is huge with no lack of space with entire towns that are becoming empty. There should never be such a housing crisis if people are willing to change their mindset . Also jobs would need to be brought back and reallocated away from the usual cities. permalink award report block reply Beardicus 3 points 4 days ago As much as I despise Biden, and he did escalate the problem, there are are many regulations and financial institutions to blame for this problem. permalink award report block reply Zelda 3 points 5 days ago Holy flip we were 25. It was 1100sf of freedom and the best thing we ever did. But man that $700 mortgage meant No eating out, just a papa John’s on payday. Then we’d split a 6 pack for the weekend. No regrets. permalink award report block reply Zelda 4 points 5 days ago Edit to add we didn’t even go with the family to ihop after church because f that eggs were 79 cents a dozen, who would pay $5 for breakfast?! Lol permalink parent award report block reply tpactionchasethevote 2 points 5 days ago 👆 permalink parent award report block reply Agenda47 1 points 5 days ago What was the down payment? permalink parent award report block reply Bramage 3 points 5 days ago FJB permalink award report block reply realsolidsnakeoil 3 points 5 days ago I bought my house at 26. Honestly, I got crazy lucky. permalink award report block reply Bullet_Tooth_Tony 2 points 4 days ago Bought mine at 30 during the potato admin. If it weren't for a freaking video game store and movie theater stock I would be renting still 😂 now I live very comfortably and just had the first kiddo. What a hilarious yet sad timeline lmao! permalink parent award report block reply lustmorden 3 points 5 days ago Well I feel better about my goal to buy a house in the next 4 years... permalink award report block reply PiratePatriotParrot OP 4 points 5 days ago If you're 36 now, you're on target! permalink parent award report block reply realPhantomFuck 2 points 5 days ago I'm 30, single and just purchased my first (town)home in a 1M+ populated county My lender and realtor said I was a unicorn and that they never see solo young buyers anymore... I don't see very many people younger than me being able to purchase a home in the future and it's a complete travesty permalink award report block reply Ryoten 2 points 5 days ago Im 41 and just bought my first house.  No mortgage permalink award report block reply tpactionchasethevote 2 points 5 days ago 🤩 permalink parent award report block reply boomerbutnotOKBoomer 2 points 5 days ago I was 40 when I bought my first home. I wasn't really ready before that. I didn't have the insight or the means to handle all that owning a home entails until I had a secure job and a defined future. So I don't know that the stats matter. What we really need to do is manage the speculation piece of home ownership and get Bill Gates, Vanguard, BlackRock and State street out of the game. permalink award report block reply cbonez416 2 points 4 days ago Your still in a war and yes we are 45 years behind the globalist commies. You will own nothing and be happy!! permalink award report block reply DRKMSTR 2 points 5 days ago We have been spending $2-3 trillion extra every year since COVID. Covid Build Back Better Act Inflation Reduction Act CHIPS act\n5.? BBB? And that's on top of our regular budget. permalink award report block reply jlange94 2 points 5 days ago I'm 31 and still renting. My only hope of buying soon is for some investments to seriously skyrocket. I work an above average paying job for my age but live in a blue state and still can't buy a decent home yet. Anything under 300k is either 100+ years old or would need some serious fixing up. permalink award report block reply tuaris 2 points 5 days ago You need a double income too. permalink award report block reply HockeyMom4Trump 2 points 4 days ago I see this another way. Back in the old days, the goal was to meet someone, buy a home, have children, work your job… These days, many young people appreciate mobility. They have flexible jobs. They can work from anywhere. They don’t want to own a home. They like the freedom of being able to move around and travel and explore. They are getting married later. Having children later. I have an adult son. He does not want to own a home right now with maintenance and something anchoring him down. He likes freedom. He can rent an apartment with a nice pool, fitness center, no maintenance and when he is done working each day, he need not worry about lawn care or painting the kitchen. His job has flexibility so if he tires of the area he currently lives in he can easily relocate. Not everyone wants to own a home. Home ownership can be a weight and a burden. I look at this metric and can see that it is comparable to other measures that young people are now doing later, like marriage and children. permalink award report block reply UpvoteBot 2 points 4 days ago The housing prices skyrocketing began with people fleeing cities when working remotely became the norm. Why remain in a crappy little apartment in a city, when you could move to the burbs and buy a house without having to change jobs nor commute. Then you add 40,000,000 brown fucks who are here illegally. Those invaders all need a place to live so the government pays to put them into various housing situations, like the apartments left by the people I mentioned above. Now, the available inventory of housing is used up. Finally you have hedge funds buying up everything they can get their hands on placing the final nail in the housing affordability coffin.\nThe $2T spending didn’t help, but the biggest problem for inflation, is all the extra people to house and mouths to feed. Illegal immigration is ABSOLUTELY the source of the majority of our financial problems right now. They don’t add anything, they just take welfare and drive up prices be consuming inventories of everything. permalink award report block reply RedditIs4Retards 2 points 4 days ago I bought my first house at 28 in 2018 under trump. Could easily have bought it a few years sooner but unfortunately decided to wait to get married. Would have had a 3k Sq ft house on 10 acres for less than I paid for a 1300sq ft house on 1/4 acre. I cannot imagine buying my first house even with much better income. My same house is now 700k with 6.3% interest. permalink award report block reply 45ichooseu 2 points 5 days ago Bought at age 34 in 2020. Still needed help from family. permalink award report block reply PiratePatriotParrot OP 2 points 5 days ago 34 for me too permalink parent award report block reply RememberCharlieKirk 1 points 5 days ago Still, I think voting rights should just extend to homeowners who have ancestry of at least two generations of American citizens. permalink award report block reply bluewhiteandred 1 points 4 days ago related: \"mortgages are a scam\" permalink award report block reply thelastlast 1 points 5 days ago China owned Biden and had him do stuff to harm the country, yes.  Congress didnt stop him because they owned Congress too. all of this is our own faults. permalink award report block reply USAUSA 1 points 5 days ago Listen Jack! .... <inaudible mumbling> .... mushroom .... .... <inaudible mumbling> ... Obama! ... <awkward silence> .... push-up contest! <shit-eating grin> permalink award report block reply fazaman 1 points 4 days ago ... And mass immigration. Let's not forget about that market pressure! permalink award report block reply Hanging_Chad 1 points 5 days ago yikes permalink award report block reply wintervagina 1 points 4 days ago My wife and I bought our first house during the first real-estate bubble in 2007. We were 27 at the time. 4% on a $220k ranch house. In 2008, everything crashed and my wife lost her job due to no work. We went bankrupt and walked away from the house, foreclosure. We lived modesty for the next 10 years and rented a trailer for $500 a month from a family member. After our bankruptcy fell off, we began looking for a house to buy again. In 2017 we found a nice farm house for $150k on 2 acres. Even has a detached garage which i turned into my woodshop and where I work on my truck. 3% mortgage. The economy was booming because of Trump. We lucked out. Our mortgage is lower now and we're making 4x more money at work now then we were back then. Struggling for those 10 years to save and get back on our feet was hard work but we made it happen. Just good timing for us that we bought in 2017 I guess. permalink award report block reply MrMcGreenGenes 1 points 5 days ago Sure it's not Letitia James types dragging up the average? permalink award report block reply SaltyChad 1 points 5 days ago Correlation to age that people are getting married and having kids??? Bunch of pagan, drug and sex fueled transients in that age bracket now. permalink award report block reply mkil5 1 points 5 days ago I'm very thankful to have taken advantage of my housing crisis repo.  Had it paid off in 2015 at 27. Still here. permalink award report block reply Shitsbrokeyo 1 points 5 days ago Median Age\nYoY Change\nFirst-Time Share\n2009\n37\n+1\n37% 2010\n30    -7\n47% What Actually Happened?This was not a “healthy” market recovery. It was a distressed-buyer surge in the aftermath of the Great Financial Crisis (GFC).Economic Conditions Driving the Collapse in AgeFactor\n2009 → 2010 Impact\nExplanation\nHome Prices\n-12% YoY (Case-Shiller)\nForeclosures flooded the market. Median existing-home price fell from $208K → $183K.\nMortgage Rates\n5.0% → 4.7% (30-yr fixed)\nFed kept rates near zero; banks desperate to lend post-bailout.\nCredit Availability\nFHA 3.5% down + seller concessions\nFHA share of first-time loans jumped from 37% → 56%. Allowed 580 FICO scores.\nFirst-Time Buyer Tax Credit\n$8,000 (expanded)\nEnacted Nov 2009, extended to April 2010. Required closing by June 30.\nInventory Surge\n+35% YoY (NAR)\n4.5M homes in foreclosure pipeline. Distressed sales = 33% of total.\nUnemployment (Youth)\n19.1% (16–24 y.o.)\nHigh, but investors & parents bought for cash-strapped kids. Who Were the 2010 First-Time Buyers?47% were under 30 (vs. 32% in 2009)\n60% used FHA loans (vs. 40% pre-crisis norm)\n28% received down-payment gifts (record high)\nMedian income: $62K → barely above 2000 levels (inflation-adjusted) Key Insight: This was a \"fire sale\" cohort, not a structural improvement. Many bought REO (bank-owned) homes at 20–30% discounts in exurbs (e.g., Phoenix, Las Vegas, Inland Empire).\nWhy the Age Dropped So SharplyOlder buyers (35–45) were underwater → couldn’t sell to upgrade → locked out.\nYoung buyers had no prior home → no negative equity → could buy distressed assets.\nTax credit + low rates = FOMO → pulled forward demand from 25–29 y.o. renters.\nInvestor competition was low → institutions hadn’t yet formed (Blackstone’s Invitation Homes launched 2012).\nWhy the Age Dropped So SharplyOlder buyers (35–45) were underwater → couldn’t sell to upgrade → locked out.\nYoung buyers had no prior home → no negative equity → could buy distressed assets.\nTax credit + low rates = FOMO → pulled forward demand from 25–29 y.o. renters.\nInvestor competition was low → institutions hadn’t yet formed (Blackstone’s Invitation Homes launched 2012). The Aftermath (2011–2013)Tax credit expired → first-time share fell to 37%\nPrices bottomed in 2012 → age rebounded to 31\nNo repeat of 2010 → inventory normalized, FHA tightened (2013) Conclusion: The 2010 drop was a one-time anomaly driven by crisis-era distortions, not sustainable affordability. It remains the only -7-year move in NAR data. permalink award report block reply Smashley 1 points 4 days ago I was 28 in 2006 when I bought by 1st. Zero down and I got a check for 1k at closing. I made 100k tax free on that house in 8 years of ownership. It was a huge shot in the arm and something I could repeat. Buy a new home, fix it up over a few years and see it. Now the interest rates take you too far backwards to do this. I had my fun but I feel for the kiddos today. permalink award report block reply GoldwaterVoter 1 points 5 days ago 1969:  26     Brand new 4 BR, 1/4 acre home in Mission Viejo, CA. nothing out of the ordinary. 30 year mortgage, about $250/mo. permalink award report block reply ScoobyDum 1 points 4 days ago Americans can’t buy homes, because illegals are snatching them up where 50 of them live in it and can split the 400k 7% loan 20 ways permalink award report block reply LordCommissarYarrick 1 points 4 days ago And people buying like five or six of the damn things. Like seriously who needs that many? permalink parent award report block reply CreepFast 1 points 5 days ago I bought my first house last year. I was 38... I also moved away from the west coast to the Midwest to do so.  I make more money and the cost of living is cheaper. permalink award report block reply _Sully_ 1 points 5 days ago Yeah, I just don't know why it hasn't been fixed in 10 months though. That settles it I voting Mamdani for Caliphate. permalink award report block reply ShitFromShinola 1 points 5 days ago HAHAHA.... Homie forgot to include 2017-2020 when the average age was 33. Bottom line is that whoever the President is, he doesn't have a lot of sway over shit like this. permalink award report block reply Shitsbrokeyo 1 points 5 days ago Final Verdict on Biden Era\"The worst affordability environment for first-time buyers since the early 1980s.\"\nRoot Cause: Exogenous inflation + Fed response, not policy failure per se.\nBut: No countervailing supply or credit policy offset the damage.\nLegacy: First-time buyers delayed by 5–7 years vs. prior generations.A 28-year-old in 2021 is still renting in 2025 (age 32).\nWealth gap: Early buyers (2020–21) gained $150K+ equity; late entrants locked out. permalink award report block reply 2016TrumpMAGA 1 points 4 days ago I blame student loans. You cannot enslave young people with tens of thousands of dollars in debt, requiring them to make thousand dollar a month payments through their twenties and early thirties and expect them to be able to start families and buy homes. Average student loan debt is almost $40,000. If you graduated at age 22 with $40,000 in student loan debt, you pay $470/month until you are 32 to pay it off. That is ridiculous. The average student loan debt for graduate school is about $88,220. That's $1025/month, PLUS $470/month. For a doctorate it's $250,000. $2900/month. None of which has a hope in hell of being repaid because some fucking jeet with a fake degree he paid $1000 for will hire other fucking jeets with fake degrees. Student loans need to end NOW, the interest rate on outstanding balances lowered to zero, discharge in bankruptcy permitted, and repayment implemented by payroll deductions over the next 30 years (a $50,000 student loan with zero interest paid off over the next 30 years is only $138/month) with tax benefits for early payoff. permalink award report block reply thisaintitchief76 1 points 4 days ago Is that why I can't afford a home now? I've had a $150k pre-approval and I can't find a single house worth living in. Everything needs at least $100k in updates. permalink award report block reply Goozmania 1 points 5 days ago What actually happened is it is following the age of the oldest millennials. The millennial generation cannot buy homes; and nor will gen z. permalink award report block reply TonsOfSalt 1 points 4 days ago I would be more worried if 70 year olds were receiving 30 year mortgages permalink award report block reply Zelda 1 points 4 days ago Believe it or not, they are. permalink parent award report block reply LookFatty 1 points 5 days ago First buy '89 at 28. 82k. San Bernardino mountains.\nHouse now on Zillow 370k 2 bed 1 bath permalink award report block reply jatergator 1 points 4 days ago Housing went up 40% in 2021-2022. Insanity. permalink award report block reply YesImWhite -1 points 5 days ago bought one at 28 in 2024 lol goddam. Its been brutal on the wallet but this is nice to see permalink award report block reply CLF3 -1 points 5 days ago 42 here, and there's no point in me even trying to get a house anymore.  I'm to the age I will see absolutely no benefit from it. permalink award report block reply DJT4547 3 points 5 days ago Huh? You can buy a house and have it paid off or almost paid off by the time you're ready to retire. permalink parent award report block reply CLF3 0 points 5 days ago Yep, already said it's pointless.  Another ten years my kids are out the door and there's no point in owning one.  And if you think I can pay one off in 20 at 6% you're fuckin nuts, because I'll be living in my fucking office and may as well not own one anyway. I'm gonna take a hard pass on the wage slavery, thanks. If I'm gonna pay rent, I may as well only pay one rent and not a mortgage AND rent to the government to keep them from selling it out from under me to blackrock or some other pile of money. permalink parent award report block reply deleted -2 points 5 days ago HockeyMom4Trump 6 points 5 days ago I bought my first house at 26. Live below your means and do not buy more house than you need! permalink parent award report block reply bidensmissingbrain 8 points 5 days ago Not always feasible. They don't make small houses with big garages hardly anywhere. And most cities/towns/developments won't let you build that way either. So then you're stuck trying to buy a plot of farm ground for 20k and acre with a minimum 20 acre buy. permalink parent award report block reply Zelda 2 points 4 days ago Facts. If any builder would make starter homes they’d sell them all day long. Now they refer to 2500sf as a starter home or downsizing. permalink parent award report block reply DontTreadOnLego 1 points 5 days ago 26 for me as well, in 2002 permalink parent award report block reply Agenda47 6 points 5 days ago Rent. permalink parent award report block reply deleted -4 points 5 days ago LiveFreeorDie0729 9 points 5 days ago This is the most boomer shit I've read in a while. permalink parent award report block reply BarrensChat 1 points 4 days ago There are plenty of millennials that can afford to buy a house even at their current prices, but they don't want to blow a large chunk of thei savings on a home that is nearly double the price it should be. permalink parent award report block reply Goozmania 7 points 5 days ago You people need to disappear. You don't understand macroeconomics. This catastrophe was accurately predicted back when millennials were children and gen z weren't even born. Stop blaming the fucking victims. https://kinder.rice.edu/urbanedge/what-millennials-think-homeownership-and-why-it-matters?utm_source=chatgpt.com https://www.pewresearch.org/social-trends/2013/02/21/chapter-1-the-changing-financial-mileposts-of-young-adults/?utm_source=chatgpt.com https://highline.huffingtonpost.com/articles/en/poor-millennials/ (this is before huffpost became violently leftist) permalink parent award report block reply MajJamesMcFarlane 2 points 5 days ago Medical expenses permalink parent award report block reply deleted -3 points 5 days ago MajJamesMcFarlane 1 points 4 days ago I spend over 6,500 a year on medical expenses. That doesn't include the cost of health insurance permalink parent award report block reply Goozmania 1 points 5 days ago We're not making money, to begin with... because we followed the path we were force fed, and entered into an economy that had no need of us. There are 20 millennial/gen z graduates in any given field for every 1 job. Many don't want to go into a trade school or become an electrician or plumber, after spending $100k+ on an education. permalink parent award report block reply 10knotsorless -6 points 5 days ago Hahah.  Good question.  42 and just bought a second house that needed a full renovation.  Now operating as a successful Airbnb.  What are y’all spending all your money on? permalink parent award report block reply PapaPepe 11 points 5 days ago People like you are why we have a housing problem. permalink parent award report block reply 10knotsorless -2 points 5 days ago Excuse me?   Please explain? permalink parent award report block reply bidensmissingbrain 9 points 5 days ago He buys a second house which he doesn't actually need which prevents someone else who could actually buy and live there from owning a place. Pretty simple. EDIT: lol, found the boomers permalink parent award report block reply view 6 more comments... PapaPepe 7 points 5 days ago Secondary properties that nobody lives in directly puts more pressure on the housing market as you are permantly taking one off of it for some Airbnb side money. It raises the prices for existing homes because it wouldn't be a good airbnb if it wasn't in a desirable area. It's the equivalent of another family of illegals coming over the border and occupying housing. It's like Black rock, Vanguard and the other big companies. You aren't just a small investor with a couple of properties, there are hundreds of thousands of you. So house prices go up, rent goes up because people can't afford the houses that have now doubled in price in 5 years and people who do have a house are having trouble because their property taxes are shooting up. Half of the country is currently struggling to make a rent or mortgage payment right now. The mortgage you are paying for both homes is probably equal to what someone would have to pay to buy just one of them today. It's never been more unaffordable to buy a home in this country. permalink parent award report block reply view 2 more comments... makersmarx 3 points 5 days ago As the housing affordability crisis deepens, Airbnb and Vrbo face backlash | CNN Business https://share.google/of7nOR6J8xOVB3Q0H permalink parent award report block reply Goozmania 2 points 5 days ago Fuck you. AirBNB should be banned, and people who have one should be punched in the face. permalink parent award report block reply SimaYi 1 points 4 days ago You obviously live in the middle of nowhere. permalink parent award report block reply etcetera 1 points 5 days ago Comment removed by community moderators. permalink award report block reply EyesSewnShut 1 points 4 days ago Comment removed by community moderators. permalink award report block reply Coreytrevor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nGreenhills 68 points 5 days ago The DOJs next conspiracy investigation should be hedge funds buying up entire neighborhoods of new communities to artificially inflate prices. That is if they can complete the investigation without rando hitmen walking into buildings in NY looking for “the NFL commissioner”. I wonder if that was Wesley Lapatner’s code name when she turned states evidence. permalink award report block reply Bramage 34 points 5 days ago The doj is waiting to fuck GEOTUS again after he leaves office. permalink parent award report block reply Andover 13 points 5 days ago Perhaps we should stop giving away trillions to lsraeI, billions to Ukraine and billions to Argentina? The $40 billion to Argentina was called an \"investment\", but that's what they said when we gave Argentina $20 billion in 2015 and not a single dollar of that has been repaid. We'll never see any of that money again. As for lsraeI, yes - Trillions with T if you include not only all of the military aid they greedily snatch from us every year as they spin on Christian Americans in the streets of Tel-Aviv, but also the additional military expenses we spend support them (such as the deploying two aircraft carriers for them earlier this year) AND the indirect funding from all of their pro-lsraeI foundations AND the total costs of all their needless wars they rope us into (such as Iran for Netanyahu's WMD hoax). We pay for lsraeI's free healthcare and free college and all of their wars, while most of us can't afford gas and rent. While our Federal Reserve debt skyrockets like never before. Something needs to change quickly or we won't survive this, even if it makes Miriam Adelson and her $600 million votes unhappy. permalink parent award report block reply lostremote- -3 points 4 days ago Its taking you guys longer and longer to tell us how these things are Israels fault.  I had to dig several comments down to find this one!  Get better! permalink parent award report block reply\nBramage 34 points 5 days ago The doj is waiting to fuck GEOTUS again after he leaves office. permalink parent award report block reply\nAndover 13 points 5 days ago Perhaps we should stop giving away trillions to lsraeI, billions to Ukraine and billions to Argentina? The $40 billion to Argentina was called an \"investment\", but that's what they said when we gave Argentina $20 billion in 2015 and not a single dollar of that has been repaid. We'll never see any of that money again. As for lsraeI, yes - Trillions with T if you include not only all of the military aid they greedily snatch from us every year as they spin on Christian Americans in the streets of Tel-Aviv, but also the additional military expenses we spend support them (such as the deploying two aircraft carriers for them earlier this year) AND the indirect funding from all of their pro-lsraeI foundations AND the total costs of all their needless wars they rope us into (such as Iran for Netanyahu's WMD hoax). We pay for lsraeI's free healthcare and free college and all of their wars, while most of us can't afford gas and rent. While our Federal Reserve debt skyrockets like never before. Something needs to change quickly or we won't survive this, even if it makes Miriam Adelson and her $600 million votes unhappy. permalink parent award report block reply lostremote- -3 points 4 days ago Its taking you guys longer and longer to tell us how these things are Israels fault.  I had to dig several comments down to find this one!  Get better! permalink parent award report block reply\nlostremote- -3 points 4 days ago Its taking you guys longer and longer to tell us how these things are Israels fault.  I had to dig several comments down to find this one!  Get better! permalink parent award report block reply\nYouEssAye 65 points 5 days ago Uhhh sorry this has been deboonked. I've been reliably informed on this site that this is due to the fact that all young people are lazy, there were no cell phones in the 70s, and  young people are lazy. It has nothing to do with the economy or population increase or money printing. It's that I just don't work as hard as boomers did. permalink award report block reply LordKuroTheGreat 39 points 5 days ago Also avocado toast, that terrible bane of civilizations. permalink parent award report block reply Filo76 15 points 5 days ago /sad ¡Jeb! noises permalink parent award report block reply DT170x 13 points 5 days ago please clap permalink parent award report block reply LookFatty 3 points 5 days ago Jeb! permalink parent award report block reply hzuiel 4 points 5 days ago There is nothing wrong with the dish itself. The whole point is that it is a cheap food that could be made at home really easily for like $1 per serving, and instead these kids who have to check to make sure theres actually money in their account before they swipe, are paying like 10-12 and another 5-8 for a coffee and they're just going to be hungry again in an hour because theres no protein in it. Leading to them doordashing food 2 hours later.... The point is living beyond your means. You cant really afford to spend like $60 a day on food for one person if you make like 90k a year. Instead you have the receptionist at the law firm trying to live like theyre a managing senior partner. People like Dave Ramsey, Caleb Hammer, and other financial advice shows can get guests all day long who live like this and believe they deserve it and wont change a thing about their consumption habits. permalink parent award report block reply thearizonaindy 8 points 5 days ago I think it’s partly because the bigger dreams are so far out of reach. When you’re truly never going to be able to afford a house or retirement, what do you have to feel like you’re really saving for? permalink parent award report block reply Hellsbells00 7 points 4 days ago Retards being bad with money aren't doing it out of nihilistic ennui. They're just retarded. I'm not defending the abysmal state of the housing market, either. Even for intelligent people that save, home ownership is not as easy as it was. But people living paycheck to paycheck pissing away money on garbage are fucking morons, and a huge percentage of the population lives like that. You need savings MORE in shittier economic times, when you're damn near obligated to maintain a car and a smartphone, and medicine is expensive. permalink parent award report block reply view 1 more comments... Goozmania 2 points 5 days ago WOOSH permalink parent award report block reply hzuiel 1 points 4 days ago Just because you dont agree thst doesnt mean that I just dont understand. I understand exactly what theyre saying, ehich is why i smashed their BS with a thorough reply. permalink parent award report block reply snoopy3210 3 points 4 days ago Biden: I spend like FDR ! I am FDR !!! permalink parent award report block reply Bouldabassed 32 points 5 days ago Yeah get into the wrong thread full of enough boomers on here and they'll go full MSM mode and try to cram that narrative down your throat. permalink parent award report block reply SanityGumby -1 points 5 days ago Tons of them are too lazy and/or too retarded to save to strive for anything meaningful. It doesn’t mean there aren’t issues for the ones trying to. permalink parent award report block reply Goozmania 7 points 5 days ago Yeah, save that $40 a month you spend on \"luxuries.\" You'll own a house in no time. GTFOH permalink parent award report block reply ArtLife 3 points 4 days ago The reality is that is the practical mindset. People are nickel and diming themselves into the poorhouse. That said, the behavior of the crony capitalists makes it very difficult. The things that should be cheap aren't, and the things that should be luxuries are often necessities. permalink parent award report block reply SanityGumby -4 points 4 days ago Yes low IQ faggot. That's how it works. permalink parent award report block reply view 1 more comments... Laquandavious 21 points 5 days ago I was too lazy to read this comment.  When is Mamdani giving me a mansion? permalink parent award report block reply Rock9Head 10 points 5 days ago First he has to take it forcefully from a white family. permalink parent award report block reply tpactionchasethevote 9 points 5 days ago There was also something about the standard 15 year mortgage being changed to 30 years by the government.  Once borrowers could take out 30 year mortgages, they could afford more, and prices went up.  It's hard to get good information on this though so if anyone has more details, please let me know. permalink parent award report block reply NoStepNovember 5 points 4 days ago 100% and even at a 6% mortgage, you are paying mostly interest for the first 10-15 years. It's not the banks offered 30 year loan to \"help the customer afford it\" it is they did it to increase their interest payments when most people  sell their house in 5-10 years. permalink parent award report block reply NonbinaryPotatohead 5 points 5 days ago LOL. I need to take up a third job...I was the lazy one...it's how I don't have any stock market funny money yet. permalink parent award report block reply load 18 more comments...\nLordKuroTheGreat 39 points 5 days ago Also avocado toast, that terrible bane of civilizations. permalink parent award report block reply Filo76 15 points 5 days ago /sad ¡Jeb! noises permalink parent award report block reply DT170x 13 points 5 days ago please clap permalink parent award report block reply LookFatty 3 points 5 days ago Jeb! permalink parent award report block reply hzuiel 4 points 5 days ago There is nothing wrong with the dish itself. The whole point is that it is a cheap food that could be made at home really easily for like $1 per serving, and instead these kids who have to check to make sure theres actually money in their account before they swipe, are paying like 10-12 and another 5-8 for a coffee and they're just going to be hungry again in an hour because theres no protein in it. Leading to them doordashing food 2 hours later.... The point is living beyond your means. You cant really afford to spend like $60 a day on food for one person if you make like 90k a year. Instead you have the receptionist at the law firm trying to live like theyre a managing senior partner. People like Dave Ramsey, Caleb Hammer, and other financial advice shows can get guests all day long who live like this and believe they deserve it and wont change a thing about their consumption habits. permalink parent award report block reply thearizonaindy 8 points 5 days ago I think it’s partly because the bigger dreams are so far out of reach. When you’re truly never going to be able to afford a house or retirement, what do you have to feel like you’re really saving for? permalink parent award report block reply Hellsbells00 7 points 4 days ago Retards being bad with money aren't doing it out of nihilistic ennui. They're just retarded. I'm not defending the abysmal state of the housing market, either. Even for intelligent people that save, home ownership is not as easy as it was. But people living paycheck to paycheck pissing away money on garbage are fucking morons, and a huge percentage of the population lives like that. You need savings MORE in shittier economic times, when you're damn near obligated to maintain a car and a smartphone, and medicine is expensive. permalink parent award report block reply view 1 more comments... Goozmania 2 points 5 days ago WOOSH permalink parent award report block reply hzuiel 1 points 4 days ago Just because you dont agree thst doesnt mean that I just dont understand. I understand exactly what theyre saying, ehich is why i smashed their BS with a thorough reply. permalink parent award report block reply snoopy3210 3 points 4 days ago Biden: I spend like FDR ! I am FDR !!! permalink parent award report block reply\nFilo76 15 points 5 days ago /sad ¡Jeb! noises permalink parent award report block reply DT170x 13 points 5 days ago please clap permalink parent award report block reply LookFatty 3 points 5 days ago Jeb! permalink parent award report block reply\nDT170x 13 points 5 days ago please clap permalink parent award report block reply LookFatty 3 points 5 days ago Jeb! permalink parent award report block reply\nLookFatty 3 points 5 days ago Jeb! permalink parent award report block reply\nhzuiel 4 points 5 days ago There is nothing wrong with the dish itself. The whole point is that it is a cheap food that could be made at home really easily for like $1 per serving, and instead these kids who have to check to make sure theres actually money in their account before they swipe, are paying like 10-12 and another 5-8 for a coffee and they're just going to be hungry again in an hour because theres no protein in it. Leading to them doordashing food 2 hours later.... The point is living beyond your means. You cant really afford to spend like $60 a day on food for one person if you make like 90k a year. Instead you have the receptionist at the law firm trying to live like theyre a managing senior partner. People like Dave Ramsey, Caleb Hammer, and other financial advice shows can get guests all day long who live like this and believe they deserve it and wont change a thing about their consumption habits. permalink parent award report block reply thearizonaindy 8 points 5 days ago I think it’s partly because the bigger dreams are so far out of reach. When you’re truly never going to be able to afford a house or retirement, what do you have to feel like you’re really saving for? permalink parent award report block reply Hellsbells00 7 points 4 days ago Retards being bad with money aren't doing it out of nihilistic ennui. They're just retarded. I'm not defending the abysmal state of the housing market, either. Even for intelligent people that save, home ownership is not as easy as it was. But people living paycheck to paycheck pissing away money on garbage are fucking morons, and a huge percentage of the population lives like that. You need savings MORE in shittier economic times, when you're damn near obligated to maintain a car and a smartphone, and medicine is expensive. permalink parent award report block reply view 1 more comments... Goozmania 2 points 5 days ago WOOSH permalink parent award report block reply hzuiel 1 points 4 days ago Just because you dont agree thst doesnt mean that I just dont understand. I understand exactly what theyre saying, ehich is why i smashed their BS with a thorough reply. permalink parent award report block reply\nthearizonaindy 8 points 5 days ago I think it’s partly because the bigger dreams are so far out of reach. When you’re truly never going to be able to afford a house or retirement, what do you have to feel like you’re really saving for? permalink parent award report block reply Hellsbells00 7 points 4 days ago Retards being bad with money aren't doing it out of nihilistic ennui. They're just retarded. I'm not defending the abysmal state of the housing market, either. Even for intelligent people that save, home ownership is not as easy as it was. But people living paycheck to paycheck pissing away money on garbage are fucking morons, and a huge percentage of the population lives like that. You need savings MORE in shittier economic times, when you're damn near obligated to maintain a car and a smartphone, and medicine is expensive. permalink parent award report block reply view 1 more comments...\nHellsbells00 7 points 4 days ago Retards being bad with money aren't doing it out of nihilistic ennui. They're just retarded. I'm not defending the abysmal state of the housing market, either. Even for intelligent people that save, home ownership is not as easy as it was. But people living paycheck to paycheck pissing away money on garbage are fucking morons, and a huge percentage of the population lives like that. You need savings MORE in shittier economic times, when you're damn near obligated to maintain a car and a smartphone, and medicine is expensive. permalink parent award report block reply view 1 more comments...\nGoozmania 2 points 5 days ago WOOSH permalink parent award report block reply hzuiel 1 points 4 days ago Just because you dont agree thst doesnt mean that I just dont understand. I understand exactly what theyre saying, ehich is why i smashed their BS with a thorough reply. permalink parent award report block reply\nhzuiel 1 points 4 days ago Just because you dont agree thst doesnt mean that I just dont understand. I understand exactly what theyre saying, ehich is why i smashed their BS with a thorough reply. permalink parent award report block reply\nsnoopy3210 3 points 4 days ago Biden: I spend like FDR ! I am FDR !!! permalink parent award report block reply\nBouldabassed 32 points 5 days ago Yeah get into the wrong thread full of enough boomers on here and they'll go full MSM mode and try to cram that narrative down your throat. permalink parent award report block reply SanityGumby -1 points 5 days ago Tons of them are too lazy and/or too retarded to save to strive for anything meaningful. It doesn’t mean there aren’t issues for the ones trying to. permalink parent award report block reply Goozmania 7 points 5 days ago Yeah, save that $40 a month you spend on \"luxuries.\" You'll own a house in no time. GTFOH permalink parent award report block reply ArtLife 3 points 4 days ago The reality is that is the practical mindset. People are nickel and diming themselves into the poorhouse. That said, the behavior of the crony capitalists makes it very difficult. The things that should be cheap aren't, and the things that should be luxuries are often necessities. permalink parent award report block reply SanityGumby -4 points 4 days ago Yes low IQ faggot. That's how it works. permalink parent award report block reply view 1 more comments...\nSanityGumby -1 points 5 days ago Tons of them are too lazy and/or too retarded to save to strive for anything meaningful. It doesn’t mean there aren’t issues for the ones trying to. permalink parent award report block reply Goozmania 7 points 5 days ago Yeah, save that $40 a month you spend on \"luxuries.\" You'll own a house in no time. GTFOH permalink parent award report block reply ArtLife 3 points 4 days ago The reality is that is the practical mindset. People are nickel and diming themselves into the poorhouse. That said, the behavior of the crony capitalists makes it very difficult. The things that should be cheap aren't, and the things that should be luxuries are often necessities. permalink parent award report block reply SanityGumby -4 points 4 days ago Yes low IQ faggot. That's how it works. permalink parent award report block reply view 1 more comments...\nGoozmania 7 points 5 days ago Yeah, save that $40 a month you spend on \"luxuries.\" You'll own a house in no time. GTFOH permalink parent award report block reply ArtLife 3 points 4 days ago The reality is that is the practical mindset. People are nickel and diming themselves into the poorhouse. That said, the behavior of the crony capitalists makes it very difficult. The things that should be cheap aren't, and the things that should be luxuries are often necessities. permalink parent award report block reply SanityGumby -4 points 4 days ago Yes low IQ faggot. That's how it works. permalink parent award report block reply view 1 more comments...\nArtLife 3 points 4 days ago The reality is that is the practical mindset. People are nickel and diming themselves into the poorhouse. That said, the behavior of the crony capitalists makes it very difficult. The things that should be cheap aren't, and the things that should be luxuries are often necessities. permalink parent award report block reply\nSanityGumby -4 points 4 days ago Yes low IQ faggot. That's how it works. permalink parent award report block reply view 1 more comments...\nLaquandavious 21 points 5 days ago I was too lazy to read this comment.  When is Mamdani giving me a mansion? permalink parent award report block reply Rock9Head 10 points 5 days ago First he has to take it forcefully from a white family. permalink parent award report block reply\nRock9Head 10 points 5 days ago First he has to take it forcefully from a white family. permalink parent award report block reply\ntpactionchasethevote 9 points 5 days ago There was also something about the standard 15 year mortgage being changed to 30 years by the government.  Once borrowers could take out 30 year mortgages, they could afford more, and prices went up.  It's hard to get good information on this though so if anyone has more details, please let me know. permalink parent award report block reply NoStepNovember 5 points 4 days ago 100% and even at a 6% mortgage, you are paying mostly interest for the first 10-15 years. It's not the banks offered 30 year loan to \"help the customer afford it\" it is they did it to increase their interest payments when most people  sell their house in 5-10 years. permalink parent award report block reply\nNoStepNovember 5 points 4 days ago 100% and even at a 6% mortgage, you are paying mostly interest for the first 10-15 years. It's not the banks offered 30 year loan to \"help the customer afford it\" it is they did it to increase their interest payments when most people  sell their house in 5-10 years. permalink parent award report block reply\nNonbinaryPotatohead 5 points 5 days ago LOL. I need to take up a third job...I was the lazy one...it's how I don't have any stock market funny money yet. permalink parent award report block reply\ninvalid_data 40 points 5 days ago All I see being built right now are endless amount of Apartments. Its straight turning into the Soviet Union everywhere. People will only be living in communist blocks soon if Trump doesn't kick out the third world. permalink award report block reply Krat 15 points 5 days ago This x10000 permalink parent award report block reply YesImWhite 11 points 5 days ago THey have overtaken my suburb \"city\". Everywhere. permalink parent award report block reply terribletwos 3 points 5 days ago They straight up rezoned all the single family home properties in my area to be multi unit and now these weird gross things are popping up everywhere that smell like California but don't match the climate. Things are like two feet from the street so that it looks like that scene from Brazil when you drive by. Some aren't just apartments they're like multiple connected houses, so they can get paid out multiple times on a single property. Things go for a million dollars or more and they're basically town homes. permalink parent award report block reply Zelda 1 points 4 days ago Because they passed this stupid affordable housing bill that forces communities to include affordable housing in all new developments. permalink parent award report block reply\nKrat 15 points 5 days ago This x10000 permalink parent award report block reply\nYesImWhite 11 points 5 days ago THey have overtaken my suburb \"city\". Everywhere. permalink parent award report block reply\nterribletwos 3 points 5 days ago They straight up rezoned all the single family home properties in my area to be multi unit and now these weird gross things are popping up everywhere that smell like California but don't match the climate. Things are like two feet from the street so that it looks like that scene from Brazil when you drive by. Some aren't just apartments they're like multiple connected houses, so they can get paid out multiple times on a single property. Things go for a million dollars or more and they're basically town homes. permalink parent award report block reply Zelda 1 points 4 days ago Because they passed this stupid affordable housing bill that forces communities to include affordable housing in all new developments. permalink parent award report block reply\nZelda 1 points 4 days ago Because they passed this stupid affordable housing bill that forces communities to include affordable housing in all new developments. permalink parent award report block reply\nShitsbrokeyo 21 points 5 days ago Interesting.  How did it go backwards in 91? permalink award report block reply AgnesDomini 25 points 5 days ago Reagan had been in office for eight years in that ten-year span. permalink parent award report block reply Shitsbrokeyo 20 points 5 days ago That chart combined with your answer really illustrates the impact and value of a strong republican/capitalist presidency. permalink parent award report block reply Skogin 7 points 5 days ago Unfortunately an attention span is required to comprehend that. permalink parent award report block reply NomadicKrow2 7 points 5 days ago On that note, the 2011 to 2021 span, Donald Trump had a significant impact during the later half of those years. permalink parent award report block reply ShitFromShinola 1 points 5 days ago No. In 2019 and 2020 the average was 33. Just like it was in 2021. There's a reason why OP left that info out. It's bullshit. Presidents have as much control over shit like this as they do the fucking price of oil. permalink parent award report block reply NomadicKrow2 2 points 5 days ago They control the price of oil very closely, it turns out. And OP \"left that info out\" because it charts by the decade you stupid fuck, up to the point where the median age surges to 40, then you get it year by year, because it was such a huge movement in such a short timespan compared to everything else. permalink parent award report block reply view 3 more comments... HuggableBear 9 points 5 days ago Same way it did in 2011. It's been hovering around 30 for decades. The news isn't one year here or there, it's that it held steady for 50 years and jumped up by ten years in 5. permalink parent award report block reply ShitFromShinola 8 points 5 days ago Look at the stratification of wealth during that same period. There is your fucking answer. permalink parent award report block reply\nAgnesDomini 25 points 5 days ago Reagan had been in office for eight years in that ten-year span. permalink parent award report block reply Shitsbrokeyo 20 points 5 days ago That chart combined with your answer really illustrates the impact and value of a strong republican/capitalist presidency. permalink parent award report block reply Skogin 7 points 5 days ago Unfortunately an attention span is required to comprehend that. permalink parent award report block reply NomadicKrow2 7 points 5 days ago On that note, the 2011 to 2021 span, Donald Trump had a significant impact during the later half of those years. permalink parent award report block reply ShitFromShinola 1 points 5 days ago No. In 2019 and 2020 the average was 33. Just like it was in 2021. There's a reason why OP left that info out. It's bullshit. Presidents have as much control over shit like this as they do the fucking price of oil. permalink parent award report block reply NomadicKrow2 2 points 5 days ago They control the price of oil very closely, it turns out. And OP \"left that info out\" because it charts by the decade you stupid fuck, up to the point where the median age surges to 40, then you get it year by year, because it was such a huge movement in such a short timespan compared to everything else. permalink parent award report block reply view 3 more comments...\nShitsbrokeyo 20 points 5 days ago That chart combined with your answer really illustrates the impact and value of a strong republican/capitalist presidency. permalink parent award report block reply Skogin 7 points 5 days ago Unfortunately an attention span is required to comprehend that. permalink parent award report block reply\nSkogin 7 points 5 days ago Unfortunately an attention span is required to comprehend that. permalink parent award report block reply\nNomadicKrow2 7 points 5 days ago On that note, the 2011 to 2021 span, Donald Trump had a significant impact during the later half of those years. permalink parent award report block reply ShitFromShinola 1 points 5 days ago No. In 2019 and 2020 the average was 33. Just like it was in 2021. There's a reason why OP left that info out. It's bullshit. Presidents have as much control over shit like this as they do the fucking price of oil. permalink parent award report block reply NomadicKrow2 2 points 5 days ago They control the price of oil very closely, it turns out. And OP \"left that info out\" because it charts by the decade you stupid fuck, up to the point where the median age surges to 40, then you get it year by year, because it was such a huge movement in such a short timespan compared to everything else. permalink parent award report block reply view 3 more comments...\nShitFromShinola 1 points 5 days ago No. In 2019 and 2020 the average was 33. Just like it was in 2021. There's a reason why OP left that info out. It's bullshit. Presidents have as much control over shit like this as they do the fucking price of oil. permalink parent award report block reply NomadicKrow2 2 points 5 days ago They control the price of oil very closely, it turns out. And OP \"left that info out\" because it charts by the decade you stupid fuck, up to the point where the median age surges to 40, then you get it year by year, because it was such a huge movement in such a short timespan compared to everything else. permalink parent award report block reply view 3 more comments...\nNomadicKrow2 2 points 5 days ago They control the price of oil very closely, it turns out. And OP \"left that info out\" because it charts by the decade you stupid fuck, up to the point where the median age surges to 40, then you get it year by year, because it was such a huge movement in such a short timespan compared to everything else. permalink parent award report block reply view 3 more comments...\nHuggableBear 9 points 5 days ago Same way it did in 2011. It's been hovering around 30 for decades. The news isn't one year here or there, it's that it held steady for 50 years and jumped up by ten years in 5. permalink parent award report block reply ShitFromShinola 8 points 5 days ago Look at the stratification of wealth during that same period. There is your fucking answer. permalink parent award report block reply\nShitFromShinola 8 points 5 days ago Look at the stratification of wealth during that same period. There is your fucking answer. permalink parent award report block reply\nIncredibleMrE1 21 points 5 days ago It's only a catastrophe unless you realize it worked exactly as intended. permalink award report block reply TrumpAndGodWin 17 points 5 days ago The plan is to make you a serf in a 200sq ft apartment in a 'fifteen minute city (minimum security prison) eating bugs while dying of cancer as they extract any wealth you had through their medical system. permalink parent award report block reply LineInTheSand 12 points 5 days ago \"Wow, a whole 200 square feet!  My 6'x8' apartment with AI-controlled bed, TV, nutrient dispenser, and remote work terminal would be jealous of such spaciousness.\" - person from 50 years in the future, probably permalink parent award report block reply ConvergenceMan 2 points 5 days ago I really despise the comparison game that spineless people play; a race to the bottom. \"It could always be worse!\" permalink parent award report block reply RememberCharlieKirk 6 points 5 days ago Well, it could. We could be just disembodied but alive heads floating in jugs of liquid set to an unpleasant but non-fatal temperature, while our only view is that of a blank yellow wall. permalink parent award report block reply view 1 more comments... IncredibleMrE1 8 points 5 days ago 200sq ft? That much? You're optimistic. permalink parent award report block reply\nTrumpAndGodWin 17 points 5 days ago The plan is to make you a serf in a 200sq ft apartment in a 'fifteen minute city (minimum security prison) eating bugs while dying of cancer as they extract any wealth you had through their medical system. permalink parent award report block reply LineInTheSand 12 points 5 days ago \"Wow, a whole 200 square feet!  My 6'x8' apartment with AI-controlled bed, TV, nutrient dispenser, and remote work terminal would be jealous of such spaciousness.\" - person from 50 years in the future, probably permalink parent award report block reply ConvergenceMan 2 points 5 days ago I really despise the comparison game that spineless people play; a race to the bottom. \"It could always be worse!\" permalink parent award report block reply RememberCharlieKirk 6 points 5 days ago Well, it could. We could be just disembodied but alive heads floating in jugs of liquid set to an unpleasant but non-fatal temperature, while our only view is that of a blank yellow wall. permalink parent award report block reply view 1 more comments... IncredibleMrE1 8 points 5 days ago 200sq ft? That much? You're optimistic. permalink parent award report block reply\nLineInTheSand 12 points 5 days ago \"Wow, a whole 200 square feet!  My 6'x8' apartment with AI-controlled bed, TV, nutrient dispenser, and remote work terminal would be jealous of such spaciousness.\" - person from 50 years in the future, probably permalink parent award report block reply ConvergenceMan 2 points 5 days ago I really despise the comparison game that spineless people play; a race to the bottom. \"It could always be worse!\" permalink parent award report block reply RememberCharlieKirk 6 points 5 days ago Well, it could. We could be just disembodied but alive heads floating in jugs of liquid set to an unpleasant but non-fatal temperature, while our only view is that of a blank yellow wall. permalink parent award report block reply view 1 more comments...\nConvergenceMan 2 points 5 days ago I really despise the comparison game that spineless people play; a race to the bottom. \"It could always be worse!\" permalink parent award report block reply RememberCharlieKirk 6 points 5 days ago Well, it could. We could be just disembodied but alive heads floating in jugs of liquid set to an unpleasant but non-fatal temperature, while our only view is that of a blank yellow wall. permalink parent award report block reply view 1 more comments...\nRememberCharlieKirk 6 points 5 days ago Well, it could. We could be just disembodied but alive heads floating in jugs of liquid set to an unpleasant but non-fatal temperature, while our only view is that of a blank yellow wall. permalink parent award report block reply view 1 more comments...\nIncredibleMrE1 8 points 5 days ago 200sq ft? That much? You're optimistic. permalink parent award report block reply\nI_Am_John_Galt 18 points 5 days ago I know I'm going to get shit on here for this, but does anyone remember Blackrock, State Street and every foreigner buying property at outrageous prices then? permalink award report block reply aoneleggedduck 4 points 4 days ago Not sure why you think that'd be a hot take around here worthy of getting shit on. Sounds pretty damn reasonable to me, lol. permalink parent award report block reply\naoneleggedduck 4 points 4 days ago Not sure why you think that'd be a hot take around here worthy of getting shit on. Sounds pretty damn reasonable to me, lol. permalink parent award report block reply\nFormerlurker92 17 points 5 days ago Sometimes I look back at my life and realize I got the metaphorical last chopper out of nam permalink award report block reply Jamps 9 points 5 days ago I feel you.   Same. permalink parent award report block reply\nJamps 9 points 5 days ago I feel you.   Same. permalink parent award report block reply\nAmerican-Patriot 17 points 5 days ago 7 fucking years in increase hot damn since 2022 permalink award report block reply BloodElfSupporter 14 points 5 days ago Isn’t it the price us average Americans pay for these fucking useless politicians and illegals? permalink parent award report block reply\nBloodElfSupporter 14 points 5 days ago Isn’t it the price us average Americans pay for these fucking useless politicians and illegals? permalink parent award report block reply\nSavingPrivateGrace 11 points 5 days ago 33 should be the average, 10 years after college is plenty of time to save for a house.  They're not able to save because everything else is too expensive, utilities, rent, groceries, insurance, automobile, etc. permalink award report block reply Donmartin 10 points 5 days ago You will need to factor in education loans that need to be paid off as well. This will add to the delay. This has increased significantly. Also some of the other items that contribute to cost of living may not have increased much in real terms like clothes and electronics. Even certain groceries if one is not brand loyal permalink parent award report block reply SimaYi 7 points 4 days ago You're still having boomer brain thinking everyone has to dump 80k into \"college\". You should be able to buy a house when you're 18 and get married. Get rid of the foreigners. permalink parent award report block reply\nDonmartin 10 points 5 days ago You will need to factor in education loans that need to be paid off as well. This will add to the delay. This has increased significantly. Also some of the other items that contribute to cost of living may not have increased much in real terms like clothes and electronics. Even certain groceries if one is not brand loyal permalink parent award report block reply\nSimaYi 7 points 4 days ago You're still having boomer brain thinking everyone has to dump 80k into \"college\". You should be able to buy a house when you're 18 and get married. Get rid of the foreigners. permalink parent award report block reply\nHeatherSwanson 10 points 5 days ago Blackrock and Blackstone happened. Private equity accelerated the hording of SFH, artificially inflating their value making it easier for leverage buyout of homes. Make it illegal to own more than one home. Period permalink award report block reply Patrick_Bateman 11 points 5 days ago An easier and less communist solution is to just prevent anyone other than individuals from owning single family dwellings. 95%+ of Americans would support that. permalink parent award report block reply Bullet_Tooth_Tony 2 points 4 days ago Such an easy work around to that through family members and friends. Give people the cash to buy homes for you essentially. permalink parent award report block reply Patrick_Bateman 1 points 4 days ago No, that's not an easy workaround. The tax implications of that make it basically pointless to even do it. permalink parent award report block reply ShitFromShinola 3 points 5 days ago They do that in communist countries, Komrad. permalink parent award report block reply\nPatrick_Bateman 11 points 5 days ago An easier and less communist solution is to just prevent anyone other than individuals from owning single family dwellings. 95%+ of Americans would support that. permalink parent award report block reply Bullet_Tooth_Tony 2 points 4 days ago Such an easy work around to that through family members and friends. Give people the cash to buy homes for you essentially. permalink parent award report block reply Patrick_Bateman 1 points 4 days ago No, that's not an easy workaround. The tax implications of that make it basically pointless to even do it. permalink parent award report block reply\nBullet_Tooth_Tony 2 points 4 days ago Such an easy work around to that through family members and friends. Give people the cash to buy homes for you essentially. permalink parent award report block reply Patrick_Bateman 1 points 4 days ago No, that's not an easy workaround. The tax implications of that make it basically pointless to even do it. permalink parent award report block reply\nPatrick_Bateman 1 points 4 days ago No, that's not an easy workaround. The tax implications of that make it basically pointless to even do it. permalink parent award report block reply\nShitFromShinola 3 points 5 days ago They do that in communist countries, Komrad. permalink parent award report block reply\nBeaverstatemilitia 10 points 5 days ago I don’t know I am I. The rental business and a lot of the people we talk to and rent to are very successful people who just don’t want the headaches. We have lawyers engineers and even a doctor that rents from us. They want to be free to do shit like go to Europe and to the Bahamas. Go out to eat all the time. They drive really nice cars and don’t care to have to take care of a house. So a lot of these people probably eventually grow up a little meet someone and want to settle down at a later date. Ie buying houses in the 40’s permalink award report block reply YesImWhite 7 points 5 days ago They are probably more broke than you think. Keeping up with the Joneses. permalink parent award report block reply Beaverstatemilitia 1 points 5 days ago They’re probably not permalink parent award report block reply YesImWhite 1 points 4 days ago I dont know them lol Im just saying. Its way more common than the latter. permalink parent award report block reply\nYesImWhite 7 points 5 days ago They are probably more broke than you think. Keeping up with the Joneses. permalink parent award report block reply Beaverstatemilitia 1 points 5 days ago They’re probably not permalink parent award report block reply YesImWhite 1 points 4 days ago I dont know them lol Im just saying. Its way more common than the latter. permalink parent award report block reply\nBeaverstatemilitia 1 points 5 days ago They’re probably not permalink parent award report block reply YesImWhite 1 points 4 days ago I dont know them lol Im just saying. Its way more common than the latter. permalink parent award report block reply\nYesImWhite 1 points 4 days ago I dont know them lol Im just saying. Its way more common than the latter. permalink parent award report block reply\nMathletesFoot 10 points 5 days ago Houses were unaffordable before Biden. The 2008 wealth transfer killed all affordability, and it was honestly not great since the dot.com crash. permalink award report block reply tpactionchasethevote 4 points 5 days ago The bailout? permalink parent award report block reply\ntpactionchasethevote 4 points 5 days ago The bailout? permalink parent award report block reply\nDEPORT50M 9 points 5 days ago This is largely because of illegals the boomers love reducing supply and the devaluing of the dollar increasing the cost. But it's mostly the 110 million brown people to make boomers feel like \"they make good real estate decisions\" permalink award report block reply\npatrioticwinning3 9 points 5 days ago Thanks boomers :p permalink award report block reply\nThe_Yakuza 8 points 5 days ago Just bought one at 30. Wish me luck guys permalink award report block reply tpactionchasethevote 3 points 5 days ago 🤩 permalink parent award report block reply\ntpactionchasethevote 3 points 5 days ago 🤩 permalink parent award report block reply\nPapaPepe 7 points 5 days ago I'm waiting for the boomers to all come in and blame it on everyone else. permalink award report block reply SimaYi 6 points 4 days ago The boomers will be dead in 10 years. permalink parent award report block reply Bullet_Tooth_Tony 3 points 4 days ago They blame it on the generation they raised 😂 after breaking every mirror in their five vacation homes. permalink parent award report block reply\nSimaYi 6 points 4 days ago The boomers will be dead in 10 years. permalink parent award report block reply\nBullet_Tooth_Tony 3 points 4 days ago They blame it on the generation they raised 😂 after breaking every mirror in their five vacation homes. permalink parent award report block reply\nasdrubael_was_right 6 points 5 days ago Yup. 45. Bought my first home last year. And I was grateful to be able to afford it. If the globalists are left in charge American home ownership will vanish entirely. permalink award report block reply\nlatain 5 points 5 days ago I am a millenial that bought a home at 29 and it’ll be fully paid off by the time I’m 40. Thank God for my smart, hardworking husband that keeps us on the right path. permalink award report block reply\nRock9Head 5 points 5 days ago Are they taking out 20 year mortgages? Because they will pay a mortgage into retirement with a 30. permalink award report block reply\nPiratePatriotParrot OP 5 points 5 days ago I think it's about corporations or other countries buying up the houses. permalink award report block reply\nZippythekid 5 points 5 days ago This is pretty accurate I bought my first house at 29 in 1996 permalink award report block reply\nraptormissle 4 points 5 days ago That retard's Build Back Better was always Destroy Things Faster permalink award report block reply\nAmericanMan00 4 points 5 days ago In that same period, Boomers killed the house building industry with the spotted owl, taking millions of acres of harvestable timber off the market , spiking prices(which turned out to be a lie, 40 yrs later) Enacted growth boundaries to prevent urban sprawl, managed growth by the government.  Prices doubled, even tripled in my neck of the woods overnight. Imported half of the world with H1B's. permalink award report block reply tpactionchasethevote 1 points 5 days ago What was the spotted owl lie? permalink parent award report block reply\ntpactionchasethevote 1 points 5 days ago What was the spotted owl lie? permalink parent award report block reply\nDonmartin 4 points 5 days ago It is not a single factor problem. Even though money printing is a macro problem. The time the current generation spends in schools have also lengthen and significantly inefficient. The money thus misallocated to school will delay ability to acquire a home. One major problem i feel is the strange brainwashing that has happened that people feel a need to congregate at certain urban centers thus pushing up the price in specific areas Yet America is huge with no lack of space with entire towns that are becoming empty. There should never be such a housing crisis if people are willing to change their mindset . Also jobs would need to be brought back and reallocated away from the usual cities. permalink award report block reply\nBeardicus 3 points 4 days ago As much as I despise Biden, and he did escalate the problem, there are are many regulations and financial institutions to blame for this problem. permalink award report block reply\nZelda 3 points 5 days ago Holy flip we were 25. It was 1100sf of freedom and the best thing we ever did. But man that $700 mortgage meant No eating out, just a papa John’s on payday. Then we’d split a 6 pack for the weekend. No regrets. permalink award report block reply Zelda 4 points 5 days ago Edit to add we didn’t even go with the family to ihop after church because f that eggs were 79 cents a dozen, who would pay $5 for breakfast?! Lol permalink parent award report block reply tpactionchasethevote 2 points 5 days ago 👆 permalink parent award report block reply Agenda47 1 points 5 days ago What was the down payment? permalink parent award report block reply\nZelda 4 points 5 days ago Edit to add we didn’t even go with the family to ihop after church because f that eggs were 79 cents a dozen, who would pay $5 for breakfast?! Lol permalink parent award report block reply tpactionchasethevote 2 points 5 days ago 👆 permalink parent award report block reply\ntpactionchasethevote 2 points 5 days ago 👆 permalink parent award report block reply\nAgenda47 1 points 5 days ago What was the down payment? permalink parent award report block reply\nBramage 3 points 5 days ago FJB permalink award report block reply\nrealsolidsnakeoil 3 points 5 days ago I bought my house at 26. Honestly, I got crazy lucky. permalink award report block reply Bullet_Tooth_Tony 2 points 4 days ago Bought mine at 30 during the potato admin. If it weren't for a freaking video game store and movie theater stock I would be renting still 😂 now I live very comfortably and just had the first kiddo. What a hilarious yet sad timeline lmao! permalink parent award report block reply\nBullet_Tooth_Tony 2 points 4 days ago Bought mine at 30 during the potato admin. If it weren't for a freaking video game store and movie theater stock I would be renting still 😂 now I live very comfortably and just had the first kiddo. What a hilarious yet sad timeline lmao! permalink parent award report block reply\nlustmorden 3 points 5 days ago Well I feel better about my goal to buy a house in the next 4 years... permalink award report block reply PiratePatriotParrot OP 4 points 5 days ago If you're 36 now, you're on target! permalink parent award report block reply\nPiratePatriotParrot OP 4 points 5 days ago If you're 36 now, you're on target! permalink parent award report block reply\nrealPhantomFuck 2 points 5 days ago I'm 30, single and just purchased my first (town)home in a 1M+ populated county My lender and realtor said I was a unicorn and that they never see solo young buyers anymore... I don't see very many people younger than me being able to purchase a home in the future and it's a complete travesty permalink award report block reply\nRyoten 2 points 5 days ago Im 41 and just bought my first house.  No mortgage permalink award report block reply tpactionchasethevote 2 points 5 days ago 🤩 permalink parent award report block reply\ntpactionchasethevote 2 points 5 days ago 🤩 permalink parent award report block reply\nboomerbutnotOKBoomer 2 points 5 days ago I was 40 when I bought my first home. I wasn't really ready before that. I didn't have the insight or the means to handle all that owning a home entails until I had a secure job and a defined future. So I don't know that the stats matter. What we really need to do is manage the speculation piece of home ownership and get Bill Gates, Vanguard, BlackRock and State street out of the game. permalink award report block reply\ncbonez416 2 points 4 days ago Your still in a war and yes we are 45 years behind the globalist commies. You will own nothing and be happy!! permalink award report block reply\nDRKMSTR 2 points 5 days ago We have been spending $2-3 trillion extra every year since COVID. Covid Build Back Better Act Inflation Reduction Act CHIPS act\n5.? BBB? And that's on top of our regular budget. permalink award report block reply\njlange94 2 points 5 days ago I'm 31 and still renting. My only hope of buying soon is for some investments to seriously skyrocket. I work an above average paying job for my age but live in a blue state and still can't buy a decent home yet. Anything under 300k is either 100+ years old or would need some serious fixing up. permalink award report block reply\ntuaris 2 points 5 days ago You need a double income too. permalink award report block reply\nHockeyMom4Trump 2 points 4 days ago I see this another way. Back in the old days, the goal was to meet someone, buy a home, have children, work your job… These days, many young people appreciate mobility. They have flexible jobs. They can work from anywhere. They don’t want to own a home. They like the freedom of being able to move around and travel and explore. They are getting married later. Having children later. I have an adult son. He does not want to own a home right now with maintenance and something anchoring him down. He likes freedom. He can rent an apartment with a nice pool, fitness center, no maintenance and when he is done working each day, he need not worry about lawn care or painting the kitchen. His job has flexibility so if he tires of the area he currently lives in he can easily relocate. Not everyone wants to own a home. Home ownership can be a weight and a burden. I look at this metric and can see that it is comparable to other measures that young people are now doing later, like marriage and children. permalink award report block reply\nUpvoteBot 2 points 4 days ago The housing prices skyrocketing began with people fleeing cities when working remotely became the norm. Why remain in a crappy little apartment in a city, when you could move to the burbs and buy a house without having to change jobs nor commute. Then you add 40,000,000 brown fucks who are here illegally. Those invaders all need a place to live so the government pays to put them into various housing situations, like the apartments left by the people I mentioned above. Now, the available inventory of housing is used up. Finally you have hedge funds buying up everything they can get their hands on placing the final nail in the housing affordability coffin.\nThe $2T spending didn’t help, but the biggest problem for inflation, is all the extra people to house and mouths to feed. Illegal immigration is ABSOLUTELY the source of the majority of our financial problems right now. They don’t add anything, they just take welfare and drive up prices be consuming inventories of everything. permalink award report block reply\nRedditIs4Retards 2 points 4 days ago I bought my first house at 28 in 2018 under trump. Could easily have bought it a few years sooner but unfortunately decided to wait to get married. Would have had a 3k Sq ft house on 10 acres for less than I paid for a 1300sq ft house on 1/4 acre. I cannot imagine buying my first house even with much better income. My same house is now 700k with 6.3% interest. permalink award report block reply\n45ichooseu 2 points 5 days ago Bought at age 34 in 2020. Still needed help from family. permalink award report block reply PiratePatriotParrot OP 2 points 5 days ago 34 for me too permalink parent award report block reply\nPiratePatriotParrot OP 2 points 5 days ago 34 for me too permalink parent award report block reply\nRememberCharlieKirk 1 points 5 days ago Still, I think voting rights should just extend to homeowners who have ancestry of at least two generations of American citizens. permalink award report block reply\nbluewhiteandred 1 points 4 days ago related: \"mortgages are a scam\" permalink award report block reply\nthelastlast 1 points 5 days ago China owned Biden and had him do stuff to harm the country, yes.  Congress didnt stop him because they owned Congress too. all of this is our own faults. permalink award report block reply\nUSAUSA 1 points 5 days ago Listen Jack! .... <inaudible mumbling> .... mushroom .... .... <inaudible mumbling> ... Obama! ... <awkward silence> .... push-up contest! <shit-eating grin> permalink award report block reply\nfazaman 1 points 4 days ago ... And mass immigration. Let's not forget about that market pressure! permalink award report block reply\nHanging_Chad 1 points 5 days ago yikes permalink award report block reply\nwintervagina 1 points 4 days ago My wife and I bought our first house during the first real-estate bubble in 2007. We were 27 at the time. 4% on a $220k ranch house. In 2008, everything crashed and my wife lost her job due to no work. We went bankrupt and walked away from the house, foreclosure. We lived modesty for the next 10 years and rented a trailer for $500 a month from a family member. After our bankruptcy fell off, we began looking for a house to buy again. In 2017 we found a nice farm house for $150k on 2 acres. Even has a detached garage which i turned into my woodshop and where I work on my truck. 3% mortgage. The economy was booming because of Trump. We lucked out. Our mortgage is lower now and we're making 4x more money at work now then we were back then. Struggling for those 10 years to save and get back on our feet was hard work but we made it happen. Just good timing for us that we bought in 2017 I guess. permalink award report block reply\nMrMcGreenGenes 1 points 5 days ago Sure it's not Letitia James types dragging up the average? permalink award report block reply\nSaltyChad 1 points 5 days ago Correlation to age that people are getting married and having kids??? Bunch of pagan, drug and sex fueled transients in that age bracket now. permalink award report block reply\nmkil5 1 points 5 days ago I'm very thankful to have taken advantage of my housing crisis repo.  Had it paid off in 2015 at 27. Still here. permalink award report block reply\nShitsbrokeyo 1 points 5 days ago Median Age\nYoY Change\nFirst-Time Share\n2009\n37\n+1\n37% 2010\n30    -7\n47% What Actually Happened?This was not a “healthy” market recovery. It was a distressed-buyer surge in the aftermath of the Great Financial Crisis (GFC).Economic Conditions Driving the Collapse in AgeFactor\n2009 → 2010 Impact\nExplanation\nHome Prices\n-12% YoY (Case-Shiller)\nForeclosures flooded the market. Median existing-home price fell from $208K → $183K.\nMortgage Rates\n5.0% → 4.7% (30-yr fixed)\nFed kept rates near zero; banks desperate to lend post-bailout.\nCredit Availability\nFHA 3.5% down + seller concessions\nFHA share of first-time loans jumped from 37% → 56%. Allowed 580 FICO scores.\nFirst-Time Buyer Tax Credit\n$8,000 (expanded)\nEnacted Nov 2009, extended to April 2010. Required closing by June 30.\nInventory Surge\n+35% YoY (NAR)\n4.5M homes in foreclosure pipeline. Distressed sales = 33% of total.\nUnemployment (Youth)\n19.1% (16–24 y.o.)\nHigh, but investors & parents bought for cash-strapped kids. Who Were the 2010 First-Time Buyers?47% were under 30 (vs. 32% in 2009)\n60% used FHA loans (vs. 40% pre-crisis norm)\n28% received down-payment gifts (record high)\nMedian income: $62K → barely above 2000 levels (inflation-adjusted) Key Insight: This was a \"fire sale\" cohort, not a structural improvement. Many bought REO (bank-owned) homes at 20–30% discounts in exurbs (e.g., Phoenix, Las Vegas, Inland Empire).\nWhy the Age Dropped So SharplyOlder buyers (35–45) were underwater → couldn’t sell to upgrade → locked out.\nYoung buyers had no prior home → no negative equity → could buy distressed assets.\nTax credit + low rates = FOMO → pulled forward demand from 25–29 y.o. renters.\nInvestor competition was low → institutions hadn’t yet formed (Blackstone’s Invitation Homes launched 2012).\nWhy the Age Dropped So SharplyOlder buyers (35–45) were underwater → couldn’t sell to upgrade → locked out.\nYoung buyers had no prior home → no negative equity → could buy distressed assets.\nTax credit + low rates = FOMO → pulled forward demand from 25–29 y.o. renters.\nInvestor competition was low → institutions hadn’t yet formed (Blackstone’s Invitation Homes launched 2012). The Aftermath (2011–2013)Tax credit expired → first-time share fell to 37%\nPrices bottomed in 2012 → age rebounded to 31\nNo repeat of 2010 → inventory normalized, FHA tightened (2013) Conclusion: The 2010 drop was a one-time anomaly driven by crisis-era distortions, not sustainable affordability. It remains the only -7-year move in NAR data. permalink award report block reply\nSmashley 1 points 4 days ago I was 28 in 2006 when I bought by 1st. Zero down and I got a check for 1k at closing. I made 100k tax free on that house in 8 years of ownership. It was a huge shot in the arm and something I could repeat. Buy a new home, fix it up over a few years and see it. Now the interest rates take you too far backwards to do this. I had my fun but I feel for the kiddos today. permalink award report block reply\nGoldwaterVoter 1 points 5 days ago 1969:  26     Brand new 4 BR, 1/4 acre home in Mission Viejo, CA. nothing out of the ordinary. 30 year mortgage, about $250/mo. permalink award report block reply\nScoobyDum 1 points 4 days ago Americans can’t buy homes, because illegals are snatching them up where 50 of them live in it and can split the 400k 7% loan 20 ways permalink award report block reply LordCommissarYarrick 1 points 4 days ago And people buying like five or six of the damn things. Like seriously who needs that many? permalink parent award report block reply\nLordCommissarYarrick 1 points 4 days ago And people buying like five or six of the damn things. Like seriously who needs that many? permalink parent award report block reply\nCreepFast 1 points 5 days ago I bought my first house last year. I was 38... I also moved away from the west coast to the Midwest to do so.  I make more money and the cost of living is cheaper. permalink award report block reply\n_Sully_ 1 points 5 days ago Yeah, I just don't know why it hasn't been fixed in 10 months though. That settles it I voting Mamdani for Caliphate. permalink award report block reply\nShitFromShinola 1 points 5 days ago HAHAHA.... Homie forgot to include 2017-2020 when the average age was 33. Bottom line is that whoever the President is, he doesn't have a lot of sway over shit like this. permalink award report block reply\nShitsbrokeyo 1 points 5 days ago Final Verdict on Biden Era\"The worst affordability environment for first-time buyers since the early 1980s.\"\nRoot Cause: Exogenous inflation + Fed response, not policy failure per se.\nBut: No countervailing supply or credit policy offset the damage.\nLegacy: First-time buyers delayed by 5–7 years vs. prior generations.A 28-year-old in 2021 is still renting in 2025 (age 32).\nWealth gap: Early buyers (2020–21) gained $150K+ equity; late entrants locked out. permalink award report block reply\n2016TrumpMAGA 1 points 4 days ago I blame student loans. You cannot enslave young people with tens of thousands of dollars in debt, requiring them to make thousand dollar a month payments through their twenties and early thirties and expect them to be able to start families and buy homes. Average student loan debt is almost $40,000. If you graduated at age 22 with $40,000 in student loan debt, you pay $470/month until you are 32 to pay it off. That is ridiculous. The average student loan debt for graduate school is about $88,220. That's $1025/month, PLUS $470/month. For a doctorate it's $250,000. $2900/month. None of which has a hope in hell of being repaid because some fucking jeet with a fake degree he paid $1000 for will hire other fucking jeets with fake degrees. Student loans need to end NOW, the interest rate on outstanding balances lowered to zero, discharge in bankruptcy permitted, and repayment implemented by payroll deductions over the next 30 years (a $50,000 student loan with zero interest paid off over the next 30 years is only $138/month) with tax benefits for early payoff. permalink award report block reply\nthisaintitchief76 1 points 4 days ago Is that why I can't afford a home now? I've had a $150k pre-approval and I can't find a single house worth living in. Everything needs at least $100k in updates. permalink award report block reply\nGoozmania 1 points 5 days ago What actually happened is it is following the age of the oldest millennials. The millennial generation cannot buy homes; and nor will gen z. permalink award report block reply\nTonsOfSalt 1 points 4 days ago I would be more worried if 70 year olds were receiving 30 year mortgages permalink award report block reply Zelda 1 points 4 days ago Believe it or not, they are. permalink parent award report block reply\nZelda 1 points 4 days ago Believe it or not, they are. permalink parent award report block reply\nLookFatty 1 points 5 days ago First buy '89 at 28. 82k. San Bernardino mountains.\nHouse now on Zillow 370k 2 bed 1 bath permalink award report block reply\njatergator 1 points 4 days ago Housing went up 40% in 2021-2022. Insanity. permalink award report block reply\nYesImWhite -1 points 5 days ago bought one at 28 in 2024 lol goddam. Its been brutal on the wallet but this is nice to see permalink award report block reply\nCLF3 -1 points 5 days ago 42 here, and there's no point in me even trying to get a house anymore.  I'm to the age I will see absolutely no benefit from it. permalink award report block reply DJT4547 3 points 5 days ago Huh? You can buy a house and have it paid off or almost paid off by the time you're ready to retire. permalink parent award report block reply CLF3 0 points 5 days ago Yep, already said it's pointless.  Another ten years my kids are out the door and there's no point in owning one.  And if you think I can pay one off in 20 at 6% you're fuckin nuts, because I'll be living in my fucking office and may as well not own one anyway. I'm gonna take a hard pass on the wage slavery, thanks. If I'm gonna pay rent, I may as well only pay one rent and not a mortgage AND rent to the government to keep them from selling it out from under me to blackrock or some other pile of money. permalink parent award report block reply\nDJT4547 3 points 5 days ago Huh? You can buy a house and have it paid off or almost paid off by the time you're ready to retire. permalink parent award report block reply CLF3 0 points 5 days ago Yep, already said it's pointless.  Another ten years my kids are out the door and there's no point in owning one.  And if you think I can pay one off in 20 at 6% you're fuckin nuts, because I'll be living in my fucking office and may as well not own one anyway. I'm gonna take a hard pass on the wage slavery, thanks. If I'm gonna pay rent, I may as well only pay one rent and not a mortgage AND rent to the government to keep them from selling it out from under me to blackrock or some other pile of money. permalink parent award report block reply\nCLF3 0 points 5 days ago Yep, already said it's pointless.  Another ten years my kids are out the door and there's no point in owning one.  And if you think I can pay one off in 20 at 6% you're fuckin nuts, because I'll be living in my fucking office and may as well not own one anyway. I'm gonna take a hard pass on the wage slavery, thanks. If I'm gonna pay rent, I may as well only pay one rent and not a mortgage AND rent to the government to keep them from selling it out from under me to blackrock or some other pile of money. permalink parent award report block reply\ndeleted -2 points 5 days ago HockeyMom4Trump 6 points 5 days ago I bought my first house at 26. Live below your means and do not buy more house than you need! permalink parent award report block reply bidensmissingbrain 8 points 5 days ago Not always feasible. They don't make small houses with big garages hardly anywhere. And most cities/towns/developments won't let you build that way either. So then you're stuck trying to buy a plot of farm ground for 20k and acre with a minimum 20 acre buy. permalink parent award report block reply Zelda 2 points 4 days ago Facts. If any builder would make starter homes they’d sell them all day long. Now they refer to 2500sf as a starter home or downsizing. permalink parent award report block reply DontTreadOnLego 1 points 5 days ago 26 for me as well, in 2002 permalink parent award report block reply Agenda47 6 points 5 days ago Rent. permalink parent award report block reply deleted -4 points 5 days ago LiveFreeorDie0729 9 points 5 days ago This is the most boomer shit I've read in a while. permalink parent award report block reply BarrensChat 1 points 4 days ago There are plenty of millennials that can afford to buy a house even at their current prices, but they don't want to blow a large chunk of thei savings on a home that is nearly double the price it should be. permalink parent award report block reply Goozmania 7 points 5 days ago You people need to disappear. You don't understand macroeconomics. This catastrophe was accurately predicted back when millennials were children and gen z weren't even born. Stop blaming the fucking victims. https://kinder.rice.edu/urbanedge/what-millennials-think-homeownership-and-why-it-matters?utm_source=chatgpt.com https://www.pewresearch.org/social-trends/2013/02/21/chapter-1-the-changing-financial-mileposts-of-young-adults/?utm_source=chatgpt.com https://highline.huffingtonpost.com/articles/en/poor-millennials/ (this is before huffpost became violently leftist) permalink parent award report block reply MajJamesMcFarlane 2 points 5 days ago Medical expenses permalink parent award report block reply deleted -3 points 5 days ago MajJamesMcFarlane 1 points 4 days ago I spend over 6,500 a year on medical expenses. That doesn't include the cost of health insurance permalink parent award report block reply Goozmania 1 points 5 days ago We're not making money, to begin with... because we followed the path we were force fed, and entered into an economy that had no need of us. There are 20 millennial/gen z graduates in any given field for every 1 job. Many don't want to go into a trade school or become an electrician or plumber, after spending $100k+ on an education. permalink parent award report block reply 10knotsorless -6 points 5 days ago Hahah.  Good question.  42 and just bought a second house that needed a full renovation.  Now operating as a successful Airbnb.  What are y’all spending all your money on? permalink parent award report block reply PapaPepe 11 points 5 days ago People like you are why we have a housing problem. permalink parent award report block reply 10knotsorless -2 points 5 days ago Excuse me?   Please explain? permalink parent award report block reply bidensmissingbrain 9 points 5 days ago He buys a second house which he doesn't actually need which prevents someone else who could actually buy and live there from owning a place. Pretty simple. EDIT: lol, found the boomers permalink parent award report block reply view 6 more comments... PapaPepe 7 points 5 days ago Secondary properties that nobody lives in directly puts more pressure on the housing market as you are permantly taking one off of it for some Airbnb side money. It raises the prices for existing homes because it wouldn't be a good airbnb if it wasn't in a desirable area. It's the equivalent of another family of illegals coming over the border and occupying housing. It's like Black rock, Vanguard and the other big companies. You aren't just a small investor with a couple of properties, there are hundreds of thousands of you. So house prices go up, rent goes up because people can't afford the houses that have now doubled in price in 5 years and people who do have a house are having trouble because their property taxes are shooting up. Half of the country is currently struggling to make a rent or mortgage payment right now. The mortgage you are paying for both homes is probably equal to what someone would have to pay to buy just one of them today. It's never been more unaffordable to buy a home in this country. permalink parent award report block reply view 2 more comments... makersmarx 3 points 5 days ago As the housing affordability crisis deepens, Airbnb and Vrbo face backlash | CNN Business https://share.google/of7nOR6J8xOVB3Q0H permalink parent award report block reply Goozmania 2 points 5 days ago Fuck you. AirBNB should be banned, and people who have one should be punched in the face. permalink parent award report block reply SimaYi 1 points 4 days ago You obviously live in the middle of nowhere. permalink parent award report block reply\nHockeyMom4Trump 6 points 5 days ago I bought my first house at 26. Live below your means and do not buy more house than you need! permalink parent award report block reply bidensmissingbrain 8 points 5 days ago Not always feasible. They don't make small houses with big garages hardly anywhere. And most cities/towns/developments won't let you build that way either. So then you're stuck trying to buy a plot of farm ground for 20k and acre with a minimum 20 acre buy. permalink parent award report block reply Zelda 2 points 4 days ago Facts. If any builder would make starter homes they’d sell them all day long. Now they refer to 2500sf as a starter home or downsizing. permalink parent award report block reply DontTreadOnLego 1 points 5 days ago 26 for me as well, in 2002 permalink parent award report block reply\nbidensmissingbrain 8 points 5 days ago Not always feasible. They don't make small houses with big garages hardly anywhere. And most cities/towns/developments won't let you build that way either. So then you're stuck trying to buy a plot of farm ground for 20k and acre with a minimum 20 acre buy. permalink parent award report block reply Zelda 2 points 4 days ago Facts. If any builder would make starter homes they’d sell them all day long. Now they refer to 2500sf as a starter home or downsizing. permalink parent award report block reply\nZelda 2 points 4 days ago Facts. If any builder would make starter homes they’d sell them all day long. Now they refer to 2500sf as a starter home or downsizing. permalink parent award report block reply\nDontTreadOnLego 1 points 5 days ago 26 for me as well, in 2002 permalink parent award report block reply\nAgenda47 6 points 5 days ago Rent. permalink parent award report block reply deleted -4 points 5 days ago LiveFreeorDie0729 9 points 5 days ago This is the most boomer shit I've read in a while. permalink parent award report block reply BarrensChat 1 points 4 days ago There are plenty of millennials that can afford to buy a house even at their current prices, but they don't want to blow a large chunk of thei savings on a home that is nearly double the price it should be. permalink parent award report block reply Goozmania 7 points 5 days ago You people need to disappear. You don't understand macroeconomics. This catastrophe was accurately predicted back when millennials were children and gen z weren't even born. Stop blaming the fucking victims. https://kinder.rice.edu/urbanedge/what-millennials-think-homeownership-and-why-it-matters?utm_source=chatgpt.com https://www.pewresearch.org/social-trends/2013/02/21/chapter-1-the-changing-financial-mileposts-of-young-adults/?utm_source=chatgpt.com https://highline.huffingtonpost.com/articles/en/poor-millennials/ (this is before huffpost became violently leftist) permalink parent award report block reply\ndeleted -4 points 5 days ago LiveFreeorDie0729 9 points 5 days ago This is the most boomer shit I've read in a while. permalink parent award report block reply BarrensChat 1 points 4 days ago There are plenty of millennials that can afford to buy a house even at their current prices, but they don't want to blow a large chunk of thei savings on a home that is nearly double the price it should be. permalink parent award report block reply Goozmania 7 points 5 days ago You people need to disappear. You don't understand macroeconomics. This catastrophe was accurately predicted back when millennials were children and gen z weren't even born. Stop blaming the fucking victims. https://kinder.rice.edu/urbanedge/what-millennials-think-homeownership-and-why-it-matters?utm_source=chatgpt.com https://www.pewresearch.org/social-trends/2013/02/21/chapter-1-the-changing-financial-mileposts-of-young-adults/?utm_source=chatgpt.com https://highline.huffingtonpost.com/articles/en/poor-millennials/ (this is before huffpost became violently leftist) permalink parent award report block reply\nLiveFreeorDie0729 9 points 5 days ago This is the most boomer shit I've read in a while. permalink parent award report block reply BarrensChat 1 points 4 days ago There are plenty of millennials that can afford to buy a house even at their current prices, but they don't want to blow a large chunk of thei savings on a home that is nearly double the price it should be. permalink parent award report block reply\nBarrensChat 1 points 4 days ago There are plenty of millennials that can afford to buy a house even at their current prices, but they don't want to blow a large chunk of thei savings on a home that is nearly double the price it should be. permalink parent award report block reply\nGoozmania 7 points 5 days ago You people need to disappear. You don't understand macroeconomics. This catastrophe was accurately predicted back when millennials were children and gen z weren't even born. Stop blaming the fucking victims. https://kinder.rice.edu/urbanedge/what-millennials-think-homeownership-and-why-it-matters?utm_source=chatgpt.com https://www.pewresearch.org/social-trends/2013/02/21/chapter-1-the-changing-financial-mileposts-of-young-adults/?utm_source=chatgpt.com https://highline.huffingtonpost.com/articles/en/poor-millennials/ (this is before huffpost became violently leftist) permalink parent award report block reply\nMajJamesMcFarlane 2 points 5 days ago Medical expenses permalink parent award report block reply deleted -3 points 5 days ago MajJamesMcFarlane 1 points 4 days ago I spend over 6,500 a year on medical expenses. That doesn't include the cost of health insurance permalink parent award report block reply\ndeleted -3 points 5 days ago MajJamesMcFarlane 1 points 4 days ago I spend over 6,500 a year on medical expenses. That doesn't include the cost of health insurance permalink parent award report block reply\nMajJamesMcFarlane 1 points 4 days ago I spend over 6,500 a year on medical expenses. That doesn't include the cost of health insurance permalink parent award report block reply\nGoozmania 1 points 5 days ago We're not making money, to begin with... because we followed the path we were force fed, and entered into an economy that had no need of us. There are 20 millennial/gen z graduates in any given field for every 1 job. Many don't want to go into a trade school or become an electrician or plumber, after spending $100k+ on an education. permalink parent award report block reply\n10knotsorless -6 points 5 days ago Hahah.  Good question.  42 and just bought a second house that needed a full renovation.  Now operating as a successful Airbnb.  What are y’all spending all your money on? permalink parent award report block reply PapaPepe 11 points 5 days ago People like you are why we have a housing problem. permalink parent award report block reply 10knotsorless -2 points 5 days ago Excuse me?   Please explain? permalink parent award report block reply bidensmissingbrain 9 points 5 days ago He buys a second house which he doesn't actually need which prevents someone else who could actually buy and live there from owning a place. Pretty simple. EDIT: lol, found the boomers permalink parent award report block reply view 6 more comments... PapaPepe 7 points 5 days ago Secondary properties that nobody lives in directly puts more pressure on the housing market as you are permantly taking one off of it for some Airbnb side money. It raises the prices for existing homes because it wouldn't be a good airbnb if it wasn't in a desirable area. It's the equivalent of another family of illegals coming over the border and occupying housing. It's like Black rock, Vanguard and the other big companies. You aren't just a small investor with a couple of properties, there are hundreds of thousands of you. So house prices go up, rent goes up because people can't afford the houses that have now doubled in price in 5 years and people who do have a house are having trouble because their property taxes are shooting up. Half of the country is currently struggling to make a rent or mortgage payment right now. The mortgage you are paying for both homes is probably equal to what someone would have to pay to buy just one of them today. It's never been more unaffordable to buy a home in this country. permalink parent award report block reply view 2 more comments... makersmarx 3 points 5 days ago As the housing affordability crisis deepens, Airbnb and Vrbo face backlash | CNN Business https://share.google/of7nOR6J8xOVB3Q0H permalink parent award report block reply Goozmania 2 points 5 days ago Fuck you. AirBNB should be banned, and people who have one should be punched in the face. permalink parent award report block reply SimaYi 1 points 4 days ago You obviously live in the middle of nowhere. permalink parent award report block reply\nPapaPepe 11 points 5 days ago People like you are why we have a housing problem. permalink parent award report block reply 10knotsorless -2 points 5 days ago Excuse me?   Please explain? permalink parent award report block reply bidensmissingbrain 9 points 5 days ago He buys a second house which he doesn't actually need which prevents someone else who could actually buy and live there from owning a place. Pretty simple. EDIT: lol, found the boomers permalink parent award report block reply view 6 more comments... PapaPepe 7 points 5 days ago Secondary properties that nobody lives in directly puts more pressure on the housing market as you are permantly taking one off of it for some Airbnb side money. It raises the prices for existing homes because it wouldn't be a good airbnb if it wasn't in a desirable area. It's the equivalent of another family of illegals coming over the border and occupying housing. It's like Black rock, Vanguard and the other big companies. You aren't just a small investor with a couple of properties, there are hundreds of thousands of you. So house prices go up, rent goes up because people can't afford the houses that have now doubled in price in 5 years and people who do have a house are having trouble because their property taxes are shooting up. Half of the country is currently struggling to make a rent or mortgage payment right now. The mortgage you are paying for both homes is probably equal to what someone would have to pay to buy just one of them today. It's never been more unaffordable to buy a home in this country. permalink parent award report block reply view 2 more comments... makersmarx 3 points 5 days ago As the housing affordability crisis deepens, Airbnb and Vrbo face backlash | CNN Business https://share.google/of7nOR6J8xOVB3Q0H permalink parent award report block reply\n10knotsorless -2 points 5 days ago Excuse me?   Please explain? permalink parent award report block reply bidensmissingbrain 9 points 5 days ago He buys a second house which he doesn't actually need which prevents someone else who could actually buy and live there from owning a place. Pretty simple. EDIT: lol, found the boomers permalink parent award report block reply view 6 more comments... PapaPepe 7 points 5 days ago Secondary properties that nobody lives in directly puts more pressure on the housing market as you are permantly taking one off of it for some Airbnb side money. It raises the prices for existing homes because it wouldn't be a good airbnb if it wasn't in a desirable area. It's the equivalent of another family of illegals coming over the border and occupying housing. It's like Black rock, Vanguard and the other big companies. You aren't just a small investor with a couple of properties, there are hundreds of thousands of you. So house prices go up, rent goes up because people can't afford the houses that have now doubled in price in 5 years and people who do have a house are having trouble because their property taxes are shooting up. Half of the country is currently struggling to make a rent or mortgage payment right now. The mortgage you are paying for both homes is probably equal to what someone would have to pay to buy just one of them today. It's never been more unaffordable to buy a home in this country. permalink parent award report block reply view 2 more comments... makersmarx 3 points 5 days ago As the housing affordability crisis deepens, Airbnb and Vrbo face backlash | CNN Business https://share.google/of7nOR6J8xOVB3Q0H permalink parent award report block reply\nbidensmissingbrain 9 points 5 days ago He buys a second house which he doesn't actually need which prevents someone else who could actually buy and live there from owning a place. Pretty simple. EDIT: lol, found the boomers permalink parent award report block reply view 6 more comments...\nPapaPepe 7 points 5 days ago Secondary properties that nobody lives in directly puts more pressure on the housing market as you are permantly taking one off of it for some Airbnb side money. It raises the prices for existing homes because it wouldn't be a good airbnb if it wasn't in a desirable area. It's the equivalent of another family of illegals coming over the border and occupying housing. It's like Black rock, Vanguard and the other big companies. You aren't just a small investor with a couple of properties, there are hundreds of thousands of you. So house prices go up, rent goes up because people can't afford the houses that have now doubled in price in 5 years and people who do have a house are having trouble because their property taxes are shooting up. Half of the country is currently struggling to make a rent or mortgage payment right now. The mortgage you are paying for both homes is probably equal to what someone would have to pay to buy just one of them today. It's never been more unaffordable to buy a home in this country. permalink parent award report block reply view 2 more comments...\nmakersmarx 3 points 5 days ago As the housing affordability crisis deepens, Airbnb and Vrbo face backlash | CNN Business https://share.google/of7nOR6J8xOVB3Q0H permalink parent award report block reply\nGoozmania 2 points 5 days ago Fuck you. AirBNB should be banned, and people who have one should be punched in the face. permalink parent award report block reply\nSimaYi 1 points 4 days ago You obviously live in the middle of nowhere. permalink parent award report block reply\netcetera 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nEyesSewnShut 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nCoreytrevor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:12:39.373792Z"
}