{
  "id": "1ARK52Co3H",
  "url": "https://patriots.win/p/1ARK52Co3H/riddle-me-that-/c",
  "content": "266 Riddle me THAT 🤯 ☪️                            ☪️ posted 6 days ago by SuperHonkey 31 comments award share report block Dr. Maalouf ‏ @realMaalouf • 8d How the hell does the city that experienced the biggest Islamic terrorist attack in history vote for a Muslim mayor?\n31 comments Sort by Top Top New Worst Old Save SubmarineGuy 20 points 6 days ago The same way that the attacked country elected a Mozlem president. Twice. permalink award report block reply SuperHonkey OP 6 points 6 days ago For those who don't know... https://youtu.be/bMUgNg7aD8M permalink parent award report block reply SteelBallRun1890 6 points 6 days ago Insane how ABC covers for him and corrects him! The media has been this bad forever, it took so long for most of us to notice permalink parent award report block reply Taliesin 10 points 6 days ago Foreigners, especially Mahommedans, voted in large numbers. They are invaders, not immigrants, and this is how they take over territory. Mass deportation, NOW! permalink award report block reply RedWave26 10 points 6 days ago They replaced the population. permalink award report block reply MAG-n-KAG 7 points 6 days ago the power of propaganda.  its the most dangerous weapon on the planet. permalink award report block reply SpaceWizard 6 points 6 days ago 9/11 was a demolition. They found thermite in the wreckage. permalink award report block reply USDMaga 5 points 6 days ago How does Europe who lost millions fighting Germany in TWO world wars vote to be ruled by Germany in the EU? permalink award report block reply PatriotSkorzeny 5 points 6 days ago Fraud, LE and treason. permalink award report block reply FusionBlack 4 points 6 days ago We let the government import legal and illegals into this country. Now we have Hell to pay. permalink award report block reply Littleirishmaid 4 points 6 days ago Liberal guilt permalink award report block reply ChyNahAzzWhole1 4 points 6 days ago NO ONE WANTS TO BE CALLED... Racist, Bigot, Islamophobic. Democrats need the votes. permalink award report block reply Formerlurker92 4 points 6 days ago Conquered people don't have their votes counted permalink award report block reply Aggrieved03 3 points 6 days ago They voted for Brennan and Cheney? permalink award report block reply MeMargie 3 points 6 days ago Public Education. permalink award report block reply magapatriot_pa 3 points 6 days ago They forgot permalink award report block reply josiborg 3 points 6 days ago They replaced all the whites with family that died for that with Muslims. permalink award report block reply greatpumpkin 3 points 6 days ago Repeal the 19th. permalink award report block reply Saltish 2 points 6 days ago An openly Jihadist Muslim mayor. Answer: by importing millions of third-worlders who hate America? permalink award report block reply Floppybutthole 2 points 6 days ago Ask the dancing isreali's permalink award report block reply 2025WhatIsTrue 2 points 6 days ago Easy...a plethora of LIB nitwits! permalink award report block reply Franklymydear 2 points 6 days ago Indoctrinate them The Muslims have not stopped, fighting that Jihad. Unfortunately, we forgot we are literally at war for the hearts and minds of the country. ….\nToo many people are still asleep and don’t realize that the schools, social media, all served to indoctrinate permalink award report block reply RudeFrog 2 points 6 days ago Wouldn't want to be racist permalink award report block reply redinmn 2 points 5 days ago The terrorist attack never stopped happening.  They didnt go away after that, they kept coming and flooded their target. permalink award report block reply Snooptwo 2 points 6 days ago Immigration. That’s how. permalink award report block reply MADASHELLNEWS 1 points 6 days ago Look into Tim Osman and urban moving company also check out Israeli truck bombs stopped by police on 9-11. permalink award report block reply BumpForTrump 1 points 6 days ago They dont permalink award report block reply 1DontTreadOnMe1 0 points 6 days ago How did you forget that it was an inside job done by the Bush administration with a little help from the CIA and some dancing Israelis? permalink award report block reply Appeal2Heaven98 0 points 6 days ago I won't lie. Mamdani's successful campaign diminished my hopium supply. permalink award report block reply SuperHonkey OP 3 points 6 days ago Laughs in Dominion permalink parent award report block reply\nSubmarineGuy 20 points 6 days ago The same way that the attacked country elected a Mozlem president. Twice. permalink award report block reply SuperHonkey OP 6 points 6 days ago For those who don't know... https://youtu.be/bMUgNg7aD8M permalink parent award report block reply SteelBallRun1890 6 points 6 days ago Insane how ABC covers for him and corrects him! The media has been this bad forever, it took so long for most of us to notice permalink parent award report block reply\nSuperHonkey OP 6 points 6 days ago For those who don't know... https://youtu.be/bMUgNg7aD8M permalink parent award report block reply SteelBallRun1890 6 points 6 days ago Insane how ABC covers for him and corrects him! The media has been this bad forever, it took so long for most of us to notice permalink parent award report block reply\nSteelBallRun1890 6 points 6 days ago Insane how ABC covers for him and corrects him! The media has been this bad forever, it took so long for most of us to notice permalink parent award report block reply\nTaliesin 10 points 6 days ago Foreigners, especially Mahommedans, voted in large numbers. They are invaders, not immigrants, and this is how they take over territory. Mass deportation, NOW! permalink award report block reply\nRedWave26 10 points 6 days ago They replaced the population. permalink award report block reply\nMAG-n-KAG 7 points 6 days ago the power of propaganda.  its the most dangerous weapon on the planet. permalink award report block reply\nSpaceWizard 6 points 6 days ago 9/11 was a demolition. They found thermite in the wreckage. permalink award report block reply\nUSDMaga 5 points 6 days ago How does Europe who lost millions fighting Germany in TWO world wars vote to be ruled by Germany in the EU? permalink award report block reply\nPatriotSkorzeny 5 points 6 days ago Fraud, LE and treason. permalink award report block reply\nFusionBlack 4 points 6 days ago We let the government import legal and illegals into this country. Now we have Hell to pay. permalink award report block reply\nLittleirishmaid 4 points 6 days ago Liberal guilt permalink award report block reply\nChyNahAzzWhole1 4 points 6 days ago NO ONE WANTS TO BE CALLED... Racist, Bigot, Islamophobic. Democrats need the votes. permalink award report block reply\nFormerlurker92 4 points 6 days ago Conquered people don't have their votes counted permalink award report block reply\nAggrieved03 3 points 6 days ago They voted for Brennan and Cheney? permalink award report block reply\nMeMargie 3 points 6 days ago Public Education. permalink award report block reply\nmagapatriot_pa 3 points 6 days ago They forgot permalink award report block reply\njosiborg 3 points 6 days ago They replaced all the whites with family that died for that with Muslims. permalink award report block reply\ngreatpumpkin 3 points 6 days ago Repeal the 19th. permalink award report block reply\nSaltish 2 points 6 days ago An openly Jihadist Muslim mayor. Answer: by importing millions of third-worlders who hate America? permalink award report block reply\nFloppybutthole 2 points 6 days ago Ask the dancing isreali's permalink award report block reply\n2025WhatIsTrue 2 points 6 days ago Easy...a plethora of LIB nitwits! permalink award report block reply\nFranklymydear 2 points 6 days ago Indoctrinate them The Muslims have not stopped, fighting that Jihad. Unfortunately, we forgot we are literally at war for the hearts and minds of the country. ….\nToo many people are still asleep and don’t realize that the schools, social media, all served to indoctrinate permalink award report block reply\nRudeFrog 2 points 6 days ago Wouldn't want to be racist permalink award report block reply\nredinmn 2 points 5 days ago The terrorist attack never stopped happening.  They didnt go away after that, they kept coming and flooded their target. permalink award report block reply\nSnooptwo 2 points 6 days ago Immigration. That’s how. permalink award report block reply\nMADASHELLNEWS 1 points 6 days ago Look into Tim Osman and urban moving company also check out Israeli truck bombs stopped by police on 9-11. permalink award report block reply\nBumpForTrump 1 points 6 days ago They dont permalink award report block reply\n1DontTreadOnMe1 0 points 6 days ago How did you forget that it was an inside job done by the Bush administration with a little help from the CIA and some dancing Israelis? permalink award report block reply\nAppeal2Heaven98 0 points 6 days ago I won't lie. Mamdani's successful campaign diminished my hopium supply. permalink award report block reply SuperHonkey OP 3 points 6 days ago Laughs in Dominion permalink parent award report block reply\nSuperHonkey OP 3 points 6 days ago Laughs in Dominion permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:06:27.027602Z"
}