{
  "id": "1ARK54SlsX",
  "url": "https://patriots.win/p/1ARK54SlsX/us-government-revokes-80000-visa/c",
  "content": "336 US Government Revokes 80,000 Visas. “The Trump Administration will not hesitate to revoke visas from foreigners who undermine our laws or threaten our national security,” (www.zerohedge.com) posted 5 days ago by Sea_Still 8 comments award share report block US Government Revokes 80,000 Visas ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero www.zerohedge.com\n8 comments Sort by Top Top New Worst Old Save Datamancer 7 points 5 days ago Every H1B threatens national security.   Every Iman, every dual-nationality representative and senator, every foreign student, and every foreign laborer. permalink award report block reply Elencher 6 points 5 days ago And yet we can't git rid of Ilan Omar, Mandami, or that fucking illegal who won the mayor race... permalink award report block reply LolOkFBI 4 points 5 days ago Shoot let's revoke em all, start back over clean slate, and then decide who we really want to let back in. Way too many people, way too much crime, America is getting third worlded permalink award report block reply sobriquet 3 points 5 days ago That's exactly how it should be. permalink award report block reply ACActual 2 points 5 days ago Whatever.  Now do Muslims permalink award report block reply ChicagoforTrump 1 points 5 days ago Or if you mention the JP. permalink award report block reply birddogz 1 points 5 days ago Sorry no can do, some commie judge will just say no and Trump will obey. permalink award report block reply anotherthing 1 points 5 days ago Are they undermining our laws and threatening our national security or are they just protesting Israel? permalink award report block reply\nDatamancer 7 points 5 days ago Every H1B threatens national security.   Every Iman, every dual-nationality representative and senator, every foreign student, and every foreign laborer. permalink award report block reply\nElencher 6 points 5 days ago And yet we can't git rid of Ilan Omar, Mandami, or that fucking illegal who won the mayor race... permalink award report block reply\nLolOkFBI 4 points 5 days ago Shoot let's revoke em all, start back over clean slate, and then decide who we really want to let back in. Way too many people, way too much crime, America is getting third worlded permalink award report block reply\nsobriquet 3 points 5 days ago That's exactly how it should be. permalink award report block reply\nACActual 2 points 5 days ago Whatever.  Now do Muslims permalink award report block reply\nChicagoforTrump 1 points 5 days ago Or if you mention the JP. permalink award report block reply\nbirddogz 1 points 5 days ago Sorry no can do, some commie judge will just say no and Trump will obey. permalink award report block reply\nanotherthing 1 points 5 days ago Are they undermining our laws and threatening our national security or are they just protesting Israel? permalink award report block reply",
  "fetched_at": "2025-11-12T23:11:03.816198Z"
}