{
  "id": "8171956",
  "title": "1431No ship for youposted6 days agobysebster132 commentsawardsharedownloadreportblock",
  "url": "https://patriots.win/p/1ARK52DM5G/no-ship-for-you/c",
  "content": "1431 No ship for you posted 6 days ago by sebster 132 comments award share download report block\n132 comments Sort by Top Top New Worst Old Save projectarcturus1 100 points 6 days ago Inbred filth that needs to be removed from our country. All somalis need to be sent back home. permalink award report block reply Twitter 38 points 6 days ago no lie they are some if not the most ugly people on the face of the planet, they look like aliens, and their foreheads are massive permalink parent award report block reply Agent_Orange 9 points 6 days ago I always wondered about people whose ears were lower than their eyes, and their cognitive ability. permalink parent award report block reply SicSemperTyrannis2 6 points 6 days ago Average IQ below 80 permalink parent award report block reply Agent_Orange 4 points 5 days ago You're very generous. I've seen rankings for Somalia that put them at one of the lowest IQs in the world (68 to 71). Explains a lot, huh? permalink parent award report block reply view 1 more comments... Nikola_S1 3 points 5 days ago As someone said, the triangle-faced ones are the most dangerous. permalink parent award report block reply MemoryHoleyeO 3 points 6 days ago Insects, not even aliens permalink parent award report block reply Redpilled2Depression 5 points 6 days ago Sub human permalink parent award report block reply Mortal_Wombat 1 points 5 days ago Zorak would like a word with you... permalink parent award report block reply swarleybing 2 points 6 days ago I wonder if he was advised to cut it shorter for the mayor race, to make him look less...whatever permalink parent award report block reply strictly1957 1 points 5 days ago That's a seven head permalink parent award report block reply load 2 more comments... Glory-Unto-God 11 points 6 days ago And the hatians. And the indians. And the rest of the blacks for that matter. Edit: anyone who professes to follow islam can also be kicked out. Send the jews home too. permalink parent award report block reply knnbccb 10 points 6 days ago Their kind has been inbred for centuries . If you want to remove them, you need a LOT of manpower and muscle. permalink parent award report block reply newuser8 6 points 6 days ago No we don't. We just tell them \"no\" and to get on this plane or we kill you. It wasnt that long ago that Germany got rid of their problem people permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago Like he said, manpower and muscle. permalink parent award report block reply Mindcrym 2 points 6 days ago I'd recommend a flame thrower on these fucks. permalink parent award report block reply CovfefeVideo 54 points 6 days ago Looks llike Frylock's retarded cousin. permalink award report block reply Rydanovich 21 points 6 days ago Damn that's a helluva reference. I applaud. permalink parent award report block reply bejeavis 11 points 6 days ago He could always hold out for a race swapped Netflix remake of Phineas and ferb permalink parent award report block reply D__1 6 points 6 days ago \"Where's Perry ?\" Camera zooms to race swapped Phineas who looks sideways as he finishes chewing something... permalink parent award report block reply SanePerson 3 points 6 days ago Brilliant permalink parent award report block reply DoMagnum 3 points 6 days ago You mean the one who gots the AIDS? permalink parent award report block reply Nate_Higgersalot 2 points 6 days ago “Now felate me while I eat this expensive ham”. permalink parent award report block reply load 1 more comments... TheRedPilledArtist 39 points 6 days ago 𝙈𝘼𝙍𝙎 𝘼𝙏𝙏𝘼𝘾𝙆𝙎 ! permalink award report block reply DT170x 21 points 6 days ago ACK.ACK.ACK! permalink parent award report block reply AwShitHereWeGoAgain 2 points 6 days ago Have you been watching DSP????? permalink parent award report block reply anotherthing 3 points 6 days ago Nosferatu version of Blackula. permalink parent award report block reply DingleBalls 31 points 6 days ago Wow Chris Rock is looking terrible these days permalink award report block reply Patriot4TN 15 points 6 days ago Ok... this was funny! Thanks for the laugh. permalink parent award report block reply loveshock 3 points 6 days ago Dont know why but I immediately had Chris Rocks voice in my head when I saw the picture. permalink parent award report block reply least_counties_ever 31 points 6 days ago Ilhan Omar’s brusband? permalink award report block reply MastaJoda 3 points 6 days ago I love steak and you just made me spit it all over the floor. Have an upvote. permalink parent award report block reply HockeyMom4Trump 2 points 6 days ago Brusband. Bahahaha permalink parent award report block reply hughjasske69 12 points 6 days ago How many years has this pathetic starving fuck been in the country and he still hasn't gained a pound? permalink award report block reply dr_gonzo 11 points 6 days ago He's probably chewing that khat shit all day...and dining on cat at night. permalink parent award report block reply deleted 12 points 6 days ago SneakyWino 12 points 6 days ago The sheriff is a N..... permalink parent award report block reply vote_for_MAGA_2020 6 points 6 days ago I permalink parent award report block reply Bramage 3 points 6 days ago G permalink parent award report block reply Briankitis 4 points 6 days ago G permalink parent award report block reply view 2 more comments... MAGA_FL_MAN 3 points 6 days ago 🔔 permalink parent award report block reply Slugbert 12 points 6 days ago Just look at that fucking guy. There is absolutely ZERO intelligence behind those eyes. permalink award report block reply cptkloss5 11 points 6 days ago can you imagine what these low IQ imbeciles must be thinking? \"how retarded are these white morons - i almost became a mayor of a major american city...\" permalink award report block reply MagaPhone017 2 points 6 days ago They dragged the Potato over the finish line, at least this one will be easier to physically carry. permalink parent award report block reply OutlawPurpleHairDye 10 points 6 days ago Must be a lot of chlorine in that gene pool permalink award report block reply DCYR66 6 points 6 days ago A very shallow pool to boot. permalink parent award report block reply MagaPhone017 2 points 6 days ago \"Above-ground and inflatable, if you know what I mean.\" ---The Bride permalink parent award report block reply Filo76 9 points 6 days ago Not yet… Unless we deport this freaky looking skinny, he will keep relentlessly running for office until “elected”. permalink award report block reply SicSemperTyrannis2 1 points 6 days ago Where did it run? permalink parent award report block reply LibtardBusterMAGA 6 points 6 days ago That's the 40 IQ stare permalink award report block reply knnbccb 1 points 5 days ago Don't forget genetic defects. Centuries of Islamic inbreeding that would even make Alabama blush. permalink parent award report block reply SnowSnake 6 points 6 days ago He looks like someone made a caricature of Chris Rock, and squished the bottom, which made the top of his head balloon out. permalink award report block reply AlexPKeaton 6 points 6 days ago WTF is even that thing?? permalink award report block reply CommieCrats 5 points 6 days ago Deus VULT Gundam permalink award report block reply Hunter_loves_2_feet 5 points 6 days ago Is that the dude from the movie or the guy that ran for office because I’m not joking when I say I can’t tell. permalink award report block reply SicSemperTyrannis2 1 points 6 days ago They are the same picture permalink parent award report block reply cptkloss5 4 points 6 days ago good one permalink award report block reply NonbinaryPotatohead 4 points 6 days ago HAHA! Look at the genetic lottery here! permalink award report block reply KekistanPM 4 points 6 days ago I wonder if he'll try again. Some people really believe they're entitled to being captain even if they don't know the first thing about the job or have their own plans to do it terribly wrong. Like Beto for instance. permalink award report block reply RPOZ28 4 points 6 days ago He looks like \"Starvin Marvin\". permalink award report block reply GeauxTrump20 4 points 6 days ago Looks like the offspring of a billy goat? permalink award report block reply SaxonRealm 3 points 6 days ago It’s not human. permalink award report block reply Cnn_is_fanfiction 3 points 6 days ago Dei megamind permalink award report block reply YT45 3 points 6 days ago At least now he has time to search for those missing chromosomes! permalink award report block reply Genericwhitemale 3 points 6 days ago Why was he even a candidate? Minneapolis is so fooked permalink award report block reply Kekistanirefugee 3 points 6 days ago He looks like one of those aliens from mars attacks permalink award report block reply Redpilled2Depression 3 points 6 days ago Good riddance to this wedge headed, inbred, subhuman FREAK!! permalink award report block reply RIPtheSystem 3 points 6 days ago Looks inbred permalink award report block reply malooch 3 points 6 days ago He looks like the alien in Independence Day when they’re the lab and the scientist is being held by the throat and the alien is talking to him? Remember that fuckin thing. That’s what this little fuckface reminds me of. Not the one will smith punched the other little fucker permalink award report block reply Bob_sacamanao 3 points 6 days ago Looks like generations of inbreeding permalink award report block reply 2025WhatIsTrue 3 points 6 days ago Deport...deport...deport...deport! permalink award report block reply SenorTrumper 3 points 6 days ago Try to imagine this goblin as mayor of anything. permalink award report block reply SicSemperTyrannis2 1 points 6 days ago No, I don't think I will. Also 🤮 permalink parent award report block reply SenorTrumper 2 points 6 days ago Why can't you cooperate for just once¿ permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago https://m.youtube.com/watch?v=lLCEUpIg8rE&list=RDlLCEUpIg8rE&start_radio=1&pp=ygUZTWVsIEdpYnNvbiB5ZWxscyBmcmVlZG9tIKAHAQ%3D%3D permalink parent award report block reply anti_masker 3 points 6 days ago Somalians are so fkin ugly permalink award report block reply Beelzy 3 points 6 days ago I've heard of missing links, but this dude isn't even on the right chain. permalink award report block reply Hangmhigh 3 points 6 days ago He's doing comercials for light bulbs now. permalink award report block reply Bramage 3 points 6 days ago Somalis are the trash of humanity. permalink award report block reply gurnzb 3 points 6 days ago why do they look like that permalink award report block reply lispboy 2 points 6 days ago I'm not really one to point out physically characteristics of a person, but this dude literally has a head the shape of a cone. permalink award report block reply DieHeretic 4 points 6 days ago Somalian Lightbulbhead. permalink parent award report block reply MagaPhone017 2 points 6 days ago \"Funnel-Face\"! A new Dick Tracy character! permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago A requirement for every Somali. permalink parent award report block reply GoldwaterVoter 2 points 6 days ago Family portraits: https://duckduckgo.com/?t=ffab&q=greys+aliens&ia=images&iax=images permalink award report block reply Nate_Higgersalot 2 points 6 days ago Looks like a 1930s cartoon devil with an extra chromosome. permalink award report block reply Buff_cousin_Elroy 2 points 6 days ago He looks like a fucking black martian from the movie Mars Attacks permalink award report block reply NotYourMan 2 points 6 days ago DEPORT! permalink award report block reply Covfefe_Commando 2 points 6 days ago No ship! permalink award report block reply Modernturnkey 2 points 6 days ago The sentience of a fish. Literally isn't aware of its own existence. And they dress it up in a little suit and pull it's strings. Women and minorities are the easiest to play. permalink award report block reply FBIsurveillance 2 points 6 days ago ALIEN HELLO WELCOME TO EARTH 👽 permalink award report block reply Bullet3250 2 points 6 days ago kek permalink award report block reply Rope_Tree_Journalist 2 points 6 days ago He's a better racist caricature of a Somalian than anything I could have imagined. permalink award report block reply Rxich 2 points 6 days ago This is the prototypical reptile permalink award report block reply Mindcrym 1 points 6 days ago Civil war IS coming. permalink award report block reply HenkZeilstra 1 points 5 days ago What a goblin permalink award report block reply strictly1957 1 points 5 days ago 60 IQ and that's being generous. Poster boy for 1st Cousin marriage permalink award report block reply 123breadman 1 points 6 days ago Seriously, there are people who think Jesus looked like this, and those same people say his \"real\" name is Isa. permalink award report block reply MeMargie 1 points 6 days ago Giving James a virtual High Five :) permalink award report block reply knnbccb 1 points 5 days ago Import the third world, become the third world. permalink award report block reply FullyDilated 1 points 6 days ago that's the face of a man who has never done one single day of manual labor in his life, fucking spook! permalink award report block reply SomecatsareMAGA 1 points 6 days ago James...lol permalink award report block reply Cali_kid 1 points 6 days ago C1A is going to deport him for losing lol permalink award report block reply Weneverleft 1 points 5 days ago Kek, so good... permalink award report block reply Easzq8 1 points 6 days ago Physiognomy is a nightmare. permalink award report block reply realsolidsnakeoil 1 points 5 days ago Why the fuck do they all have light bulb heads? permalink award report block reply edxzxz 1 points 5 days ago I ran across something on the internet yesterday that said James Woods is reported to have an I.Q. of 180?  Thank God he chooses to use his intellectual powers for good and not evil.  This one here is just more comedy gold from James Woods! permalink award report block reply VikingHalo45 1 points 6 days ago What is that thing? permalink award report block reply throwaway29834751 1 points 5 days ago repeal the 1965 immigration act, and limit / reduce immigration from all other countries, western hemisphere included permalink award report block reply Eaglemeagle 1 points 6 days ago guy has a great punchable face permalink award report block reply RoughBoy 1 points 5 days ago Human bat permalink award report block reply Beeboy 1 points 5 days ago Ugly thing permalink award report block reply Beeboy 1 points 5 days ago Satanic permalink award report block reply cosmos411 1 points 5 days ago Every time I see this inbred retard I can't help but think of candy corn. permalink award report block reply Chickensaurus 1 points 6 days ago ELI5? permalink award report block reply Jack 6 points 6 days ago Somali guy loses in rank choice voting to a white Dems guy in minneapolis mayoral election. That's all. permalink parent award report block reply Chickensaurus 2 points 6 days ago So a commie lost to a commie and we're celebrating? permalink parent award report block reply Megaboom2025 3 points 6 days ago Worse. Same mayor as the George Floyd riots permalink parent award report block reply Jack 3 points 6 days ago the somali guy is a state senator and a known meme, so the celebration is for his defeat. for more context, it's a race between two democrats in the 2nd round and the walking meme only lost by 6 points. Seriously. Minnesota is so fucked lol. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago He lost but is a State legislator?!? That's not confusing at all ... permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Rank choice voting, are you serious? permalink parent award report block reply Jack 2 points 5 days ago the left loves ranked choice voting because it allows socialist to sneak in. NYC democratic primary is also ranked choice voting, but he would've won either way. And yeah, he is a state senator running for mayor, it's not uncommon. JD Vance was US Senator when he became VP. If you win you just resign from your current position. permalink parent award report block reply Ligersrule1 4 points 6 days ago Somalians retarded and should be all sent home permalink parent award report block reply AwShitHereWeGoAgain 1 points 6 days ago KEK!!!! permalink award report block reply PatriotSkorzeny 1 points 6 days ago I don’t think that’s fair to the actor in the film. But good news nonetheless. permalink award report block reply alucard13mmfmj 1 points 5 days ago The funny thing is if he was handsome, and not a retarded looking skinny, he probably wouldve won because of the white women vote. permalink award report block reply TrumpVoter1 0 points 6 days ago Too funny James permalink award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter. permalink award report block reply RememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nprojectarcturus1 100 points 6 days ago Inbred filth that needs to be removed from our country. All somalis need to be sent back home. permalink award report block reply Twitter 38 points 6 days ago no lie they are some if not the most ugly people on the face of the planet, they look like aliens, and their foreheads are massive permalink parent award report block reply Agent_Orange 9 points 6 days ago I always wondered about people whose ears were lower than their eyes, and their cognitive ability. permalink parent award report block reply SicSemperTyrannis2 6 points 6 days ago Average IQ below 80 permalink parent award report block reply Agent_Orange 4 points 5 days ago You're very generous. I've seen rankings for Somalia that put them at one of the lowest IQs in the world (68 to 71). Explains a lot, huh? permalink parent award report block reply view 1 more comments... Nikola_S1 3 points 5 days ago As someone said, the triangle-faced ones are the most dangerous. permalink parent award report block reply MemoryHoleyeO 3 points 6 days ago Insects, not even aliens permalink parent award report block reply Redpilled2Depression 5 points 6 days ago Sub human permalink parent award report block reply Mortal_Wombat 1 points 5 days ago Zorak would like a word with you... permalink parent award report block reply swarleybing 2 points 6 days ago I wonder if he was advised to cut it shorter for the mayor race, to make him look less...whatever permalink parent award report block reply strictly1957 1 points 5 days ago That's a seven head permalink parent award report block reply load 2 more comments... Glory-Unto-God 11 points 6 days ago And the hatians. And the indians. And the rest of the blacks for that matter. Edit: anyone who professes to follow islam can also be kicked out. Send the jews home too. permalink parent award report block reply knnbccb 10 points 6 days ago Their kind has been inbred for centuries . If you want to remove them, you need a LOT of manpower and muscle. permalink parent award report block reply newuser8 6 points 6 days ago No we don't. We just tell them \"no\" and to get on this plane or we kill you. It wasnt that long ago that Germany got rid of their problem people permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago Like he said, manpower and muscle. permalink parent award report block reply Mindcrym 2 points 6 days ago I'd recommend a flame thrower on these fucks. permalink parent award report block reply\nTwitter 38 points 6 days ago no lie they are some if not the most ugly people on the face of the planet, they look like aliens, and their foreheads are massive permalink parent award report block reply Agent_Orange 9 points 6 days ago I always wondered about people whose ears were lower than their eyes, and their cognitive ability. permalink parent award report block reply SicSemperTyrannis2 6 points 6 days ago Average IQ below 80 permalink parent award report block reply Agent_Orange 4 points 5 days ago You're very generous. I've seen rankings for Somalia that put them at one of the lowest IQs in the world (68 to 71). Explains a lot, huh? permalink parent award report block reply view 1 more comments... Nikola_S1 3 points 5 days ago As someone said, the triangle-faced ones are the most dangerous. permalink parent award report block reply MemoryHoleyeO 3 points 6 days ago Insects, not even aliens permalink parent award report block reply Redpilled2Depression 5 points 6 days ago Sub human permalink parent award report block reply Mortal_Wombat 1 points 5 days ago Zorak would like a word with you... permalink parent award report block reply swarleybing 2 points 6 days ago I wonder if he was advised to cut it shorter for the mayor race, to make him look less...whatever permalink parent award report block reply strictly1957 1 points 5 days ago That's a seven head permalink parent award report block reply load 2 more comments...\nAgent_Orange 9 points 6 days ago I always wondered about people whose ears were lower than their eyes, and their cognitive ability. permalink parent award report block reply SicSemperTyrannis2 6 points 6 days ago Average IQ below 80 permalink parent award report block reply Agent_Orange 4 points 5 days ago You're very generous. I've seen rankings for Somalia that put them at one of the lowest IQs in the world (68 to 71). Explains a lot, huh? permalink parent award report block reply view 1 more comments...\nSicSemperTyrannis2 6 points 6 days ago Average IQ below 80 permalink parent award report block reply Agent_Orange 4 points 5 days ago You're very generous. I've seen rankings for Somalia that put them at one of the lowest IQs in the world (68 to 71). Explains a lot, huh? permalink parent award report block reply view 1 more comments...\nAgent_Orange 4 points 5 days ago You're very generous. I've seen rankings for Somalia that put them at one of the lowest IQs in the world (68 to 71). Explains a lot, huh? permalink parent award report block reply view 1 more comments...\nNikola_S1 3 points 5 days ago As someone said, the triangle-faced ones are the most dangerous. permalink parent award report block reply\nMemoryHoleyeO 3 points 6 days ago Insects, not even aliens permalink parent award report block reply Redpilled2Depression 5 points 6 days ago Sub human permalink parent award report block reply Mortal_Wombat 1 points 5 days ago Zorak would like a word with you... permalink parent award report block reply\nRedpilled2Depression 5 points 6 days ago Sub human permalink parent award report block reply\nMortal_Wombat 1 points 5 days ago Zorak would like a word with you... permalink parent award report block reply\nswarleybing 2 points 6 days ago I wonder if he was advised to cut it shorter for the mayor race, to make him look less...whatever permalink parent award report block reply\nstrictly1957 1 points 5 days ago That's a seven head permalink parent award report block reply\nGlory-Unto-God 11 points 6 days ago And the hatians. And the indians. And the rest of the blacks for that matter. Edit: anyone who professes to follow islam can also be kicked out. Send the jews home too. permalink parent award report block reply\nknnbccb 10 points 6 days ago Their kind has been inbred for centuries . If you want to remove them, you need a LOT of manpower and muscle. permalink parent award report block reply newuser8 6 points 6 days ago No we don't. We just tell them \"no\" and to get on this plane or we kill you. It wasnt that long ago that Germany got rid of their problem people permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago Like he said, manpower and muscle. permalink parent award report block reply\nnewuser8 6 points 6 days ago No we don't. We just tell them \"no\" and to get on this plane or we kill you. It wasnt that long ago that Germany got rid of their problem people permalink parent award report block reply SicSemperTyrannis2 3 points 6 days ago Like he said, manpower and muscle. permalink parent award report block reply\nSicSemperTyrannis2 3 points 6 days ago Like he said, manpower and muscle. permalink parent award report block reply\nMindcrym 2 points 6 days ago I'd recommend a flame thrower on these fucks. permalink parent award report block reply\nCovfefeVideo 54 points 6 days ago Looks llike Frylock's retarded cousin. permalink award report block reply Rydanovich 21 points 6 days ago Damn that's a helluva reference. I applaud. permalink parent award report block reply bejeavis 11 points 6 days ago He could always hold out for a race swapped Netflix remake of Phineas and ferb permalink parent award report block reply D__1 6 points 6 days ago \"Where's Perry ?\" Camera zooms to race swapped Phineas who looks sideways as he finishes chewing something... permalink parent award report block reply SanePerson 3 points 6 days ago Brilliant permalink parent award report block reply DoMagnum 3 points 6 days ago You mean the one who gots the AIDS? permalink parent award report block reply Nate_Higgersalot 2 points 6 days ago “Now felate me while I eat this expensive ham”. permalink parent award report block reply load 1 more comments...\nRydanovich 21 points 6 days ago Damn that's a helluva reference. I applaud. permalink parent award report block reply\nbejeavis 11 points 6 days ago He could always hold out for a race swapped Netflix remake of Phineas and ferb permalink parent award report block reply D__1 6 points 6 days ago \"Where's Perry ?\" Camera zooms to race swapped Phineas who looks sideways as he finishes chewing something... permalink parent award report block reply SanePerson 3 points 6 days ago Brilliant permalink parent award report block reply\nD__1 6 points 6 days ago \"Where's Perry ?\" Camera zooms to race swapped Phineas who looks sideways as he finishes chewing something... permalink parent award report block reply\nSanePerson 3 points 6 days ago Brilliant permalink parent award report block reply\nDoMagnum 3 points 6 days ago You mean the one who gots the AIDS? permalink parent award report block reply\nNate_Higgersalot 2 points 6 days ago “Now felate me while I eat this expensive ham”. permalink parent award report block reply\nTheRedPilledArtist 39 points 6 days ago 𝙈𝘼𝙍𝙎 𝘼𝙏𝙏𝘼𝘾𝙆𝙎 ! permalink award report block reply DT170x 21 points 6 days ago ACK.ACK.ACK! permalink parent award report block reply AwShitHereWeGoAgain 2 points 6 days ago Have you been watching DSP????? permalink parent award report block reply anotherthing 3 points 6 days ago Nosferatu version of Blackula. permalink parent award report block reply\nDT170x 21 points 6 days ago ACK.ACK.ACK! permalink parent award report block reply AwShitHereWeGoAgain 2 points 6 days ago Have you been watching DSP????? permalink parent award report block reply\nAwShitHereWeGoAgain 2 points 6 days ago Have you been watching DSP????? permalink parent award report block reply\nanotherthing 3 points 6 days ago Nosferatu version of Blackula. permalink parent award report block reply\nDingleBalls 31 points 6 days ago Wow Chris Rock is looking terrible these days permalink award report block reply Patriot4TN 15 points 6 days ago Ok... this was funny! Thanks for the laugh. permalink parent award report block reply loveshock 3 points 6 days ago Dont know why but I immediately had Chris Rocks voice in my head when I saw the picture. permalink parent award report block reply\nPatriot4TN 15 points 6 days ago Ok... this was funny! Thanks for the laugh. permalink parent award report block reply\nloveshock 3 points 6 days ago Dont know why but I immediately had Chris Rocks voice in my head when I saw the picture. permalink parent award report block reply\nleast_counties_ever 31 points 6 days ago Ilhan Omar’s brusband? permalink award report block reply MastaJoda 3 points 6 days ago I love steak and you just made me spit it all over the floor. Have an upvote. permalink parent award report block reply HockeyMom4Trump 2 points 6 days ago Brusband. Bahahaha permalink parent award report block reply\nMastaJoda 3 points 6 days ago I love steak and you just made me spit it all over the floor. Have an upvote. permalink parent award report block reply\nHockeyMom4Trump 2 points 6 days ago Brusband. Bahahaha permalink parent award report block reply\nhughjasske69 12 points 6 days ago How many years has this pathetic starving fuck been in the country and he still hasn't gained a pound? permalink award report block reply dr_gonzo 11 points 6 days ago He's probably chewing that khat shit all day...and dining on cat at night. permalink parent award report block reply\ndr_gonzo 11 points 6 days ago He's probably chewing that khat shit all day...and dining on cat at night. permalink parent award report block reply\ndeleted 12 points 6 days ago SneakyWino 12 points 6 days ago The sheriff is a N..... permalink parent award report block reply vote_for_MAGA_2020 6 points 6 days ago I permalink parent award report block reply Bramage 3 points 6 days ago G permalink parent award report block reply Briankitis 4 points 6 days ago G permalink parent award report block reply view 2 more comments... MAGA_FL_MAN 3 points 6 days ago 🔔 permalink parent award report block reply\nSneakyWino 12 points 6 days ago The sheriff is a N..... permalink parent award report block reply vote_for_MAGA_2020 6 points 6 days ago I permalink parent award report block reply Bramage 3 points 6 days ago G permalink parent award report block reply Briankitis 4 points 6 days ago G permalink parent award report block reply view 2 more comments... MAGA_FL_MAN 3 points 6 days ago 🔔 permalink parent award report block reply\nvote_for_MAGA_2020 6 points 6 days ago I permalink parent award report block reply Bramage 3 points 6 days ago G permalink parent award report block reply Briankitis 4 points 6 days ago G permalink parent award report block reply view 2 more comments...\nBramage 3 points 6 days ago G permalink parent award report block reply Briankitis 4 points 6 days ago G permalink parent award report block reply view 2 more comments...\nBriankitis 4 points 6 days ago G permalink parent award report block reply view 2 more comments...\nMAGA_FL_MAN 3 points 6 days ago 🔔 permalink parent award report block reply\nSlugbert 12 points 6 days ago Just look at that fucking guy. There is absolutely ZERO intelligence behind those eyes. permalink award report block reply\ncptkloss5 11 points 6 days ago can you imagine what these low IQ imbeciles must be thinking? \"how retarded are these white morons - i almost became a mayor of a major american city...\" permalink award report block reply MagaPhone017 2 points 6 days ago They dragged the Potato over the finish line, at least this one will be easier to physically carry. permalink parent award report block reply\nMagaPhone017 2 points 6 days ago They dragged the Potato over the finish line, at least this one will be easier to physically carry. permalink parent award report block reply\nOutlawPurpleHairDye 10 points 6 days ago Must be a lot of chlorine in that gene pool permalink award report block reply DCYR66 6 points 6 days ago A very shallow pool to boot. permalink parent award report block reply MagaPhone017 2 points 6 days ago \"Above-ground and inflatable, if you know what I mean.\" ---The Bride permalink parent award report block reply\nDCYR66 6 points 6 days ago A very shallow pool to boot. permalink parent award report block reply\nMagaPhone017 2 points 6 days ago \"Above-ground and inflatable, if you know what I mean.\" ---The Bride permalink parent award report block reply\nFilo76 9 points 6 days ago Not yet… Unless we deport this freaky looking skinny, he will keep relentlessly running for office until “elected”. permalink award report block reply SicSemperTyrannis2 1 points 6 days ago Where did it run? permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago Where did it run? permalink parent award report block reply\nLibtardBusterMAGA 6 points 6 days ago That's the 40 IQ stare permalink award report block reply knnbccb 1 points 5 days ago Don't forget genetic defects. Centuries of Islamic inbreeding that would even make Alabama blush. permalink parent award report block reply\nknnbccb 1 points 5 days ago Don't forget genetic defects. Centuries of Islamic inbreeding that would even make Alabama blush. permalink parent award report block reply\nSnowSnake 6 points 6 days ago He looks like someone made a caricature of Chris Rock, and squished the bottom, which made the top of his head balloon out. permalink award report block reply\nAlexPKeaton 6 points 6 days ago WTF is even that thing?? permalink award report block reply\nCommieCrats 5 points 6 days ago Deus VULT Gundam permalink award report block reply\nHunter_loves_2_feet 5 points 6 days ago Is that the dude from the movie or the guy that ran for office because I’m not joking when I say I can’t tell. permalink award report block reply SicSemperTyrannis2 1 points 6 days ago They are the same picture permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago They are the same picture permalink parent award report block reply\ncptkloss5 4 points 6 days ago good one permalink award report block reply\nNonbinaryPotatohead 4 points 6 days ago HAHA! Look at the genetic lottery here! permalink award report block reply\nKekistanPM 4 points 6 days ago I wonder if he'll try again. Some people really believe they're entitled to being captain even if they don't know the first thing about the job or have their own plans to do it terribly wrong. Like Beto for instance. permalink award report block reply\nRPOZ28 4 points 6 days ago He looks like \"Starvin Marvin\". permalink award report block reply\nGeauxTrump20 4 points 6 days ago Looks like the offspring of a billy goat? permalink award report block reply\nSaxonRealm 3 points 6 days ago It’s not human. permalink award report block reply\nCnn_is_fanfiction 3 points 6 days ago Dei megamind permalink award report block reply\nYT45 3 points 6 days ago At least now he has time to search for those missing chromosomes! permalink award report block reply\nGenericwhitemale 3 points 6 days ago Why was he even a candidate? Minneapolis is so fooked permalink award report block reply\nKekistanirefugee 3 points 6 days ago He looks like one of those aliens from mars attacks permalink award report block reply\nRedpilled2Depression 3 points 6 days ago Good riddance to this wedge headed, inbred, subhuman FREAK!! permalink award report block reply\nRIPtheSystem 3 points 6 days ago Looks inbred permalink award report block reply\nmalooch 3 points 6 days ago He looks like the alien in Independence Day when they’re the lab and the scientist is being held by the throat and the alien is talking to him? Remember that fuckin thing. That’s what this little fuckface reminds me of. Not the one will smith punched the other little fucker permalink award report block reply\nBob_sacamanao 3 points 6 days ago Looks like generations of inbreeding permalink award report block reply\n2025WhatIsTrue 3 points 6 days ago Deport...deport...deport...deport! permalink award report block reply\nSenorTrumper 3 points 6 days ago Try to imagine this goblin as mayor of anything. permalink award report block reply SicSemperTyrannis2 1 points 6 days ago No, I don't think I will. Also 🤮 permalink parent award report block reply SenorTrumper 2 points 6 days ago Why can't you cooperate for just once¿ permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago https://m.youtube.com/watch?v=lLCEUpIg8rE&list=RDlLCEUpIg8rE&start_radio=1&pp=ygUZTWVsIEdpYnNvbiB5ZWxscyBmcmVlZG9tIKAHAQ%3D%3D permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago No, I don't think I will. Also 🤮 permalink parent award report block reply SenorTrumper 2 points 6 days ago Why can't you cooperate for just once¿ permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago https://m.youtube.com/watch?v=lLCEUpIg8rE&list=RDlLCEUpIg8rE&start_radio=1&pp=ygUZTWVsIEdpYnNvbiB5ZWxscyBmcmVlZG9tIKAHAQ%3D%3D permalink parent award report block reply\nSenorTrumper 2 points 6 days ago Why can't you cooperate for just once¿ permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago https://m.youtube.com/watch?v=lLCEUpIg8rE&list=RDlLCEUpIg8rE&start_radio=1&pp=ygUZTWVsIEdpYnNvbiB5ZWxscyBmcmVlZG9tIKAHAQ%3D%3D permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago https://m.youtube.com/watch?v=lLCEUpIg8rE&list=RDlLCEUpIg8rE&start_radio=1&pp=ygUZTWVsIEdpYnNvbiB5ZWxscyBmcmVlZG9tIKAHAQ%3D%3D permalink parent award report block reply\nanti_masker 3 points 6 days ago Somalians are so fkin ugly permalink award report block reply\nBeelzy 3 points 6 days ago I've heard of missing links, but this dude isn't even on the right chain. permalink award report block reply\nHangmhigh 3 points 6 days ago He's doing comercials for light bulbs now. permalink award report block reply\nBramage 3 points 6 days ago Somalis are the trash of humanity. permalink award report block reply\ngurnzb 3 points 6 days ago why do they look like that permalink award report block reply\nlispboy 2 points 6 days ago I'm not really one to point out physically characteristics of a person, but this dude literally has a head the shape of a cone. permalink award report block reply DieHeretic 4 points 6 days ago Somalian Lightbulbhead. permalink parent award report block reply MagaPhone017 2 points 6 days ago \"Funnel-Face\"! A new Dick Tracy character! permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago A requirement for every Somali. permalink parent award report block reply\nDieHeretic 4 points 6 days ago Somalian Lightbulbhead. permalink parent award report block reply\nMagaPhone017 2 points 6 days ago \"Funnel-Face\"! A new Dick Tracy character! permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago A requirement for every Somali. permalink parent award report block reply\nGoldwaterVoter 2 points 6 days ago Family portraits: https://duckduckgo.com/?t=ffab&q=greys+aliens&ia=images&iax=images permalink award report block reply\nNate_Higgersalot 2 points 6 days ago Looks like a 1930s cartoon devil with an extra chromosome. permalink award report block reply\nBuff_cousin_Elroy 2 points 6 days ago He looks like a fucking black martian from the movie Mars Attacks permalink award report block reply\nNotYourMan 2 points 6 days ago DEPORT! permalink award report block reply\nCovfefe_Commando 2 points 6 days ago No ship! permalink award report block reply\nModernturnkey 2 points 6 days ago The sentience of a fish. Literally isn't aware of its own existence. And they dress it up in a little suit and pull it's strings. Women and minorities are the easiest to play. permalink award report block reply\nFBIsurveillance 2 points 6 days ago ALIEN HELLO WELCOME TO EARTH 👽 permalink award report block reply\nBullet3250 2 points 6 days ago kek permalink award report block reply\nRope_Tree_Journalist 2 points 6 days ago He's a better racist caricature of a Somalian than anything I could have imagined. permalink award report block reply\nRxich 2 points 6 days ago This is the prototypical reptile permalink award report block reply\nMindcrym 1 points 6 days ago Civil war IS coming. permalink award report block reply\nHenkZeilstra 1 points 5 days ago What a goblin permalink award report block reply\nstrictly1957 1 points 5 days ago 60 IQ and that's being generous. Poster boy for 1st Cousin marriage permalink award report block reply\n123breadman 1 points 6 days ago Seriously, there are people who think Jesus looked like this, and those same people say his \"real\" name is Isa. permalink award report block reply\nMeMargie 1 points 6 days ago Giving James a virtual High Five :) permalink award report block reply\nknnbccb 1 points 5 days ago Import the third world, become the third world. permalink award report block reply\nFullyDilated 1 points 6 days ago that's the face of a man who has never done one single day of manual labor in his life, fucking spook! permalink award report block reply\nSomecatsareMAGA 1 points 6 days ago James...lol permalink award report block reply\nCali_kid 1 points 6 days ago C1A is going to deport him for losing lol permalink award report block reply\nWeneverleft 1 points 5 days ago Kek, so good... permalink award report block reply\nEaszq8 1 points 6 days ago Physiognomy is a nightmare. permalink award report block reply\nrealsolidsnakeoil 1 points 5 days ago Why the fuck do they all have light bulb heads? permalink award report block reply\nedxzxz 1 points 5 days ago I ran across something on the internet yesterday that said James Woods is reported to have an I.Q. of 180?  Thank God he chooses to use his intellectual powers for good and not evil.  This one here is just more comedy gold from James Woods! permalink award report block reply\nVikingHalo45 1 points 6 days ago What is that thing? permalink award report block reply\nthrowaway29834751 1 points 5 days ago repeal the 1965 immigration act, and limit / reduce immigration from all other countries, western hemisphere included permalink award report block reply\nEaglemeagle 1 points 6 days ago guy has a great punchable face permalink award report block reply\nRoughBoy 1 points 5 days ago Human bat permalink award report block reply\nBeeboy 1 points 5 days ago Ugly thing permalink award report block reply\nBeeboy 1 points 5 days ago Satanic permalink award report block reply\ncosmos411 1 points 5 days ago Every time I see this inbred retard I can't help but think of candy corn. permalink award report block reply\nChickensaurus 1 points 6 days ago ELI5? permalink award report block reply Jack 6 points 6 days ago Somali guy loses in rank choice voting to a white Dems guy in minneapolis mayoral election. That's all. permalink parent award report block reply Chickensaurus 2 points 6 days ago So a commie lost to a commie and we're celebrating? permalink parent award report block reply Megaboom2025 3 points 6 days ago Worse. Same mayor as the George Floyd riots permalink parent award report block reply Jack 3 points 6 days ago the somali guy is a state senator and a known meme, so the celebration is for his defeat. for more context, it's a race between two democrats in the 2nd round and the walking meme only lost by 6 points. Seriously. Minnesota is so fucked lol. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago He lost but is a State legislator?!? That's not confusing at all ... permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Rank choice voting, are you serious? permalink parent award report block reply Jack 2 points 5 days ago the left loves ranked choice voting because it allows socialist to sneak in. NYC democratic primary is also ranked choice voting, but he would've won either way. And yeah, he is a state senator running for mayor, it's not uncommon. JD Vance was US Senator when he became VP. If you win you just resign from your current position. permalink parent award report block reply Ligersrule1 4 points 6 days ago Somalians retarded and should be all sent home permalink parent award report block reply\nJack 6 points 6 days ago Somali guy loses in rank choice voting to a white Dems guy in minneapolis mayoral election. That's all. permalink parent award report block reply Chickensaurus 2 points 6 days ago So a commie lost to a commie and we're celebrating? permalink parent award report block reply Megaboom2025 3 points 6 days ago Worse. Same mayor as the George Floyd riots permalink parent award report block reply Jack 3 points 6 days ago the somali guy is a state senator and a known meme, so the celebration is for his defeat. for more context, it's a race between two democrats in the 2nd round and the walking meme only lost by 6 points. Seriously. Minnesota is so fucked lol. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago He lost but is a State legislator?!? That's not confusing at all ... permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Rank choice voting, are you serious? permalink parent award report block reply Jack 2 points 5 days ago the left loves ranked choice voting because it allows socialist to sneak in. NYC democratic primary is also ranked choice voting, but he would've won either way. And yeah, he is a state senator running for mayor, it's not uncommon. JD Vance was US Senator when he became VP. If you win you just resign from your current position. permalink parent award report block reply\nChickensaurus 2 points 6 days ago So a commie lost to a commie and we're celebrating? permalink parent award report block reply Megaboom2025 3 points 6 days ago Worse. Same mayor as the George Floyd riots permalink parent award report block reply Jack 3 points 6 days ago the somali guy is a state senator and a known meme, so the celebration is for his defeat. for more context, it's a race between two democrats in the 2nd round and the walking meme only lost by 6 points. Seriously. Minnesota is so fucked lol. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago He lost but is a State legislator?!? That's not confusing at all ... permalink parent award report block reply\nMegaboom2025 3 points 6 days ago Worse. Same mayor as the George Floyd riots permalink parent award report block reply\nJack 3 points 6 days ago the somali guy is a state senator and a known meme, so the celebration is for his defeat. for more context, it's a race between two democrats in the 2nd round and the walking meme only lost by 6 points. Seriously. Minnesota is so fucked lol. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago He lost but is a State legislator?!? That's not confusing at all ... permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago He lost but is a State legislator?!? That's not confusing at all ... permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago Rank choice voting, are you serious? permalink parent award report block reply Jack 2 points 5 days ago the left loves ranked choice voting because it allows socialist to sneak in. NYC democratic primary is also ranked choice voting, but he would've won either way. And yeah, he is a state senator running for mayor, it's not uncommon. JD Vance was US Senator when he became VP. If you win you just resign from your current position. permalink parent award report block reply\nJack 2 points 5 days ago the left loves ranked choice voting because it allows socialist to sneak in. NYC democratic primary is also ranked choice voting, but he would've won either way. And yeah, he is a state senator running for mayor, it's not uncommon. JD Vance was US Senator when he became VP. If you win you just resign from your current position. permalink parent award report block reply\nLigersrule1 4 points 6 days ago Somalians retarded and should be all sent home permalink parent award report block reply\nAwShitHereWeGoAgain 1 points 6 days ago KEK!!!! permalink award report block reply\nPatriotSkorzeny 1 points 6 days ago I don’t think that’s fair to the actor in the film. But good news nonetheless. permalink award report block reply\nalucard13mmfmj 1 points 5 days ago The funny thing is if he was handsome, and not a retarded looking skinny, he probably wouldve won because of the white women vote. permalink award report block reply\nTrumpVoter1 0 points 6 days ago Too funny James permalink award report block reply\nFullyDilated 1 points 6 days ago Comment removed by community filter. permalink award report block reply\nRememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T20:05:28.691748Z"
}