{
  "id": "8184861",
  "title": "746The long term \"necessity\" of H1B's is a lie.  An American can be trained for every one of these r",
  "url": "https://patriots.win/p/1ARK9mHVr7/the-long-term-necessity-of-h1bs-/c",
  "content": "836 The long term \"necessity\" of H1B's is a lie.  An American can be trained for every one of these roles in a short time period.  They steal an American's job every single time and depress wages for that role for every other American. posted 13 hours ago by Diversity_Fire 63 comments award share report block The only difference between an H1B hire and an illegal alien hire is that instead of stealing an extreme low wage manual labor job, they are stealing a higher paying job from middle income Americans. (and have the same wage depressing effect as well) These companies are, in effect, selling access to America in exchange for low wages and circumventing the immigration process. The US military trains people to work on the most advanced fighter jets in the world with a few weeks to a few months training. There is ZERO excuse for these large companies to be allowed to sell access to America just because they make larger donations to politicians than individuals can. If it is about a specialized job, FORCE THE COMPANY to have a SHORT TERM H1B, for a specific role, and only if they have demonstrated a TRAINING PROGRAM where the need for that H1B will be fixed in short order. As a worker for a big tech company, there is NO part of my job I cannot train someone to do OJT in just a few months.\n63 comments Sort by Top Top New Worst Old Save sir_rockness 38 points 11 hours ago It's all about greed.  It has nothing to do with skilled jobs.   Trump better get his head out of his ass now permalink award report block reply TheRedPike 21 points 10 hours ago With jeets, it isn't just greed.  It is also nepotism and racism.  They will go to great lengths to make sure as many people in an organization looks like they do.   If they do it while spending MORE money, that is even better. permalink parent award report block reply breadbaker 5 points 9 hours ago Worked at one place where one dude was the right kind of hindu but from the wrong state/area.  Then there was the Sikh and Muslim guys who were ostracized, and then there was a South Indian guy who they would laugh at for being too dark while everyone was wheatish (?). Imagine in an office in the US making fun of a guy for skin color.  Absolute nightmare for any supervisor around. permalink parent award report block reply dtrap 5 points 7 hours ago The all hands meetings to explain why you can't wash your face in the bathroom leaving water everywhere and the importance of deodorant are always classics. permalink parent award report block reply Femprep 5 points 7 hours ago We grow up being taught not to be racist, so we don’t understand how inherently racist other countries are, then import them and their racism here. permalink parent award report block reply conservatarian 4 points 8 hours ago If Trump doesn't quickly reverse course on this, he will torpedo the movement he started. We love the guy but this is a monumental fuck up that cannot stand. permalink parent award report block reply NotYourMan 1 points 7 hours ago What percentage of entry level computer science or EE jobs in Silicon Valley is H1B-visas or foreign born workers?  All of those entry level jobs went to foriegners with a masters degree for a US university.  The universities are the problem.  Of course its California and the government of California hates Americans and wants to over throw the constitution but the question still stands. permalink parent award report block reply DeportThemAllForever 1 points 7 hours ago It’s not just computer nerd stuff?  It’s every fucking job out there. Who reads X-rays at the hospital?  Who works factories?  Who assembles batteries and technology? Who is laying pipe? Who answers phone? Cable repair guy here doesn’t speak English. It’s all foreign labor hired by US corporations.  Sickening to watch American fall apart because this shit is allowed. But it’s greatest economy ever because stock market is doing great or something.  We measure success on how much inflation we can force people to accept as “economic growth”. permalink parent award report block reply ShadowInv 1 points 6 hours ago Stock market is all of our retirement money being forced into it. Wall street can front run it permalink parent award report block reply mikethemarine 1 points 6 hours ago it's about COMMUNISM, they have to EQUALIZE the wages throughout the world in order to have ONE world currency and one world work force and one world control of ALL of it, If we stop this we destroy all of it. Kick them all out, anybody can be trained enough to do any job, shit they even launched a monkey into space and he had to do certain things permalink parent award report block reply UrShulgi 24 points 11 hours ago The biggest problem isn't H1-B's, it's outsourcing in general.  I work for a mega-corp, and we have an entire division of the company that is dedicated to running affairs in India and Malaysia, staffing as much as they can there.  My last job I got hired for, my boss had to run through 4 levels of exceptions to say THIS JOB CAN'T BE DONE INTERNATIONALLY, before they'd hire stateside.  4 levels of exceptions and approvals just to hire in the US.  Why hire jeets domestically at domestic H1-B wages when you can hire jeets in their home countries for much less?  THAT, is the fucking problem. permalink award report block reply breadbaker 5 points 9 hours ago Tax and tariff services. Corps will find another way around it, and government should deal with it quickly and effectively. We spineless and law politicians. permalink parent award report block reply dtrap 2 points 7 hours ago This is the answer. permalink parent award report block reply Parhelion12 4 points 8 hours ago They can both be problems. permalink parent award report block reply UrShulgi 2 points 6 hours ago It's the level of problem...it's a bee sting vs a fucking hive attacking you.  Look at the numbers :  85k h1b/year, 300k+ jobs outsourced every year.  H1B's are temporary, and don't last forever, outsourced jobs never come back.  It's a matter of scale. permalink parent award report block reply covok48 1 points 1 hour ago I can assure you the Dallas might as well be called New Dhallas. Its also a problem. permalink parent award report block reply Elonmuskbedo 1 points 9 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply _2022_ 20 points 12 hours ago H-1B support and 50 year mortgages. Great second term. It’s over when dems steal the midterms. permalink award report block reply xanaxagoras 17 points 9 hours ago Do they even need to steal? Are you feeling excited about voting for your lukewarm do-nothing fucking retard GOP congressman? I’m not. permalink parent award report block reply CrossTheRubixCube 9 points 9 hours ago At this rate the Dems won’t even need to steal the midterms. permalink parent award report block reply flashersenpai 0 points 5 hours ago +7 D generic ballot polling today permalink parent award report block reply TrumpPl4yedU 2 points 10 hours ago Comment removed upon the user being banned. permalink parent award report block reply DontBeAFaggot 17 points 10 hours ago Trump is completely out of touch on this permalink award report block reply RudeFrog 16 points 10 hours ago It's so complicated only cheap foreign labor knows how to do it permalink award report block reply Greenhills 8 points 10 hours ago It’s a lie because we’re the greatest, smartest, most innovative human population on the planet. And in reality, there’s probably 1,500 tops specialists in the world who are extraordinary. Do you know Nissan pays $1B with a B to Tech Mahindra to offshore IT support? It’s disgusting. Imagine what Amazon pays or Apple. I’m with UrShulgi here, the H1b is just the tip of the iceberg. The real issue is the offshoring companies now prioritize as a corporate strategy not a last resort. permalink award report block reply RedStoneDeepState -1 points 10 hours ago offshore Visas don't matter there. You can't force companies to not outsource. permalink parent award report block reply Parhelion12 5 points 8 hours ago But you can regulate into oblivion permalink parent award report block reply RedStoneDeepState -3 points 8 hours ago Yes, you can regulate the US economy into oblivion and effectively mandate more outsourcing that way. What about it? permalink parent award report block reply SteveRogers42 8 points 10 hours ago I remember when Trump said he was opposed to “the siren song of globalism “… permalink award report block reply Wontgoquietly 7 points 9 hours ago H-1B is the enemy of American labor.  It cannot continue without causing severe harm to Americans who want and need middle class job opportunities.  Trump simply doesn’t get it.  His top three labor priorities are oligarchs, oligarchs, and oligarchs. permalink award report block reply SuperDuperBasedMD 7 points 12 hours ago Keep in mind, although the H1b problem is real and it's very important, the reason why it's being algorithmically pushed is because it's being used as a wedge to destroy MAGA. Everyone should read this article. https://theconservativetreehouse.com/blog/2025/11/11/the-2025-maga-fracture-and-the-benefactors-behind-it/ \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" permalink award report block reply ShadowInv 6 points 9 hours ago But they aren't wrong about it, f isreal and f h1b's permalink parent award report block reply Oleander 6 points 8 hours ago So what do you want us to do, clap like a goddamn seal united and happy when what they're doing is the opposite of MAGA? The whole point was for working class people to tell these invaders to fuck off. America First. Remember? permalink parent award report block reply PhilipeNegro 2 points 6 hours ago “Sundance” can shove this up his faggotty ass, along with his faggotty pseudonym. permalink parent award report block reply flashersenpai -1 points 5 hours ago omg kraken permalink parent award report block reply covok48 3 points 7 hours ago I hate H1Bs and Indians. I’m done having these cretins and their spawn rob me & my family of our future. permalink award report block reply Oleander 1 points 7 hours ago You can bet they ain't done with you though, and neither are our crooked politicians. In their minds they don't need your consent. This world is becoming a dark place. At least you have a family, many of us can only dream of that right now. permalink parent award report block reply Femprep 3 points 7 hours ago If companies are applying for, and receiving H1Bs, they should also be required to train people for the job the H1B has taken so they can ultimately be sent home and replaced with home grown. permalink award report block reply Crappydatum 3 points 3 hours ago Shaniqua can do dat John just fine Did I say John? I meant job permalink award report block reply BurtMcGirt 3 points 8 hours ago It's not just about suppression of wages. It's about having a mindless, compliant workforce, who will allow you to treat them like slave labor to avoid being sent back to their shitholes. Big Corporate is just as bad as Big Socialist Government. permalink award report block reply rebuildingMyself 3 points 10 hours ago And those low wage jobs tht used to be done by young teenagers needing money for school or (God forbid) their own hobbies are replaced by jeets. Little Billy earning money by mowing his neighbors lawns? Nah we have illegal slave labor for that now. So those young ambitious kids are denied the opportunity to build valuable skills and learn hard lessons while the cost of failure is cheap are told to shut up and study their Marxist programming instead. That way they can eventually vote for Commies like Mamdami who promise free gibs from the sky only to revoke the promise right after giving him the vote he needed. permalink award report block reply dtrap 2 points 8 hours ago The fact that they force Americans to train H1Bs before the Americans are replaced by H1Bs says it all. This is about long term control of wage growth. American gets in, gets 6-8 months of experience, then levels up for $5-10-k. Any employer that doesn't want to waste money on churn will pony up. The solution? H1B visa holders. Once sponsored they are stuck with their employer for 3 years. If the H1B visa holder even thinks of playing the field, the employer cancels the visa and the visa holder has 3 months to either find a new sponsor or liquidate their US life and self-deport. Visa holders stay put and accept the wages given for year or decades at a time. Docile. Controlled. The H1B visa is just moving indentured servitude up the employment chain. permalink award report block reply Crappydatum 2 points 3 hours ago Don't blame Trump, blame the Department of Edumacate permalink award report block reply ATX_for_Trump 2 points 9 hours ago American's are already in these roles and are just being replaced by cheaper labor.  Train your replacement or lose your severance package. permalink award report block reply GarbageManCan47 2 points 10 hours ago Get rid of fucking welfare that's making doing nothing viable as a life style. As a grown adult, if you don't earn a living, you shouldn't be living, period. That's part of the problem. permalink award report block reply ShadowInv 3 points 9 hours ago Why work if the money earned isn't enough to pay for life? permalink parent award report block reply edxzxz 1 points 9 hours ago Here's the only scenario I'd be ok with someone getting a visa to work here:  You operate a multinational company and your North American V.P. of R&D retires, you want to promote the European division R&D guy to the job and he needs to live in the USA to do that job.  Positions where your company needs a very specific person for a very specific role in your company, ok.  The total number issued each year should be under 500. permalink award report block reply It_takes_10_years 1 points 7 hours ago Trump disagrees with you. \"I know what MAGA wants better than anyone else\" Ingraham countered him, saying that US has \"plenty of talented people.\" Trump in response said, \"No, you don't. There are certain skills you don't have, and people have to learn them. You can't take people off the unemployment line and say, 'I'm going to put you into a factory where we're going to make missiles.'\" America requires foreigners because Americans are too stupid! Our country and our colleges would FAIL without foreigners. permalink award report block reply Diversity_Fire OP 1 points 5 hours ago This is horse shit.  The us air force has high schoolers making munitions within 3 months for air craft permalink parent award report block reply SanityGumby 1 points 8 minutes ago No they don’t. Screwing a handful of parts together is not building munitions. permalink parent award report block reply It_takes_10_years 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply RedStoneDeepState 1 points 11 hours ago Not for all of them. 80% of the time, sure, but about 20% of the time it's legitimately difficult to train them up. We need to reduce H1Bs but the program is still important. permalink award report block reply TheRedPike 0 points 9 hours ago $100k a pop sounds good to me. permalink parent award report block reply mohel 1 points 7 hours ago Junior developer with a fake diploma from Hyderabad would disagree permalink award report block reply SanityGumby 1 points 12 minutes ago So you literally agree with what Trump said. Cool permalink award report block reply frenacrossthepond 0 points 9 hours ago The same story in Europe. Large companies have lobbied to allow importation of Indian workers etc... They are only doing this to increase the size of their workforce in order to a) demonstrate \"growth\" for shareholders/stock price and b) so that a company can apply for more national and EU funding. The whole thing is a racket. In fact worker's salaries are often so subsidized by the state that the state would actually save money if the workers were fired and they would claim unemployment money instead. Many times internal company projects are started just for the sole purpose of getting more state funding and increasing the workforce numbers. Actual project - no one gives a fuck about...it will never become a product or service offered to a customer. The biggest players are the ones exploiting the system to the max...and then the ceos use every tax evasion trick to keep more money. It' called \"milking the system\" and there are many start-ups that seem designed to do just that. permalink award report block reply NZbacon 0 points 9 hours ago If foreign work is required then it can be done remotely. permalink award report block reply flashersenpai 0 points 5 hours ago But Bessent just said H1B could need 3-7 years to train workers! permalink award report block reply Greenhills 0 points 8 hours ago Do you know how many people right now are getting blown out of roles they’ve had for ten years so they can train their lesser counterpart in the Philippines? I think they call this AI permalink award report block reply UncleStepDaddy 0 points 8 hours ago It's completely DISPICABLE! permalink award report block reply TOPDAWG23 0 points 6 hours ago yawn so did trump change his 100,000 fee on them or what? Seems you morons are being taken for a ride and reacting like the left does at every little thing. permalink award report block reply flashersenpai 1 points 5 hours ago trump pushes more foreigners to replace american workers little thing k permalink parent award report block reply SanityGumby 1 points 7 minutes ago Except he didn’t permalink parent award report block reply BubbaSawyer4Trump 1 points 9 hours ago Comment removed by community filter, pending further review. permalink award report block reply\nsir_rockness 38 points 11 hours ago It's all about greed.  It has nothing to do with skilled jobs.   Trump better get his head out of his ass now permalink award report block reply TheRedPike 21 points 10 hours ago With jeets, it isn't just greed.  It is also nepotism and racism.  They will go to great lengths to make sure as many people in an organization looks like they do.   If they do it while spending MORE money, that is even better. permalink parent award report block reply breadbaker 5 points 9 hours ago Worked at one place where one dude was the right kind of hindu but from the wrong state/area.  Then there was the Sikh and Muslim guys who were ostracized, and then there was a South Indian guy who they would laugh at for being too dark while everyone was wheatish (?). Imagine in an office in the US making fun of a guy for skin color.  Absolute nightmare for any supervisor around. permalink parent award report block reply dtrap 5 points 7 hours ago The all hands meetings to explain why you can't wash your face in the bathroom leaving water everywhere and the importance of deodorant are always classics. permalink parent award report block reply Femprep 5 points 7 hours ago We grow up being taught not to be racist, so we don’t understand how inherently racist other countries are, then import them and their racism here. permalink parent award report block reply conservatarian 4 points 8 hours ago If Trump doesn't quickly reverse course on this, he will torpedo the movement he started. We love the guy but this is a monumental fuck up that cannot stand. permalink parent award report block reply NotYourMan 1 points 7 hours ago What percentage of entry level computer science or EE jobs in Silicon Valley is H1B-visas or foreign born workers?  All of those entry level jobs went to foriegners with a masters degree for a US university.  The universities are the problem.  Of course its California and the government of California hates Americans and wants to over throw the constitution but the question still stands. permalink parent award report block reply DeportThemAllForever 1 points 7 hours ago It’s not just computer nerd stuff?  It’s every fucking job out there. Who reads X-rays at the hospital?  Who works factories?  Who assembles batteries and technology? Who is laying pipe? Who answers phone? Cable repair guy here doesn’t speak English. It’s all foreign labor hired by US corporations.  Sickening to watch American fall apart because this shit is allowed. But it’s greatest economy ever because stock market is doing great or something.  We measure success on how much inflation we can force people to accept as “economic growth”. permalink parent award report block reply ShadowInv 1 points 6 hours ago Stock market is all of our retirement money being forced into it. Wall street can front run it permalink parent award report block reply mikethemarine 1 points 6 hours ago it's about COMMUNISM, they have to EQUALIZE the wages throughout the world in order to have ONE world currency and one world work force and one world control of ALL of it, If we stop this we destroy all of it. Kick them all out, anybody can be trained enough to do any job, shit they even launched a monkey into space and he had to do certain things permalink parent award report block reply\nTheRedPike 21 points 10 hours ago With jeets, it isn't just greed.  It is also nepotism and racism.  They will go to great lengths to make sure as many people in an organization looks like they do.   If they do it while spending MORE money, that is even better. permalink parent award report block reply breadbaker 5 points 9 hours ago Worked at one place where one dude was the right kind of hindu but from the wrong state/area.  Then there was the Sikh and Muslim guys who were ostracized, and then there was a South Indian guy who they would laugh at for being too dark while everyone was wheatish (?). Imagine in an office in the US making fun of a guy for skin color.  Absolute nightmare for any supervisor around. permalink parent award report block reply dtrap 5 points 7 hours ago The all hands meetings to explain why you can't wash your face in the bathroom leaving water everywhere and the importance of deodorant are always classics. permalink parent award report block reply Femprep 5 points 7 hours ago We grow up being taught not to be racist, so we don’t understand how inherently racist other countries are, then import them and their racism here. permalink parent award report block reply\nbreadbaker 5 points 9 hours ago Worked at one place where one dude was the right kind of hindu but from the wrong state/area.  Then there was the Sikh and Muslim guys who were ostracized, and then there was a South Indian guy who they would laugh at for being too dark while everyone was wheatish (?). Imagine in an office in the US making fun of a guy for skin color.  Absolute nightmare for any supervisor around. permalink parent award report block reply dtrap 5 points 7 hours ago The all hands meetings to explain why you can't wash your face in the bathroom leaving water everywhere and the importance of deodorant are always classics. permalink parent award report block reply\ndtrap 5 points 7 hours ago The all hands meetings to explain why you can't wash your face in the bathroom leaving water everywhere and the importance of deodorant are always classics. permalink parent award report block reply\nFemprep 5 points 7 hours ago We grow up being taught not to be racist, so we don’t understand how inherently racist other countries are, then import them and their racism here. permalink parent award report block reply\nconservatarian 4 points 8 hours ago If Trump doesn't quickly reverse course on this, he will torpedo the movement he started. We love the guy but this is a monumental fuck up that cannot stand. permalink parent award report block reply\nNotYourMan 1 points 7 hours ago What percentage of entry level computer science or EE jobs in Silicon Valley is H1B-visas or foreign born workers?  All of those entry level jobs went to foriegners with a masters degree for a US university.  The universities are the problem.  Of course its California and the government of California hates Americans and wants to over throw the constitution but the question still stands. permalink parent award report block reply DeportThemAllForever 1 points 7 hours ago It’s not just computer nerd stuff?  It’s every fucking job out there. Who reads X-rays at the hospital?  Who works factories?  Who assembles batteries and technology? Who is laying pipe? Who answers phone? Cable repair guy here doesn’t speak English. It’s all foreign labor hired by US corporations.  Sickening to watch American fall apart because this shit is allowed. But it’s greatest economy ever because stock market is doing great or something.  We measure success on how much inflation we can force people to accept as “economic growth”. permalink parent award report block reply ShadowInv 1 points 6 hours ago Stock market is all of our retirement money being forced into it. Wall street can front run it permalink parent award report block reply\nDeportThemAllForever 1 points 7 hours ago It’s not just computer nerd stuff?  It’s every fucking job out there. Who reads X-rays at the hospital?  Who works factories?  Who assembles batteries and technology? Who is laying pipe? Who answers phone? Cable repair guy here doesn’t speak English. It’s all foreign labor hired by US corporations.  Sickening to watch American fall apart because this shit is allowed. But it’s greatest economy ever because stock market is doing great or something.  We measure success on how much inflation we can force people to accept as “economic growth”. permalink parent award report block reply ShadowInv 1 points 6 hours ago Stock market is all of our retirement money being forced into it. Wall street can front run it permalink parent award report block reply\nShadowInv 1 points 6 hours ago Stock market is all of our retirement money being forced into it. Wall street can front run it permalink parent award report block reply\nmikethemarine 1 points 6 hours ago it's about COMMUNISM, they have to EQUALIZE the wages throughout the world in order to have ONE world currency and one world work force and one world control of ALL of it, If we stop this we destroy all of it. Kick them all out, anybody can be trained enough to do any job, shit they even launched a monkey into space and he had to do certain things permalink parent award report block reply\nUrShulgi 24 points 11 hours ago The biggest problem isn't H1-B's, it's outsourcing in general.  I work for a mega-corp, and we have an entire division of the company that is dedicated to running affairs in India and Malaysia, staffing as much as they can there.  My last job I got hired for, my boss had to run through 4 levels of exceptions to say THIS JOB CAN'T BE DONE INTERNATIONALLY, before they'd hire stateside.  4 levels of exceptions and approvals just to hire in the US.  Why hire jeets domestically at domestic H1-B wages when you can hire jeets in their home countries for much less?  THAT, is the fucking problem. permalink award report block reply breadbaker 5 points 9 hours ago Tax and tariff services. Corps will find another way around it, and government should deal with it quickly and effectively. We spineless and law politicians. permalink parent award report block reply dtrap 2 points 7 hours ago This is the answer. permalink parent award report block reply Parhelion12 4 points 8 hours ago They can both be problems. permalink parent award report block reply UrShulgi 2 points 6 hours ago It's the level of problem...it's a bee sting vs a fucking hive attacking you.  Look at the numbers :  85k h1b/year, 300k+ jobs outsourced every year.  H1B's are temporary, and don't last forever, outsourced jobs never come back.  It's a matter of scale. permalink parent award report block reply covok48 1 points 1 hour ago I can assure you the Dallas might as well be called New Dhallas. Its also a problem. permalink parent award report block reply Elonmuskbedo 1 points 9 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nbreadbaker 5 points 9 hours ago Tax and tariff services. Corps will find another way around it, and government should deal with it quickly and effectively. We spineless and law politicians. permalink parent award report block reply dtrap 2 points 7 hours ago This is the answer. permalink parent award report block reply\ndtrap 2 points 7 hours ago This is the answer. permalink parent award report block reply\nParhelion12 4 points 8 hours ago They can both be problems. permalink parent award report block reply UrShulgi 2 points 6 hours ago It's the level of problem...it's a bee sting vs a fucking hive attacking you.  Look at the numbers :  85k h1b/year, 300k+ jobs outsourced every year.  H1B's are temporary, and don't last forever, outsourced jobs never come back.  It's a matter of scale. permalink parent award report block reply\nUrShulgi 2 points 6 hours ago It's the level of problem...it's a bee sting vs a fucking hive attacking you.  Look at the numbers :  85k h1b/year, 300k+ jobs outsourced every year.  H1B's are temporary, and don't last forever, outsourced jobs never come back.  It's a matter of scale. permalink parent award report block reply\ncovok48 1 points 1 hour ago I can assure you the Dallas might as well be called New Dhallas. Its also a problem. permalink parent award report block reply\nElonmuskbedo 1 points 9 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\n_2022_ 20 points 12 hours ago H-1B support and 50 year mortgages. Great second term. It’s over when dems steal the midterms. permalink award report block reply xanaxagoras 17 points 9 hours ago Do they even need to steal? Are you feeling excited about voting for your lukewarm do-nothing fucking retard GOP congressman? I’m not. permalink parent award report block reply CrossTheRubixCube 9 points 9 hours ago At this rate the Dems won’t even need to steal the midterms. permalink parent award report block reply flashersenpai 0 points 5 hours ago +7 D generic ballot polling today permalink parent award report block reply TrumpPl4yedU 2 points 10 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nxanaxagoras 17 points 9 hours ago Do they even need to steal? Are you feeling excited about voting for your lukewarm do-nothing fucking retard GOP congressman? I’m not. permalink parent award report block reply\nCrossTheRubixCube 9 points 9 hours ago At this rate the Dems won’t even need to steal the midterms. permalink parent award report block reply flashersenpai 0 points 5 hours ago +7 D generic ballot polling today permalink parent award report block reply\nflashersenpai 0 points 5 hours ago +7 D generic ballot polling today permalink parent award report block reply\nTrumpPl4yedU 2 points 10 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nDontBeAFaggot 17 points 10 hours ago Trump is completely out of touch on this permalink award report block reply\nRudeFrog 16 points 10 hours ago It's so complicated only cheap foreign labor knows how to do it permalink award report block reply\nGreenhills 8 points 10 hours ago It’s a lie because we’re the greatest, smartest, most innovative human population on the planet. And in reality, there’s probably 1,500 tops specialists in the world who are extraordinary. Do you know Nissan pays $1B with a B to Tech Mahindra to offshore IT support? It’s disgusting. Imagine what Amazon pays or Apple. I’m with UrShulgi here, the H1b is just the tip of the iceberg. The real issue is the offshoring companies now prioritize as a corporate strategy not a last resort. permalink award report block reply RedStoneDeepState -1 points 10 hours ago offshore Visas don't matter there. You can't force companies to not outsource. permalink parent award report block reply Parhelion12 5 points 8 hours ago But you can regulate into oblivion permalink parent award report block reply RedStoneDeepState -3 points 8 hours ago Yes, you can regulate the US economy into oblivion and effectively mandate more outsourcing that way. What about it? permalink parent award report block reply\nRedStoneDeepState -1 points 10 hours ago offshore Visas don't matter there. You can't force companies to not outsource. permalink parent award report block reply Parhelion12 5 points 8 hours ago But you can regulate into oblivion permalink parent award report block reply RedStoneDeepState -3 points 8 hours ago Yes, you can regulate the US economy into oblivion and effectively mandate more outsourcing that way. What about it? permalink parent award report block reply\nParhelion12 5 points 8 hours ago But you can regulate into oblivion permalink parent award report block reply RedStoneDeepState -3 points 8 hours ago Yes, you can regulate the US economy into oblivion and effectively mandate more outsourcing that way. What about it? permalink parent award report block reply\nRedStoneDeepState -3 points 8 hours ago Yes, you can regulate the US economy into oblivion and effectively mandate more outsourcing that way. What about it? permalink parent award report block reply\nSteveRogers42 8 points 10 hours ago I remember when Trump said he was opposed to “the siren song of globalism “… permalink award report block reply\nWontgoquietly 7 points 9 hours ago H-1B is the enemy of American labor.  It cannot continue without causing severe harm to Americans who want and need middle class job opportunities.  Trump simply doesn’t get it.  His top three labor priorities are oligarchs, oligarchs, and oligarchs. permalink award report block reply\nSuperDuperBasedMD 7 points 12 hours ago Keep in mind, although the H1b problem is real and it's very important, the reason why it's being algorithmically pushed is because it's being used as a wedge to destroy MAGA. Everyone should read this article. https://theconservativetreehouse.com/blog/2025/11/11/the-2025-maga-fracture-and-the-benefactors-behind-it/ \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" permalink award report block reply ShadowInv 6 points 9 hours ago But they aren't wrong about it, f isreal and f h1b's permalink parent award report block reply Oleander 6 points 8 hours ago So what do you want us to do, clap like a goddamn seal united and happy when what they're doing is the opposite of MAGA? The whole point was for working class people to tell these invaders to fuck off. America First. Remember? permalink parent award report block reply PhilipeNegro 2 points 6 hours ago “Sundance” can shove this up his faggotty ass, along with his faggotty pseudonym. permalink parent award report block reply flashersenpai -1 points 5 hours ago omg kraken permalink parent award report block reply\nShadowInv 6 points 9 hours ago But they aren't wrong about it, f isreal and f h1b's permalink parent award report block reply\nOleander 6 points 8 hours ago So what do you want us to do, clap like a goddamn seal united and happy when what they're doing is the opposite of MAGA? The whole point was for working class people to tell these invaders to fuck off. America First. Remember? permalink parent award report block reply\nPhilipeNegro 2 points 6 hours ago “Sundance” can shove this up his faggotty ass, along with his faggotty pseudonym. permalink parent award report block reply\nflashersenpai -1 points 5 hours ago omg kraken permalink parent award report block reply\ncovok48 3 points 7 hours ago I hate H1Bs and Indians. I’m done having these cretins and their spawn rob me & my family of our future. permalink award report block reply Oleander 1 points 7 hours ago You can bet they ain't done with you though, and neither are our crooked politicians. In their minds they don't need your consent. This world is becoming a dark place. At least you have a family, many of us can only dream of that right now. permalink parent award report block reply\nOleander 1 points 7 hours ago You can bet they ain't done with you though, and neither are our crooked politicians. In their minds they don't need your consent. This world is becoming a dark place. At least you have a family, many of us can only dream of that right now. permalink parent award report block reply\nFemprep 3 points 7 hours ago If companies are applying for, and receiving H1Bs, they should also be required to train people for the job the H1B has taken so they can ultimately be sent home and replaced with home grown. permalink award report block reply\nCrappydatum 3 points 3 hours ago Shaniqua can do dat John just fine Did I say John? I meant job permalink award report block reply\nBurtMcGirt 3 points 8 hours ago It's not just about suppression of wages. It's about having a mindless, compliant workforce, who will allow you to treat them like slave labor to avoid being sent back to their shitholes. Big Corporate is just as bad as Big Socialist Government. permalink award report block reply\nrebuildingMyself 3 points 10 hours ago And those low wage jobs tht used to be done by young teenagers needing money for school or (God forbid) their own hobbies are replaced by jeets. Little Billy earning money by mowing his neighbors lawns? Nah we have illegal slave labor for that now. So those young ambitious kids are denied the opportunity to build valuable skills and learn hard lessons while the cost of failure is cheap are told to shut up and study their Marxist programming instead. That way they can eventually vote for Commies like Mamdami who promise free gibs from the sky only to revoke the promise right after giving him the vote he needed. permalink award report block reply\ndtrap 2 points 8 hours ago The fact that they force Americans to train H1Bs before the Americans are replaced by H1Bs says it all. This is about long term control of wage growth. American gets in, gets 6-8 months of experience, then levels up for $5-10-k. Any employer that doesn't want to waste money on churn will pony up. The solution? H1B visa holders. Once sponsored they are stuck with their employer for 3 years. If the H1B visa holder even thinks of playing the field, the employer cancels the visa and the visa holder has 3 months to either find a new sponsor or liquidate their US life and self-deport. Visa holders stay put and accept the wages given for year or decades at a time. Docile. Controlled. The H1B visa is just moving indentured servitude up the employment chain. permalink award report block reply\nCrappydatum 2 points 3 hours ago Don't blame Trump, blame the Department of Edumacate permalink award report block reply\nATX_for_Trump 2 points 9 hours ago American's are already in these roles and are just being replaced by cheaper labor.  Train your replacement or lose your severance package. permalink award report block reply\nGarbageManCan47 2 points 10 hours ago Get rid of fucking welfare that's making doing nothing viable as a life style. As a grown adult, if you don't earn a living, you shouldn't be living, period. That's part of the problem. permalink award report block reply ShadowInv 3 points 9 hours ago Why work if the money earned isn't enough to pay for life? permalink parent award report block reply\nShadowInv 3 points 9 hours ago Why work if the money earned isn't enough to pay for life? permalink parent award report block reply\nedxzxz 1 points 9 hours ago Here's the only scenario I'd be ok with someone getting a visa to work here:  You operate a multinational company and your North American V.P. of R&D retires, you want to promote the European division R&D guy to the job and he needs to live in the USA to do that job.  Positions where your company needs a very specific person for a very specific role in your company, ok.  The total number issued each year should be under 500. permalink award report block reply\nIt_takes_10_years 1 points 7 hours ago Trump disagrees with you. \"I know what MAGA wants better than anyone else\" Ingraham countered him, saying that US has \"plenty of talented people.\" Trump in response said, \"No, you don't. There are certain skills you don't have, and people have to learn them. You can't take people off the unemployment line and say, 'I'm going to put you into a factory where we're going to make missiles.'\" America requires foreigners because Americans are too stupid! Our country and our colleges would FAIL without foreigners. permalink award report block reply Diversity_Fire OP 1 points 5 hours ago This is horse shit.  The us air force has high schoolers making munitions within 3 months for air craft permalink parent award report block reply SanityGumby 1 points 8 minutes ago No they don’t. Screwing a handful of parts together is not building munitions. permalink parent award report block reply It_takes_10_years 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nDiversity_Fire OP 1 points 5 hours ago This is horse shit.  The us air force has high schoolers making munitions within 3 months for air craft permalink parent award report block reply SanityGumby 1 points 8 minutes ago No they don’t. Screwing a handful of parts together is not building munitions. permalink parent award report block reply It_takes_10_years 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nSanityGumby 1 points 8 minutes ago No they don’t. Screwing a handful of parts together is not building munitions. permalink parent award report block reply\nIt_takes_10_years 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nRedStoneDeepState 1 points 11 hours ago Not for all of them. 80% of the time, sure, but about 20% of the time it's legitimately difficult to train them up. We need to reduce H1Bs but the program is still important. permalink award report block reply TheRedPike 0 points 9 hours ago $100k a pop sounds good to me. permalink parent award report block reply\nTheRedPike 0 points 9 hours ago $100k a pop sounds good to me. permalink parent award report block reply\nmohel 1 points 7 hours ago Junior developer with a fake diploma from Hyderabad would disagree permalink award report block reply\nSanityGumby 1 points 12 minutes ago So you literally agree with what Trump said. Cool permalink award report block reply\nfrenacrossthepond 0 points 9 hours ago The same story in Europe. Large companies have lobbied to allow importation of Indian workers etc... They are only doing this to increase the size of their workforce in order to a) demonstrate \"growth\" for shareholders/stock price and b) so that a company can apply for more national and EU funding. The whole thing is a racket. In fact worker's salaries are often so subsidized by the state that the state would actually save money if the workers were fired and they would claim unemployment money instead. Many times internal company projects are started just for the sole purpose of getting more state funding and increasing the workforce numbers. Actual project - no one gives a fuck about...it will never become a product or service offered to a customer. The biggest players are the ones exploiting the system to the max...and then the ceos use every tax evasion trick to keep more money. It' called \"milking the system\" and there are many start-ups that seem designed to do just that. permalink award report block reply\nNZbacon 0 points 9 hours ago If foreign work is required then it can be done remotely. permalink award report block reply\nflashersenpai 0 points 5 hours ago But Bessent just said H1B could need 3-7 years to train workers! permalink award report block reply\nGreenhills 0 points 8 hours ago Do you know how many people right now are getting blown out of roles they’ve had for ten years so they can train their lesser counterpart in the Philippines? I think they call this AI permalink award report block reply\nUncleStepDaddy 0 points 8 hours ago It's completely DISPICABLE! permalink award report block reply\nTOPDAWG23 0 points 6 hours ago yawn so did trump change his 100,000 fee on them or what? Seems you morons are being taken for a ride and reacting like the left does at every little thing. permalink award report block reply flashersenpai 1 points 5 hours ago trump pushes more foreigners to replace american workers little thing k permalink parent award report block reply SanityGumby 1 points 7 minutes ago Except he didn’t permalink parent award report block reply\nflashersenpai 1 points 5 hours ago trump pushes more foreigners to replace american workers little thing k permalink parent award report block reply SanityGumby 1 points 7 minutes ago Except he didn’t permalink parent award report block reply\nSanityGumby 1 points 7 minutes ago Except he didn’t permalink parent award report block reply\nBubbaSawyer4Trump 1 points 9 hours ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T23:41:25.269298Z"
}