{
  "id": "8184819",
  "title": "30441% of LGBTQ+ television characters have been axed amid nationwide rollback of woke DEI policies ",
  "url": "https://patriots.win/p/1ARK9mHVWb/41-of-lgbtq-television-character/c",
  "content": "305 41% of LGBTQ+ television characters have been axed amid nationwide rollback of woke DEI policies and initiatives, according to Deadline. / Let's hit 100% posted 9 hours ago by PiratePatriotParrot 14 comments award share report block E X X ➠A L E R T S @ExxAlerts • 18h JUST IN: 41% of LGBTQ+ television characters have been axed amid nationwide rollback of woke DEI policies and initiatives, according to Deadline.\n14 comments Sort by Top Top New Worst Old Save DaninElkhart 17 points 8 hours ago Did the TV execs make it realistic and have the 41% off themselves? permalink award report block reply booblitchutz 8 points 7 hours ago I saw that and chuckled. permalink parent award report block reply Tookens 13 points 8 hours ago Man..  next thing you know they're going to start showing white couples again. permalink award report block reply booblitchutz 7 points 7 hours ago Not a chance permalink parent award report block reply Now_On_to_Mars 4 points 6 hours ago Don't be ridiculous permalink parent award report block reply airborne3502 8 points 9 hours ago Somehow, we were paying for this, and the only reason it ended is because the money ran out. permalink award report block reply Now_On_to_Mars 6 points 6 hours ago Hmm 41% where have I seen that number before??? permalink award report block reply joggin_noggin 2 points 5 hours ago Coincidence, or satire with a fabricated number? permalink parent award report block reply Now_On_to_Mars 2 points 4 hours ago 87% of all statistics are made up on the spot permalink parent award report block reply HostlyMarmless 6 points 7 hours ago I'm sure the perverts who were trying to indoctrinate you and your children to normalize and accept this degeneracy have just given up. /s permalink award report block reply PM-Melania-feet-pics 3 points 6 hours ago Make no mistake, they'll fight to the end.  They know what'll happen if they lose. permalink parent award report block reply Oodles 4 points 6 hours ago Now do non-Whites permalink award report block reply goatnuts 3 points 4 hours ago 41% you say? Curious that. permalink award report block reply Moebius 3 points 8 hours ago Not enough permalink award report block reply covefefe_energy 2 points 5 hours ago Fuck man. NSFW label PLEEEEEEASE! permalink award report block reply\nDaninElkhart 17 points 8 hours ago Did the TV execs make it realistic and have the 41% off themselves? permalink award report block reply booblitchutz 8 points 7 hours ago I saw that and chuckled. permalink parent award report block reply\nbooblitchutz 8 points 7 hours ago I saw that and chuckled. permalink parent award report block reply\nTookens 13 points 8 hours ago Man..  next thing you know they're going to start showing white couples again. permalink award report block reply booblitchutz 7 points 7 hours ago Not a chance permalink parent award report block reply Now_On_to_Mars 4 points 6 hours ago Don't be ridiculous permalink parent award report block reply\nbooblitchutz 7 points 7 hours ago Not a chance permalink parent award report block reply\nNow_On_to_Mars 4 points 6 hours ago Don't be ridiculous permalink parent award report block reply\nairborne3502 8 points 9 hours ago Somehow, we were paying for this, and the only reason it ended is because the money ran out. permalink award report block reply\nNow_On_to_Mars 6 points 6 hours ago Hmm 41% where have I seen that number before??? permalink award report block reply joggin_noggin 2 points 5 hours ago Coincidence, or satire with a fabricated number? permalink parent award report block reply Now_On_to_Mars 2 points 4 hours ago 87% of all statistics are made up on the spot permalink parent award report block reply\njoggin_noggin 2 points 5 hours ago Coincidence, or satire with a fabricated number? permalink parent award report block reply Now_On_to_Mars 2 points 4 hours ago 87% of all statistics are made up on the spot permalink parent award report block reply\nNow_On_to_Mars 2 points 4 hours ago 87% of all statistics are made up on the spot permalink parent award report block reply\nHostlyMarmless 6 points 7 hours ago I'm sure the perverts who were trying to indoctrinate you and your children to normalize and accept this degeneracy have just given up. /s permalink award report block reply PM-Melania-feet-pics 3 points 6 hours ago Make no mistake, they'll fight to the end.  They know what'll happen if they lose. permalink parent award report block reply\nPM-Melania-feet-pics 3 points 6 hours ago Make no mistake, they'll fight to the end.  They know what'll happen if they lose. permalink parent award report block reply\nOodles 4 points 6 hours ago Now do non-Whites permalink award report block reply\ngoatnuts 3 points 4 hours ago 41% you say? Curious that. permalink award report block reply\nMoebius 3 points 8 hours ago Not enough permalink award report block reply\ncovefefe_energy 2 points 5 hours ago Fuck man. NSFW label PLEEEEEEASE! permalink award report block reply"
}