{
  "id": "1ARK9hkCp9",
  "url": "https://patriots.win/p/1ARK9hkCp9/mindblowing-discovery-/c",
  "content": "1523 Mind-blowing discovery 🤯 posted 2 days ago by kek_saved_the_world 133 comments award share report block Elon Musk @elonmusk • 2d Mind-blowing discovery 🤯 Daily Mail @DailyMail • 2d Olympics set to ban ALL transgender athletes from female events after 'finding scientific evidence of advantages to being born male'. Read more: https://t.co/hk1MKrxXX8\n133 comments Sort by Top Top New Worst Old Save WeeWillyWinkler 100 points 2 days ago thank god for The Science™ permalink award report block reply lifeisahologram 34 points 2 days ago Well now the science is racist because it doesn’t affirm that my female dick  is womanly, reee! permalink parent award report block reply mty_green_go 34 points 2 days ago female dick? i thought that it was called a SHENIS .   I can't keep up permalink parent award report block reply lifeisahologram 10 points 2 days ago 🤣 permalink parent award report block reply mikethemarine 7 points 2 days ago shit I have a retarded/mentally disabled friend that said the same thing, when this shit show started, he said he could outdo most women. Don't trust the science, TRUST THE RETARDED ON TRANNIES permalink parent award report block reply view 1 more comments... PatriotLady1 6 points 2 days ago \"SHENIS\"??? ... LMAO ﻿🤣﻿﻿🤣﻿﻿🤣﻿ permalink parent award report block reply 2021is1776-2 6 points 2 days ago No no no it’s enlarged clit syndrome. You damn bigots permalink parent award report block reply Deportthemall23 -3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments... Than0sIII 3 points 2 days ago One-eyed Jilly. permalink parent award report block reply Reefay 2 points 2 days ago Shenis, my sides permalink parent award report block reply KekistanPM 10 points 2 days ago Reddit probably: \"Noooooo they're using DEBOOOOOOONKED lies, not REAL science!!!!\" permalink parent award report block reply snoopy3210 4 points 2 days ago A study has shown that males in dresses have larger wing span when swimming 😮 permalink parent award report block reply bidensmissingbrain 6 points 2 days ago Funny how The Science changes right after a report comes out that late GenZ and Gen Alpha aren't into the whole trans thing. permalink parent award report block reply Burisma 6 points 2 days ago But...the science was SETTLED. permalink parent award report block reply RuprechtThaMonkeyBoy 4 points 2 days ago Settled? SETTLED? Those words are offensive and indicative of colonial imperialism. Reee! permalink parent award report block reply Gadsden 4 points 2 days ago I hope we didn't pay for that study. permalink parent award report block reply YT45 4 points 2 days ago Oh, but we did… permalink parent award report block reply TD_Covfefe_Crusader 2 points 2 days ago And the \"experts\". permalink parent award report block reply Shakakka99 43 points 2 days ago Was the scientific evidence dozens of shattered \"women's\" records? permalink award report block reply hzuiel 31 points 2 days ago Way more than dozens, in some cases it was transgenders going back and forth breaking each others records for the last few years. permalink parent award report block reply ICONSIDEREDTHISFIRST 16 points 2 days ago Hopefully they strip all the records as well. permalink parent award report block reply vote_for_MAGA_2020 6 points 2 days ago I hope they don't. Let the record show that men are better than women at everything. permalink parent award report block reply KinderKing -3 points 2 days ago Go watch a video of men multi-tasking Men and women are different and have different strengths. permalink parent award report block reply DontBeAFaggot 1 points 2 days ago Go back to kindergarten kinderking permalink parent award report block reply nakedjay 6 points 2 days ago Well that and few cracked women's skulls. permalink parent award report block reply Dangerous 35 points 2 days ago There are male and female divisions for fucking Chess you shouldn't need a scientific study to state the obvious permalink award report block reply dahdahdah_dahditdah 11 points 2 days ago There are male and female divisions for fucking Chess Close, but not quite correct. There are female-only chess events and championships, however the major chess championships are open to males and females alike. It just happens that males dominate the open gender events. Statistics of gender IQ are interesting. If I recall correctly (feel free to flame me if I get this wrong), females have a slightly higher IQ than males AS A POPULATION AVERAGE. However males have greater variability. Therefore males have more idiots and also more geniuses. A truly merit based recruitment of top scientists, engineers, executives, and other top performers will mostly recruit men, for that reason, with some exceptions. To put it another way, the IQ bell curve for women is taller and narrower, and that for men is more sprawled out with more populations in the tails on both sides -- again, idiots and brainiacs. permalink parent award report block reply BoatingAccident 13 points 2 days ago TLDR, your village idiot is probably a dude permalink parent award report block reply Donnie_Bro 8 points 2 days ago As is the chief. permalink parent award report block reply rebuildingMyself 3 points 2 days ago And so is your village genius, but that's clearly because the patriarchy keeps the smarter women down permalink parent award report block reply Agenda47 6 points 2 days ago There are female-only chess events and championships, however the major chess championships are open to males and females alike. It just happens that males dominate the open gender events. That's the case with most athletic sports too though. \"Male divisions\" typically didn't need to ban females, they just weren't ever good enough to join. permalink parent award report block reply Major_Nutt 3 points 2 days ago Never ever hear about that bullshit in football especially cause even the \"all sexes are equal\" crowd knows to shut up before 120lb Brittany gets turned into people-pudding at the 20yd line by 375lb DeMarcus. permalink parent award report block reply MoldyLocksNesMonste 1 points 2 days ago It's not 120 lb Brittany, but rather 5'5\" 170 pound Karen getting creamed permalink parent award report block reply c9AfEoF1StU7C2j2ZUv1 2 points 2 days ago Statistics of gender IQ are interesting. If I recall correctly (feel free to flame me if I get this wrong), females have a slightly higher IQ than males AS A POPULATION AVERAGE. I don't think there's substantial evidence pointing to a slightly higher average with women.  The mean for both men and women are extremely, extremely close. You've of course already added that the range of distribution isn't the same. permalink parent award report block reply tradcathbugman 2 points 2 days ago To add to both your points, most sports actually technically have \"women's\" and \"open\" categories, the effect is almost always the same, though much less surprising for most sports. The IQ bell curve pointiness thing also generalizes to most characteristics, probably because having two X chromosomes instead of one normalizes any characteristic that the X chromosome can affect.  The generalized idea is called \"Greater Male Variability Hypothesis\", it got memory holed for a while during the worst of the culture war stuff, but I hope we see more interesting research results soon as the pendulum swings back. permalink parent award report block reply UntakenUsername 22 points 2 days ago Yeah, right. Next you're going to tell us that the earth revolves around the sun instead of the other way around. permalink award report block reply Lmn8rinos 10 points 2 days ago And that bears shit in the woods permalink parent award report block reply lostremote- 4 points 2 days ago I mean theres a commercial that shows this permalink parent award report block reply vote_for_MAGA_2020 2 points 2 days ago Holy crap (pun intended), that connection didn't click in my head until you said it. permalink parent award report block reply aloch2 2 points 2 days ago And the Pope is Catholic. permalink parent award report block reply Taylor3006 8 points 2 days ago Yeah, not so sure about that after the past three or so. permalink parent award report block reply Friendly_B 2 points 2 days ago And that bears shit in the woods Jesse Lee Peterson enters the chat. permalink parent award report block reply VirTW 18 points 2 days ago Notice how it's never a problem of the women competing in the male events permalink award report block reply Afeazo 7 points 2 days ago For most major sports and I would assume probably the Olympics as well, there is no rules and nothing stopping women from trying to join the same professional leagues that men are part of. The problem comes from the fact that these pro leagues are pretty much exclusively performance selected and women would not be able to out compete men until there’s no spots left. You could have a woman linebacker next pick on any NFL team for example, but there’s guaranteed to be enough dudes lining up for that same open position that a woman wouldn’t be near the top spot to be selected. But if she somehow managed to do better via some super human capability then she’d be put on the team. permalink parent award report block reply bidensmissingbrain 7 points 2 days ago There's a reason the women who made it onto college teams were all kickers. And most only lasted a season permalink parent award report block reply Jimmyprawns 3 points 2 days ago They all peaked in highschool or junior highschool because they got a head start at puberty and finished puberty a bit sooner than the dudes.  But after a year of college, the dudes had all blown right past the hand full of females who were able to kind of keep for just a minute during jr or senior highschool.  And for that brief period, only as kickers. permalink parent award report block reply Dev404 12 points 2 days ago This is going to make the feminists shake their female testicles in anger. permalink award report block reply Strzok 2 points 2 days ago lmao permalink parent award report block reply MoldyLocksNesMonste 1 points 2 days ago Pretty sure they are tucked and there won't be any shaking permalink parent award report block reply Calumet57 10 points 2 days ago Don't be alarmed.  The Committee was quick to assure that opening ceremonies will remain satanic. permalink award report block reply Roadpower 1 points 2 days ago I heard that they had a thing for tunnels. permalink parent award report block reply DJT4MoreYears 8 points 2 days ago BREAKING NEWS: Men are NOT women. permalink award report block reply South_Florida_Guy 8 points 2 days ago That's impossible! I was told women are just as good if not BETTER than men at EVERYTHING! permalink award report block reply Jimmyprawns 2 points 2 days ago And by the same soyance that now tells me otherwise.  I don't know what to believe in anymore. permalink parent award report block reply Saltish 4 points 2 days ago lmao. \"The Experts,\" everyone. Please, hold your applause. permalink award report block reply TheWitnessOfCacti 4 points 2 days ago What a joke that this is even news.  Should have never been allowed to happen in the first place.  The Olympics are supposed to be about the beauty of a pure life and natural athleticism that comes from it and not gender bending politics which is the absolute antithesis of it. permalink award report block reply MegoThor 4 points 2 days ago Next up; water is wet. permalink award report block reply cosmos411 3 points 2 days ago Wait, what? Being able to stand up while peeing isn't the only advantage for being male? permalink award report block reply Crappydatum 1 points 2 days ago Well, for you, maybe permalink parent award report block reply knnbccb 3 points 2 days ago Let them create and compete in their own Translympics. The cripples and retards have their own Paralympics. Leave the normal people alone. permalink award report block reply Rain_man 3 points 2 days ago Guys. I am SHOCKED permalink award report block reply Mungo 3 points 2 days ago Stunning permalink award report block reply Roadpower 2 points 2 days ago And brave! permalink parent award report block reply DingleBalls 3 points 2 days ago NO SHIT, SHERLOCKS! permalink award report block reply barwhack 2 points 2 days ago #Dipßhitzl That's the medical term for leftist brainitis. permalink award report block reply Trump-16-20-24-28-32 2 points 2 days ago Ban women in men's sports as well. Also, ban performance enhancing drugs.  This includes hormone therapy. Testosterone is performance enhancing for women... Estrogen is performance enhancing for men.  And maybe it doesn't increase muscle mass or anything like that, it still specifically affects performance. permalink award report block reply MoldyLocksNesMonste 2 points 2 days ago Huh, so those fat guys with lot of aromatase activity going on have a performance advantage of some sort over leaner dudes? permalink parent award report block reply Trump-16-20-24-28-32 2 points 2 days ago LOL! I'm not sure how many fat guys with lots of aromatase activity are competing in the Olympics. permalink parent award report block reply jatergator 2 points 2 days ago Honk honk permalink award report block reply MoldyLocksNesMonste 2 points 2 days ago Advantages everyone has known since the beginning of history. permalink award report block reply TerdFurguson 2 points 2 days ago Among the points stressed in that presentation was the distinction between transgender and DSD in athletes who have male chromosomes but were raised as female. On the latter, which led to immense controversy at the boxing at Paris 2024, the future landscape is less clear. It is understood that a rule change around DSD athletes is considered likely in the long run, but faces internal opposition, according to Daily Mail Sport sources. That separate branch of the debate led to fury in Paris last year when Algeria's Imane Khelif and Lin Yu-ting of Taiwan won boxing gold medals after being disqualified from the World Championships in 2023 for reportedly failing gender eligibility tests. So if I'm reading this correctly, the olympic committee won't consider somebody a tranny if they were transed early enough, they would then fall into this \"DSD\" category and be allowed to compete as women even though they're men. Too much to hope for that they wouldn't keep at least one foot in clown world, I suppose. permalink award report block reply Retard_Strength 1 points 2 days ago you'd think they would've figured all this shit out back when East Germany was injecting their women athletes with testosterone. permalink parent award report block reply boomerbutnotOKBoomer 1 points 2 days ago What the hell is \"DSD\"? permalink parent award report block reply dres3 2 points 2 days ago Olympics wants US taxpayer money, doesn't it? permalink award report block reply MAGA1773 2 points 2 days ago Oh wow who would have thunk it? Could it be the big giant DONG and balls? permalink award report block reply Pappy_Gunn 2 points 2 days ago Too bad.  I was looking forward to Canada-USA Women's Olympic hockey with a couple of trannies on each side.  Make women's hockey great.  I don't mean again, I mean for once. permalink award report block reply Owmyballz 2 points 2 days ago Did you know the Olympic Committee has funded a committee to determine if you need to breath to live, and if so they will require mandatory breathing at all events. permalink award report block reply LibsRcrazy 1 points 2 days ago DUH permalink award report block reply behemoth887 1 points 2 days ago the soyence is always heckin changing u guys also the soyence is also heckin fact trust the heckin soyence permalink award report block reply Jimmyprawns 1 points 2 days ago Sounds kinda cultish. permalink parent award report block reply Bullet3250 1 points 2 days ago Will wonders never cease!! permalink award report block reply ckover9000 1 points 2 days ago Start calling them transphobes and watch the IOC go nuts. permalink award report block reply PiratePatriotAu 1 points 2 days ago \"Finding the science\" These committees are fully cucked to whatever the current thing is. permalink award report block reply anomaly47 1 points 2 days ago Water is wet. permalink award report block reply Kiwipede22 1 points 2 days ago ‘Internal opposition’.  Some oppose banning men in female sports….WHY?  do they want to see a woman beaten to death in the boxing ring… would that be frightfully exciting for them!!  No doubt it would boost the audience numbers exponentially. permalink award report block reply MoldyLocksNesMonste 2 points 2 days ago Hell yeah. Imagine a male vs female heavy weight bout. It'd be bigger than Tyson vs. Hollyfield. permalink parent award report block reply Nachos_and_cheese 1 points 2 days ago Who woulda thunk? permalink award report block reply Formerlurker92 1 points 2 days ago Sanity is slowly and by degrees being returned permalink award report block reply TenchuStealthAss 1 points 2 days ago lol permalink award report block reply TheSonOfGadsden 1 points 2 days ago “You don’t say.” -Nicholas Cage permalink award report block reply roadrunner0 1 points 2 days ago Well no shit Sherlock, after over 100 years of rules keeping them out for obvious reasons they started allowing and it was massively destructive so now they are out again.. permalink award report block reply Kolob64 1 points 2 days ago Wow, we never had any idea before. permalink award report block reply GhostOfMyFormerSelf 1 points 2 days ago 2020 to now: America at her dumbest. permalink award report block reply Amway 1 points 2 days ago I love rightfully placed sarcasm. permalink award report block reply 2020Gop 1 points 2 days ago Obviously need MOAR FUNDING!  - Commies permalink award report block reply Crappydatum 1 points 2 days ago Was that scientific evidence hiding in the top drawer? permalink award report block reply JoeBidensDementia1 1 points 2 days ago They're called balls. permalink award report block reply Grindelwald 1 points 2 days ago But they will be sending scientists to every woman’s bathroom at the Olympics to study the matter further. Seeking scientific researchers for the job. permalink award report block reply Just_trust_me_bro 1 points 2 days ago Sounds like something mr mike would have put in his phd thesis. permalink award report block reply raptormissle 1 points 2 days ago You're Blinding me with Science. permalink award report block reply LiquidSun 1 points 2 days ago I'm so sick of these tards who won't take a fucking breath until The Science tells them it's a healthy thing to do. permalink award report block reply 5DchessWatch 1 points 2 days ago oh my doy permalink award report block reply raptormissle 1 points 2 days ago And the Gold medal for the most obvious conclusion in the history of mankind goes to the Olympics. permalink award report block reply ncswicn 1 points 2 days ago 🤣🤣🤣 permalink award report block reply DwellerMike 1 points 2 days ago Fucking hell mate. There's benefits? Like no shit sherlock. permalink award report block reply SaltySilverback13 1 points 2 days ago In other news, water is wet... permalink award report block reply popcycle 1 points 2 days ago the tranny thing is over, except for the cleanup of what, three contaminated generations of youths? permalink award report block reply OmegaBird 1 points 2 days ago Noooooo. You don't say? Males and females are biologically and physically different?! permalink award report block reply Bob_sacamanao 1 points 2 days ago Democrats need a fucking BIOLOGY degree to know what a woman is 🤡 permalink award report block reply Kilroy 1 points 2 days ago Lol, their must have been an honest biologist on their payroll that they couldn't shut up. permalink award report block reply 2021is1776-2 1 points 2 days ago Today scientists finally discovered the sun causes temperatures to rise and in other news scientists confirm moisture and water are closely related. permalink award report block reply FusionBlack 1 points 2 days ago Earth shattering revolation. These people are genuinely retarded. permalink award report block reply tiamat 1 points 2 days ago Like rediscovering the wheel permalink award report block reply SpiderTaxi 1 points 2 days ago Omg, really now???   Kick a transgender in the balls and have 'The Science' tell me it may hurt. permalink award report block reply RoughBoy 1 points 2 days ago Week, better late than never I guess. permalink award report block reply ParticleCannon 1 points 2 days ago Someone made money determining that permalink award report block reply billybaldwin2 1 points 2 days ago America could have won every female Olympics for half a century. You bigots ruined it. permalink award report block reply charlesthehammer 1 points 2 days ago Also, water is wet permalink award report block reply mohel 0 points 2 days ago now they only need to discover the difference between sex and gender permalink award report block reply RINO_fatigue 0 points 2 days ago Hopefully California lawmakers can do something to reverse this, the Olympics deserves to be exposed as being the globohomo clown show that it is and the feminist bitch athletes all deserve severe beatings permalink award report block reply PensivePatriot 2 points 2 days ago Why, exactly would you want a reversal? Why, exactly do you want men to compete in women’s sports? permalink parent award report block reply BaguettesOfRudysSUB 0 points 2 days ago It's another bot, dipshit. Spend three minutes looking through its history. permalink parent award report block reply RINO_fatigue -1 points 2 days ago Why do you simp for feminist bitch dyke athletes who hate you and want to see you impoverished, humiliated, etc.?  I'd rather see the feminists fight the trannys to the death, people who step in and side with the feminists are badly misguised permalink parent award report block reply PensivePatriot 1 points 2 days ago Fuck off, leftist incognito. permalink parent award report block reply RINO_fatigue 1 points 2 days ago t. male feminist permalink parent award report block reply Washington_Redskins 0 points 2 days ago This is terrible news. It means my future career as a 40-year-old WNBA player is gone. They stole my dream. How dare they! permalink award report block reply Jimmyprawns 1 points 2 days ago Man that and the name of your team.  The bastards won't let you have anything will they? permalink parent award report block reply morbidly 1 points 2 days ago Comment removed by community moderators. permalink award report block reply\nWeeWillyWinkler 100 points 2 days ago thank god for The Science™ permalink award report block reply lifeisahologram 34 points 2 days ago Well now the science is racist because it doesn’t affirm that my female dick  is womanly, reee! permalink parent award report block reply mty_green_go 34 points 2 days ago female dick? i thought that it was called a SHENIS .   I can't keep up permalink parent award report block reply lifeisahologram 10 points 2 days ago 🤣 permalink parent award report block reply mikethemarine 7 points 2 days ago shit I have a retarded/mentally disabled friend that said the same thing, when this shit show started, he said he could outdo most women. Don't trust the science, TRUST THE RETARDED ON TRANNIES permalink parent award report block reply view 1 more comments... PatriotLady1 6 points 2 days ago \"SHENIS\"??? ... LMAO ﻿🤣﻿﻿🤣﻿﻿🤣﻿ permalink parent award report block reply 2021is1776-2 6 points 2 days ago No no no it’s enlarged clit syndrome. You damn bigots permalink parent award report block reply Deportthemall23 -3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments... Than0sIII 3 points 2 days ago One-eyed Jilly. permalink parent award report block reply Reefay 2 points 2 days ago Shenis, my sides permalink parent award report block reply KekistanPM 10 points 2 days ago Reddit probably: \"Noooooo they're using DEBOOOOOOONKED lies, not REAL science!!!!\" permalink parent award report block reply snoopy3210 4 points 2 days ago A study has shown that males in dresses have larger wing span when swimming 😮 permalink parent award report block reply bidensmissingbrain 6 points 2 days ago Funny how The Science changes right after a report comes out that late GenZ and Gen Alpha aren't into the whole trans thing. permalink parent award report block reply Burisma 6 points 2 days ago But...the science was SETTLED. permalink parent award report block reply RuprechtThaMonkeyBoy 4 points 2 days ago Settled? SETTLED? Those words are offensive and indicative of colonial imperialism. Reee! permalink parent award report block reply Gadsden 4 points 2 days ago I hope we didn't pay for that study. permalink parent award report block reply YT45 4 points 2 days ago Oh, but we did… permalink parent award report block reply TD_Covfefe_Crusader 2 points 2 days ago And the \"experts\". permalink parent award report block reply\nlifeisahologram 34 points 2 days ago Well now the science is racist because it doesn’t affirm that my female dick  is womanly, reee! permalink parent award report block reply mty_green_go 34 points 2 days ago female dick? i thought that it was called a SHENIS .   I can't keep up permalink parent award report block reply lifeisahologram 10 points 2 days ago 🤣 permalink parent award report block reply mikethemarine 7 points 2 days ago shit I have a retarded/mentally disabled friend that said the same thing, when this shit show started, he said he could outdo most women. Don't trust the science, TRUST THE RETARDED ON TRANNIES permalink parent award report block reply view 1 more comments... PatriotLady1 6 points 2 days ago \"SHENIS\"??? ... LMAO ﻿🤣﻿﻿🤣﻿﻿🤣﻿ permalink parent award report block reply 2021is1776-2 6 points 2 days ago No no no it’s enlarged clit syndrome. You damn bigots permalink parent award report block reply Deportthemall23 -3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments... Than0sIII 3 points 2 days ago One-eyed Jilly. permalink parent award report block reply Reefay 2 points 2 days ago Shenis, my sides permalink parent award report block reply KekistanPM 10 points 2 days ago Reddit probably: \"Noooooo they're using DEBOOOOOOONKED lies, not REAL science!!!!\" permalink parent award report block reply snoopy3210 4 points 2 days ago A study has shown that males in dresses have larger wing span when swimming 😮 permalink parent award report block reply\nmty_green_go 34 points 2 days ago female dick? i thought that it was called a SHENIS .   I can't keep up permalink parent award report block reply lifeisahologram 10 points 2 days ago 🤣 permalink parent award report block reply mikethemarine 7 points 2 days ago shit I have a retarded/mentally disabled friend that said the same thing, when this shit show started, he said he could outdo most women. Don't trust the science, TRUST THE RETARDED ON TRANNIES permalink parent award report block reply view 1 more comments... PatriotLady1 6 points 2 days ago \"SHENIS\"??? ... LMAO ﻿🤣﻿﻿🤣﻿﻿🤣﻿ permalink parent award report block reply 2021is1776-2 6 points 2 days ago No no no it’s enlarged clit syndrome. You damn bigots permalink parent award report block reply Deportthemall23 -3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments... Than0sIII 3 points 2 days ago One-eyed Jilly. permalink parent award report block reply Reefay 2 points 2 days ago Shenis, my sides permalink parent award report block reply\nlifeisahologram 10 points 2 days ago 🤣 permalink parent award report block reply mikethemarine 7 points 2 days ago shit I have a retarded/mentally disabled friend that said the same thing, when this shit show started, he said he could outdo most women. Don't trust the science, TRUST THE RETARDED ON TRANNIES permalink parent award report block reply view 1 more comments...\nmikethemarine 7 points 2 days ago shit I have a retarded/mentally disabled friend that said the same thing, when this shit show started, he said he could outdo most women. Don't trust the science, TRUST THE RETARDED ON TRANNIES permalink parent award report block reply view 1 more comments...\nPatriotLady1 6 points 2 days ago \"SHENIS\"??? ... LMAO ﻿🤣﻿﻿🤣﻿﻿🤣﻿ permalink parent award report block reply\n2021is1776-2 6 points 2 days ago No no no it’s enlarged clit syndrome. You damn bigots permalink parent award report block reply Deportthemall23 -3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments...\nDeportthemall23 -3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments...\nThan0sIII 3 points 2 days ago One-eyed Jilly. permalink parent award report block reply\nReefay 2 points 2 days ago Shenis, my sides permalink parent award report block reply\nKekistanPM 10 points 2 days ago Reddit probably: \"Noooooo they're using DEBOOOOOOONKED lies, not REAL science!!!!\" permalink parent award report block reply\nsnoopy3210 4 points 2 days ago A study has shown that males in dresses have larger wing span when swimming 😮 permalink parent award report block reply\nbidensmissingbrain 6 points 2 days ago Funny how The Science changes right after a report comes out that late GenZ and Gen Alpha aren't into the whole trans thing. permalink parent award report block reply\nBurisma 6 points 2 days ago But...the science was SETTLED. permalink parent award report block reply RuprechtThaMonkeyBoy 4 points 2 days ago Settled? SETTLED? Those words are offensive and indicative of colonial imperialism. Reee! permalink parent award report block reply\nRuprechtThaMonkeyBoy 4 points 2 days ago Settled? SETTLED? Those words are offensive and indicative of colonial imperialism. Reee! permalink parent award report block reply\nGadsden 4 points 2 days ago I hope we didn't pay for that study. permalink parent award report block reply YT45 4 points 2 days ago Oh, but we did… permalink parent award report block reply\nYT45 4 points 2 days ago Oh, but we did… permalink parent award report block reply\nTD_Covfefe_Crusader 2 points 2 days ago And the \"experts\". permalink parent award report block reply\nShakakka99 43 points 2 days ago Was the scientific evidence dozens of shattered \"women's\" records? permalink award report block reply hzuiel 31 points 2 days ago Way more than dozens, in some cases it was transgenders going back and forth breaking each others records for the last few years. permalink parent award report block reply ICONSIDEREDTHISFIRST 16 points 2 days ago Hopefully they strip all the records as well. permalink parent award report block reply vote_for_MAGA_2020 6 points 2 days ago I hope they don't. Let the record show that men are better than women at everything. permalink parent award report block reply KinderKing -3 points 2 days ago Go watch a video of men multi-tasking Men and women are different and have different strengths. permalink parent award report block reply DontBeAFaggot 1 points 2 days ago Go back to kindergarten kinderking permalink parent award report block reply nakedjay 6 points 2 days ago Well that and few cracked women's skulls. permalink parent award report block reply\nhzuiel 31 points 2 days ago Way more than dozens, in some cases it was transgenders going back and forth breaking each others records for the last few years. permalink parent award report block reply\nICONSIDEREDTHISFIRST 16 points 2 days ago Hopefully they strip all the records as well. permalink parent award report block reply vote_for_MAGA_2020 6 points 2 days ago I hope they don't. Let the record show that men are better than women at everything. permalink parent award report block reply KinderKing -3 points 2 days ago Go watch a video of men multi-tasking Men and women are different and have different strengths. permalink parent award report block reply DontBeAFaggot 1 points 2 days ago Go back to kindergarten kinderking permalink parent award report block reply\nvote_for_MAGA_2020 6 points 2 days ago I hope they don't. Let the record show that men are better than women at everything. permalink parent award report block reply KinderKing -3 points 2 days ago Go watch a video of men multi-tasking Men and women are different and have different strengths. permalink parent award report block reply DontBeAFaggot 1 points 2 days ago Go back to kindergarten kinderking permalink parent award report block reply\nKinderKing -3 points 2 days ago Go watch a video of men multi-tasking Men and women are different and have different strengths. permalink parent award report block reply DontBeAFaggot 1 points 2 days ago Go back to kindergarten kinderking permalink parent award report block reply\nDontBeAFaggot 1 points 2 days ago Go back to kindergarten kinderking permalink parent award report block reply\nnakedjay 6 points 2 days ago Well that and few cracked women's skulls. permalink parent award report block reply\nDangerous 35 points 2 days ago There are male and female divisions for fucking Chess you shouldn't need a scientific study to state the obvious permalink award report block reply dahdahdah_dahditdah 11 points 2 days ago There are male and female divisions for fucking Chess Close, but not quite correct. There are female-only chess events and championships, however the major chess championships are open to males and females alike. It just happens that males dominate the open gender events. Statistics of gender IQ are interesting. If I recall correctly (feel free to flame me if I get this wrong), females have a slightly higher IQ than males AS A POPULATION AVERAGE. However males have greater variability. Therefore males have more idiots and also more geniuses. A truly merit based recruitment of top scientists, engineers, executives, and other top performers will mostly recruit men, for that reason, with some exceptions. To put it another way, the IQ bell curve for women is taller and narrower, and that for men is more sprawled out with more populations in the tails on both sides -- again, idiots and brainiacs. permalink parent award report block reply BoatingAccident 13 points 2 days ago TLDR, your village idiot is probably a dude permalink parent award report block reply Donnie_Bro 8 points 2 days ago As is the chief. permalink parent award report block reply rebuildingMyself 3 points 2 days ago And so is your village genius, but that's clearly because the patriarchy keeps the smarter women down permalink parent award report block reply Agenda47 6 points 2 days ago There are female-only chess events and championships, however the major chess championships are open to males and females alike. It just happens that males dominate the open gender events. That's the case with most athletic sports too though. \"Male divisions\" typically didn't need to ban females, they just weren't ever good enough to join. permalink parent award report block reply Major_Nutt 3 points 2 days ago Never ever hear about that bullshit in football especially cause even the \"all sexes are equal\" crowd knows to shut up before 120lb Brittany gets turned into people-pudding at the 20yd line by 375lb DeMarcus. permalink parent award report block reply MoldyLocksNesMonste 1 points 2 days ago It's not 120 lb Brittany, but rather 5'5\" 170 pound Karen getting creamed permalink parent award report block reply c9AfEoF1StU7C2j2ZUv1 2 points 2 days ago Statistics of gender IQ are interesting. If I recall correctly (feel free to flame me if I get this wrong), females have a slightly higher IQ than males AS A POPULATION AVERAGE. I don't think there's substantial evidence pointing to a slightly higher average with women.  The mean for both men and women are extremely, extremely close. You've of course already added that the range of distribution isn't the same. permalink parent award report block reply tradcathbugman 2 points 2 days ago To add to both your points, most sports actually technically have \"women's\" and \"open\" categories, the effect is almost always the same, though much less surprising for most sports. The IQ bell curve pointiness thing also generalizes to most characteristics, probably because having two X chromosomes instead of one normalizes any characteristic that the X chromosome can affect.  The generalized idea is called \"Greater Male Variability Hypothesis\", it got memory holed for a while during the worst of the culture war stuff, but I hope we see more interesting research results soon as the pendulum swings back. permalink parent award report block reply\ndahdahdah_dahditdah 11 points 2 days ago There are male and female divisions for fucking Chess Close, but not quite correct. There are female-only chess events and championships, however the major chess championships are open to males and females alike. It just happens that males dominate the open gender events. Statistics of gender IQ are interesting. If I recall correctly (feel free to flame me if I get this wrong), females have a slightly higher IQ than males AS A POPULATION AVERAGE. However males have greater variability. Therefore males have more idiots and also more geniuses. A truly merit based recruitment of top scientists, engineers, executives, and other top performers will mostly recruit men, for that reason, with some exceptions. To put it another way, the IQ bell curve for women is taller and narrower, and that for men is more sprawled out with more populations in the tails on both sides -- again, idiots and brainiacs. permalink parent award report block reply BoatingAccident 13 points 2 days ago TLDR, your village idiot is probably a dude permalink parent award report block reply Donnie_Bro 8 points 2 days ago As is the chief. permalink parent award report block reply rebuildingMyself 3 points 2 days ago And so is your village genius, but that's clearly because the patriarchy keeps the smarter women down permalink parent award report block reply Agenda47 6 points 2 days ago There are female-only chess events and championships, however the major chess championships are open to males and females alike. It just happens that males dominate the open gender events. That's the case with most athletic sports too though. \"Male divisions\" typically didn't need to ban females, they just weren't ever good enough to join. permalink parent award report block reply Major_Nutt 3 points 2 days ago Never ever hear about that bullshit in football especially cause even the \"all sexes are equal\" crowd knows to shut up before 120lb Brittany gets turned into people-pudding at the 20yd line by 375lb DeMarcus. permalink parent award report block reply MoldyLocksNesMonste 1 points 2 days ago It's not 120 lb Brittany, but rather 5'5\" 170 pound Karen getting creamed permalink parent award report block reply c9AfEoF1StU7C2j2ZUv1 2 points 2 days ago Statistics of gender IQ are interesting. If I recall correctly (feel free to flame me if I get this wrong), females have a slightly higher IQ than males AS A POPULATION AVERAGE. I don't think there's substantial evidence pointing to a slightly higher average with women.  The mean for both men and women are extremely, extremely close. You've of course already added that the range of distribution isn't the same. permalink parent award report block reply tradcathbugman 2 points 2 days ago To add to both your points, most sports actually technically have \"women's\" and \"open\" categories, the effect is almost always the same, though much less surprising for most sports. The IQ bell curve pointiness thing also generalizes to most characteristics, probably because having two X chromosomes instead of one normalizes any characteristic that the X chromosome can affect.  The generalized idea is called \"Greater Male Variability Hypothesis\", it got memory holed for a while during the worst of the culture war stuff, but I hope we see more interesting research results soon as the pendulum swings back. permalink parent award report block reply\nBoatingAccident 13 points 2 days ago TLDR, your village idiot is probably a dude permalink parent award report block reply Donnie_Bro 8 points 2 days ago As is the chief. permalink parent award report block reply rebuildingMyself 3 points 2 days ago And so is your village genius, but that's clearly because the patriarchy keeps the smarter women down permalink parent award report block reply\nDonnie_Bro 8 points 2 days ago As is the chief. permalink parent award report block reply\nrebuildingMyself 3 points 2 days ago And so is your village genius, but that's clearly because the patriarchy keeps the smarter women down permalink parent award report block reply\nAgenda47 6 points 2 days ago There are female-only chess events and championships, however the major chess championships are open to males and females alike. It just happens that males dominate the open gender events. That's the case with most athletic sports too though. \"Male divisions\" typically didn't need to ban females, they just weren't ever good enough to join. permalink parent award report block reply Major_Nutt 3 points 2 days ago Never ever hear about that bullshit in football especially cause even the \"all sexes are equal\" crowd knows to shut up before 120lb Brittany gets turned into people-pudding at the 20yd line by 375lb DeMarcus. permalink parent award report block reply MoldyLocksNesMonste 1 points 2 days ago It's not 120 lb Brittany, but rather 5'5\" 170 pound Karen getting creamed permalink parent award report block reply\nMajor_Nutt 3 points 2 days ago Never ever hear about that bullshit in football especially cause even the \"all sexes are equal\" crowd knows to shut up before 120lb Brittany gets turned into people-pudding at the 20yd line by 375lb DeMarcus. permalink parent award report block reply MoldyLocksNesMonste 1 points 2 days ago It's not 120 lb Brittany, but rather 5'5\" 170 pound Karen getting creamed permalink parent award report block reply\nMoldyLocksNesMonste 1 points 2 days ago It's not 120 lb Brittany, but rather 5'5\" 170 pound Karen getting creamed permalink parent award report block reply\nc9AfEoF1StU7C2j2ZUv1 2 points 2 days ago Statistics of gender IQ are interesting. If I recall correctly (feel free to flame me if I get this wrong), females have a slightly higher IQ than males AS A POPULATION AVERAGE. I don't think there's substantial evidence pointing to a slightly higher average with women.  The mean for both men and women are extremely, extremely close. You've of course already added that the range of distribution isn't the same. permalink parent award report block reply\ntradcathbugman 2 points 2 days ago To add to both your points, most sports actually technically have \"women's\" and \"open\" categories, the effect is almost always the same, though much less surprising for most sports. The IQ bell curve pointiness thing also generalizes to most characteristics, probably because having two X chromosomes instead of one normalizes any characteristic that the X chromosome can affect.  The generalized idea is called \"Greater Male Variability Hypothesis\", it got memory holed for a while during the worst of the culture war stuff, but I hope we see more interesting research results soon as the pendulum swings back. permalink parent award report block reply\nUntakenUsername 22 points 2 days ago Yeah, right. Next you're going to tell us that the earth revolves around the sun instead of the other way around. permalink award report block reply Lmn8rinos 10 points 2 days ago And that bears shit in the woods permalink parent award report block reply lostremote- 4 points 2 days ago I mean theres a commercial that shows this permalink parent award report block reply vote_for_MAGA_2020 2 points 2 days ago Holy crap (pun intended), that connection didn't click in my head until you said it. permalink parent award report block reply aloch2 2 points 2 days ago And the Pope is Catholic. permalink parent award report block reply Taylor3006 8 points 2 days ago Yeah, not so sure about that after the past three or so. permalink parent award report block reply Friendly_B 2 points 2 days ago And that bears shit in the woods Jesse Lee Peterson enters the chat. permalink parent award report block reply\nLmn8rinos 10 points 2 days ago And that bears shit in the woods permalink parent award report block reply lostremote- 4 points 2 days ago I mean theres a commercial that shows this permalink parent award report block reply vote_for_MAGA_2020 2 points 2 days ago Holy crap (pun intended), that connection didn't click in my head until you said it. permalink parent award report block reply aloch2 2 points 2 days ago And the Pope is Catholic. permalink parent award report block reply Taylor3006 8 points 2 days ago Yeah, not so sure about that after the past three or so. permalink parent award report block reply Friendly_B 2 points 2 days ago And that bears shit in the woods Jesse Lee Peterson enters the chat. permalink parent award report block reply\nlostremote- 4 points 2 days ago I mean theres a commercial that shows this permalink parent award report block reply vote_for_MAGA_2020 2 points 2 days ago Holy crap (pun intended), that connection didn't click in my head until you said it. permalink parent award report block reply\nvote_for_MAGA_2020 2 points 2 days ago Holy crap (pun intended), that connection didn't click in my head until you said it. permalink parent award report block reply\naloch2 2 points 2 days ago And the Pope is Catholic. permalink parent award report block reply Taylor3006 8 points 2 days ago Yeah, not so sure about that after the past three or so. permalink parent award report block reply\nTaylor3006 8 points 2 days ago Yeah, not so sure about that after the past three or so. permalink parent award report block reply\nFriendly_B 2 points 2 days ago And that bears shit in the woods Jesse Lee Peterson enters the chat. permalink parent award report block reply\nVirTW 18 points 2 days ago Notice how it's never a problem of the women competing in the male events permalink award report block reply Afeazo 7 points 2 days ago For most major sports and I would assume probably the Olympics as well, there is no rules and nothing stopping women from trying to join the same professional leagues that men are part of. The problem comes from the fact that these pro leagues are pretty much exclusively performance selected and women would not be able to out compete men until there’s no spots left. You could have a woman linebacker next pick on any NFL team for example, but there’s guaranteed to be enough dudes lining up for that same open position that a woman wouldn’t be near the top spot to be selected. But if she somehow managed to do better via some super human capability then she’d be put on the team. permalink parent award report block reply bidensmissingbrain 7 points 2 days ago There's a reason the women who made it onto college teams were all kickers. And most only lasted a season permalink parent award report block reply Jimmyprawns 3 points 2 days ago They all peaked in highschool or junior highschool because they got a head start at puberty and finished puberty a bit sooner than the dudes.  But after a year of college, the dudes had all blown right past the hand full of females who were able to kind of keep for just a minute during jr or senior highschool.  And for that brief period, only as kickers. permalink parent award report block reply\nAfeazo 7 points 2 days ago For most major sports and I would assume probably the Olympics as well, there is no rules and nothing stopping women from trying to join the same professional leagues that men are part of. The problem comes from the fact that these pro leagues are pretty much exclusively performance selected and women would not be able to out compete men until there’s no spots left. You could have a woman linebacker next pick on any NFL team for example, but there’s guaranteed to be enough dudes lining up for that same open position that a woman wouldn’t be near the top spot to be selected. But if she somehow managed to do better via some super human capability then she’d be put on the team. permalink parent award report block reply bidensmissingbrain 7 points 2 days ago There's a reason the women who made it onto college teams were all kickers. And most only lasted a season permalink parent award report block reply Jimmyprawns 3 points 2 days ago They all peaked in highschool or junior highschool because they got a head start at puberty and finished puberty a bit sooner than the dudes.  But after a year of college, the dudes had all blown right past the hand full of females who were able to kind of keep for just a minute during jr or senior highschool.  And for that brief period, only as kickers. permalink parent award report block reply\nbidensmissingbrain 7 points 2 days ago There's a reason the women who made it onto college teams were all kickers. And most only lasted a season permalink parent award report block reply Jimmyprawns 3 points 2 days ago They all peaked in highschool or junior highschool because they got a head start at puberty and finished puberty a bit sooner than the dudes.  But after a year of college, the dudes had all blown right past the hand full of females who were able to kind of keep for just a minute during jr or senior highschool.  And for that brief period, only as kickers. permalink parent award report block reply\nJimmyprawns 3 points 2 days ago They all peaked in highschool or junior highschool because they got a head start at puberty and finished puberty a bit sooner than the dudes.  But after a year of college, the dudes had all blown right past the hand full of females who were able to kind of keep for just a minute during jr or senior highschool.  And for that brief period, only as kickers. permalink parent award report block reply\nDev404 12 points 2 days ago This is going to make the feminists shake their female testicles in anger. permalink award report block reply Strzok 2 points 2 days ago lmao permalink parent award report block reply MoldyLocksNesMonste 1 points 2 days ago Pretty sure they are tucked and there won't be any shaking permalink parent award report block reply\nStrzok 2 points 2 days ago lmao permalink parent award report block reply\nMoldyLocksNesMonste 1 points 2 days ago Pretty sure they are tucked and there won't be any shaking permalink parent award report block reply\nCalumet57 10 points 2 days ago Don't be alarmed.  The Committee was quick to assure that opening ceremonies will remain satanic. permalink award report block reply Roadpower 1 points 2 days ago I heard that they had a thing for tunnels. permalink parent award report block reply\nRoadpower 1 points 2 days ago I heard that they had a thing for tunnels. permalink parent award report block reply\nDJT4MoreYears 8 points 2 days ago BREAKING NEWS: Men are NOT women. permalink award report block reply\nSouth_Florida_Guy 8 points 2 days ago That's impossible! I was told women are just as good if not BETTER than men at EVERYTHING! permalink award report block reply Jimmyprawns 2 points 2 days ago And by the same soyance that now tells me otherwise.  I don't know what to believe in anymore. permalink parent award report block reply\nJimmyprawns 2 points 2 days ago And by the same soyance that now tells me otherwise.  I don't know what to believe in anymore. permalink parent award report block reply\nSaltish 4 points 2 days ago lmao. \"The Experts,\" everyone. Please, hold your applause. permalink award report block reply\nTheWitnessOfCacti 4 points 2 days ago What a joke that this is even news.  Should have never been allowed to happen in the first place.  The Olympics are supposed to be about the beauty of a pure life and natural athleticism that comes from it and not gender bending politics which is the absolute antithesis of it. permalink award report block reply\nMegoThor 4 points 2 days ago Next up; water is wet. permalink award report block reply\ncosmos411 3 points 2 days ago Wait, what? Being able to stand up while peeing isn't the only advantage for being male? permalink award report block reply Crappydatum 1 points 2 days ago Well, for you, maybe permalink parent award report block reply\nCrappydatum 1 points 2 days ago Well, for you, maybe permalink parent award report block reply\nknnbccb 3 points 2 days ago Let them create and compete in their own Translympics. The cripples and retards have their own Paralympics. Leave the normal people alone. permalink award report block reply\nRain_man 3 points 2 days ago Guys. I am SHOCKED permalink award report block reply\nMungo 3 points 2 days ago Stunning permalink award report block reply Roadpower 2 points 2 days ago And brave! permalink parent award report block reply\nRoadpower 2 points 2 days ago And brave! permalink parent award report block reply\nDingleBalls 3 points 2 days ago NO SHIT, SHERLOCKS! permalink award report block reply\nbarwhack 2 points 2 days ago #Dipßhitzl That's the medical term for leftist brainitis. permalink award report block reply\nTrump-16-20-24-28-32 2 points 2 days ago Ban women in men's sports as well. Also, ban performance enhancing drugs.  This includes hormone therapy. Testosterone is performance enhancing for women... Estrogen is performance enhancing for men.  And maybe it doesn't increase muscle mass or anything like that, it still specifically affects performance. permalink award report block reply MoldyLocksNesMonste 2 points 2 days ago Huh, so those fat guys with lot of aromatase activity going on have a performance advantage of some sort over leaner dudes? permalink parent award report block reply Trump-16-20-24-28-32 2 points 2 days ago LOL! I'm not sure how many fat guys with lots of aromatase activity are competing in the Olympics. permalink parent award report block reply\nMoldyLocksNesMonste 2 points 2 days ago Huh, so those fat guys with lot of aromatase activity going on have a performance advantage of some sort over leaner dudes? permalink parent award report block reply Trump-16-20-24-28-32 2 points 2 days ago LOL! I'm not sure how many fat guys with lots of aromatase activity are competing in the Olympics. permalink parent award report block reply\nTrump-16-20-24-28-32 2 points 2 days ago LOL! I'm not sure how many fat guys with lots of aromatase activity are competing in the Olympics. permalink parent award report block reply\njatergator 2 points 2 days ago Honk honk permalink award report block reply\nMoldyLocksNesMonste 2 points 2 days ago Advantages everyone has known since the beginning of history. permalink award report block reply\nTerdFurguson 2 points 2 days ago Among the points stressed in that presentation was the distinction between transgender and DSD in athletes who have male chromosomes but were raised as female. On the latter, which led to immense controversy at the boxing at Paris 2024, the future landscape is less clear. It is understood that a rule change around DSD athletes is considered likely in the long run, but faces internal opposition, according to Daily Mail Sport sources. That separate branch of the debate led to fury in Paris last year when Algeria's Imane Khelif and Lin Yu-ting of Taiwan won boxing gold medals after being disqualified from the World Championships in 2023 for reportedly failing gender eligibility tests. So if I'm reading this correctly, the olympic committee won't consider somebody a tranny if they were transed early enough, they would then fall into this \"DSD\" category and be allowed to compete as women even though they're men. Too much to hope for that they wouldn't keep at least one foot in clown world, I suppose. permalink award report block reply Retard_Strength 1 points 2 days ago you'd think they would've figured all this shit out back when East Germany was injecting their women athletes with testosterone. permalink parent award report block reply boomerbutnotOKBoomer 1 points 2 days ago What the hell is \"DSD\"? permalink parent award report block reply\nRetard_Strength 1 points 2 days ago you'd think they would've figured all this shit out back when East Germany was injecting their women athletes with testosterone. permalink parent award report block reply\nboomerbutnotOKBoomer 1 points 2 days ago What the hell is \"DSD\"? permalink parent award report block reply\ndres3 2 points 2 days ago Olympics wants US taxpayer money, doesn't it? permalink award report block reply\nMAGA1773 2 points 2 days ago Oh wow who would have thunk it? Could it be the big giant DONG and balls? permalink award report block reply\nPappy_Gunn 2 points 2 days ago Too bad.  I was looking forward to Canada-USA Women's Olympic hockey with a couple of trannies on each side.  Make women's hockey great.  I don't mean again, I mean for once. permalink award report block reply\nOwmyballz 2 points 2 days ago Did you know the Olympic Committee has funded a committee to determine if you need to breath to live, and if so they will require mandatory breathing at all events. permalink award report block reply\nLibsRcrazy 1 points 2 days ago DUH permalink award report block reply\nbehemoth887 1 points 2 days ago the soyence is always heckin changing u guys also the soyence is also heckin fact trust the heckin soyence permalink award report block reply Jimmyprawns 1 points 2 days ago Sounds kinda cultish. permalink parent award report block reply\nJimmyprawns 1 points 2 days ago Sounds kinda cultish. permalink parent award report block reply\nBullet3250 1 points 2 days ago Will wonders never cease!! permalink award report block reply\nckover9000 1 points 2 days ago Start calling them transphobes and watch the IOC go nuts. permalink award report block reply\nPiratePatriotAu 1 points 2 days ago \"Finding the science\" These committees are fully cucked to whatever the current thing is. permalink award report block reply\nanomaly47 1 points 2 days ago Water is wet. permalink award report block reply\nKiwipede22 1 points 2 days ago ‘Internal opposition’.  Some oppose banning men in female sports….WHY?  do they want to see a woman beaten to death in the boxing ring… would that be frightfully exciting for them!!  No doubt it would boost the audience numbers exponentially. permalink award report block reply MoldyLocksNesMonste 2 points 2 days ago Hell yeah. Imagine a male vs female heavy weight bout. It'd be bigger than Tyson vs. Hollyfield. permalink parent award report block reply\nMoldyLocksNesMonste 2 points 2 days ago Hell yeah. Imagine a male vs female heavy weight bout. It'd be bigger than Tyson vs. Hollyfield. permalink parent award report block reply\nNachos_and_cheese 1 points 2 days ago Who woulda thunk? permalink award report block reply\nFormerlurker92 1 points 2 days ago Sanity is slowly and by degrees being returned permalink award report block reply\nTenchuStealthAss 1 points 2 days ago lol permalink award report block reply\nTheSonOfGadsden 1 points 2 days ago “You don’t say.” -Nicholas Cage permalink award report block reply\nroadrunner0 1 points 2 days ago Well no shit Sherlock, after over 100 years of rules keeping them out for obvious reasons they started allowing and it was massively destructive so now they are out again.. permalink award report block reply\nKolob64 1 points 2 days ago Wow, we never had any idea before. permalink award report block reply\nGhostOfMyFormerSelf 1 points 2 days ago 2020 to now: America at her dumbest. permalink award report block reply\nAmway 1 points 2 days ago I love rightfully placed sarcasm. permalink award report block reply\n2020Gop 1 points 2 days ago Obviously need MOAR FUNDING!  - Commies permalink award report block reply\nCrappydatum 1 points 2 days ago Was that scientific evidence hiding in the top drawer? permalink award report block reply\nJoeBidensDementia1 1 points 2 days ago They're called balls. permalink award report block reply\nGrindelwald 1 points 2 days ago But they will be sending scientists to every woman’s bathroom at the Olympics to study the matter further. Seeking scientific researchers for the job. permalink award report block reply\nJust_trust_me_bro 1 points 2 days ago Sounds like something mr mike would have put in his phd thesis. permalink award report block reply\nraptormissle 1 points 2 days ago You're Blinding me with Science. permalink award report block reply\nLiquidSun 1 points 2 days ago I'm so sick of these tards who won't take a fucking breath until The Science tells them it's a healthy thing to do. permalink award report block reply\n5DchessWatch 1 points 2 days ago oh my doy permalink award report block reply\nraptormissle 1 points 2 days ago And the Gold medal for the most obvious conclusion in the history of mankind goes to the Olympics. permalink award report block reply\nncswicn 1 points 2 days ago 🤣🤣🤣 permalink award report block reply\nDwellerMike 1 points 2 days ago Fucking hell mate. There's benefits? Like no shit sherlock. permalink award report block reply\nSaltySilverback13 1 points 2 days ago In other news, water is wet... permalink award report block reply\npopcycle 1 points 2 days ago the tranny thing is over, except for the cleanup of what, three contaminated generations of youths? permalink award report block reply\nOmegaBird 1 points 2 days ago Noooooo. You don't say? Males and females are biologically and physically different?! permalink award report block reply\nBob_sacamanao 1 points 2 days ago Democrats need a fucking BIOLOGY degree to know what a woman is 🤡 permalink award report block reply\nKilroy 1 points 2 days ago Lol, their must have been an honest biologist on their payroll that they couldn't shut up. permalink award report block reply\n2021is1776-2 1 points 2 days ago Today scientists finally discovered the sun causes temperatures to rise and in other news scientists confirm moisture and water are closely related. permalink award report block reply\nFusionBlack 1 points 2 days ago Earth shattering revolation. These people are genuinely retarded. permalink award report block reply\ntiamat 1 points 2 days ago Like rediscovering the wheel permalink award report block reply\nSpiderTaxi 1 points 2 days ago Omg, really now???   Kick a transgender in the balls and have 'The Science' tell me it may hurt. permalink award report block reply\nRoughBoy 1 points 2 days ago Week, better late than never I guess. permalink award report block reply\nParticleCannon 1 points 2 days ago Someone made money determining that permalink award report block reply\nbillybaldwin2 1 points 2 days ago America could have won every female Olympics for half a century. You bigots ruined it. permalink award report block reply\ncharlesthehammer 1 points 2 days ago Also, water is wet permalink award report block reply\nmohel 0 points 2 days ago now they only need to discover the difference between sex and gender permalink award report block reply\nRINO_fatigue 0 points 2 days ago Hopefully California lawmakers can do something to reverse this, the Olympics deserves to be exposed as being the globohomo clown show that it is and the feminist bitch athletes all deserve severe beatings permalink award report block reply PensivePatriot 2 points 2 days ago Why, exactly would you want a reversal? Why, exactly do you want men to compete in women’s sports? permalink parent award report block reply BaguettesOfRudysSUB 0 points 2 days ago It's another bot, dipshit. Spend three minutes looking through its history. permalink parent award report block reply RINO_fatigue -1 points 2 days ago Why do you simp for feminist bitch dyke athletes who hate you and want to see you impoverished, humiliated, etc.?  I'd rather see the feminists fight the trannys to the death, people who step in and side with the feminists are badly misguised permalink parent award report block reply PensivePatriot 1 points 2 days ago Fuck off, leftist incognito. permalink parent award report block reply RINO_fatigue 1 points 2 days ago t. male feminist permalink parent award report block reply\nPensivePatriot 2 points 2 days ago Why, exactly would you want a reversal? Why, exactly do you want men to compete in women’s sports? permalink parent award report block reply BaguettesOfRudysSUB 0 points 2 days ago It's another bot, dipshit. Spend three minutes looking through its history. permalink parent award report block reply RINO_fatigue -1 points 2 days ago Why do you simp for feminist bitch dyke athletes who hate you and want to see you impoverished, humiliated, etc.?  I'd rather see the feminists fight the trannys to the death, people who step in and side with the feminists are badly misguised permalink parent award report block reply PensivePatriot 1 points 2 days ago Fuck off, leftist incognito. permalink parent award report block reply RINO_fatigue 1 points 2 days ago t. male feminist permalink parent award report block reply\nBaguettesOfRudysSUB 0 points 2 days ago It's another bot, dipshit. Spend three minutes looking through its history. permalink parent award report block reply\nRINO_fatigue -1 points 2 days ago Why do you simp for feminist bitch dyke athletes who hate you and want to see you impoverished, humiliated, etc.?  I'd rather see the feminists fight the trannys to the death, people who step in and side with the feminists are badly misguised permalink parent award report block reply PensivePatriot 1 points 2 days ago Fuck off, leftist incognito. permalink parent award report block reply RINO_fatigue 1 points 2 days ago t. male feminist permalink parent award report block reply\nPensivePatriot 1 points 2 days ago Fuck off, leftist incognito. permalink parent award report block reply RINO_fatigue 1 points 2 days ago t. male feminist permalink parent award report block reply\nRINO_fatigue 1 points 2 days ago t. male feminist permalink parent award report block reply\nWashington_Redskins 0 points 2 days ago This is terrible news. It means my future career as a 40-year-old WNBA player is gone. They stole my dream. How dare they! permalink award report block reply Jimmyprawns 1 points 2 days ago Man that and the name of your team.  The bastards won't let you have anything will they? permalink parent award report block reply\nJimmyprawns 1 points 2 days ago Man that and the name of your team.  The bastards won't let you have anything will they? permalink parent award report block reply\nmorbidly 1 points 2 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T21:24:13.419647Z"
}