{
  "id": "1ARK9nPM50",
  "url": "https://patriots.win/p/1ARK9nPM50/if-you-voted-for-trump-you-need-/c",
  "content": "124 If you voted for Trump, you need to criticize him when he fucks up and support him when he does well. Otherwise he will drive the nation off a cliff for his special interest buddies and hand over the midterms and the next presidency to democrats. We DID NOT vote for this. posted 3 hours ago by Crucible 26 comments award share download report block\n26 comments Sort by Top Top New Worst Old Save Around the Web A Simple Trick to Grow Hair Goes Viral in Utah HaloGrow TrumpWonByALandslide 27 points 3 hours ago That was the worst possible answer I've ever heard in an interview. permalink award report block reply tt777 12 points 2 hours ago Him making it seem like the Epstein thing was no big deal was pretty terrible too. permalink parent award report block reply Elencher 8 points 2 hours ago This is so much worse than the Epstein thing. At least there there was some plausible reason, that the FBI fucked the whole thing up so bad there wasn't anything left to go on and everything they had was suspect., Poorly communicated, but there was a reason. This is demoralizing beyond repair, there's no justification for this shit. This is giving up on any possible political solution and starting to prepare for the worst. permalink parent award report block reply Appeal2Heaven98 5 points 2 hours ago Yeah. That answer doesn't sound like the type of thing any \"America First\" president would say. permalink parent award report block reply Elencher 4 points 2 hours ago Even IF the underlying assumption was true, that there were not enough talented Americans to do the job, the solution isn't import jeets. The solution is train Americans. Physically not enough Americans, encourage birth rates. There is no set of circumstances where the answer is to add more street shitters. permalink parent award report block reply bejeavis 4 points 2 hours ago The irony is when the Epstein reversal took place the copium du jour around here was \"guys were still going to get deportations and end H1B\" Lmao even permalink parent award report block reply Elencher 5 points 2 hours ago I was that guy. I was more than willing to let that slide to get demographics under control. Not only are things getting worse faster than they were under Biden, it's even harder to get rid of them since it's all \"legal.\" permalink parent award report block reply FKH2 2 points 2 hours ago By anyone to include all the retarded shit Biden and Kameltoe said this takes the cake permalink parent award report block reply TrumpWonByALandslide 1 points 23 minutes ago Completely agree permalink parent award report block reply HeavenlyTrumpets 15 points 3 hours ago fucking trainwreck what the fuck is happening right now permalink award report block reply FKH2 4 points 2 hours ago We are being subjected to humiliation rituals for the crime of wanting a sovereign country permalink parent award report block reply aqua27 12 points 3 hours ago Don't forget the terrorist who killed our military invited into White House. permalink award report block reply DrCowboyPresident 3 points 2 hours ago I'm willing to bet money the reason is simply because the current Govt of Syria is anti-Russia and Assad was pro-Russia. permalink parent award report block reply 42rle 5 points 2 hours ago He is dead wrong on H1B and mortgage permalink award report block reply henri_derelicte 4 points 3 hours ago We’ve consistently thought the H1b system is broken. Large corporations want to keep it in order to keep wages down and to placate Indians with the ability to hire people. permalink award report block reply Whoopies_tds 3 points 3 hours ago He needs to be more specific about the \"talent\" he is referring to. Yes we have lots but as always, leading edge technology requires the most brilliant people from around the world and hate to break it to you, we don't have a monopoly on the smartest people. permalink award report block reply TerryBibble 9 points 2 hours ago Yeah and talented people dont go under H1B. Research visa types permalink parent award report block reply Whoopies_tds 1 points 2 hours ago Yea they do. \"Talented\" is a very broad spectrum of people. We want and need the top 1-5% and they are mostly NOT from India permalink parent award report block reply bejeavis 2 points 2 hours ago Well we all know that's not who we're talking about here. And to pretend that's what is meant is being disingenuous. permalink parent award report block reply keeptherepublic1776 2 points 2 hours ago He's a scum bag grifter permalink award report block reply Elencher 4 points 2 hours ago It's worse than that. He's too rich to waste time grifting, he's too clean to be compromised or they'd have dropped what they knew in 2016. Something insidious is going on. permalink parent award report block reply Appeal2Heaven98 2 points 2 hours ago I think he's honestly just given up. He can't do 80% of the stuff he wants to do without it being reversed unless he wants to go full dictator mode. permalink parent award report block reply mojorisen 2 points 2 hours ago Critical feedback is one thing.  I have a problem with having to read post on a PRO Trump forum that read like either Mamdani's press director or a Chicom bot wrote them. permalink award report block reply happyfave 2 points 2 hours ago This site is depressing lately, it's been taken over by shills. permalink parent award report block reply Metalheads4Trump 1 points 2 hours ago They keep trying to split MAGA and Trump’s fans with utter BS. Who cares what “influencers” do (lol, what they do is in their title.) People are too dumb to realize Trump does stuff like this in interviews to get doubters to start taking about these subjects and dig deeper. They fall for it, every single time. If they had something to pin on him legit they would’ve done in in 2016 and not 2025/2026. It’s all BS. permalink parent award report block reply happyfave 1 points 2 hours ago REEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE permalink award report block reply Elric44357 1 points 1 hour ago Liberals let Biden run amuck and did not say shit. Now they act like they are conservatives and sow dissention. Trump isn't perfect, he has his flaws, but he is not a moronic liberal asshole trashing the country. permalink award report block reply\nTrumpWonByALandslide 27 points 3 hours ago That was the worst possible answer I've ever heard in an interview. permalink award report block reply tt777 12 points 2 hours ago Him making it seem like the Epstein thing was no big deal was pretty terrible too. permalink parent award report block reply Elencher 8 points 2 hours ago This is so much worse than the Epstein thing. At least there there was some plausible reason, that the FBI fucked the whole thing up so bad there wasn't anything left to go on and everything they had was suspect., Poorly communicated, but there was a reason. This is demoralizing beyond repair, there's no justification for this shit. This is giving up on any possible political solution and starting to prepare for the worst. permalink parent award report block reply Appeal2Heaven98 5 points 2 hours ago Yeah. That answer doesn't sound like the type of thing any \"America First\" president would say. permalink parent award report block reply Elencher 4 points 2 hours ago Even IF the underlying assumption was true, that there were not enough talented Americans to do the job, the solution isn't import jeets. The solution is train Americans. Physically not enough Americans, encourage birth rates. There is no set of circumstances where the answer is to add more street shitters. permalink parent award report block reply bejeavis 4 points 2 hours ago The irony is when the Epstein reversal took place the copium du jour around here was \"guys were still going to get deportations and end H1B\" Lmao even permalink parent award report block reply Elencher 5 points 2 hours ago I was that guy. I was more than willing to let that slide to get demographics under control. Not only are things getting worse faster than they were under Biden, it's even harder to get rid of them since it's all \"legal.\" permalink parent award report block reply FKH2 2 points 2 hours ago By anyone to include all the retarded shit Biden and Kameltoe said this takes the cake permalink parent award report block reply TrumpWonByALandslide 1 points 23 minutes ago Completely agree permalink parent award report block reply\ntt777 12 points 2 hours ago Him making it seem like the Epstein thing was no big deal was pretty terrible too. permalink parent award report block reply Elencher 8 points 2 hours ago This is so much worse than the Epstein thing. At least there there was some plausible reason, that the FBI fucked the whole thing up so bad there wasn't anything left to go on and everything they had was suspect., Poorly communicated, but there was a reason. This is demoralizing beyond repair, there's no justification for this shit. This is giving up on any possible political solution and starting to prepare for the worst. permalink parent award report block reply Appeal2Heaven98 5 points 2 hours ago Yeah. That answer doesn't sound like the type of thing any \"America First\" president would say. permalink parent award report block reply Elencher 4 points 2 hours ago Even IF the underlying assumption was true, that there were not enough talented Americans to do the job, the solution isn't import jeets. The solution is train Americans. Physically not enough Americans, encourage birth rates. There is no set of circumstances where the answer is to add more street shitters. permalink parent award report block reply bejeavis 4 points 2 hours ago The irony is when the Epstein reversal took place the copium du jour around here was \"guys were still going to get deportations and end H1B\" Lmao even permalink parent award report block reply Elencher 5 points 2 hours ago I was that guy. I was more than willing to let that slide to get demographics under control. Not only are things getting worse faster than they were under Biden, it's even harder to get rid of them since it's all \"legal.\" permalink parent award report block reply\nElencher 8 points 2 hours ago This is so much worse than the Epstein thing. At least there there was some plausible reason, that the FBI fucked the whole thing up so bad there wasn't anything left to go on and everything they had was suspect., Poorly communicated, but there was a reason. This is demoralizing beyond repair, there's no justification for this shit. This is giving up on any possible political solution and starting to prepare for the worst. permalink parent award report block reply Appeal2Heaven98 5 points 2 hours ago Yeah. That answer doesn't sound like the type of thing any \"America First\" president would say. permalink parent award report block reply Elencher 4 points 2 hours ago Even IF the underlying assumption was true, that there were not enough talented Americans to do the job, the solution isn't import jeets. The solution is train Americans. Physically not enough Americans, encourage birth rates. There is no set of circumstances where the answer is to add more street shitters. permalink parent award report block reply bejeavis 4 points 2 hours ago The irony is when the Epstein reversal took place the copium du jour around here was \"guys were still going to get deportations and end H1B\" Lmao even permalink parent award report block reply Elencher 5 points 2 hours ago I was that guy. I was more than willing to let that slide to get demographics under control. Not only are things getting worse faster than they were under Biden, it's even harder to get rid of them since it's all \"legal.\" permalink parent award report block reply\nAppeal2Heaven98 5 points 2 hours ago Yeah. That answer doesn't sound like the type of thing any \"America First\" president would say. permalink parent award report block reply Elencher 4 points 2 hours ago Even IF the underlying assumption was true, that there were not enough talented Americans to do the job, the solution isn't import jeets. The solution is train Americans. Physically not enough Americans, encourage birth rates. There is no set of circumstances where the answer is to add more street shitters. permalink parent award report block reply\nElencher 4 points 2 hours ago Even IF the underlying assumption was true, that there were not enough talented Americans to do the job, the solution isn't import jeets. The solution is train Americans. Physically not enough Americans, encourage birth rates. There is no set of circumstances where the answer is to add more street shitters. permalink parent award report block reply\nbejeavis 4 points 2 hours ago The irony is when the Epstein reversal took place the copium du jour around here was \"guys were still going to get deportations and end H1B\" Lmao even permalink parent award report block reply Elencher 5 points 2 hours ago I was that guy. I was more than willing to let that slide to get demographics under control. Not only are things getting worse faster than they were under Biden, it's even harder to get rid of them since it's all \"legal.\" permalink parent award report block reply\nElencher 5 points 2 hours ago I was that guy. I was more than willing to let that slide to get demographics under control. Not only are things getting worse faster than they were under Biden, it's even harder to get rid of them since it's all \"legal.\" permalink parent award report block reply\nFKH2 2 points 2 hours ago By anyone to include all the retarded shit Biden and Kameltoe said this takes the cake permalink parent award report block reply TrumpWonByALandslide 1 points 23 minutes ago Completely agree permalink parent award report block reply\nTrumpWonByALandslide 1 points 23 minutes ago Completely agree permalink parent award report block reply\nHeavenlyTrumpets 15 points 3 hours ago fucking trainwreck what the fuck is happening right now permalink award report block reply FKH2 4 points 2 hours ago We are being subjected to humiliation rituals for the crime of wanting a sovereign country permalink parent award report block reply\nFKH2 4 points 2 hours ago We are being subjected to humiliation rituals for the crime of wanting a sovereign country permalink parent award report block reply\naqua27 12 points 3 hours ago Don't forget the terrorist who killed our military invited into White House. permalink award report block reply DrCowboyPresident 3 points 2 hours ago I'm willing to bet money the reason is simply because the current Govt of Syria is anti-Russia and Assad was pro-Russia. permalink parent award report block reply\nDrCowboyPresident 3 points 2 hours ago I'm willing to bet money the reason is simply because the current Govt of Syria is anti-Russia and Assad was pro-Russia. permalink parent award report block reply\n42rle 5 points 2 hours ago He is dead wrong on H1B and mortgage permalink award report block reply\nhenri_derelicte 4 points 3 hours ago We’ve consistently thought the H1b system is broken. Large corporations want to keep it in order to keep wages down and to placate Indians with the ability to hire people. permalink award report block reply\nWhoopies_tds 3 points 3 hours ago He needs to be more specific about the \"talent\" he is referring to. Yes we have lots but as always, leading edge technology requires the most brilliant people from around the world and hate to break it to you, we don't have a monopoly on the smartest people. permalink award report block reply TerryBibble 9 points 2 hours ago Yeah and talented people dont go under H1B. Research visa types permalink parent award report block reply Whoopies_tds 1 points 2 hours ago Yea they do. \"Talented\" is a very broad spectrum of people. We want and need the top 1-5% and they are mostly NOT from India permalink parent award report block reply bejeavis 2 points 2 hours ago Well we all know that's not who we're talking about here. And to pretend that's what is meant is being disingenuous. permalink parent award report block reply\nTerryBibble 9 points 2 hours ago Yeah and talented people dont go under H1B. Research visa types permalink parent award report block reply Whoopies_tds 1 points 2 hours ago Yea they do. \"Talented\" is a very broad spectrum of people. We want and need the top 1-5% and they are mostly NOT from India permalink parent award report block reply bejeavis 2 points 2 hours ago Well we all know that's not who we're talking about here. And to pretend that's what is meant is being disingenuous. permalink parent award report block reply\nWhoopies_tds 1 points 2 hours ago Yea they do. \"Talented\" is a very broad spectrum of people. We want and need the top 1-5% and they are mostly NOT from India permalink parent award report block reply bejeavis 2 points 2 hours ago Well we all know that's not who we're talking about here. And to pretend that's what is meant is being disingenuous. permalink parent award report block reply\nbejeavis 2 points 2 hours ago Well we all know that's not who we're talking about here. And to pretend that's what is meant is being disingenuous. permalink parent award report block reply\nkeeptherepublic1776 2 points 2 hours ago He's a scum bag grifter permalink award report block reply Elencher 4 points 2 hours ago It's worse than that. He's too rich to waste time grifting, he's too clean to be compromised or they'd have dropped what they knew in 2016. Something insidious is going on. permalink parent award report block reply Appeal2Heaven98 2 points 2 hours ago I think he's honestly just given up. He can't do 80% of the stuff he wants to do without it being reversed unless he wants to go full dictator mode. permalink parent award report block reply\nElencher 4 points 2 hours ago It's worse than that. He's too rich to waste time grifting, he's too clean to be compromised or they'd have dropped what they knew in 2016. Something insidious is going on. permalink parent award report block reply\nAppeal2Heaven98 2 points 2 hours ago I think he's honestly just given up. He can't do 80% of the stuff he wants to do without it being reversed unless he wants to go full dictator mode. permalink parent award report block reply\nmojorisen 2 points 2 hours ago Critical feedback is one thing.  I have a problem with having to read post on a PRO Trump forum that read like either Mamdani's press director or a Chicom bot wrote them. permalink award report block reply happyfave 2 points 2 hours ago This site is depressing lately, it's been taken over by shills. permalink parent award report block reply Metalheads4Trump 1 points 2 hours ago They keep trying to split MAGA and Trump’s fans with utter BS. Who cares what “influencers” do (lol, what they do is in their title.) People are too dumb to realize Trump does stuff like this in interviews to get doubters to start taking about these subjects and dig deeper. They fall for it, every single time. If they had something to pin on him legit they would’ve done in in 2016 and not 2025/2026. It’s all BS. permalink parent award report block reply\nhappyfave 2 points 2 hours ago This site is depressing lately, it's been taken over by shills. permalink parent award report block reply Metalheads4Trump 1 points 2 hours ago They keep trying to split MAGA and Trump’s fans with utter BS. Who cares what “influencers” do (lol, what they do is in their title.) People are too dumb to realize Trump does stuff like this in interviews to get doubters to start taking about these subjects and dig deeper. They fall for it, every single time. If they had something to pin on him legit they would’ve done in in 2016 and not 2025/2026. It’s all BS. permalink parent award report block reply\nMetalheads4Trump 1 points 2 hours ago They keep trying to split MAGA and Trump’s fans with utter BS. Who cares what “influencers” do (lol, what they do is in their title.) People are too dumb to realize Trump does stuff like this in interviews to get doubters to start taking about these subjects and dig deeper. They fall for it, every single time. If they had something to pin on him legit they would’ve done in in 2016 and not 2025/2026. It’s all BS. permalink parent award report block reply\nhappyfave 1 points 2 hours ago REEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE permalink award report block reply\nElric44357 1 points 1 hour ago Liberals let Biden run amuck and did not say shit. Now they act like they are conservatives and sow dissention. Trump isn't perfect, he has his flaws, but he is not a moronic liberal asshole trashing the country. permalink award report block reply",
  "fetched_at": "2025-11-12T21:06:07.462353Z"
}