{
  "id": "1ARK53JXsa",
  "url": "https://patriots.win/p/1ARK53JXsa/a-gay-man-and-drunk-walk-into-a-/c",
  "content": "1075 A gay man and drunk walk into a bar... posted 6 days ago by I-am-Orlando PRO 149 comments award share download report block\n149 comments Sort by Top Top New Worst Old Save RomanCatholicPatriot 69 points 6 days ago HOMOSEXUALITY IS A S I N permalink award report block reply saltyviewer123 50 points 6 days ago Also INSIDER TRADING permalink parent award report block reply Build_Back_Bankrupt 39 points 6 days ago And tearing up SotU speeches, destruction of federal property is a federal crime. permalink parent award report block reply The_Return_of_User_x 9 points 6 days ago A gay man and a drunk? I didnt know Obama drank! permalink parent award report block reply Mythologick 8 points 6 days ago How else do you get loose enough to take big mikes cock? permalink parent award report block reply view 1 more comments... deleted 15 points 6 days ago keeman 20 points 6 days ago You mean aside from elections and stock futures? permalink parent award report block reply Covfefe_Commando 3 points 6 days ago she swung a really big hammer, and so did her husband, apparently... permalink parent award report block reply view 1 more comments... Bullet3250 1 points 5 days ago She made huge improvements in her district... People can now defecate on the sidewalks, people can now set up tents on city streets and live there, they have open drug markets in the streets, she gives away needles and crack pipes for free. housing prices went up, taxes went up, crime went up, poverty went up, only public education levels went down.  And shoplifting is now a 25$ fine when you  steal under 960$....  And people now leave their car windows DOWN when parked in the street to avoid the smash and grab crowds. Not to mention her 800%+ life time stock market gains -  perhaps the highest returns ever recorded! What a great Congresswoman! permalink parent award report block reply Melchizedek18 7 points 6 days ago We wish. Insider trading is legal for congressional members. permalink parent award report block reply keeman 4 points 6 days ago No, insider trading in a human created crime.  Don't see anything about this in Leviticus. permalink parent award report block reply deleted 8 points 6 days ago Shih_Tabed 1 points 6 days ago Well, looks like she is going to get away with all of it, so divine justice has its limits it seems. permalink parent award report block reply view 2 more comments... DoMagnum 10 points 6 days ago So is hugging Piglosi. permalink parent award report block reply DT170x 7 points 6 days ago That also counts as beastility, which also is illegal. permalink parent award report block reply Bidensmellslikepiss 7 points 6 days ago and fucking GAY permalink parent award report block reply RichardCranium88 2 points 6 days ago Stop, Hammer Time permalink parent award report block reply Standingoak 2 points 6 days ago Not if you are Catholic or Jewish or Satanist...but I repeat myself permalink parent award report block reply VoldemarBGuerta 1 points 5 days ago The act of homosexuality is a mortal sin in Catholicism. permalink parent award report block reply Standingoak 1 points 5 days ago Tell it to all the priests.  I wonder why the Catholic Church didn't want families of Priests ,as in the Orthodox Catholic Church , to receive any wealth upon death of the priest ? I wonder if that is why they \"tolerate\" homosexuality ?  Unlike the Orthodox Catholic Church ? permalink parent award report block reply load 14 more comments... Genericwhitemale 38 points 6 days ago Anyone who has a 100M+ net worth working in government is a corrupt pos. permalink award report block reply EDDIT_IS_CUCKED -16 points 6 days ago Trump? Spez: you all are fucking retards. I'm using Trump as an example that not everyone in politics with that wealth is corrupt. All of you that down voted essentially called Trump corrupt.  Reading comprehension never seemed to catch on at this place. It's the equivalent of someone saying incorrectly \"There are no states bigger than TX.\" And someone replies with \"Alaska?\" permalink parent award report block reply halcyondream 29 points 6 days ago That wasn't his point. Trump was already a billionaire, he means career politicians that are nothing outside of it walking away with with 9 figures+. Don't be an asshat. permalink parent award report block reply EDDIT_IS_CUCKED -9 points 6 days ago Ok. She married someone worth $100M+ before she got into politics. So the same shit applies to her, independently wealthy prior to public sevice. To say she earned her entire fortune from insider trading is just simply wrong. Maybe you stop being an asshat, faggot. permalink parent award report block reply Genericwhitemale 10 points 6 days ago The point is she’s corrupt. They make a ton of money through the market and insider information. If you serve the public you shouldn’t be allowed to do that. Don’t tell me you can truly serve people when you’re busy lining your own pockets. permalink parent award report block reply view 5 more comments... makersmarx 7 points 6 days ago No! permalink parent award report block reply Meddlesom 1 points 6 days ago You're a fucking moron. permalink parent award report block reply EDDIT_IS_CUCKED 1 points 5 days ago Congrats on having zero reading comprehension faggot. permalink parent award report block reply Meddlesom 0 points 4 days ago Back peddle faster, chicken-bricker. permalink parent award report block reply view 3 more comments... dr_gonzo 24 points 6 days ago For almost four decades Nancy Pelosi has served herself and worked to make herself richer. No one was more skilled at insider trading and screwing over the American people. Americans will be forever furious for her part in passing Obummercare. She made us ashamed to be Americans, and will go down in history as the biggest disgrace to ever walk the halls of congress. Fuck you for everything you've done. The American people and I will be hoping you die a slow, painful death. There, fixed that for ya. permalink award report block reply Shitsbrokeyo 1 points 5 days ago Well it was 0bama, anything coming out of his mouth is a lie, to continue his efforts in tearing down Anerica. permalink parent award report block reply Rope_Tree_Journalist 19 points 6 days ago Press 'S' to spit permalink award report block reply South_Florida_Guy 5 points 6 days ago Press N to.... permalink parent award report block reply PelosisPuss 4 points 6 days ago S permalink parent award report block reply YaharaRiver 2 points 6 days ago S permalink parent award report block reply Icepck 18 points 6 days ago Politics was the only chapter of her life. That shouldn't be the majority of any persons life. permalink award report block reply suckmycorona 7 points 6 days ago Well government cracked down on the mob so she really only had one avenue to go towards. permalink parent award report block reply SaltArmyCaptain 16 points 6 days ago Got my hopes up, it sounded like she died till the end there.... permalink award report block reply AliceCooperBiden 3 points 6 days ago Same. I was wondering how I missed such fantastic news. permalink parent award report block reply SomecatsareMAGA 9 points 6 days ago Controlled by demonic forces. Look at his face. Came from nowhere and going nowhere. Pelosi 🤮🤑 permalink award report block reply AwShitHereWeGoAgain 7 points 6 days ago Shut up, you bottom bitch faggot. permalink award report block reply PoohBearBalloon 7 points 6 days ago Shut up faggot! permalink award report block reply ScamBlondie 7 points 6 days ago Any politician who refers to their work as “service” is automatically a douche. permalink award report block reply MemoryHoleyeO 7 points 6 days ago 4 decades is nothing to be proud about. That's disgusting permalink award report block reply SnowSnake 7 points 6 days ago Nancy, and Paul aaannd Paul's homo-side-squeeze David. I wish him the best, too. 🔨 🛠 permalink award report block reply GodIsPerfect 7 points 6 days ago Time to lock her up for insider trading. permalink award report block reply spinometer2 6 points 6 days ago I have nothing nice to say permalink award report block reply JayKay1776 5 points 6 days ago Personally I hope she gets to meet Dick Cheney here pretty soon. permalink award report block reply MonolitoVeritas 4 points 6 days ago if there still is an old decrepit squirrel still running on an old, rusted, wheel in her demented, insane brain, I hope she has enough left upstairs to feel the flames of hell that await her. permalink award report block reply DanIsSwell 4 points 6 days ago A gay man and a drunk walk into a bar. She whispers “when I get drunk, I like a big black cock” He says “Me too, but I told you Michael isn’t here right now” permalink award report block reply KernalMustard 4 points 6 days ago I wanna bet Paul cucks his wife then he has sex with the dude. I think that was what was going on. permalink parent award report block reply GuerillaYourDreams 4 points 6 days ago If I never see or hear from this purple-lipped demon ever again, it will still be too soon! permalink award report block reply I-am-Orlando OP PRO 4 points 6 days ago Link to treasonist POS https://x.com/BarackObama/status/1986475370363687393 permalink award report block reply MythArcana 2 points 6 days ago 👋🏻🐸 permalink parent award report block reply I-am-Orlando OP PRO 1 points 6 days ago It's my fren! 👍🏼 Hola hello, pede. permalink parent award report block reply Unboosted 3 points 6 days ago Bad take from obama permalink award report block reply 1_Badcop 3 points 6 days ago A gay muslim and a drunk walk into a bar... ...and America got fucked! Finished the joke for you! Only, it's not a joke. And it wasn't funny. permalink award report block reply Retard_Strength 3 points 6 days ago STOP HAMMERTIME permalink award report block reply Oodles 3 points 6 days ago Drunk corrupt cunt and her gay black friend permalink award report block reply tuaris 3 points 6 days ago If Nancy Pelosi was \"one of the best\", then what does one of their worst look like? permalink award report block reply DoMagnum 3 points 6 days ago When Barry and Big Mike fight, they reportedly exchange blows. permalink award report block reply 2025WhatIsTrue 3 points 6 days ago This criminal reprobate would look best spending the rest of her worthless, criminal life behind SuperMax bars.  What a subhuman loser. permalink award report block reply Rain_man 3 points 6 days ago If she retires, when will Paul have his late night hammer parties? permalink award report block reply 16BeatsAOne 3 points 6 days ago Mike and I wish you and Paul and his hammer-wielding boyfriend the best in this next chapter. Fixed it. permalink award report block reply Dev404 3 points 6 days ago Both deserve to burn in hell for all eternity for the crimes they've committed for decades. permalink award report block reply JackOfAllTirades 3 points 6 days ago Go fuck yourself faggot. permalink award report block reply slimcoat 3 points 6 days ago You have to pass it to find out what's in it. I'll never forget her saying that. permalink award report block reply canapede24 3 points 6 days ago Gay muslim* permalink award report block reply Light_HIV_Effect 3 points 6 days ago She's not served anyone but herself and her bank account. She's a hyper partisan embarrassment and drunk that abused the US Air Force to shuttle her family around with a fully stocked liquor bar and was responsible for allowing members of congress to get booze delivered directly to their offices. She also has tardive dyskinesia from all the years of psychoactive antidepressants and antipsychotics she's guzzled down over the years. permalink award report block reply mass55th 3 points 6 days ago Nancy and her husband Paul can now get hammered together. permalink award report block reply Elric44357 3 points 6 days ago What a crock of shit, but what else would you expect from Obama. permalink award report block reply Wupta PRO 3 points 6 days ago Name one good thing either have done one. permalink award report block reply Sugz_Da_Feefth 2 points 6 days ago Hahaha!! permalink award report block reply barwhack 2 points 6 days ago Allahu Akbar. permalink award report block reply YaharaRiver 2 points 6 days ago B A R F ! ! 🤮 permalink award report block reply Agent_Orange 2 points 6 days ago He and Michelle are barely on speaking terms anymore. She trashes him every chance she gets. The rest of the post is also a lie. permalink award report block reply Rock9Head 2 points 6 days ago Obamacare is a disaster. She got out at the last moment. permalink award report block reply BrionK 2 points 6 days ago Fuck all the systems that created these commies.\nIf you aren't shutting down the system you are the evil. permalink award report block reply HankScorpio 2 points 6 days ago Shanghai Nancy. permalink award report block reply FreedomFlowerDelta 2 points 6 days ago When is she going to be gone for real? permalink award report block reply knnbccb 2 points 6 days ago Mamdani also hates your kind too. permalink award report block reply Texar1991 2 points 6 days ago The next chapter for her will be Hell. permalink award report block reply Magaman4200 2 points 6 days ago 🤮 permalink award report block reply IronPatriot1 2 points 6 days ago Is she dead?! 😃 permalink award report block reply Oldman6541E5 3 points 6 days ago She will be retiring. Maybe she will be my neighbor in the retirement home. Probably not though. Will you be my neighbor? permalink parent award report block reply Build_Back_Bankrupt 3 points 6 days ago She'll have to be, the No Kings protests took out King Friday. permalink parent award report block reply Oldman6541E5 3 points 6 days ago HA HA HA! permalink parent award report block reply Mortal_Wombat 1 points 6 days ago That's the next chapter 🤣 permalink parent award report block reply Bidensmellslikepiss 2 points 6 days ago Well he's right about one thing. She brought alot of FBI faggots together on J6. permalink award report block reply Nomad899 2 points 6 days ago Grifter praising grift….she enriched herself and fucked this country raw permalink award report block reply Hopfrog1985 2 points 6 days ago Paul and Nancy will probably get HAMMERED a lot together now that she’s off work permalink award report block reply Hopfrog1985 2 points 6 days ago Get it permalink parent award report block reply CheeseAndOnion 2 points 6 days ago Hammer dildo bros permalink award report block reply MrTexan 2 points 6 days ago Her and her husband can now both enjoy getting hammered in retirement. permalink award report block reply ProbablyASockAccount 2 points 6 days ago One thing. Point to one fucking thing that cunt did in all of her decades in \"public service\". permalink award report block reply Aggrieved03 2 points 6 days ago O accountability for either of these criminals. permalink award report block reply MaxJohnson 1 points 5 days ago hopefully it’s an epilogue not a new chapter. permalink award report block reply Live_free_or_die_55 1 points 6 days ago Two traitors walking in to the bar …. permalink award report block reply h203h 1 points 5 days ago This fucking bitch gets off and no arrest for her huh, she is going straight to hell for undermining the American people and the crimes against humanity that she has done. FUCK HER I HOPE SHE ROTS IN HELL AND GETS HER GRAVE PISSED ON OVER AND OVER AGAIN permalink award report block reply MythArcana 1 points 6 days ago Don't let the doorknob hit you in the bonus hole!  🚪 💃 permalink award report block reply Ritchie_Blackadder 1 points 6 days ago At this point she's gone down ON history. Nancy too. permalink award report block reply OG_BACONndEGGs 1 points 6 days ago Michelle? permalink award report block reply Trump4Infinity 1 points 6 days ago Hey look at this politician who's held different seats of power for 40 years. She's good and sheit no reason to investigate for corruption and treason. If she's not made an example of no one else will be either. Either it starts with one or better be no one. permalink award report block reply jml1997 1 points 6 days ago I was going to say, normally you walk into the bar to get drunk and then saw it was old pickled liver herself. Bitch is constantly hammered. permalink award report block reply FatBeagleMars 1 points 6 days ago A gay man and a drunk walk into a bar. The next morning they both wonder why their a$$hole hurts. permalink award report block reply Skogin 1 points 6 days ago She falls down, but he grabs on and starts sucking. permalink award report block reply billybaldwin2 1 points 6 days ago Didn't she choose not to campaign in 2022 and 2024 too? permalink award report block reply GdotLee 1 points 6 days ago Next chapter?  LAST chapter. permalink award report block reply SavingPrivateGrace 1 points 6 days ago Crazy Nancy.  Obama accepted her resignation. permalink award report block reply iamstadter 1 points 5 days ago ....of grifting. permalink award report block reply paramour 1 points 5 days ago Gross. permalink award report block reply SisterCovfefeToo 1 points 5 days ago Hahaha We have to pass it to see what's in it. She drove the divisiveness of Congress to the point where no legislation could be passed. To think she represented the People of the United States as the bestest speaker of all time is delusional. permalink award report block reply Memeoverlord 1 points 5 days ago He spelled michael wrong again permalink award report block reply Wrez77 1 points 6 days ago Just burn in Hell already permalink award report block reply ConductProbation 1 points 5 days ago May you have many hammers in your future! permalink award report block reply MudDog 1 points 6 days ago wow he snubbed hammer man, what a dick! permalink award report block reply TrumpRideorDie74 1 points 6 days ago I'm not upvoting this bullshit permalink award report block reply MeMargie 1 points 6 days ago Pray I get to see Justice for their Treason prior to me leaving this earth :) A couple of Self Serving Traitors Burn in Hell with your Maker ! permalink award report block reply BasedMillennial -1 points 6 days ago \"wE hassshve to passssh the billllsh to know whatssshh init\" permalink award report block reply Trex69 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply RememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply Trex69 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nRomanCatholicPatriot 69 points 6 days ago HOMOSEXUALITY IS A S I N permalink award report block reply saltyviewer123 50 points 6 days ago Also INSIDER TRADING permalink parent award report block reply Build_Back_Bankrupt 39 points 6 days ago And tearing up SotU speeches, destruction of federal property is a federal crime. permalink parent award report block reply The_Return_of_User_x 9 points 6 days ago A gay man and a drunk? I didnt know Obama drank! permalink parent award report block reply Mythologick 8 points 6 days ago How else do you get loose enough to take big mikes cock? permalink parent award report block reply view 1 more comments... deleted 15 points 6 days ago keeman 20 points 6 days ago You mean aside from elections and stock futures? permalink parent award report block reply Covfefe_Commando 3 points 6 days ago she swung a really big hammer, and so did her husband, apparently... permalink parent award report block reply view 1 more comments... Bullet3250 1 points 5 days ago She made huge improvements in her district... People can now defecate on the sidewalks, people can now set up tents on city streets and live there, they have open drug markets in the streets, she gives away needles and crack pipes for free. housing prices went up, taxes went up, crime went up, poverty went up, only public education levels went down.  And shoplifting is now a 25$ fine when you  steal under 960$....  And people now leave their car windows DOWN when parked in the street to avoid the smash and grab crowds. Not to mention her 800%+ life time stock market gains -  perhaps the highest returns ever recorded! What a great Congresswoman! permalink parent award report block reply Melchizedek18 7 points 6 days ago We wish. Insider trading is legal for congressional members. permalink parent award report block reply keeman 4 points 6 days ago No, insider trading in a human created crime.  Don't see anything about this in Leviticus. permalink parent award report block reply deleted 8 points 6 days ago Shih_Tabed 1 points 6 days ago Well, looks like she is going to get away with all of it, so divine justice has its limits it seems. permalink parent award report block reply view 2 more comments... DoMagnum 10 points 6 days ago So is hugging Piglosi. permalink parent award report block reply DT170x 7 points 6 days ago That also counts as beastility, which also is illegal. permalink parent award report block reply Bidensmellslikepiss 7 points 6 days ago and fucking GAY permalink parent award report block reply RichardCranium88 2 points 6 days ago Stop, Hammer Time permalink parent award report block reply Standingoak 2 points 6 days ago Not if you are Catholic or Jewish or Satanist...but I repeat myself permalink parent award report block reply VoldemarBGuerta 1 points 5 days ago The act of homosexuality is a mortal sin in Catholicism. permalink parent award report block reply Standingoak 1 points 5 days ago Tell it to all the priests.  I wonder why the Catholic Church didn't want families of Priests ,as in the Orthodox Catholic Church , to receive any wealth upon death of the priest ? I wonder if that is why they \"tolerate\" homosexuality ?  Unlike the Orthodox Catholic Church ? permalink parent award report block reply load 14 more comments...\nsaltyviewer123 50 points 6 days ago Also INSIDER TRADING permalink parent award report block reply Build_Back_Bankrupt 39 points 6 days ago And tearing up SotU speeches, destruction of federal property is a federal crime. permalink parent award report block reply The_Return_of_User_x 9 points 6 days ago A gay man and a drunk? I didnt know Obama drank! permalink parent award report block reply Mythologick 8 points 6 days ago How else do you get loose enough to take big mikes cock? permalink parent award report block reply view 1 more comments... deleted 15 points 6 days ago keeman 20 points 6 days ago You mean aside from elections and stock futures? permalink parent award report block reply Covfefe_Commando 3 points 6 days ago she swung a really big hammer, and so did her husband, apparently... permalink parent award report block reply view 1 more comments... Bullet3250 1 points 5 days ago She made huge improvements in her district... People can now defecate on the sidewalks, people can now set up tents on city streets and live there, they have open drug markets in the streets, she gives away needles and crack pipes for free. housing prices went up, taxes went up, crime went up, poverty went up, only public education levels went down.  And shoplifting is now a 25$ fine when you  steal under 960$....  And people now leave their car windows DOWN when parked in the street to avoid the smash and grab crowds. Not to mention her 800%+ life time stock market gains -  perhaps the highest returns ever recorded! What a great Congresswoman! permalink parent award report block reply Melchizedek18 7 points 6 days ago We wish. Insider trading is legal for congressional members. permalink parent award report block reply keeman 4 points 6 days ago No, insider trading in a human created crime.  Don't see anything about this in Leviticus. permalink parent award report block reply deleted 8 points 6 days ago Shih_Tabed 1 points 6 days ago Well, looks like she is going to get away with all of it, so divine justice has its limits it seems. permalink parent award report block reply view 2 more comments...\nBuild_Back_Bankrupt 39 points 6 days ago And tearing up SotU speeches, destruction of federal property is a federal crime. permalink parent award report block reply The_Return_of_User_x 9 points 6 days ago A gay man and a drunk? I didnt know Obama drank! permalink parent award report block reply Mythologick 8 points 6 days ago How else do you get loose enough to take big mikes cock? permalink parent award report block reply view 1 more comments...\nThe_Return_of_User_x 9 points 6 days ago A gay man and a drunk? I didnt know Obama drank! permalink parent award report block reply Mythologick 8 points 6 days ago How else do you get loose enough to take big mikes cock? permalink parent award report block reply view 1 more comments...\nMythologick 8 points 6 days ago How else do you get loose enough to take big mikes cock? permalink parent award report block reply view 1 more comments...\ndeleted 15 points 6 days ago keeman 20 points 6 days ago You mean aside from elections and stock futures? permalink parent award report block reply Covfefe_Commando 3 points 6 days ago she swung a really big hammer, and so did her husband, apparently... permalink parent award report block reply view 1 more comments... Bullet3250 1 points 5 days ago She made huge improvements in her district... People can now defecate on the sidewalks, people can now set up tents on city streets and live there, they have open drug markets in the streets, she gives away needles and crack pipes for free. housing prices went up, taxes went up, crime went up, poverty went up, only public education levels went down.  And shoplifting is now a 25$ fine when you  steal under 960$....  And people now leave their car windows DOWN when parked in the street to avoid the smash and grab crowds. Not to mention her 800%+ life time stock market gains -  perhaps the highest returns ever recorded! What a great Congresswoman! permalink parent award report block reply\nkeeman 20 points 6 days ago You mean aside from elections and stock futures? permalink parent award report block reply Covfefe_Commando 3 points 6 days ago she swung a really big hammer, and so did her husband, apparently... permalink parent award report block reply view 1 more comments...\nCovfefe_Commando 3 points 6 days ago she swung a really big hammer, and so did her husband, apparently... permalink parent award report block reply view 1 more comments...\nBullet3250 1 points 5 days ago She made huge improvements in her district... People can now defecate on the sidewalks, people can now set up tents on city streets and live there, they have open drug markets in the streets, she gives away needles and crack pipes for free. housing prices went up, taxes went up, crime went up, poverty went up, only public education levels went down.  And shoplifting is now a 25$ fine when you  steal under 960$....  And people now leave their car windows DOWN when parked in the street to avoid the smash and grab crowds. Not to mention her 800%+ life time stock market gains -  perhaps the highest returns ever recorded! What a great Congresswoman! permalink parent award report block reply\nMelchizedek18 7 points 6 days ago We wish. Insider trading is legal for congressional members. permalink parent award report block reply\nkeeman 4 points 6 days ago No, insider trading in a human created crime.  Don't see anything about this in Leviticus. permalink parent award report block reply deleted 8 points 6 days ago Shih_Tabed 1 points 6 days ago Well, looks like she is going to get away with all of it, so divine justice has its limits it seems. permalink parent award report block reply view 2 more comments...\ndeleted 8 points 6 days ago Shih_Tabed 1 points 6 days ago Well, looks like she is going to get away with all of it, so divine justice has its limits it seems. permalink parent award report block reply view 2 more comments...\nShih_Tabed 1 points 6 days ago Well, looks like she is going to get away with all of it, so divine justice has its limits it seems. permalink parent award report block reply view 2 more comments...\nDoMagnum 10 points 6 days ago So is hugging Piglosi. permalink parent award report block reply DT170x 7 points 6 days ago That also counts as beastility, which also is illegal. permalink parent award report block reply\nDT170x 7 points 6 days ago That also counts as beastility, which also is illegal. permalink parent award report block reply\nBidensmellslikepiss 7 points 6 days ago and fucking GAY permalink parent award report block reply\nRichardCranium88 2 points 6 days ago Stop, Hammer Time permalink parent award report block reply\nStandingoak 2 points 6 days ago Not if you are Catholic or Jewish or Satanist...but I repeat myself permalink parent award report block reply VoldemarBGuerta 1 points 5 days ago The act of homosexuality is a mortal sin in Catholicism. permalink parent award report block reply Standingoak 1 points 5 days ago Tell it to all the priests.  I wonder why the Catholic Church didn't want families of Priests ,as in the Orthodox Catholic Church , to receive any wealth upon death of the priest ? I wonder if that is why they \"tolerate\" homosexuality ?  Unlike the Orthodox Catholic Church ? permalink parent award report block reply\nVoldemarBGuerta 1 points 5 days ago The act of homosexuality is a mortal sin in Catholicism. permalink parent award report block reply Standingoak 1 points 5 days ago Tell it to all the priests.  I wonder why the Catholic Church didn't want families of Priests ,as in the Orthodox Catholic Church , to receive any wealth upon death of the priest ? I wonder if that is why they \"tolerate\" homosexuality ?  Unlike the Orthodox Catholic Church ? permalink parent award report block reply\nStandingoak 1 points 5 days ago Tell it to all the priests.  I wonder why the Catholic Church didn't want families of Priests ,as in the Orthodox Catholic Church , to receive any wealth upon death of the priest ? I wonder if that is why they \"tolerate\" homosexuality ?  Unlike the Orthodox Catholic Church ? permalink parent award report block reply\nGenericwhitemale 38 points 6 days ago Anyone who has a 100M+ net worth working in government is a corrupt pos. permalink award report block reply EDDIT_IS_CUCKED -16 points 6 days ago Trump? Spez: you all are fucking retards. I'm using Trump as an example that not everyone in politics with that wealth is corrupt. All of you that down voted essentially called Trump corrupt.  Reading comprehension never seemed to catch on at this place. It's the equivalent of someone saying incorrectly \"There are no states bigger than TX.\" And someone replies with \"Alaska?\" permalink parent award report block reply halcyondream 29 points 6 days ago That wasn't his point. Trump was already a billionaire, he means career politicians that are nothing outside of it walking away with with 9 figures+. Don't be an asshat. permalink parent award report block reply EDDIT_IS_CUCKED -9 points 6 days ago Ok. She married someone worth $100M+ before she got into politics. So the same shit applies to her, independently wealthy prior to public sevice. To say she earned her entire fortune from insider trading is just simply wrong. Maybe you stop being an asshat, faggot. permalink parent award report block reply Genericwhitemale 10 points 6 days ago The point is she’s corrupt. They make a ton of money through the market and insider information. If you serve the public you shouldn’t be allowed to do that. Don’t tell me you can truly serve people when you’re busy lining your own pockets. permalink parent award report block reply view 5 more comments... makersmarx 7 points 6 days ago No! permalink parent award report block reply Meddlesom 1 points 6 days ago You're a fucking moron. permalink parent award report block reply EDDIT_IS_CUCKED 1 points 5 days ago Congrats on having zero reading comprehension faggot. permalink parent award report block reply Meddlesom 0 points 4 days ago Back peddle faster, chicken-bricker. permalink parent award report block reply view 3 more comments...\nEDDIT_IS_CUCKED -16 points 6 days ago Trump? Spez: you all are fucking retards. I'm using Trump as an example that not everyone in politics with that wealth is corrupt. All of you that down voted essentially called Trump corrupt.  Reading comprehension never seemed to catch on at this place. It's the equivalent of someone saying incorrectly \"There are no states bigger than TX.\" And someone replies with \"Alaska?\" permalink parent award report block reply halcyondream 29 points 6 days ago That wasn't his point. Trump was already a billionaire, he means career politicians that are nothing outside of it walking away with with 9 figures+. Don't be an asshat. permalink parent award report block reply EDDIT_IS_CUCKED -9 points 6 days ago Ok. She married someone worth $100M+ before she got into politics. So the same shit applies to her, independently wealthy prior to public sevice. To say she earned her entire fortune from insider trading is just simply wrong. Maybe you stop being an asshat, faggot. permalink parent award report block reply Genericwhitemale 10 points 6 days ago The point is she’s corrupt. They make a ton of money through the market and insider information. If you serve the public you shouldn’t be allowed to do that. Don’t tell me you can truly serve people when you’re busy lining your own pockets. permalink parent award report block reply view 5 more comments... makersmarx 7 points 6 days ago No! permalink parent award report block reply Meddlesom 1 points 6 days ago You're a fucking moron. permalink parent award report block reply EDDIT_IS_CUCKED 1 points 5 days ago Congrats on having zero reading comprehension faggot. permalink parent award report block reply Meddlesom 0 points 4 days ago Back peddle faster, chicken-bricker. permalink parent award report block reply view 3 more comments...\nhalcyondream 29 points 6 days ago That wasn't his point. Trump was already a billionaire, he means career politicians that are nothing outside of it walking away with with 9 figures+. Don't be an asshat. permalink parent award report block reply EDDIT_IS_CUCKED -9 points 6 days ago Ok. She married someone worth $100M+ before she got into politics. So the same shit applies to her, independently wealthy prior to public sevice. To say she earned her entire fortune from insider trading is just simply wrong. Maybe you stop being an asshat, faggot. permalink parent award report block reply Genericwhitemale 10 points 6 days ago The point is she’s corrupt. They make a ton of money through the market and insider information. If you serve the public you shouldn’t be allowed to do that. Don’t tell me you can truly serve people when you’re busy lining your own pockets. permalink parent award report block reply view 5 more comments...\nEDDIT_IS_CUCKED -9 points 6 days ago Ok. She married someone worth $100M+ before she got into politics. So the same shit applies to her, independently wealthy prior to public sevice. To say she earned her entire fortune from insider trading is just simply wrong. Maybe you stop being an asshat, faggot. permalink parent award report block reply Genericwhitemale 10 points 6 days ago The point is she’s corrupt. They make a ton of money through the market and insider information. If you serve the public you shouldn’t be allowed to do that. Don’t tell me you can truly serve people when you’re busy lining your own pockets. permalink parent award report block reply view 5 more comments...\nGenericwhitemale 10 points 6 days ago The point is she’s corrupt. They make a ton of money through the market and insider information. If you serve the public you shouldn’t be allowed to do that. Don’t tell me you can truly serve people when you’re busy lining your own pockets. permalink parent award report block reply view 5 more comments...\nmakersmarx 7 points 6 days ago No! permalink parent award report block reply\nMeddlesom 1 points 6 days ago You're a fucking moron. permalink parent award report block reply EDDIT_IS_CUCKED 1 points 5 days ago Congrats on having zero reading comprehension faggot. permalink parent award report block reply Meddlesom 0 points 4 days ago Back peddle faster, chicken-bricker. permalink parent award report block reply view 3 more comments...\nEDDIT_IS_CUCKED 1 points 5 days ago Congrats on having zero reading comprehension faggot. permalink parent award report block reply Meddlesom 0 points 4 days ago Back peddle faster, chicken-bricker. permalink parent award report block reply view 3 more comments...\nMeddlesom 0 points 4 days ago Back peddle faster, chicken-bricker. permalink parent award report block reply view 3 more comments...\ndr_gonzo 24 points 6 days ago For almost four decades Nancy Pelosi has served herself and worked to make herself richer. No one was more skilled at insider trading and screwing over the American people. Americans will be forever furious for her part in passing Obummercare. She made us ashamed to be Americans, and will go down in history as the biggest disgrace to ever walk the halls of congress. Fuck you for everything you've done. The American people and I will be hoping you die a slow, painful death. There, fixed that for ya. permalink award report block reply Shitsbrokeyo 1 points 5 days ago Well it was 0bama, anything coming out of his mouth is a lie, to continue his efforts in tearing down Anerica. permalink parent award report block reply\nShitsbrokeyo 1 points 5 days ago Well it was 0bama, anything coming out of his mouth is a lie, to continue his efforts in tearing down Anerica. permalink parent award report block reply\nRope_Tree_Journalist 19 points 6 days ago Press 'S' to spit permalink award report block reply South_Florida_Guy 5 points 6 days ago Press N to.... permalink parent award report block reply PelosisPuss 4 points 6 days ago S permalink parent award report block reply YaharaRiver 2 points 6 days ago S permalink parent award report block reply\nSouth_Florida_Guy 5 points 6 days ago Press N to.... permalink parent award report block reply\nPelosisPuss 4 points 6 days ago S permalink parent award report block reply\nYaharaRiver 2 points 6 days ago S permalink parent award report block reply\nIcepck 18 points 6 days ago Politics was the only chapter of her life. That shouldn't be the majority of any persons life. permalink award report block reply suckmycorona 7 points 6 days ago Well government cracked down on the mob so she really only had one avenue to go towards. permalink parent award report block reply\nsuckmycorona 7 points 6 days ago Well government cracked down on the mob so she really only had one avenue to go towards. permalink parent award report block reply\nSaltArmyCaptain 16 points 6 days ago Got my hopes up, it sounded like she died till the end there.... permalink award report block reply AliceCooperBiden 3 points 6 days ago Same. I was wondering how I missed such fantastic news. permalink parent award report block reply\nAliceCooperBiden 3 points 6 days ago Same. I was wondering how I missed such fantastic news. permalink parent award report block reply\nSomecatsareMAGA 9 points 6 days ago Controlled by demonic forces. Look at his face. Came from nowhere and going nowhere. Pelosi 🤮🤑 permalink award report block reply\nAwShitHereWeGoAgain 7 points 6 days ago Shut up, you bottom bitch faggot. permalink award report block reply\nPoohBearBalloon 7 points 6 days ago Shut up faggot! permalink award report block reply\nScamBlondie 7 points 6 days ago Any politician who refers to their work as “service” is automatically a douche. permalink award report block reply\nMemoryHoleyeO 7 points 6 days ago 4 decades is nothing to be proud about. That's disgusting permalink award report block reply\nSnowSnake 7 points 6 days ago Nancy, and Paul aaannd Paul's homo-side-squeeze David. I wish him the best, too. 🔨 🛠 permalink award report block reply\nGodIsPerfect 7 points 6 days ago Time to lock her up for insider trading. permalink award report block reply\nspinometer2 6 points 6 days ago I have nothing nice to say permalink award report block reply\nJayKay1776 5 points 6 days ago Personally I hope she gets to meet Dick Cheney here pretty soon. permalink award report block reply\nMonolitoVeritas 4 points 6 days ago if there still is an old decrepit squirrel still running on an old, rusted, wheel in her demented, insane brain, I hope she has enough left upstairs to feel the flames of hell that await her. permalink award report block reply\nDanIsSwell 4 points 6 days ago A gay man and a drunk walk into a bar. She whispers “when I get drunk, I like a big black cock” He says “Me too, but I told you Michael isn’t here right now” permalink award report block reply KernalMustard 4 points 6 days ago I wanna bet Paul cucks his wife then he has sex with the dude. I think that was what was going on. permalink parent award report block reply\nKernalMustard 4 points 6 days ago I wanna bet Paul cucks his wife then he has sex with the dude. I think that was what was going on. permalink parent award report block reply\nGuerillaYourDreams 4 points 6 days ago If I never see or hear from this purple-lipped demon ever again, it will still be too soon! permalink award report block reply\nI-am-Orlando OP PRO 4 points 6 days ago Link to treasonist POS https://x.com/BarackObama/status/1986475370363687393 permalink award report block reply MythArcana 2 points 6 days ago 👋🏻🐸 permalink parent award report block reply I-am-Orlando OP PRO 1 points 6 days ago It's my fren! 👍🏼 Hola hello, pede. permalink parent award report block reply\nMythArcana 2 points 6 days ago 👋🏻🐸 permalink parent award report block reply I-am-Orlando OP PRO 1 points 6 days ago It's my fren! 👍🏼 Hola hello, pede. permalink parent award report block reply\nI-am-Orlando OP PRO 1 points 6 days ago It's my fren! 👍🏼 Hola hello, pede. permalink parent award report block reply\nUnboosted 3 points 6 days ago Bad take from obama permalink award report block reply\n1_Badcop 3 points 6 days ago A gay muslim and a drunk walk into a bar... ...and America got fucked! Finished the joke for you! Only, it's not a joke. And it wasn't funny. permalink award report block reply\nRetard_Strength 3 points 6 days ago STOP HAMMERTIME permalink award report block reply\nOodles 3 points 6 days ago Drunk corrupt cunt and her gay black friend permalink award report block reply\ntuaris 3 points 6 days ago If Nancy Pelosi was \"one of the best\", then what does one of their worst look like? permalink award report block reply\nDoMagnum 3 points 6 days ago When Barry and Big Mike fight, they reportedly exchange blows. permalink award report block reply\n2025WhatIsTrue 3 points 6 days ago This criminal reprobate would look best spending the rest of her worthless, criminal life behind SuperMax bars.  What a subhuman loser. permalink award report block reply\nRain_man 3 points 6 days ago If she retires, when will Paul have his late night hammer parties? permalink award report block reply\n16BeatsAOne 3 points 6 days ago Mike and I wish you and Paul and his hammer-wielding boyfriend the best in this next chapter. Fixed it. permalink award report block reply\nDev404 3 points 6 days ago Both deserve to burn in hell for all eternity for the crimes they've committed for decades. permalink award report block reply\nJackOfAllTirades 3 points 6 days ago Go fuck yourself faggot. permalink award report block reply\nslimcoat 3 points 6 days ago You have to pass it to find out what's in it. I'll never forget her saying that. permalink award report block reply\ncanapede24 3 points 6 days ago Gay muslim* permalink award report block reply\nLight_HIV_Effect 3 points 6 days ago She's not served anyone but herself and her bank account. She's a hyper partisan embarrassment and drunk that abused the US Air Force to shuttle her family around with a fully stocked liquor bar and was responsible for allowing members of congress to get booze delivered directly to their offices. She also has tardive dyskinesia from all the years of psychoactive antidepressants and antipsychotics she's guzzled down over the years. permalink award report block reply\nmass55th 3 points 6 days ago Nancy and her husband Paul can now get hammered together. permalink award report block reply\nElric44357 3 points 6 days ago What a crock of shit, but what else would you expect from Obama. permalink award report block reply\nWupta PRO 3 points 6 days ago Name one good thing either have done one. permalink award report block reply\nSugz_Da_Feefth 2 points 6 days ago Hahaha!! permalink award report block reply\nbarwhack 2 points 6 days ago Allahu Akbar. permalink award report block reply\nYaharaRiver 2 points 6 days ago B A R F ! ! 🤮 permalink award report block reply\nAgent_Orange 2 points 6 days ago He and Michelle are barely on speaking terms anymore. She trashes him every chance she gets. The rest of the post is also a lie. permalink award report block reply\nRock9Head 2 points 6 days ago Obamacare is a disaster. She got out at the last moment. permalink award report block reply\nBrionK 2 points 6 days ago Fuck all the systems that created these commies.\nIf you aren't shutting down the system you are the evil. permalink award report block reply\nHankScorpio 2 points 6 days ago Shanghai Nancy. permalink award report block reply\nFreedomFlowerDelta 2 points 6 days ago When is she going to be gone for real? permalink award report block reply\nknnbccb 2 points 6 days ago Mamdani also hates your kind too. permalink award report block reply\nTexar1991 2 points 6 days ago The next chapter for her will be Hell. permalink award report block reply\nMagaman4200 2 points 6 days ago 🤮 permalink award report block reply\nIronPatriot1 2 points 6 days ago Is she dead?! 😃 permalink award report block reply Oldman6541E5 3 points 6 days ago She will be retiring. Maybe she will be my neighbor in the retirement home. Probably not though. Will you be my neighbor? permalink parent award report block reply Build_Back_Bankrupt 3 points 6 days ago She'll have to be, the No Kings protests took out King Friday. permalink parent award report block reply Oldman6541E5 3 points 6 days ago HA HA HA! permalink parent award report block reply Mortal_Wombat 1 points 6 days ago That's the next chapter 🤣 permalink parent award report block reply\nOldman6541E5 3 points 6 days ago She will be retiring. Maybe she will be my neighbor in the retirement home. Probably not though. Will you be my neighbor? permalink parent award report block reply Build_Back_Bankrupt 3 points 6 days ago She'll have to be, the No Kings protests took out King Friday. permalink parent award report block reply Oldman6541E5 3 points 6 days ago HA HA HA! permalink parent award report block reply\nBuild_Back_Bankrupt 3 points 6 days ago She'll have to be, the No Kings protests took out King Friday. permalink parent award report block reply Oldman6541E5 3 points 6 days ago HA HA HA! permalink parent award report block reply\nOldman6541E5 3 points 6 days ago HA HA HA! permalink parent award report block reply\nMortal_Wombat 1 points 6 days ago That's the next chapter 🤣 permalink parent award report block reply\nBidensmellslikepiss 2 points 6 days ago Well he's right about one thing. She brought alot of FBI faggots together on J6. permalink award report block reply\nNomad899 2 points 6 days ago Grifter praising grift….she enriched herself and fucked this country raw permalink award report block reply\nHopfrog1985 2 points 6 days ago Paul and Nancy will probably get HAMMERED a lot together now that she’s off work permalink award report block reply Hopfrog1985 2 points 6 days ago Get it permalink parent award report block reply\nHopfrog1985 2 points 6 days ago Get it permalink parent award report block reply\nCheeseAndOnion 2 points 6 days ago Hammer dildo bros permalink award report block reply\nMrTexan 2 points 6 days ago Her and her husband can now both enjoy getting hammered in retirement. permalink award report block reply\nProbablyASockAccount 2 points 6 days ago One thing. Point to one fucking thing that cunt did in all of her decades in \"public service\". permalink award report block reply\nAggrieved03 2 points 6 days ago O accountability for either of these criminals. permalink award report block reply\nMaxJohnson 1 points 5 days ago hopefully it’s an epilogue not a new chapter. permalink award report block reply\nLive_free_or_die_55 1 points 6 days ago Two traitors walking in to the bar …. permalink award report block reply\nh203h 1 points 5 days ago This fucking bitch gets off and no arrest for her huh, she is going straight to hell for undermining the American people and the crimes against humanity that she has done. FUCK HER I HOPE SHE ROTS IN HELL AND GETS HER GRAVE PISSED ON OVER AND OVER AGAIN permalink award report block reply\nMythArcana 1 points 6 days ago Don't let the doorknob hit you in the bonus hole!  🚪 💃 permalink award report block reply\nRitchie_Blackadder 1 points 6 days ago At this point she's gone down ON history. Nancy too. permalink award report block reply\nOG_BACONndEGGs 1 points 6 days ago Michelle? permalink award report block reply\nTrump4Infinity 1 points 6 days ago Hey look at this politician who's held different seats of power for 40 years. She's good and sheit no reason to investigate for corruption and treason. If she's not made an example of no one else will be either. Either it starts with one or better be no one. permalink award report block reply\njml1997 1 points 6 days ago I was going to say, normally you walk into the bar to get drunk and then saw it was old pickled liver herself. Bitch is constantly hammered. permalink award report block reply\nFatBeagleMars 1 points 6 days ago A gay man and a drunk walk into a bar. The next morning they both wonder why their a$$hole hurts. permalink award report block reply\nSkogin 1 points 6 days ago She falls down, but he grabs on and starts sucking. permalink award report block reply\nbillybaldwin2 1 points 6 days ago Didn't she choose not to campaign in 2022 and 2024 too? permalink award report block reply\nGdotLee 1 points 6 days ago Next chapter?  LAST chapter. permalink award report block reply\nSavingPrivateGrace 1 points 6 days ago Crazy Nancy.  Obama accepted her resignation. permalink award report block reply\niamstadter 1 points 5 days ago ....of grifting. permalink award report block reply\nparamour 1 points 5 days ago Gross. permalink award report block reply\nSisterCovfefeToo 1 points 5 days ago Hahaha We have to pass it to see what's in it. She drove the divisiveness of Congress to the point where no legislation could be passed. To think she represented the People of the United States as the bestest speaker of all time is delusional. permalink award report block reply\nMemeoverlord 1 points 5 days ago He spelled michael wrong again permalink award report block reply\nWrez77 1 points 6 days ago Just burn in Hell already permalink award report block reply\nConductProbation 1 points 5 days ago May you have many hammers in your future! permalink award report block reply\nMudDog 1 points 6 days ago wow he snubbed hammer man, what a dick! permalink award report block reply\nTrumpRideorDie74 1 points 6 days ago I'm not upvoting this bullshit permalink award report block reply\nMeMargie 1 points 6 days ago Pray I get to see Justice for their Treason prior to me leaving this earth :) A couple of Self Serving Traitors Burn in Hell with your Maker ! permalink award report block reply\nBasedMillennial -1 points 6 days ago \"wE hassshve to passssh the billllsh to know whatssshh init\" permalink award report block reply\nTrex69 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nRememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nTrex69 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T21:04:32.458058Z"
}