{
  "id": "8176167",
  "title": "1363Fedsurection confirmed (aka conspiracy theorists were right again)posted4 days agobyaustford68 c",
  "url": "https://patriots.win/p/1ARK57r8MR/fedsurection-confirmed-aka-consp/c",
  "content": "1363 Fedsurection confirmed (aka conspiracy theorists were right again) posted 4 days ago by austford 68 comments award share download report block\n68 comments Sort by Top Top New Worst Old Save fat50 78 points 4 days ago I hate knowing shit years before it's proven to be true. permalink award report block reply NotYourMan 50 points 4 days ago Jan 6th was entrapment of Trump supporters protesting obvious cheating in the 2020 election.  Democrats wanted to make it look like an insurrection so they could jail Trump.  They setup the riots by Nancy waiting 71 minutes before sending in help and planting fake bombs.  In addition after Jan 6th the committee leaked fake news that six police were killed in the riots on Jan 6th which was an absolute lie.  Chief Steven Sund stated that he requested National Guard support at approximately 1 p.m. on January 6 but did not receive a response for 71 minutes, during which time the Capitol was breached.  It wasn't Trump.  It appears that it was Nancy. permalink parent award report block reply wmmiv2016v2 21 points 4 days ago Capital was \"breached\".  No, they opened the doors and waved them in. permalink parent award report block reply schism 9 points 4 days ago Even more disgusting is this evil cunt launched pepper balls at patriots during the Fedsurrection, then served as key trial witness to secure their convictions.  She needs a lengthy sentence in solitary confinement. https://www.courthousenews.com/former-capitol-police-officer-testifies-about-launching-pepper-balls-at-accused-jan-6-rioter/ permalink parent award report block reply TruthyBrat 5 points 4 days ago Thank you. The idea that the Capitol could be \"breached\" by an unruly protest mob after the hardening it got post-9/11 is so absurd only a Democrat could believe it. permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago patriots put themselve son the line fighting those pigs and you're denying it permalink parent award report block reply zettarose1955 4 points 4 days ago Most of us that went or knew people that were going knew it was a trap but went anyway!!! I believe even Trump knew it was. permalink parent award report block reply fasterthanspeedofdum 19 points 4 days ago Most of us have known it was an inside job just like we know about 9/11 and 2020 elections and everything else. We'll never tire of saying arrest them all. Dismantle all agencies involved. Do something! permalink parent award report block reply snoopy3210 -8 points 4 days ago The guy that dropped the bomb on J6 in the original video was much thinner.. this another fake news permalink parent award report block reply Transparency 3 points 4 days ago The guy that dropped the bomb on J6 Not likely that it was a \"guy\". permalink parent award report block reply KekistanPM 12 points 4 days ago \"You may have been right this time, but you're still a conspiracy theorist.\" permalink parent award report block reply shatmaself 2 points 4 days ago And the 10 times before that permalink parent award report block reply austford OP 2 points 4 days ago lol guilty permalink parent award report block reply Rudy_DankMemer 7 points 4 days ago that part will never get old, or tiresome. my family found me a shirt for me last year for my bday that reads: I Grow My Beard & I Know Things What does suck is watching nothing ever happen to those evil pedo overlords. permalink parent award report block reply KernalMustard 3 points 4 days ago I have this feeling every day around here. I think its because evidence based on logic and how people are. People lie and People suck. permalink parent award report block reply load 6 more comments... MrMcGreenGenes 33 points 4 days ago I feel like I'm owed a refund for my only visit ever to our nation's capital, along with millions for the malicious defamation. permalink award report block reply bananaguard62 23 points 4 days ago Malicious defamation is right! I lost family, friends,  and work for a peaceful 15min walk through the Rotunda; in large part due to the narrative strung together by the media and J6 committee. This was carefully orchestrated to smear Trump and his followers to shun them from polite society. It's a miracle he survived permalink parent award report block reply RichieSprouse 8 points 4 days ago I never went in.  The Capitol Police holding the doors open and waiving us through was too suspicious permalink parent award report block reply bananaguard62 6 points 4 days ago When I went to exit the officer holding the east rotunda doors yelled,  \"YOU'RE WORKING AGAINST YOURSELVES.  YOU NEED TO BE GOING IN, NOT OUT. IN!\". You can see me stop in the doorway,  think about it, then go back in.  Someone has video of him saying it,  but I haven't found it permalink parent award report block reply Lady_MaGa 3 points 4 days ago Trump has the hand of God with him. permalink parent award report block reply mohel 4 points 4 days ago How come nobody has been held responsible for such an obvious deception? permalink parent award report block reply bananaguard62 20 points 4 days ago Since we know there was a conspiracy to entrap J6ers and the CP were involved, we need to see how close she was to the CP officers that were suicided. They may have been loose ends. This is the smoking gun to show that it was orchestrated by our own government. J6ers deserve a public apology in the form of millions dollars permalink award report block reply JoinTheDiscussion 7 points 4 days ago Na, just a front row seat at the gallows permalink parent award report block reply SavingPrivateGrace 16 points 4 days ago Nancy Pelosi was part of the inside job.  Her entire existence as an inside trader is who she really is. permalink award report block reply KneadThePeople 10 points 4 days ago Who is going to pay for all the time I spent behind bars? permalink award report block reply djentropyhardcore 6 points 4 days ago Who was it? permalink award report block reply ninabobby 14 points 4 days ago According to a gait analysis- https://www.theblaze.com/news/former-capitol-police-officer-a-forensic-match-for-jan-6-pipe-bomber-sources-say permalink parent award report block reply realsolidsnakeoil 19 points 4 days ago Kerkhoff, who was a Capitol Police officer for four and a half years, left the department in mid-2021 for a security detail at the Central Intelligence Agency, sources told Blaze News. I hate this fucking planet. permalink parent award report block reply Whatyougotson 8 points 4 days ago She....went to work for the c.i.a??? you've got to be kidding me permalink parent award report block reply ParticleCannon 5 points 4 days ago Groomed permalink parent award report block reply view 2 more comments... fat50 1 points 4 days ago Odds are, she was already employed there. permalink parent award report block reply djentropyhardcore 3 points 4 days ago Thanks pedes! permalink parent award report block reply fat50 1 points 4 days ago IT'S ALWAYS THE FUCKING CIA!!!! permalink parent award report block reply gustodog 2 points 4 days ago But didn't a FBI whistleblower claim the perp they found, and were told to stand down on, was a retired US Navy master sergeant? permalink parent award report block reply Retard_Strength 5 points 4 days ago Is Blaze putting this out there because they are 100% sure? And forcing Kash to do something? permalink award report block reply Klaus73 5 points 4 days ago Well are they putting their money where their mouth is and opening up to possible defamation if wrong? permalink parent award report block reply sorrytodisagree 2 points 4 days ago By what happened to Giuliani, Trump, Mike Lindell, and Alex Jones they could be found liable for defamation even when they're right. permalink parent award report block reply WarViper1337 5 points 4 days ago How many people have been arrested for this so far? permalink award report block reply NoMoreShinesBilly 5 points 4 days ago but what about SNAP?  and stealing more money from American citizens to finance the illegal alien invaders? permalink award report block reply highenergywinning 4 points 4 days ago Bondi ? Anyone? Bondi? permalink award report block reply chickeninoven 5 points 4 days ago The princess you're looking for is at another news outlet. permalink parent award report block reply TrumpAndSimpsNotMAGA 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply Rucktoe 4 points 4 days ago Will the lunatics on reddit that were so wrong self reflect on this?  Nope. permalink award report block reply 45fan 4 points 4 days ago Alright Bongino you got the suspect you were chomping at the bit to get. Now what? permalink award report block reply IvIA6A 3 points 4 days ago I knew it was either FBI or CIA that did it. They knew exactly who it was based on cell phone records. Turns out to be capitol police working for the CIA permalink award report block reply tdtech9 3 points 4 days ago And the same report says she moved jobs, from the CP to the CIA, afterwards. permalink parent award report block reply JoeMcCarthyWasRight 2 points 4 days ago She’s an employee. There’s a chain of traitors who have this traitor her orders. The American people want them executed. permalink award report block reply Prandogolio 2 points 4 days ago I used to pipe bomb womp rats back home permalink award report block reply H0rse 1 points 4 days ago A PIPE BOMB JUST FLEW OVER MY HOUSE! permalink parent award report block reply Nellie_the_Beaut 2 points 4 days ago How many indictments and prosecutions have cited this “bombing attempt at the DNC headquarters” in the evidence against President Trump, his cabinet, staff and Americans who attended the January 6th rally? permalink award report block reply BlueKentuckyGirl 1 points 4 days ago This better be put in the national news permalink award report block reply BlueKentuckyGirl 1 points 4 days ago American citizenry walking around with their fingers in their ears singing lalalala all while wearing horse blinders. It does get frustrating permalink award report block reply RyanKeyOh 1 points 4 days ago Has this been confirmed? Not doubting it, just want to read more permalink award report block reply Bramage 1 points 4 days ago ...and the actual punishment starts when... permalink award report block reply TheOriginalBrickBot 1 points 4 days ago S tier meme permalink award report block reply CanadianMeathead 1 points 4 days ago Where is the proof? permalink award report block reply mullethawk 2 points 4 days ago Her next door neighbor's address was \"tied to a vehicle that picked up the bomb suspect,\" whatever that means. And the same neighbor's DC Metrorail SmarTrip card was \"allegedly\" used by the bomb suspect. So there's that in addition to the gait analysis. permalink parent award report block reply CanadianMeathead 1 points 4 days ago Still pretty stretched. permalink parent award report block reply xBigCoffinHunter 1 points 4 days ago It’s the new Spoiler Alert permalink award report block reply Stolen 0 points 4 days ago The issue isn't that this was a Fedsurrection. The issue is that MAGA doesn't think that MAGA could have rioted. permalink award report block reply TheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nfat50 78 points 4 days ago I hate knowing shit years before it's proven to be true. permalink award report block reply NotYourMan 50 points 4 days ago Jan 6th was entrapment of Trump supporters protesting obvious cheating in the 2020 election.  Democrats wanted to make it look like an insurrection so they could jail Trump.  They setup the riots by Nancy waiting 71 minutes before sending in help and planting fake bombs.  In addition after Jan 6th the committee leaked fake news that six police were killed in the riots on Jan 6th which was an absolute lie.  Chief Steven Sund stated that he requested National Guard support at approximately 1 p.m. on January 6 but did not receive a response for 71 minutes, during which time the Capitol was breached.  It wasn't Trump.  It appears that it was Nancy. permalink parent award report block reply wmmiv2016v2 21 points 4 days ago Capital was \"breached\".  No, they opened the doors and waved them in. permalink parent award report block reply schism 9 points 4 days ago Even more disgusting is this evil cunt launched pepper balls at patriots during the Fedsurrection, then served as key trial witness to secure their convictions.  She needs a lengthy sentence in solitary confinement. https://www.courthousenews.com/former-capitol-police-officer-testifies-about-launching-pepper-balls-at-accused-jan-6-rioter/ permalink parent award report block reply TruthyBrat 5 points 4 days ago Thank you. The idea that the Capitol could be \"breached\" by an unruly protest mob after the hardening it got post-9/11 is so absurd only a Democrat could believe it. permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago patriots put themselve son the line fighting those pigs and you're denying it permalink parent award report block reply zettarose1955 4 points 4 days ago Most of us that went or knew people that were going knew it was a trap but went anyway!!! I believe even Trump knew it was. permalink parent award report block reply fasterthanspeedofdum 19 points 4 days ago Most of us have known it was an inside job just like we know about 9/11 and 2020 elections and everything else. We'll never tire of saying arrest them all. Dismantle all agencies involved. Do something! permalink parent award report block reply snoopy3210 -8 points 4 days ago The guy that dropped the bomb on J6 in the original video was much thinner.. this another fake news permalink parent award report block reply Transparency 3 points 4 days ago The guy that dropped the bomb on J6 Not likely that it was a \"guy\". permalink parent award report block reply KekistanPM 12 points 4 days ago \"You may have been right this time, but you're still a conspiracy theorist.\" permalink parent award report block reply shatmaself 2 points 4 days ago And the 10 times before that permalink parent award report block reply austford OP 2 points 4 days ago lol guilty permalink parent award report block reply Rudy_DankMemer 7 points 4 days ago that part will never get old, or tiresome. my family found me a shirt for me last year for my bday that reads: I Grow My Beard & I Know Things What does suck is watching nothing ever happen to those evil pedo overlords. permalink parent award report block reply KernalMustard 3 points 4 days ago I have this feeling every day around here. I think its because evidence based on logic and how people are. People lie and People suck. permalink parent award report block reply load 6 more comments...\nNotYourMan 50 points 4 days ago Jan 6th was entrapment of Trump supporters protesting obvious cheating in the 2020 election.  Democrats wanted to make it look like an insurrection so they could jail Trump.  They setup the riots by Nancy waiting 71 minutes before sending in help and planting fake bombs.  In addition after Jan 6th the committee leaked fake news that six police were killed in the riots on Jan 6th which was an absolute lie.  Chief Steven Sund stated that he requested National Guard support at approximately 1 p.m. on January 6 but did not receive a response for 71 minutes, during which time the Capitol was breached.  It wasn't Trump.  It appears that it was Nancy. permalink parent award report block reply wmmiv2016v2 21 points 4 days ago Capital was \"breached\".  No, they opened the doors and waved them in. permalink parent award report block reply schism 9 points 4 days ago Even more disgusting is this evil cunt launched pepper balls at patriots during the Fedsurrection, then served as key trial witness to secure their convictions.  She needs a lengthy sentence in solitary confinement. https://www.courthousenews.com/former-capitol-police-officer-testifies-about-launching-pepper-balls-at-accused-jan-6-rioter/ permalink parent award report block reply TruthyBrat 5 points 4 days ago Thank you. The idea that the Capitol could be \"breached\" by an unruly protest mob after the hardening it got post-9/11 is so absurd only a Democrat could believe it. permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago patriots put themselve son the line fighting those pigs and you're denying it permalink parent award report block reply zettarose1955 4 points 4 days ago Most of us that went or knew people that were going knew it was a trap but went anyway!!! I believe even Trump knew it was. permalink parent award report block reply\nwmmiv2016v2 21 points 4 days ago Capital was \"breached\".  No, they opened the doors and waved them in. permalink parent award report block reply schism 9 points 4 days ago Even more disgusting is this evil cunt launched pepper balls at patriots during the Fedsurrection, then served as key trial witness to secure their convictions.  She needs a lengthy sentence in solitary confinement. https://www.courthousenews.com/former-capitol-police-officer-testifies-about-launching-pepper-balls-at-accused-jan-6-rioter/ permalink parent award report block reply TruthyBrat 5 points 4 days ago Thank you. The idea that the Capitol could be \"breached\" by an unruly protest mob after the hardening it got post-9/11 is so absurd only a Democrat could believe it. permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago patriots put themselve son the line fighting those pigs and you're denying it permalink parent award report block reply\nschism 9 points 4 days ago Even more disgusting is this evil cunt launched pepper balls at patriots during the Fedsurrection, then served as key trial witness to secure their convictions.  She needs a lengthy sentence in solitary confinement. https://www.courthousenews.com/former-capitol-police-officer-testifies-about-launching-pepper-balls-at-accused-jan-6-rioter/ permalink parent award report block reply\nTruthyBrat 5 points 4 days ago Thank you. The idea that the Capitol could be \"breached\" by an unruly protest mob after the hardening it got post-9/11 is so absurd only a Democrat could believe it. permalink parent award report block reply\nPeterThielAntiChrist 1 points 3 days ago patriots put themselve son the line fighting those pigs and you're denying it permalink parent award report block reply\nzettarose1955 4 points 4 days ago Most of us that went or knew people that were going knew it was a trap but went anyway!!! I believe even Trump knew it was. permalink parent award report block reply\nfasterthanspeedofdum 19 points 4 days ago Most of us have known it was an inside job just like we know about 9/11 and 2020 elections and everything else. We'll never tire of saying arrest them all. Dismantle all agencies involved. Do something! permalink parent award report block reply snoopy3210 -8 points 4 days ago The guy that dropped the bomb on J6 in the original video was much thinner.. this another fake news permalink parent award report block reply Transparency 3 points 4 days ago The guy that dropped the bomb on J6 Not likely that it was a \"guy\". permalink parent award report block reply\nsnoopy3210 -8 points 4 days ago The guy that dropped the bomb on J6 in the original video was much thinner.. this another fake news permalink parent award report block reply Transparency 3 points 4 days ago The guy that dropped the bomb on J6 Not likely that it was a \"guy\". permalink parent award report block reply\nTransparency 3 points 4 days ago The guy that dropped the bomb on J6 Not likely that it was a \"guy\". permalink parent award report block reply\nKekistanPM 12 points 4 days ago \"You may have been right this time, but you're still a conspiracy theorist.\" permalink parent award report block reply shatmaself 2 points 4 days ago And the 10 times before that permalink parent award report block reply austford OP 2 points 4 days ago lol guilty permalink parent award report block reply\nshatmaself 2 points 4 days ago And the 10 times before that permalink parent award report block reply\naustford OP 2 points 4 days ago lol guilty permalink parent award report block reply\nRudy_DankMemer 7 points 4 days ago that part will never get old, or tiresome. my family found me a shirt for me last year for my bday that reads: I Grow My Beard & I Know Things What does suck is watching nothing ever happen to those evil pedo overlords. permalink parent award report block reply\nKernalMustard 3 points 4 days ago I have this feeling every day around here. I think its because evidence based on logic and how people are. People lie and People suck. permalink parent award report block reply\nMrMcGreenGenes 33 points 4 days ago I feel like I'm owed a refund for my only visit ever to our nation's capital, along with millions for the malicious defamation. permalink award report block reply bananaguard62 23 points 4 days ago Malicious defamation is right! I lost family, friends,  and work for a peaceful 15min walk through the Rotunda; in large part due to the narrative strung together by the media and J6 committee. This was carefully orchestrated to smear Trump and his followers to shun them from polite society. It's a miracle he survived permalink parent award report block reply RichieSprouse 8 points 4 days ago I never went in.  The Capitol Police holding the doors open and waiving us through was too suspicious permalink parent award report block reply bananaguard62 6 points 4 days ago When I went to exit the officer holding the east rotunda doors yelled,  \"YOU'RE WORKING AGAINST YOURSELVES.  YOU NEED TO BE GOING IN, NOT OUT. IN!\". You can see me stop in the doorway,  think about it, then go back in.  Someone has video of him saying it,  but I haven't found it permalink parent award report block reply Lady_MaGa 3 points 4 days ago Trump has the hand of God with him. permalink parent award report block reply mohel 4 points 4 days ago How come nobody has been held responsible for such an obvious deception? permalink parent award report block reply\nbananaguard62 23 points 4 days ago Malicious defamation is right! I lost family, friends,  and work for a peaceful 15min walk through the Rotunda; in large part due to the narrative strung together by the media and J6 committee. This was carefully orchestrated to smear Trump and his followers to shun them from polite society. It's a miracle he survived permalink parent award report block reply RichieSprouse 8 points 4 days ago I never went in.  The Capitol Police holding the doors open and waiving us through was too suspicious permalink parent award report block reply bananaguard62 6 points 4 days ago When I went to exit the officer holding the east rotunda doors yelled,  \"YOU'RE WORKING AGAINST YOURSELVES.  YOU NEED TO BE GOING IN, NOT OUT. IN!\". You can see me stop in the doorway,  think about it, then go back in.  Someone has video of him saying it,  but I haven't found it permalink parent award report block reply Lady_MaGa 3 points 4 days ago Trump has the hand of God with him. permalink parent award report block reply\nRichieSprouse 8 points 4 days ago I never went in.  The Capitol Police holding the doors open and waiving us through was too suspicious permalink parent award report block reply bananaguard62 6 points 4 days ago When I went to exit the officer holding the east rotunda doors yelled,  \"YOU'RE WORKING AGAINST YOURSELVES.  YOU NEED TO BE GOING IN, NOT OUT. IN!\". You can see me stop in the doorway,  think about it, then go back in.  Someone has video of him saying it,  but I haven't found it permalink parent award report block reply\nbananaguard62 6 points 4 days ago When I went to exit the officer holding the east rotunda doors yelled,  \"YOU'RE WORKING AGAINST YOURSELVES.  YOU NEED TO BE GOING IN, NOT OUT. IN!\". You can see me stop in the doorway,  think about it, then go back in.  Someone has video of him saying it,  but I haven't found it permalink parent award report block reply\nLady_MaGa 3 points 4 days ago Trump has the hand of God with him. permalink parent award report block reply\nmohel 4 points 4 days ago How come nobody has been held responsible for such an obvious deception? permalink parent award report block reply\nbananaguard62 20 points 4 days ago Since we know there was a conspiracy to entrap J6ers and the CP were involved, we need to see how close she was to the CP officers that were suicided. They may have been loose ends. This is the smoking gun to show that it was orchestrated by our own government. J6ers deserve a public apology in the form of millions dollars permalink award report block reply JoinTheDiscussion 7 points 4 days ago Na, just a front row seat at the gallows permalink parent award report block reply\nJoinTheDiscussion 7 points 4 days ago Na, just a front row seat at the gallows permalink parent award report block reply\nSavingPrivateGrace 16 points 4 days ago Nancy Pelosi was part of the inside job.  Her entire existence as an inside trader is who she really is. permalink award report block reply\nKneadThePeople 10 points 4 days ago Who is going to pay for all the time I spent behind bars? permalink award report block reply\ndjentropyhardcore 6 points 4 days ago Who was it? permalink award report block reply ninabobby 14 points 4 days ago According to a gait analysis- https://www.theblaze.com/news/former-capitol-police-officer-a-forensic-match-for-jan-6-pipe-bomber-sources-say permalink parent award report block reply realsolidsnakeoil 19 points 4 days ago Kerkhoff, who was a Capitol Police officer for four and a half years, left the department in mid-2021 for a security detail at the Central Intelligence Agency, sources told Blaze News. I hate this fucking planet. permalink parent award report block reply Whatyougotson 8 points 4 days ago She....went to work for the c.i.a??? you've got to be kidding me permalink parent award report block reply ParticleCannon 5 points 4 days ago Groomed permalink parent award report block reply view 2 more comments... fat50 1 points 4 days ago Odds are, she was already employed there. permalink parent award report block reply djentropyhardcore 3 points 4 days ago Thanks pedes! permalink parent award report block reply fat50 1 points 4 days ago IT'S ALWAYS THE FUCKING CIA!!!! permalink parent award report block reply gustodog 2 points 4 days ago But didn't a FBI whistleblower claim the perp they found, and were told to stand down on, was a retired US Navy master sergeant? permalink parent award report block reply\nninabobby 14 points 4 days ago According to a gait analysis- https://www.theblaze.com/news/former-capitol-police-officer-a-forensic-match-for-jan-6-pipe-bomber-sources-say permalink parent award report block reply realsolidsnakeoil 19 points 4 days ago Kerkhoff, who was a Capitol Police officer for four and a half years, left the department in mid-2021 for a security detail at the Central Intelligence Agency, sources told Blaze News. I hate this fucking planet. permalink parent award report block reply Whatyougotson 8 points 4 days ago She....went to work for the c.i.a??? you've got to be kidding me permalink parent award report block reply ParticleCannon 5 points 4 days ago Groomed permalink parent award report block reply view 2 more comments... fat50 1 points 4 days ago Odds are, she was already employed there. permalink parent award report block reply djentropyhardcore 3 points 4 days ago Thanks pedes! permalink parent award report block reply fat50 1 points 4 days ago IT'S ALWAYS THE FUCKING CIA!!!! permalink parent award report block reply gustodog 2 points 4 days ago But didn't a FBI whistleblower claim the perp they found, and were told to stand down on, was a retired US Navy master sergeant? permalink parent award report block reply\nrealsolidsnakeoil 19 points 4 days ago Kerkhoff, who was a Capitol Police officer for four and a half years, left the department in mid-2021 for a security detail at the Central Intelligence Agency, sources told Blaze News. I hate this fucking planet. permalink parent award report block reply Whatyougotson 8 points 4 days ago She....went to work for the c.i.a??? you've got to be kidding me permalink parent award report block reply ParticleCannon 5 points 4 days ago Groomed permalink parent award report block reply view 2 more comments... fat50 1 points 4 days ago Odds are, she was already employed there. permalink parent award report block reply djentropyhardcore 3 points 4 days ago Thanks pedes! permalink parent award report block reply fat50 1 points 4 days ago IT'S ALWAYS THE FUCKING CIA!!!! permalink parent award report block reply\nWhatyougotson 8 points 4 days ago She....went to work for the c.i.a??? you've got to be kidding me permalink parent award report block reply ParticleCannon 5 points 4 days ago Groomed permalink parent award report block reply view 2 more comments... fat50 1 points 4 days ago Odds are, she was already employed there. permalink parent award report block reply\nParticleCannon 5 points 4 days ago Groomed permalink parent award report block reply view 2 more comments...\nfat50 1 points 4 days ago Odds are, she was already employed there. permalink parent award report block reply\ndjentropyhardcore 3 points 4 days ago Thanks pedes! permalink parent award report block reply\nfat50 1 points 4 days ago IT'S ALWAYS THE FUCKING CIA!!!! permalink parent award report block reply\ngustodog 2 points 4 days ago But didn't a FBI whistleblower claim the perp they found, and were told to stand down on, was a retired US Navy master sergeant? permalink parent award report block reply\nRetard_Strength 5 points 4 days ago Is Blaze putting this out there because they are 100% sure? And forcing Kash to do something? permalink award report block reply Klaus73 5 points 4 days ago Well are they putting their money where their mouth is and opening up to possible defamation if wrong? permalink parent award report block reply sorrytodisagree 2 points 4 days ago By what happened to Giuliani, Trump, Mike Lindell, and Alex Jones they could be found liable for defamation even when they're right. permalink parent award report block reply\nKlaus73 5 points 4 days ago Well are they putting their money where their mouth is and opening up to possible defamation if wrong? permalink parent award report block reply sorrytodisagree 2 points 4 days ago By what happened to Giuliani, Trump, Mike Lindell, and Alex Jones they could be found liable for defamation even when they're right. permalink parent award report block reply\nsorrytodisagree 2 points 4 days ago By what happened to Giuliani, Trump, Mike Lindell, and Alex Jones they could be found liable for defamation even when they're right. permalink parent award report block reply\nWarViper1337 5 points 4 days ago How many people have been arrested for this so far? permalink award report block reply\nNoMoreShinesBilly 5 points 4 days ago but what about SNAP?  and stealing more money from American citizens to finance the illegal alien invaders? permalink award report block reply\nhighenergywinning 4 points 4 days ago Bondi ? Anyone? Bondi? permalink award report block reply chickeninoven 5 points 4 days ago The princess you're looking for is at another news outlet. permalink parent award report block reply TrumpAndSimpsNotMAGA 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nchickeninoven 5 points 4 days ago The princess you're looking for is at another news outlet. permalink parent award report block reply\nTrumpAndSimpsNotMAGA 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nRucktoe 4 points 4 days ago Will the lunatics on reddit that were so wrong self reflect on this?  Nope. permalink award report block reply\n45fan 4 points 4 days ago Alright Bongino you got the suspect you were chomping at the bit to get. Now what? permalink award report block reply\nIvIA6A 3 points 4 days ago I knew it was either FBI or CIA that did it. They knew exactly who it was based on cell phone records. Turns out to be capitol police working for the CIA permalink award report block reply tdtech9 3 points 4 days ago And the same report says she moved jobs, from the CP to the CIA, afterwards. permalink parent award report block reply\ntdtech9 3 points 4 days ago And the same report says she moved jobs, from the CP to the CIA, afterwards. permalink parent award report block reply\nJoeMcCarthyWasRight 2 points 4 days ago She’s an employee. There’s a chain of traitors who have this traitor her orders. The American people want them executed. permalink award report block reply\nPrandogolio 2 points 4 days ago I used to pipe bomb womp rats back home permalink award report block reply H0rse 1 points 4 days ago A PIPE BOMB JUST FLEW OVER MY HOUSE! permalink parent award report block reply\nH0rse 1 points 4 days ago A PIPE BOMB JUST FLEW OVER MY HOUSE! permalink parent award report block reply\nNellie_the_Beaut 2 points 4 days ago How many indictments and prosecutions have cited this “bombing attempt at the DNC headquarters” in the evidence against President Trump, his cabinet, staff and Americans who attended the January 6th rally? permalink award report block reply\nBlueKentuckyGirl 1 points 4 days ago This better be put in the national news permalink award report block reply\nBlueKentuckyGirl 1 points 4 days ago American citizenry walking around with their fingers in their ears singing lalalala all while wearing horse blinders. It does get frustrating permalink award report block reply\nRyanKeyOh 1 points 4 days ago Has this been confirmed? Not doubting it, just want to read more permalink award report block reply\nBramage 1 points 4 days ago ...and the actual punishment starts when... permalink award report block reply\nTheOriginalBrickBot 1 points 4 days ago S tier meme permalink award report block reply\nCanadianMeathead 1 points 4 days ago Where is the proof? permalink award report block reply mullethawk 2 points 4 days ago Her next door neighbor's address was \"tied to a vehicle that picked up the bomb suspect,\" whatever that means. And the same neighbor's DC Metrorail SmarTrip card was \"allegedly\" used by the bomb suspect. So there's that in addition to the gait analysis. permalink parent award report block reply CanadianMeathead 1 points 4 days ago Still pretty stretched. permalink parent award report block reply\nmullethawk 2 points 4 days ago Her next door neighbor's address was \"tied to a vehicle that picked up the bomb suspect,\" whatever that means. And the same neighbor's DC Metrorail SmarTrip card was \"allegedly\" used by the bomb suspect. So there's that in addition to the gait analysis. permalink parent award report block reply CanadianMeathead 1 points 4 days ago Still pretty stretched. permalink parent award report block reply\nCanadianMeathead 1 points 4 days ago Still pretty stretched. permalink parent award report block reply\nxBigCoffinHunter 1 points 4 days ago It’s the new Spoiler Alert permalink award report block reply\nStolen 0 points 4 days ago The issue isn't that this was a Fedsurrection. The issue is that MAGA doesn't think that MAGA could have rioted. permalink award report block reply\nTheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply"
}