{
  "id": "1ARK9hiHY6",
  "url": "https://patriots.win/p/1ARK9hiHY6/poland-without-fake-asylum-seeke/c",
  "content": "347 Poland without fake asylum seekers is a paradise. We need more Poland and less EU. posted 2 days ago by ALT26 20 comments award share report block RadioGenoa @RadioGenoa • 4d Poland without fake asylum seekers is a paradise. We need more Poland and less EU.\n20 comments Sort by Top Top New Worst Old Save PenguinOfDoom 8 points 2 days ago I can't tell you how much I needed that. Just beautiful. permalink award report block reply Smurfection 2 points 2 days ago It was beautiful and a real day brightener for me too! permalink parent award report block reply Bullet3250 8 points 2 days ago When you love your children - this is the model for All Europe to follow. permalink award report block reply BBvarn 6 points 2 days ago Poland will save Western civilization. permalink award report block reply RealWomenLoveTrump 4 points 2 days ago Which is funny, because, as a GenXer, when we wanted to call someone retarded, we called them a Pollack! Not so funny anymore :) permalink parent award report block reply NotYourMan 3 points 2 days ago Poland is showing Europe the path to restore itself to greatness because the EU has created chaos and the eventual fall of European countries into liberal fascism and totalitarian rule. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 2 days ago Again? permalink parent award report block reply ACActual 5 points 2 days ago White Culture is beautiful permalink award report block reply DrVSGGEOTUSPhD 3 points 2 days ago The wholesome level....it's over 9000 permalink award report block reply MadRussian 3 points 2 days ago No joggers or street shitters either. permalink award report block reply NotYourMan 3 points 2 days ago No reason for any European country to take in violent criminals from other countries.  No reason for successful Germany or France to take in asylum seekers, no reason.  No reason for the UK to import violent criminals from other countries that will never assimilate into the culture.  This is nothing more than replacement of the indigenous people to create chaos and justify tyranny. permalink award report block reply Smurfection 1 points 2 days ago The moment a white country let's the darkies play Dey kultur games, this stuff ends because some homeless bum walks in and starts shouting incoherent crap or some Muslim gets offended because music is haram or a Jew complains that there was a Christian song and it was done in a Church and Jews shrivel and shrink like vampires if they get close to a crucifix or something like that.  Or maybe it's flashbacks to Auschwitz were half of the people murdered there were Jewish. permalink parent award report block reply Smurfection 1 points 2 days ago It's cause lefties spend their youth laughing at and mocking these types of things and then when and if they have their own kids, can't raise the kids with enough discipline and respect to participate in something like this. permalink award report block reply deleted 1 points 2 days ago Smurfection 2 points 2 days ago really?  You think?  They're issuing pronouncements and laws for the entirety of Europe and the globe respectfully though....  Maybe, just maybe, they think they are the government of Europe and the world. permalink parent award report block reply uxername27 -1 points 2 days ago Think of the EU as a worse version of your federal government. Each european country is like a state, but they are all melted in a super-country like the USA, but more tyrannical. permalink parent award report block reply greatpumpkin 1 points 2 days ago If only they weren't subject to the EU's censorship crackdown .... permalink award report block reply auntjemima 1 points 2 days ago Paradise being simply what was normal 30yrs ago. permalink award report block reply South_Florida_Guy 1 points 2 days ago Huwhyte peepul ain't got no culcha n sheeit! permalink award report block reply OpusX 1 points 2 days ago Beautiful. permalink award report block reply\nPenguinOfDoom 8 points 2 days ago I can't tell you how much I needed that. Just beautiful. permalink award report block reply Smurfection 2 points 2 days ago It was beautiful and a real day brightener for me too! permalink parent award report block reply\nSmurfection 2 points 2 days ago It was beautiful and a real day brightener for me too! permalink parent award report block reply\nBullet3250 8 points 2 days ago When you love your children - this is the model for All Europe to follow. permalink award report block reply\nBBvarn 6 points 2 days ago Poland will save Western civilization. permalink award report block reply RealWomenLoveTrump 4 points 2 days ago Which is funny, because, as a GenXer, when we wanted to call someone retarded, we called them a Pollack! Not so funny anymore :) permalink parent award report block reply NotYourMan 3 points 2 days ago Poland is showing Europe the path to restore itself to greatness because the EU has created chaos and the eventual fall of European countries into liberal fascism and totalitarian rule. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 2 days ago Again? permalink parent award report block reply\nRealWomenLoveTrump 4 points 2 days ago Which is funny, because, as a GenXer, when we wanted to call someone retarded, we called them a Pollack! Not so funny anymore :) permalink parent award report block reply\nNotYourMan 3 points 2 days ago Poland is showing Europe the path to restore itself to greatness because the EU has created chaos and the eventual fall of European countries into liberal fascism and totalitarian rule. permalink parent award report block reply\nDrVSGGEOTUSPhD 2 points 2 days ago Again? permalink parent award report block reply\nACActual 5 points 2 days ago White Culture is beautiful permalink award report block reply\nDrVSGGEOTUSPhD 3 points 2 days ago The wholesome level....it's over 9000 permalink award report block reply\nMadRussian 3 points 2 days ago No joggers or street shitters either. permalink award report block reply\nNotYourMan 3 points 2 days ago No reason for any European country to take in violent criminals from other countries.  No reason for successful Germany or France to take in asylum seekers, no reason.  No reason for the UK to import violent criminals from other countries that will never assimilate into the culture.  This is nothing more than replacement of the indigenous people to create chaos and justify tyranny. permalink award report block reply Smurfection 1 points 2 days ago The moment a white country let's the darkies play Dey kultur games, this stuff ends because some homeless bum walks in and starts shouting incoherent crap or some Muslim gets offended because music is haram or a Jew complains that there was a Christian song and it was done in a Church and Jews shrivel and shrink like vampires if they get close to a crucifix or something like that.  Or maybe it's flashbacks to Auschwitz were half of the people murdered there were Jewish. permalink parent award report block reply\nSmurfection 1 points 2 days ago The moment a white country let's the darkies play Dey kultur games, this stuff ends because some homeless bum walks in and starts shouting incoherent crap or some Muslim gets offended because music is haram or a Jew complains that there was a Christian song and it was done in a Church and Jews shrivel and shrink like vampires if they get close to a crucifix or something like that.  Or maybe it's flashbacks to Auschwitz were half of the people murdered there were Jewish. permalink parent award report block reply\nSmurfection 1 points 2 days ago It's cause lefties spend their youth laughing at and mocking these types of things and then when and if they have their own kids, can't raise the kids with enough discipline and respect to participate in something like this. permalink award report block reply\ndeleted 1 points 2 days ago Smurfection 2 points 2 days ago really?  You think?  They're issuing pronouncements and laws for the entirety of Europe and the globe respectfully though....  Maybe, just maybe, they think they are the government of Europe and the world. permalink parent award report block reply uxername27 -1 points 2 days ago Think of the EU as a worse version of your federal government. Each european country is like a state, but they are all melted in a super-country like the USA, but more tyrannical. permalink parent award report block reply\nSmurfection 2 points 2 days ago really?  You think?  They're issuing pronouncements and laws for the entirety of Europe and the globe respectfully though....  Maybe, just maybe, they think they are the government of Europe and the world. permalink parent award report block reply uxername27 -1 points 2 days ago Think of the EU as a worse version of your federal government. Each european country is like a state, but they are all melted in a super-country like the USA, but more tyrannical. permalink parent award report block reply\nuxername27 -1 points 2 days ago Think of the EU as a worse version of your federal government. Each european country is like a state, but they are all melted in a super-country like the USA, but more tyrannical. permalink parent award report block reply\ngreatpumpkin 1 points 2 days ago If only they weren't subject to the EU's censorship crackdown .... permalink award report block reply\nauntjemima 1 points 2 days ago Paradise being simply what was normal 30yrs ago. permalink award report block reply\nSouth_Florida_Guy 1 points 2 days ago Huwhyte peepul ain't got no culcha n sheeit! permalink award report block reply\nOpusX 1 points 2 days ago Beautiful. permalink award report block reply",
  "fetched_at": "2025-11-12T23:15:55.199979Z"
}