{
  "id": "1ARK5BHQJl",
  "url": "https://patriots.win/p/1ARK5BHQJl/americans-are-literally-going-to/c",
  "content": "345 \"Americans are literally going to bed each night worried that the next big layoff wave will hit them. \n\nUnlimited labor pools have distorted the labor market to such a degree that good and productive employees are no longer “safe.”\" posted 3 days ago by bleeje 4 comments award share report block Nick Plumb @PlumbNick • 3d @IngrahamAngle Americans are literally going to bed each night worried that the next big layoff wave will hit them. Unlimited labor pools have distorted the labor market to such a degree that good and productive employees are no longer “safe.”\n4 comments Sort by Top Top New Worst Old Save Around the Web breadbaker 9 points 3 days ago Yeah, should be tariffed if US labor does not constitute 75% by value, time, and number of persons. permalink award report block reply Standingoak 4 points 3 days ago Will that include US built Robots ? Better to thin out the foreign bleeders before the hydraulic fluid boys get going strong. permalink parent award report block reply breadbaker 4 points 3 days ago On the money. permalink award report block reply PatriotDescendant 2 points 2 days ago Yeah, and they fire 3K workers at one end of the company without giving them a chance to take the place of the h1bs. They should be required to post ALL of the positions currently staffed by H1Bs and allow \"about to be terminated\" workers a chance to vie for those positions. Fire the invaders! permalink award report block reply\nbreadbaker 9 points 3 days ago Yeah, should be tariffed if US labor does not constitute 75% by value, time, and number of persons. permalink award report block reply Standingoak 4 points 3 days ago Will that include US built Robots ? Better to thin out the foreign bleeders before the hydraulic fluid boys get going strong. permalink parent award report block reply\nStandingoak 4 points 3 days ago Will that include US built Robots ? Better to thin out the foreign bleeders before the hydraulic fluid boys get going strong. permalink parent award report block reply\nbreadbaker 4 points 3 days ago On the money. permalink award report block reply\nPatriotDescendant 2 points 2 days ago Yeah, and they fire 3K workers at one end of the company without giving them a chance to take the place of the h1bs. They should be required to post ALL of the positions currently staffed by H1Bs and allow \"about to be terminated\" workers a chance to vie for those positions. Fire the invaders! permalink award report block reply",
  "fetched_at": "2025-11-12T23:05:14.359698Z"
}