{
  "id": "8181173",
  "title": "1967The only thing the Schumer Shutdown accomplished was alerting Americans that 59% of Illegal-Head",
  "url": "https://patriots.win/p/1ARK9iqP1H/the-only-thing-the-schumer-shutd/c",
  "content": "1967 The only thing the Schumer Shutdown accomplished was alerting Americans that 59% of Illegal-Headed Households receive American taxpayer funded welfare.\n\nThere’s no going back now.\n\nThanks Chuck! posted 2 days ago by blue5707 122 comments award share report block C3 @C_3C_3 • 2d The only thing the Schumer Shutdown accomplished was alerting Americans that 59% of Illegal-Headed Households receive American taxpayer funded welfare. There’s no going back now. Thanks Chuck!\n122 comments Sort by Top Top New Worst Old Save JoeBidensDementia1 117 points 2 days ago If we have this data, we have their addresses, too. Deport them all! permalink award report block reply LiveFreeInXorDie 33 points 2 days ago \"Gotta deport 'em all!\" permalink parent award report block reply MastaJoda 9 points 2 days ago Even the freeloading ''legal migrants.'' Holy shit think of the money saved. Why in tf do we subsidize immigration? If you come here you damn well better be able to pull your own weight ffs. I want 10 yr moritorium on ALL immigration. This shit is ridiculous. permalink parent award report block reply Cacciali_Via 2 points 1 day ago In 1925, we halted immigration for 40yrs. We need to do it again. permalink parent award report block reply aoneleggedduck 7 points 2 days ago with Ash Deportem, 10 year old kid destined to be an UndokuMon master! permalink parent award report block reply Deportthemall23 -3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply Get_Off_Big_Tech 3 points 2 days ago Pokémon go back to your country! permalink parent award report block reply breadbaker -31 points 2 days ago This is just crappy outrage bait. Illegal-headed household can mean there are US born kids receiving benefits that they are clearly and legally entitled to. I don't think this is the win anyone says it is beyond the notion that illegals are really poor and not the future doctors or engineers that wandered over the border. permalink parent award report block reply LiveFreeInXorDie 34 points 2 days ago Spawn of illegals receiving citizen benefits is outrageous, whether or not it's legal in a court of law. permalink parent award report block reply Simple_Doot 32 points 2 days ago You've made a great argument to end birthright citizenship. permalink parent award report block reply MastaJoda 7 points 2 days ago All in favor? Yay permalink parent award report block reply 420praiseit894 24 points 2 days ago Anchor baby citizenship also needs to go. And I wouldn't call them poor so much as exploiting the system. Plenty of leeches receiving tens of thousands of dollars for nothing. Getting a decent living off the backs of the taxpayer isn't poverty. permalink parent award report block reply hansgruber7 17 points 2 days ago It's still a problem and the illegals should not be here. permalink parent award report block reply Awakened 10 points 2 days ago You all have to go back. permalink parent award report block reply BurtMcGirt 3 points 2 days ago With their anchor babies permalink parent award report block reply load 6 more comments... BlackPilledMAGA 12 points 2 days ago Exactly! Go through every tax roll in every state city and town and identify which owners are citizens and which aren't. The ones who are here illegally, seize the property and deport them. Sell the property at public auctions and after all of their legal costs and property taxes are paid current give them back what's left and permanently ban them from America. permalink parent award report block reply booblitchutz 11 points 2 days ago \"noooo you can't just take our slaves AGAIN!!!\" permalink parent award report block reply anotherthing 1 points 1 day ago At least back before the Civil War, they paid for their own slaves out of their own pockets. permalink parent award report block reply TheThreeSeashells 4 points 2 days ago Unfortunately, the answer we're going to get is \"We have this data, we have their addresses, too...now all we're going to do is start paying them again rather than kicking them out or, after discovering they gave fake addresses, shutting down all payments to those invaders immediately.\" permalink parent award report block reply GodSaveTheWest 4 points 2 days ago The legal immigrants need to be looked at too. Why the fuck are we letting in people who leech off the system? permalink parent award report block reply JoeBidensDementia1 6 points 2 days ago Only about 2% of Japanese immigrants are on welfare. But nearly 49% of those from Laos are. Thomas Sowell permalink parent award report block reply Cacciali_Via 2 points 1 day ago I have some Hmong aquantances/friends. They are good net tax contributors, but I also know that historically the Hmong people used to have a written language. Somehow along the way they devolved and lost the ability to write in their language. Eventually they started using the roman alphabet to phonetically recreate their spoken language but nobody knows what the original written characters even look like. In other words, they are the jungle Asians and not the smarter snow Asians. permalink parent award report block reply ModernKnight 67 points 2 days ago Oof, that chart hurts to look at.  The 52% of legal immigrants receiving benefits is horrible also.  We shouldn't have any gibs.  If gibs ARE to be had, though, all foreigners should be disqualified from receiving said gibs. Edit to add: I also do not, for a second, believe those housing assistance numbers. permalink award report block reply realPhantomFuck 41 points 2 days ago Seriously. WHAT benefit is a person who immigrates here just to leech? They are a net negative and should be removed Edit: I appreciate the responses and I know the why . It’s just insane to me that this is accepted because they’re “legal.” It shouldn’t even be possible to get on assistance as a new citizen permalink parent award report block reply John_Smallberries 18 points 2 days ago They're a benefit to the democrat communists due to the swaying of census numbers. permalink parent award report block reply BlackPilledMAGA 8 points 2 days ago SCOTUS needs to clarify that immediately and permanently remove all illegals from the census count. Non-citizens were never intended to count towards congressional representation and federal funding. Once they no longer count towards federal funding or congressional seats all of the leftist politicians will drop them in an instant. The pandering will end forever. permalink parent award report block reply PROCIsAsshoe 11 points 2 days ago In response to your question, there are two answers -- A Democrats internal monologue: \"They'll vote Democrat forever!\" A Democrats public reply: \"They bring diversity and enrich our culture!\" permalink parent award report block reply SDsc0rch 10 points 2 days ago some people work for a living some people VOTE for a living (!!!) permalink parent award report block reply rebuildingMyself 5 points 2 days ago It's a benefit to them because while you study hard and pray you'll get a job so you can afford a house and family some day, they drop three kids and make you pay for it. Its a benefit to the Uniparty since they cannot control our minds as effectively anymore so need to replace us. permalink parent award report block reply 420praiseit894 3 points 2 days ago And social security will turn into an avalanche when our population stabilizes or starts decreasing, because it's a pyramid scheme. Which isn't an excuse. In my opinion, fuck it, pull that pin. It's better than destroying our society by importing third worlders. permalink parent award report block reply booblitchutz 4 points 2 days ago Slaves. Their labor is to vote democrat and in return they get taken care of. permalink parent award report block reply The_Emperor 1 points 2 days ago Whole agencies encourage this permalink parent award report block reply load 2 more comments... deleted 19 points 2 days ago movetofirefox 12 points 2 days ago Forever, end of story. permalink parent award report block reply that_sound 5 points 2 days ago Forever. If they can't make it here, they can go back to wherever they are from. We only want the best immigrants. And the numbers should be based exclusively on the labor needs of the nation. permalink parent award report block reply Awakened 2 points 2 days ago No never. The should all be sent back period. Sheesh. If this is where the average poster here is at, it truly is hopeless. Everyone wants to be charitable with someone else's money. permalink parent award report block reply Fren20 -1 points 2 days ago Ten years nobody has ever helped me, your one crazy mothetfucker not with my tax money,you must have money 🤑🤑🤑🤑 permalink parent award report block reply Fren20 -1 points 2 days ago Hell no you moron,I never got any help ,are you fucking stupid no ten years,you must have money 🤑🤑🤑 not my taxes..but feel free to give me your ten years of free money permalink parent award report block reply Wrexxis780 15 points 2 days ago ANY foreigner should NOT get any gibs ANY American getting gibs should be owned by the government and should be given reasonable jobs or community service to earn it. If they want out, get a real job. permalink parent award report block reply rebuildingMyself 8 points 2 days ago I'd be okay with someone on gibs losing their right to vote until they are once again independent permalink parent award report block reply Aquamine-Amarine -5 points 2 days ago Slippery slope. Lots of people here want to steal voting rights. It's a bad idea. Requirements for welfare should be really strict. The amount you get should depend on your situation. Single people can get money, obviously not as much as a family though. Single mothers should NOT get any money unless they're married to the kid's father. They take advantage of the system too much. Young adults taking care of younger siblings because their parents are dead can get money for the kid. Illegals get absolutely nothing. Deport. permalink parent award report block reply GodSaveTheWest 8 points 2 days ago Wrong, every single dumb fuck having voting rights was never the intention of the founding fathers. The greeks knew it was dumb too as they were theorizing democracy. There absolutely should be restrictions on who can vote. Muh slippery slope isnt an argument here, its how it was meant to be. You should have to be a tax payer to have a say how our government spends tax money. Not be on public benefits as you'll just vote for more free stuff. Not have certain kinds of debt as you'll just vote for however promises to forgive it. Have signed up for the draft (women signing up being optional. if they want to vote equally, they can risk dying in war equally.) In addition to that there should be a basic test when registering to vote. Too many idiots voting with no idea how our government even works or any knowledge of history or economics. permalink parent award report block reply ModernKnight 6 points 2 days ago Universal franchise was a bad idea.  The founders knew it.  \"When the people find that they can vote themselves money, that will herald the end of the republic.\"  Remove ALL gibs, or get those receiving them off the voter rolls. permalink parent award report block reply TheThreeSeashells 4 points 2 days ago I'd rather start with mandatory drug and alcohol testing, no smoking, and zero tolerance when those rules are broken.  Sorry, but if you're taking my money, you don't get to waste it on things you don't need, most of which will only lead to negative actions resulting in more theft of taxpayer money. I'd also be willing to throw in that they lose some benefits if they give birth.  Once again, if you need government handouts to survive, you shouldn't be making it harder to survive without taking more government money.  The \"childbirth\" clause could be offset should the recipient at least get a part-time job. permalink parent award report block reply ColbyP 3 points 2 days ago Taking away voting rights is both good, and consistent with the Founder's philosophy. They didn't write in everyone being allowed to vote in the constitution for good reason: many people shouldn't be allowed to. They didn't believe that the dregs and leeches of society should have a say, and would be ashamed that we ever gave them one. permalink parent award report block reply view 1 more comments... throttlejohnson 6 points 2 days ago also the 39% US born on welfare is fucking sad... permalink parent award report block reply booblitchutz 6 points 2 days ago Not as sad as the fact that the majority of fucking people who come to this country are leeches! permalink parent award report block reply booblitchutz 2 points 2 days ago 39% of US born households are on some kind of welfare though. That's bad enough! permalink parent award report block reply load 1 more comments... Formerlurker92 25 points 2 days ago The purple and orange categories need to be completely eliminated permalink award report block reply RespectMySafeSpace 20 points 2 days ago No immigrants should be getting any kind of welfare. Period. permalink parent award report block reply monkadelic 2 points 2 days ago you get what you incentivize. permalink parent award report block reply Awakened 21 points 2 days ago The orange and purple graphs need to both be zero. This is criminal and those responsible would be tried for treason and hanged in a serious country, but we live in 🤡🌎 permalink award report block reply CDean 20 points 2 days ago I don't understand this. The i134 immigration form clearly states the requirement of the sponsor to financially support the benefactor. How do they get welfare? They should be deported. permalink award report block reply SanityGumby 16 points 2 days ago Democrats are violating the law to give it to them. SNAP was already illegal to give to illegals but they did it anyway. permalink parent award report block reply Hangmhigh 16 points 2 days ago This is infurating. Our quailty of life is being desroyed and the globalists respoaible need to have their yachts sunk. permalink award report block reply Serulin 13 points 2 days ago Why are we subsidizing legal immigrants too?? permalink award report block reply worldowedexplanation 4 points 2 days ago Because Democrats need someone to clean their bathrooms, they’re too fat to do it themselves permalink parent award report block reply DeportThemAllForever 3 points 2 days ago This permalink parent award report block reply RizzlieDoodad 6 points 2 days ago IDK why everyone is celebrating. The Republicans voted for no changes to the Biden spending budget except the ACA stuff permalink award report block reply shockpurseyell 3 points 2 days ago It’s only a matter of hours before we find out how added money they just pumped into SNAP, along with restoring all govt workers, with back pay. So much for shrinking govt. permalink parent award report block reply RizzlieDoodad 3 points 1 day ago We don't have an America first government. We have a government compromised by Epstein permalink parent award report block reply Michalusmichalus 1 points 2 days ago When I think of inflation, that's fine. Less spending power. permalink parent award report block reply WhoDecidedThat 4 points 2 days ago Realize that means that their kids are also illegals without the false interpretation of birthright. Meaning 60% of welfare is illegals not just households permalink award report block reply FORMERCHILDSTAR 4 points 2 days ago Illegal immigration is a net loss on so many levels. We're sacrificing our country and being forced to pay the tab for it simultaneously. We don't have political leaders, we have professional extortionists. permalink award report block reply 3stepsahead 3 points 2 days ago Cut off their money.  No illegal or immigrant should receive any taxpayer money.  This should be the biggest layup ever. permalink award report block reply suckmycorona 3 points 2 days ago If diversity is strength then why do they need so much help? permalink award report block reply Crappydatum 3 points 2 days ago The USA population has ZERO idea of this, since it is being actively withheld from every Misleadia outlet! While we laugh at the stupidity of getting \"information\" from such an unreliable source, 95% of your neighbors don't know any better permalink award report block reply HunterBidensPC 3 points 2 days ago Hi, critical thinker here. Just wondering how we could have this data which shows the number of illegals on welfare but we can’t somehow just “turn off the faucet” for those households and send ICE out to deport them and let their anchor babies decide if they want to stay until we can kick them out too? permalink award report block reply Michalusmichalus 2 points 2 days ago Because of all the ,\" that's not happening\" bullshit. permalink parent award report block reply Mechanicalmind 2 points 2 days ago And they will continue to collect. permalink award report block reply Maga2015bis 2 points 2 days ago While I support legal immigration, unless they are real refugees they should not receive any welfare either. Too many chain migration recipients take advantage of the U.S. welfare. permalink award report block reply keeman 2 points 2 days ago It accomplished showing some of us actual conservatives that the R party will declare victory when passing an extension of the previous D administration's cartoonishly bloated budget.  R party has both houses of Congress, the presidency and SCOTUS and best we can do is just block the Ds from increasing spending ever further and then congratulate ourselves on how amazing we are. permalink award report block reply LiveFreeInXorDie 2 points 2 days ago Found the sauce: https://cis.org/Report/Welfare-Use-Immigrants-and-USBorn permalink award report block reply SanityGumby 2 points 2 days ago Exactly. Anyone here saying that Democrats won needs to be deported because they are part of an op. Democrats gained literally nothing while exposing all of the tax fraud they committed. permalink award report block reply Induceddrag 2 points 2 days ago We have to be cautious in this assumption.   Low info voters are being bombarded by the media telling people it is the GOP cutting SNAP and hiking Obamacare prices. The right needs to get the message out that the ACA subsidy debacle was built into the original bill, and roll out all the Obama promises. permalink award report block reply Aoikaze2000 2 points 2 days ago Y'know, time for dual citizenship to end.  You're either an American or you aren't. And with it, it's long overdue to send all of the illegals back home.  We don't want them here, we don't need them here, they have to go home. permalink award report block reply noPTSDforMePlease 2 points 1 day ago 40% of Americans are on welfare. Wow. We have a hollow economy. permalink award report block reply Bicentennial76 1 points 1 day ago Its insane.  We already have socialism permalink parent award report block reply ElectionMeddler 2 points 2 days ago You can pick up your welfare benefits at your local ICE detention facility. Remember to bring your real ID permalink award report block reply SavingPrivateGrace 2 points 2 days ago The Schumer shutdown also exposed the EBT fraud as many tik tok videos revealed they sell the money on the card for weed and drugs.  Thanks Chuck! permalink award report block reply VirtusHonos 2 points 2 days ago the \"legal\" \"immigrants\" are close behind the illegal aliens. I say turn off all aid to non-citizens. The proposition behind their coming to live here was that they would be self-supporting, a fundamental American principal. Charity has limits. permalink award report block reply DarthEP 2 points 2 days ago Cannot Sustain Both Immigration And A Welfare State. This Is NOT Multiple Choice It's Either One Or The Other. permalink award report block reply Michalusmichalus 2 points 2 days ago It's designed failure. This is what all those NGO's were doing. When USAID got nixxed Redditpra were crying about losing their jobs. Most of them were wtf jobs. permalink parent award report block reply DarthEP 3 points 2 days ago From FDR To Cloward-Piven: Wave After Wave Of This BS permalink parent award report block reply SDsc0rch 2 points 2 days ago imagine if the great rush limbaugh were still alive            what would he be saying... permalink award report block reply 123breadman 2 points 2 days ago Housing is BS because illegals get 1 legal citizen to rent it out, then 20 move into one home. permalink award report block reply Chickensaurus 1 points 2 days ago It also polarized the left and created huge crowds at national protests. permalink award report block reply booblitchutz 2 points 2 days ago The \"huge crowds\" are the result of an extraordinarily well funded advertising campaign and organizational effort. The GOP doesn't have access to that kind of cash. The dems can simply reach into the pot and take all they want. permalink parent award report block reply Chickensaurus 1 points 2 days ago Some are indeed paid, but the vast majority are normal retards. permalink parent award report block reply booblitchutz 2 points 2 days ago Not what I said. permalink parent award report block reply Chickensaurus 1 points 2 days ago Yes, I understand yoyr point and don't disagree. And it's definitely mostly because of the paid influence peddling, professional signs, etc. The GOP has money. They spend it o n shit that doesn't help politically. permalink parent award report block reply Dem_slayer 1 points 2 days ago Illegals and legal immigrants should not get one fucking cent in aid.... wtf... permalink award report block reply Maskurbator 1 points 2 days ago If we got rid of all benefits, the US would be 80% white within two years. permalink award report block reply thp2034 1 points 2 days ago Hey now wait a minute. Didn't they say that Illegal Aliens were not eligible for welfare & other gubbermint bennies???\nDon't tell me we were lied to?!?! permalink award report block reply Live_free_or_die_55 1 points 2 days ago No more welfare !! Deport them all Now!! permalink award report block reply dres3 1 points 2 days ago Framework idea to lefties: \"Dis' monies coulda been goin' to y'alls EBTs.\" permalink award report block reply RandyMoss 1 points 2 days ago And Trump will sign a bill continuing the scam permalink award report block reply Shaffro 1 points 2 days ago Deport the parasites. I am sick of them. permalink award report block reply least_counties_ever 1 points 2 days ago We’re subsidizing someone else’s cheap labor. permalink award report block reply mohel 1 points 2 days ago News at 11. Americans are dumber than anyone could have expected. permalink award report block reply GottaMemberMyPW 1 points 2 days ago Here’s a link to the report this chart is from. permalink award report block reply TheSHazDroid 1 points 2 days ago We will find out from now to the midterms if the new media has replaced.the influence of the old guard legacy news. I think that they are at near parity with a slight lead and momentum for the new media. IMHO I think more Americans learned more about how bad Obamacare is and the level of fraud in it.  And because the Dems stretched the shutdown to threaten SNAP benefits and now that was exposed  to even more Americans. Dems are trying to spike the football over winning 2 blue states and a deep blue city. But Mamdani is going to be talking point for the entire year leading up to the midterms. permalink award report block reply Stanwyk74 1 points 2 days ago Git their fake base out for the elections permalink award report block reply Pede 1 points 2 days ago It also accomplished exposing SNAP Americans. Now we all know that SNAP people are largely obese and are spending the money carelessly when they aren't committing fraud by selling it. permalink award report block reply BetaMan1313 1 points 2 days ago Chuck? More like cuck permalink award report block reply Vorgar 1 points 2 days ago 52% of legal immigrants receiving any is too high as well. permalink award report block reply Im_RickSteves_bitch 1 points 2 days ago I really doubt it's only 39% permalink award report block reply BigMikesChef 1 points 2 days ago Any \"legal\" immigrant on welfare needs to be deported immediately as well. permalink award report block reply FurtherRight 1 points 2 days ago Comment removed by community filter, pending further review. permalink award report block reply\nJoeBidensDementia1 117 points 2 days ago If we have this data, we have their addresses, too. Deport them all! permalink award report block reply LiveFreeInXorDie 33 points 2 days ago \"Gotta deport 'em all!\" permalink parent award report block reply MastaJoda 9 points 2 days ago Even the freeloading ''legal migrants.'' Holy shit think of the money saved. Why in tf do we subsidize immigration? If you come here you damn well better be able to pull your own weight ffs. I want 10 yr moritorium on ALL immigration. This shit is ridiculous. permalink parent award report block reply Cacciali_Via 2 points 1 day ago In 1925, we halted immigration for 40yrs. We need to do it again. permalink parent award report block reply aoneleggedduck 7 points 2 days ago with Ash Deportem, 10 year old kid destined to be an UndokuMon master! permalink parent award report block reply Deportthemall23 -3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply Get_Off_Big_Tech 3 points 2 days ago Pokémon go back to your country! permalink parent award report block reply breadbaker -31 points 2 days ago This is just crappy outrage bait. Illegal-headed household can mean there are US born kids receiving benefits that they are clearly and legally entitled to. I don't think this is the win anyone says it is beyond the notion that illegals are really poor and not the future doctors or engineers that wandered over the border. permalink parent award report block reply LiveFreeInXorDie 34 points 2 days ago Spawn of illegals receiving citizen benefits is outrageous, whether or not it's legal in a court of law. permalink parent award report block reply Simple_Doot 32 points 2 days ago You've made a great argument to end birthright citizenship. permalink parent award report block reply MastaJoda 7 points 2 days ago All in favor? Yay permalink parent award report block reply 420praiseit894 24 points 2 days ago Anchor baby citizenship also needs to go. And I wouldn't call them poor so much as exploiting the system. Plenty of leeches receiving tens of thousands of dollars for nothing. Getting a decent living off the backs of the taxpayer isn't poverty. permalink parent award report block reply hansgruber7 17 points 2 days ago It's still a problem and the illegals should not be here. permalink parent award report block reply Awakened 10 points 2 days ago You all have to go back. permalink parent award report block reply BurtMcGirt 3 points 2 days ago With their anchor babies permalink parent award report block reply load 6 more comments... BlackPilledMAGA 12 points 2 days ago Exactly! Go through every tax roll in every state city and town and identify which owners are citizens and which aren't. The ones who are here illegally, seize the property and deport them. Sell the property at public auctions and after all of their legal costs and property taxes are paid current give them back what's left and permanently ban them from America. permalink parent award report block reply booblitchutz 11 points 2 days ago \"noooo you can't just take our slaves AGAIN!!!\" permalink parent award report block reply anotherthing 1 points 1 day ago At least back before the Civil War, they paid for their own slaves out of their own pockets. permalink parent award report block reply TheThreeSeashells 4 points 2 days ago Unfortunately, the answer we're going to get is \"We have this data, we have their addresses, too...now all we're going to do is start paying them again rather than kicking them out or, after discovering they gave fake addresses, shutting down all payments to those invaders immediately.\" permalink parent award report block reply GodSaveTheWest 4 points 2 days ago The legal immigrants need to be looked at too. Why the fuck are we letting in people who leech off the system? permalink parent award report block reply JoeBidensDementia1 6 points 2 days ago Only about 2% of Japanese immigrants are on welfare. But nearly 49% of those from Laos are. Thomas Sowell permalink parent award report block reply Cacciali_Via 2 points 1 day ago I have some Hmong aquantances/friends. They are good net tax contributors, but I also know that historically the Hmong people used to have a written language. Somehow along the way they devolved and lost the ability to write in their language. Eventually they started using the roman alphabet to phonetically recreate their spoken language but nobody knows what the original written characters even look like. In other words, they are the jungle Asians and not the smarter snow Asians. permalink parent award report block reply\nLiveFreeInXorDie 33 points 2 days ago \"Gotta deport 'em all!\" permalink parent award report block reply MastaJoda 9 points 2 days ago Even the freeloading ''legal migrants.'' Holy shit think of the money saved. Why in tf do we subsidize immigration? If you come here you damn well better be able to pull your own weight ffs. I want 10 yr moritorium on ALL immigration. This shit is ridiculous. permalink parent award report block reply Cacciali_Via 2 points 1 day ago In 1925, we halted immigration for 40yrs. We need to do it again. permalink parent award report block reply aoneleggedduck 7 points 2 days ago with Ash Deportem, 10 year old kid destined to be an UndokuMon master! permalink parent award report block reply Deportthemall23 -3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply Get_Off_Big_Tech 3 points 2 days ago Pokémon go back to your country! permalink parent award report block reply breadbaker -31 points 2 days ago This is just crappy outrage bait. Illegal-headed household can mean there are US born kids receiving benefits that they are clearly and legally entitled to. I don't think this is the win anyone says it is beyond the notion that illegals are really poor and not the future doctors or engineers that wandered over the border. permalink parent award report block reply LiveFreeInXorDie 34 points 2 days ago Spawn of illegals receiving citizen benefits is outrageous, whether or not it's legal in a court of law. permalink parent award report block reply Simple_Doot 32 points 2 days ago You've made a great argument to end birthright citizenship. permalink parent award report block reply MastaJoda 7 points 2 days ago All in favor? Yay permalink parent award report block reply 420praiseit894 24 points 2 days ago Anchor baby citizenship also needs to go. And I wouldn't call them poor so much as exploiting the system. Plenty of leeches receiving tens of thousands of dollars for nothing. Getting a decent living off the backs of the taxpayer isn't poverty. permalink parent award report block reply hansgruber7 17 points 2 days ago It's still a problem and the illegals should not be here. permalink parent award report block reply Awakened 10 points 2 days ago You all have to go back. permalink parent award report block reply BurtMcGirt 3 points 2 days ago With their anchor babies permalink parent award report block reply load 6 more comments...\nMastaJoda 9 points 2 days ago Even the freeloading ''legal migrants.'' Holy shit think of the money saved. Why in tf do we subsidize immigration? If you come here you damn well better be able to pull your own weight ffs. I want 10 yr moritorium on ALL immigration. This shit is ridiculous. permalink parent award report block reply Cacciali_Via 2 points 1 day ago In 1925, we halted immigration for 40yrs. We need to do it again. permalink parent award report block reply\nCacciali_Via 2 points 1 day ago In 1925, we halted immigration for 40yrs. We need to do it again. permalink parent award report block reply\naoneleggedduck 7 points 2 days ago with Ash Deportem, 10 year old kid destined to be an UndokuMon master! permalink parent award report block reply Deportthemall23 -3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nDeportthemall23 -3 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nGet_Off_Big_Tech 3 points 2 days ago Pokémon go back to your country! permalink parent award report block reply\nbreadbaker -31 points 2 days ago This is just crappy outrage bait. Illegal-headed household can mean there are US born kids receiving benefits that they are clearly and legally entitled to. I don't think this is the win anyone says it is beyond the notion that illegals are really poor and not the future doctors or engineers that wandered over the border. permalink parent award report block reply LiveFreeInXorDie 34 points 2 days ago Spawn of illegals receiving citizen benefits is outrageous, whether or not it's legal in a court of law. permalink parent award report block reply Simple_Doot 32 points 2 days ago You've made a great argument to end birthright citizenship. permalink parent award report block reply MastaJoda 7 points 2 days ago All in favor? Yay permalink parent award report block reply 420praiseit894 24 points 2 days ago Anchor baby citizenship also needs to go. And I wouldn't call them poor so much as exploiting the system. Plenty of leeches receiving tens of thousands of dollars for nothing. Getting a decent living off the backs of the taxpayer isn't poverty. permalink parent award report block reply hansgruber7 17 points 2 days ago It's still a problem and the illegals should not be here. permalink parent award report block reply Awakened 10 points 2 days ago You all have to go back. permalink parent award report block reply BurtMcGirt 3 points 2 days ago With their anchor babies permalink parent award report block reply load 6 more comments...\nLiveFreeInXorDie 34 points 2 days ago Spawn of illegals receiving citizen benefits is outrageous, whether or not it's legal in a court of law. permalink parent award report block reply\nSimple_Doot 32 points 2 days ago You've made a great argument to end birthright citizenship. permalink parent award report block reply MastaJoda 7 points 2 days ago All in favor? Yay permalink parent award report block reply\nMastaJoda 7 points 2 days ago All in favor? Yay permalink parent award report block reply\n420praiseit894 24 points 2 days ago Anchor baby citizenship also needs to go. And I wouldn't call them poor so much as exploiting the system. Plenty of leeches receiving tens of thousands of dollars for nothing. Getting a decent living off the backs of the taxpayer isn't poverty. permalink parent award report block reply\nhansgruber7 17 points 2 days ago It's still a problem and the illegals should not be here. permalink parent award report block reply\nAwakened 10 points 2 days ago You all have to go back. permalink parent award report block reply BurtMcGirt 3 points 2 days ago With their anchor babies permalink parent award report block reply\nBurtMcGirt 3 points 2 days ago With their anchor babies permalink parent award report block reply\nBlackPilledMAGA 12 points 2 days ago Exactly! Go through every tax roll in every state city and town and identify which owners are citizens and which aren't. The ones who are here illegally, seize the property and deport them. Sell the property at public auctions and after all of their legal costs and property taxes are paid current give them back what's left and permanently ban them from America. permalink parent award report block reply\nbooblitchutz 11 points 2 days ago \"noooo you can't just take our slaves AGAIN!!!\" permalink parent award report block reply anotherthing 1 points 1 day ago At least back before the Civil War, they paid for their own slaves out of their own pockets. permalink parent award report block reply\nanotherthing 1 points 1 day ago At least back before the Civil War, they paid for their own slaves out of their own pockets. permalink parent award report block reply\nTheThreeSeashells 4 points 2 days ago Unfortunately, the answer we're going to get is \"We have this data, we have their addresses, too...now all we're going to do is start paying them again rather than kicking them out or, after discovering they gave fake addresses, shutting down all payments to those invaders immediately.\" permalink parent award report block reply\nGodSaveTheWest 4 points 2 days ago The legal immigrants need to be looked at too. Why the fuck are we letting in people who leech off the system? permalink parent award report block reply JoeBidensDementia1 6 points 2 days ago Only about 2% of Japanese immigrants are on welfare. But nearly 49% of those from Laos are. Thomas Sowell permalink parent award report block reply Cacciali_Via 2 points 1 day ago I have some Hmong aquantances/friends. They are good net tax contributors, but I also know that historically the Hmong people used to have a written language. Somehow along the way they devolved and lost the ability to write in their language. Eventually they started using the roman alphabet to phonetically recreate their spoken language but nobody knows what the original written characters even look like. In other words, they are the jungle Asians and not the smarter snow Asians. permalink parent award report block reply\nJoeBidensDementia1 6 points 2 days ago Only about 2% of Japanese immigrants are on welfare. But nearly 49% of those from Laos are. Thomas Sowell permalink parent award report block reply Cacciali_Via 2 points 1 day ago I have some Hmong aquantances/friends. They are good net tax contributors, but I also know that historically the Hmong people used to have a written language. Somehow along the way they devolved and lost the ability to write in their language. Eventually they started using the roman alphabet to phonetically recreate their spoken language but nobody knows what the original written characters even look like. In other words, they are the jungle Asians and not the smarter snow Asians. permalink parent award report block reply\nCacciali_Via 2 points 1 day ago I have some Hmong aquantances/friends. They are good net tax contributors, but I also know that historically the Hmong people used to have a written language. Somehow along the way they devolved and lost the ability to write in their language. Eventually they started using the roman alphabet to phonetically recreate their spoken language but nobody knows what the original written characters even look like. In other words, they are the jungle Asians and not the smarter snow Asians. permalink parent award report block reply\nModernKnight 67 points 2 days ago Oof, that chart hurts to look at.  The 52% of legal immigrants receiving benefits is horrible also.  We shouldn't have any gibs.  If gibs ARE to be had, though, all foreigners should be disqualified from receiving said gibs. Edit to add: I also do not, for a second, believe those housing assistance numbers. permalink award report block reply realPhantomFuck 41 points 2 days ago Seriously. WHAT benefit is a person who immigrates here just to leech? They are a net negative and should be removed Edit: I appreciate the responses and I know the why . It’s just insane to me that this is accepted because they’re “legal.” It shouldn’t even be possible to get on assistance as a new citizen permalink parent award report block reply John_Smallberries 18 points 2 days ago They're a benefit to the democrat communists due to the swaying of census numbers. permalink parent award report block reply BlackPilledMAGA 8 points 2 days ago SCOTUS needs to clarify that immediately and permanently remove all illegals from the census count. Non-citizens were never intended to count towards congressional representation and federal funding. Once they no longer count towards federal funding or congressional seats all of the leftist politicians will drop them in an instant. The pandering will end forever. permalink parent award report block reply PROCIsAsshoe 11 points 2 days ago In response to your question, there are two answers -- A Democrats internal monologue: \"They'll vote Democrat forever!\" A Democrats public reply: \"They bring diversity and enrich our culture!\" permalink parent award report block reply SDsc0rch 10 points 2 days ago some people work for a living some people VOTE for a living (!!!) permalink parent award report block reply rebuildingMyself 5 points 2 days ago It's a benefit to them because while you study hard and pray you'll get a job so you can afford a house and family some day, they drop three kids and make you pay for it. Its a benefit to the Uniparty since they cannot control our minds as effectively anymore so need to replace us. permalink parent award report block reply 420praiseit894 3 points 2 days ago And social security will turn into an avalanche when our population stabilizes or starts decreasing, because it's a pyramid scheme. Which isn't an excuse. In my opinion, fuck it, pull that pin. It's better than destroying our society by importing third worlders. permalink parent award report block reply booblitchutz 4 points 2 days ago Slaves. Their labor is to vote democrat and in return they get taken care of. permalink parent award report block reply The_Emperor 1 points 2 days ago Whole agencies encourage this permalink parent award report block reply load 2 more comments... deleted 19 points 2 days ago movetofirefox 12 points 2 days ago Forever, end of story. permalink parent award report block reply that_sound 5 points 2 days ago Forever. If they can't make it here, they can go back to wherever they are from. We only want the best immigrants. And the numbers should be based exclusively on the labor needs of the nation. permalink parent award report block reply Awakened 2 points 2 days ago No never. The should all be sent back period. Sheesh. If this is where the average poster here is at, it truly is hopeless. Everyone wants to be charitable with someone else's money. permalink parent award report block reply Fren20 -1 points 2 days ago Ten years nobody has ever helped me, your one crazy mothetfucker not with my tax money,you must have money 🤑🤑🤑🤑 permalink parent award report block reply Fren20 -1 points 2 days ago Hell no you moron,I never got any help ,are you fucking stupid no ten years,you must have money 🤑🤑🤑 not my taxes..but feel free to give me your ten years of free money permalink parent award report block reply Wrexxis780 15 points 2 days ago ANY foreigner should NOT get any gibs ANY American getting gibs should be owned by the government and should be given reasonable jobs or community service to earn it. If they want out, get a real job. permalink parent award report block reply rebuildingMyself 8 points 2 days ago I'd be okay with someone on gibs losing their right to vote until they are once again independent permalink parent award report block reply Aquamine-Amarine -5 points 2 days ago Slippery slope. Lots of people here want to steal voting rights. It's a bad idea. Requirements for welfare should be really strict. The amount you get should depend on your situation. Single people can get money, obviously not as much as a family though. Single mothers should NOT get any money unless they're married to the kid's father. They take advantage of the system too much. Young adults taking care of younger siblings because their parents are dead can get money for the kid. Illegals get absolutely nothing. Deport. permalink parent award report block reply GodSaveTheWest 8 points 2 days ago Wrong, every single dumb fuck having voting rights was never the intention of the founding fathers. The greeks knew it was dumb too as they were theorizing democracy. There absolutely should be restrictions on who can vote. Muh slippery slope isnt an argument here, its how it was meant to be. You should have to be a tax payer to have a say how our government spends tax money. Not be on public benefits as you'll just vote for more free stuff. Not have certain kinds of debt as you'll just vote for however promises to forgive it. Have signed up for the draft (women signing up being optional. if they want to vote equally, they can risk dying in war equally.) In addition to that there should be a basic test when registering to vote. Too many idiots voting with no idea how our government even works or any knowledge of history or economics. permalink parent award report block reply ModernKnight 6 points 2 days ago Universal franchise was a bad idea.  The founders knew it.  \"When the people find that they can vote themselves money, that will herald the end of the republic.\"  Remove ALL gibs, or get those receiving them off the voter rolls. permalink parent award report block reply TheThreeSeashells 4 points 2 days ago I'd rather start with mandatory drug and alcohol testing, no smoking, and zero tolerance when those rules are broken.  Sorry, but if you're taking my money, you don't get to waste it on things you don't need, most of which will only lead to negative actions resulting in more theft of taxpayer money. I'd also be willing to throw in that they lose some benefits if they give birth.  Once again, if you need government handouts to survive, you shouldn't be making it harder to survive without taking more government money.  The \"childbirth\" clause could be offset should the recipient at least get a part-time job. permalink parent award report block reply ColbyP 3 points 2 days ago Taking away voting rights is both good, and consistent with the Founder's philosophy. They didn't write in everyone being allowed to vote in the constitution for good reason: many people shouldn't be allowed to. They didn't believe that the dregs and leeches of society should have a say, and would be ashamed that we ever gave them one. permalink parent award report block reply view 1 more comments... throttlejohnson 6 points 2 days ago also the 39% US born on welfare is fucking sad... permalink parent award report block reply booblitchutz 6 points 2 days ago Not as sad as the fact that the majority of fucking people who come to this country are leeches! permalink parent award report block reply booblitchutz 2 points 2 days ago 39% of US born households are on some kind of welfare though. That's bad enough! permalink parent award report block reply load 1 more comments...\nrealPhantomFuck 41 points 2 days ago Seriously. WHAT benefit is a person who immigrates here just to leech? They are a net negative and should be removed Edit: I appreciate the responses and I know the why . It’s just insane to me that this is accepted because they’re “legal.” It shouldn’t even be possible to get on assistance as a new citizen permalink parent award report block reply John_Smallberries 18 points 2 days ago They're a benefit to the democrat communists due to the swaying of census numbers. permalink parent award report block reply BlackPilledMAGA 8 points 2 days ago SCOTUS needs to clarify that immediately and permanently remove all illegals from the census count. Non-citizens were never intended to count towards congressional representation and federal funding. Once they no longer count towards federal funding or congressional seats all of the leftist politicians will drop them in an instant. The pandering will end forever. permalink parent award report block reply PROCIsAsshoe 11 points 2 days ago In response to your question, there are two answers -- A Democrats internal monologue: \"They'll vote Democrat forever!\" A Democrats public reply: \"They bring diversity and enrich our culture!\" permalink parent award report block reply SDsc0rch 10 points 2 days ago some people work for a living some people VOTE for a living (!!!) permalink parent award report block reply rebuildingMyself 5 points 2 days ago It's a benefit to them because while you study hard and pray you'll get a job so you can afford a house and family some day, they drop three kids and make you pay for it. Its a benefit to the Uniparty since they cannot control our minds as effectively anymore so need to replace us. permalink parent award report block reply 420praiseit894 3 points 2 days ago And social security will turn into an avalanche when our population stabilizes or starts decreasing, because it's a pyramid scheme. Which isn't an excuse. In my opinion, fuck it, pull that pin. It's better than destroying our society by importing third worlders. permalink parent award report block reply booblitchutz 4 points 2 days ago Slaves. Their labor is to vote democrat and in return they get taken care of. permalink parent award report block reply The_Emperor 1 points 2 days ago Whole agencies encourage this permalink parent award report block reply load 2 more comments...\nJohn_Smallberries 18 points 2 days ago They're a benefit to the democrat communists due to the swaying of census numbers. permalink parent award report block reply BlackPilledMAGA 8 points 2 days ago SCOTUS needs to clarify that immediately and permanently remove all illegals from the census count. Non-citizens were never intended to count towards congressional representation and federal funding. Once they no longer count towards federal funding or congressional seats all of the leftist politicians will drop them in an instant. The pandering will end forever. permalink parent award report block reply\nBlackPilledMAGA 8 points 2 days ago SCOTUS needs to clarify that immediately and permanently remove all illegals from the census count. Non-citizens were never intended to count towards congressional representation and federal funding. Once they no longer count towards federal funding or congressional seats all of the leftist politicians will drop them in an instant. The pandering will end forever. permalink parent award report block reply\nPROCIsAsshoe 11 points 2 days ago In response to your question, there are two answers -- A Democrats internal monologue: \"They'll vote Democrat forever!\" A Democrats public reply: \"They bring diversity and enrich our culture!\" permalink parent award report block reply\nSDsc0rch 10 points 2 days ago some people work for a living some people VOTE for a living (!!!) permalink parent award report block reply\nrebuildingMyself 5 points 2 days ago It's a benefit to them because while you study hard and pray you'll get a job so you can afford a house and family some day, they drop three kids and make you pay for it. Its a benefit to the Uniparty since they cannot control our minds as effectively anymore so need to replace us. permalink parent award report block reply 420praiseit894 3 points 2 days ago And social security will turn into an avalanche when our population stabilizes or starts decreasing, because it's a pyramid scheme. Which isn't an excuse. In my opinion, fuck it, pull that pin. It's better than destroying our society by importing third worlders. permalink parent award report block reply\n420praiseit894 3 points 2 days ago And social security will turn into an avalanche when our population stabilizes or starts decreasing, because it's a pyramid scheme. Which isn't an excuse. In my opinion, fuck it, pull that pin. It's better than destroying our society by importing third worlders. permalink parent award report block reply\nbooblitchutz 4 points 2 days ago Slaves. Their labor is to vote democrat and in return they get taken care of. permalink parent award report block reply The_Emperor 1 points 2 days ago Whole agencies encourage this permalink parent award report block reply\nThe_Emperor 1 points 2 days ago Whole agencies encourage this permalink parent award report block reply\ndeleted 19 points 2 days ago movetofirefox 12 points 2 days ago Forever, end of story. permalink parent award report block reply that_sound 5 points 2 days ago Forever. If they can't make it here, they can go back to wherever they are from. We only want the best immigrants. And the numbers should be based exclusively on the labor needs of the nation. permalink parent award report block reply Awakened 2 points 2 days ago No never. The should all be sent back period. Sheesh. If this is where the average poster here is at, it truly is hopeless. Everyone wants to be charitable with someone else's money. permalink parent award report block reply Fren20 -1 points 2 days ago Ten years nobody has ever helped me, your one crazy mothetfucker not with my tax money,you must have money 🤑🤑🤑🤑 permalink parent award report block reply Fren20 -1 points 2 days ago Hell no you moron,I never got any help ,are you fucking stupid no ten years,you must have money 🤑🤑🤑 not my taxes..but feel free to give me your ten years of free money permalink parent award report block reply\nmovetofirefox 12 points 2 days ago Forever, end of story. permalink parent award report block reply that_sound 5 points 2 days ago Forever. If they can't make it here, they can go back to wherever they are from. We only want the best immigrants. And the numbers should be based exclusively on the labor needs of the nation. permalink parent award report block reply\nthat_sound 5 points 2 days ago Forever. If they can't make it here, they can go back to wherever they are from. We only want the best immigrants. And the numbers should be based exclusively on the labor needs of the nation. permalink parent award report block reply\nAwakened 2 points 2 days ago No never. The should all be sent back period. Sheesh. If this is where the average poster here is at, it truly is hopeless. Everyone wants to be charitable with someone else's money. permalink parent award report block reply\nFren20 -1 points 2 days ago Ten years nobody has ever helped me, your one crazy mothetfucker not with my tax money,you must have money 🤑🤑🤑🤑 permalink parent award report block reply\nFren20 -1 points 2 days ago Hell no you moron,I never got any help ,are you fucking stupid no ten years,you must have money 🤑🤑🤑 not my taxes..but feel free to give me your ten years of free money permalink parent award report block reply\nWrexxis780 15 points 2 days ago ANY foreigner should NOT get any gibs ANY American getting gibs should be owned by the government and should be given reasonable jobs or community service to earn it. If they want out, get a real job. permalink parent award report block reply rebuildingMyself 8 points 2 days ago I'd be okay with someone on gibs losing their right to vote until they are once again independent permalink parent award report block reply Aquamine-Amarine -5 points 2 days ago Slippery slope. Lots of people here want to steal voting rights. It's a bad idea. Requirements for welfare should be really strict. The amount you get should depend on your situation. Single people can get money, obviously not as much as a family though. Single mothers should NOT get any money unless they're married to the kid's father. They take advantage of the system too much. Young adults taking care of younger siblings because their parents are dead can get money for the kid. Illegals get absolutely nothing. Deport. permalink parent award report block reply GodSaveTheWest 8 points 2 days ago Wrong, every single dumb fuck having voting rights was never the intention of the founding fathers. The greeks knew it was dumb too as they were theorizing democracy. There absolutely should be restrictions on who can vote. Muh slippery slope isnt an argument here, its how it was meant to be. You should have to be a tax payer to have a say how our government spends tax money. Not be on public benefits as you'll just vote for more free stuff. Not have certain kinds of debt as you'll just vote for however promises to forgive it. Have signed up for the draft (women signing up being optional. if they want to vote equally, they can risk dying in war equally.) In addition to that there should be a basic test when registering to vote. Too many idiots voting with no idea how our government even works or any knowledge of history or economics. permalink parent award report block reply ModernKnight 6 points 2 days ago Universal franchise was a bad idea.  The founders knew it.  \"When the people find that they can vote themselves money, that will herald the end of the republic.\"  Remove ALL gibs, or get those receiving them off the voter rolls. permalink parent award report block reply TheThreeSeashells 4 points 2 days ago I'd rather start with mandatory drug and alcohol testing, no smoking, and zero tolerance when those rules are broken.  Sorry, but if you're taking my money, you don't get to waste it on things you don't need, most of which will only lead to negative actions resulting in more theft of taxpayer money. I'd also be willing to throw in that they lose some benefits if they give birth.  Once again, if you need government handouts to survive, you shouldn't be making it harder to survive without taking more government money.  The \"childbirth\" clause could be offset should the recipient at least get a part-time job. permalink parent award report block reply ColbyP 3 points 2 days ago Taking away voting rights is both good, and consistent with the Founder's philosophy. They didn't write in everyone being allowed to vote in the constitution for good reason: many people shouldn't be allowed to. They didn't believe that the dregs and leeches of society should have a say, and would be ashamed that we ever gave them one. permalink parent award report block reply view 1 more comments...\nrebuildingMyself 8 points 2 days ago I'd be okay with someone on gibs losing their right to vote until they are once again independent permalink parent award report block reply Aquamine-Amarine -5 points 2 days ago Slippery slope. Lots of people here want to steal voting rights. It's a bad idea. Requirements for welfare should be really strict. The amount you get should depend on your situation. Single people can get money, obviously not as much as a family though. Single mothers should NOT get any money unless they're married to the kid's father. They take advantage of the system too much. Young adults taking care of younger siblings because their parents are dead can get money for the kid. Illegals get absolutely nothing. Deport. permalink parent award report block reply GodSaveTheWest 8 points 2 days ago Wrong, every single dumb fuck having voting rights was never the intention of the founding fathers. The greeks knew it was dumb too as they were theorizing democracy. There absolutely should be restrictions on who can vote. Muh slippery slope isnt an argument here, its how it was meant to be. You should have to be a tax payer to have a say how our government spends tax money. Not be on public benefits as you'll just vote for more free stuff. Not have certain kinds of debt as you'll just vote for however promises to forgive it. Have signed up for the draft (women signing up being optional. if they want to vote equally, they can risk dying in war equally.) In addition to that there should be a basic test when registering to vote. Too many idiots voting with no idea how our government even works or any knowledge of history or economics. permalink parent award report block reply ModernKnight 6 points 2 days ago Universal franchise was a bad idea.  The founders knew it.  \"When the people find that they can vote themselves money, that will herald the end of the republic.\"  Remove ALL gibs, or get those receiving them off the voter rolls. permalink parent award report block reply TheThreeSeashells 4 points 2 days ago I'd rather start with mandatory drug and alcohol testing, no smoking, and zero tolerance when those rules are broken.  Sorry, but if you're taking my money, you don't get to waste it on things you don't need, most of which will only lead to negative actions resulting in more theft of taxpayer money. I'd also be willing to throw in that they lose some benefits if they give birth.  Once again, if you need government handouts to survive, you shouldn't be making it harder to survive without taking more government money.  The \"childbirth\" clause could be offset should the recipient at least get a part-time job. permalink parent award report block reply ColbyP 3 points 2 days ago Taking away voting rights is both good, and consistent with the Founder's philosophy. They didn't write in everyone being allowed to vote in the constitution for good reason: many people shouldn't be allowed to. They didn't believe that the dregs and leeches of society should have a say, and would be ashamed that we ever gave them one. permalink parent award report block reply view 1 more comments...\nAquamine-Amarine -5 points 2 days ago Slippery slope. Lots of people here want to steal voting rights. It's a bad idea. Requirements for welfare should be really strict. The amount you get should depend on your situation. Single people can get money, obviously not as much as a family though. Single mothers should NOT get any money unless they're married to the kid's father. They take advantage of the system too much. Young adults taking care of younger siblings because their parents are dead can get money for the kid. Illegals get absolutely nothing. Deport. permalink parent award report block reply GodSaveTheWest 8 points 2 days ago Wrong, every single dumb fuck having voting rights was never the intention of the founding fathers. The greeks knew it was dumb too as they were theorizing democracy. There absolutely should be restrictions on who can vote. Muh slippery slope isnt an argument here, its how it was meant to be. You should have to be a tax payer to have a say how our government spends tax money. Not be on public benefits as you'll just vote for more free stuff. Not have certain kinds of debt as you'll just vote for however promises to forgive it. Have signed up for the draft (women signing up being optional. if they want to vote equally, they can risk dying in war equally.) In addition to that there should be a basic test when registering to vote. Too many idiots voting with no idea how our government even works or any knowledge of history or economics. permalink parent award report block reply ModernKnight 6 points 2 days ago Universal franchise was a bad idea.  The founders knew it.  \"When the people find that they can vote themselves money, that will herald the end of the republic.\"  Remove ALL gibs, or get those receiving them off the voter rolls. permalink parent award report block reply TheThreeSeashells 4 points 2 days ago I'd rather start with mandatory drug and alcohol testing, no smoking, and zero tolerance when those rules are broken.  Sorry, but if you're taking my money, you don't get to waste it on things you don't need, most of which will only lead to negative actions resulting in more theft of taxpayer money. I'd also be willing to throw in that they lose some benefits if they give birth.  Once again, if you need government handouts to survive, you shouldn't be making it harder to survive without taking more government money.  The \"childbirth\" clause could be offset should the recipient at least get a part-time job. permalink parent award report block reply ColbyP 3 points 2 days ago Taking away voting rights is both good, and consistent with the Founder's philosophy. They didn't write in everyone being allowed to vote in the constitution for good reason: many people shouldn't be allowed to. They didn't believe that the dregs and leeches of society should have a say, and would be ashamed that we ever gave them one. permalink parent award report block reply view 1 more comments...\nGodSaveTheWest 8 points 2 days ago Wrong, every single dumb fuck having voting rights was never the intention of the founding fathers. The greeks knew it was dumb too as they were theorizing democracy. There absolutely should be restrictions on who can vote. Muh slippery slope isnt an argument here, its how it was meant to be. You should have to be a tax payer to have a say how our government spends tax money. Not be on public benefits as you'll just vote for more free stuff. Not have certain kinds of debt as you'll just vote for however promises to forgive it. Have signed up for the draft (women signing up being optional. if they want to vote equally, they can risk dying in war equally.) In addition to that there should be a basic test when registering to vote. Too many idiots voting with no idea how our government even works or any knowledge of history or economics. permalink parent award report block reply\nModernKnight 6 points 2 days ago Universal franchise was a bad idea.  The founders knew it.  \"When the people find that they can vote themselves money, that will herald the end of the republic.\"  Remove ALL gibs, or get those receiving them off the voter rolls. permalink parent award report block reply\nTheThreeSeashells 4 points 2 days ago I'd rather start with mandatory drug and alcohol testing, no smoking, and zero tolerance when those rules are broken.  Sorry, but if you're taking my money, you don't get to waste it on things you don't need, most of which will only lead to negative actions resulting in more theft of taxpayer money. I'd also be willing to throw in that they lose some benefits if they give birth.  Once again, if you need government handouts to survive, you shouldn't be making it harder to survive without taking more government money.  The \"childbirth\" clause could be offset should the recipient at least get a part-time job. permalink parent award report block reply\nColbyP 3 points 2 days ago Taking away voting rights is both good, and consistent with the Founder's philosophy. They didn't write in everyone being allowed to vote in the constitution for good reason: many people shouldn't be allowed to. They didn't believe that the dregs and leeches of society should have a say, and would be ashamed that we ever gave them one. permalink parent award report block reply view 1 more comments...\nthrottlejohnson 6 points 2 days ago also the 39% US born on welfare is fucking sad... permalink parent award report block reply booblitchutz 6 points 2 days ago Not as sad as the fact that the majority of fucking people who come to this country are leeches! permalink parent award report block reply\nbooblitchutz 6 points 2 days ago Not as sad as the fact that the majority of fucking people who come to this country are leeches! permalink parent award report block reply\nbooblitchutz 2 points 2 days ago 39% of US born households are on some kind of welfare though. That's bad enough! permalink parent award report block reply\nFormerlurker92 25 points 2 days ago The purple and orange categories need to be completely eliminated permalink award report block reply RespectMySafeSpace 20 points 2 days ago No immigrants should be getting any kind of welfare. Period. permalink parent award report block reply monkadelic 2 points 2 days ago you get what you incentivize. permalink parent award report block reply\nRespectMySafeSpace 20 points 2 days ago No immigrants should be getting any kind of welfare. Period. permalink parent award report block reply monkadelic 2 points 2 days ago you get what you incentivize. permalink parent award report block reply\nmonkadelic 2 points 2 days ago you get what you incentivize. permalink parent award report block reply\nAwakened 21 points 2 days ago The orange and purple graphs need to both be zero. This is criminal and those responsible would be tried for treason and hanged in a serious country, but we live in 🤡🌎 permalink award report block reply\nCDean 20 points 2 days ago I don't understand this. The i134 immigration form clearly states the requirement of the sponsor to financially support the benefactor. How do they get welfare? They should be deported. permalink award report block reply SanityGumby 16 points 2 days ago Democrats are violating the law to give it to them. SNAP was already illegal to give to illegals but they did it anyway. permalink parent award report block reply\nSanityGumby 16 points 2 days ago Democrats are violating the law to give it to them. SNAP was already illegal to give to illegals but they did it anyway. permalink parent award report block reply\nHangmhigh 16 points 2 days ago This is infurating. Our quailty of life is being desroyed and the globalists respoaible need to have their yachts sunk. permalink award report block reply\nSerulin 13 points 2 days ago Why are we subsidizing legal immigrants too?? permalink award report block reply worldowedexplanation 4 points 2 days ago Because Democrats need someone to clean their bathrooms, they’re too fat to do it themselves permalink parent award report block reply DeportThemAllForever 3 points 2 days ago This permalink parent award report block reply\nworldowedexplanation 4 points 2 days ago Because Democrats need someone to clean their bathrooms, they’re too fat to do it themselves permalink parent award report block reply DeportThemAllForever 3 points 2 days ago This permalink parent award report block reply\nDeportThemAllForever 3 points 2 days ago This permalink parent award report block reply\nRizzlieDoodad 6 points 2 days ago IDK why everyone is celebrating. The Republicans voted for no changes to the Biden spending budget except the ACA stuff permalink award report block reply shockpurseyell 3 points 2 days ago It’s only a matter of hours before we find out how added money they just pumped into SNAP, along with restoring all govt workers, with back pay. So much for shrinking govt. permalink parent award report block reply RizzlieDoodad 3 points 1 day ago We don't have an America first government. We have a government compromised by Epstein permalink parent award report block reply Michalusmichalus 1 points 2 days ago When I think of inflation, that's fine. Less spending power. permalink parent award report block reply\nshockpurseyell 3 points 2 days ago It’s only a matter of hours before we find out how added money they just pumped into SNAP, along with restoring all govt workers, with back pay. So much for shrinking govt. permalink parent award report block reply RizzlieDoodad 3 points 1 day ago We don't have an America first government. We have a government compromised by Epstein permalink parent award report block reply\nRizzlieDoodad 3 points 1 day ago We don't have an America first government. We have a government compromised by Epstein permalink parent award report block reply\nMichalusmichalus 1 points 2 days ago When I think of inflation, that's fine. Less spending power. permalink parent award report block reply\nWhoDecidedThat 4 points 2 days ago Realize that means that their kids are also illegals without the false interpretation of birthright. Meaning 60% of welfare is illegals not just households permalink award report block reply\nFORMERCHILDSTAR 4 points 2 days ago Illegal immigration is a net loss on so many levels. We're sacrificing our country and being forced to pay the tab for it simultaneously. We don't have political leaders, we have professional extortionists. permalink award report block reply\n3stepsahead 3 points 2 days ago Cut off their money.  No illegal or immigrant should receive any taxpayer money.  This should be the biggest layup ever. permalink award report block reply\nsuckmycorona 3 points 2 days ago If diversity is strength then why do they need so much help? permalink award report block reply\nCrappydatum 3 points 2 days ago The USA population has ZERO idea of this, since it is being actively withheld from every Misleadia outlet! While we laugh at the stupidity of getting \"information\" from such an unreliable source, 95% of your neighbors don't know any better permalink award report block reply\nHunterBidensPC 3 points 2 days ago Hi, critical thinker here. Just wondering how we could have this data which shows the number of illegals on welfare but we can’t somehow just “turn off the faucet” for those households and send ICE out to deport them and let their anchor babies decide if they want to stay until we can kick them out too? permalink award report block reply Michalusmichalus 2 points 2 days ago Because of all the ,\" that's not happening\" bullshit. permalink parent award report block reply\nMichalusmichalus 2 points 2 days ago Because of all the ,\" that's not happening\" bullshit. permalink parent award report block reply\nMechanicalmind 2 points 2 days ago And they will continue to collect. permalink award report block reply\nMaga2015bis 2 points 2 days ago While I support legal immigration, unless they are real refugees they should not receive any welfare either. Too many chain migration recipients take advantage of the U.S. welfare. permalink award report block reply\nkeeman 2 points 2 days ago It accomplished showing some of us actual conservatives that the R party will declare victory when passing an extension of the previous D administration's cartoonishly bloated budget.  R party has both houses of Congress, the presidency and SCOTUS and best we can do is just block the Ds from increasing spending ever further and then congratulate ourselves on how amazing we are. permalink award report block reply\nLiveFreeInXorDie 2 points 2 days ago Found the sauce: https://cis.org/Report/Welfare-Use-Immigrants-and-USBorn permalink award report block reply\nSanityGumby 2 points 2 days ago Exactly. Anyone here saying that Democrats won needs to be deported because they are part of an op. Democrats gained literally nothing while exposing all of the tax fraud they committed. permalink award report block reply\nInduceddrag 2 points 2 days ago We have to be cautious in this assumption.   Low info voters are being bombarded by the media telling people it is the GOP cutting SNAP and hiking Obamacare prices. The right needs to get the message out that the ACA subsidy debacle was built into the original bill, and roll out all the Obama promises. permalink award report block reply\nAoikaze2000 2 points 2 days ago Y'know, time for dual citizenship to end.  You're either an American or you aren't. And with it, it's long overdue to send all of the illegals back home.  We don't want them here, we don't need them here, they have to go home. permalink award report block reply\nnoPTSDforMePlease 2 points 1 day ago 40% of Americans are on welfare. Wow. We have a hollow economy. permalink award report block reply Bicentennial76 1 points 1 day ago Its insane.  We already have socialism permalink parent award report block reply\nBicentennial76 1 points 1 day ago Its insane.  We already have socialism permalink parent award report block reply\nElectionMeddler 2 points 2 days ago You can pick up your welfare benefits at your local ICE detention facility. Remember to bring your real ID permalink award report block reply\nSavingPrivateGrace 2 points 2 days ago The Schumer shutdown also exposed the EBT fraud as many tik tok videos revealed they sell the money on the card for weed and drugs.  Thanks Chuck! permalink award report block reply\nVirtusHonos 2 points 2 days ago the \"legal\" \"immigrants\" are close behind the illegal aliens. I say turn off all aid to non-citizens. The proposition behind their coming to live here was that they would be self-supporting, a fundamental American principal. Charity has limits. permalink award report block reply\nDarthEP 2 points 2 days ago Cannot Sustain Both Immigration And A Welfare State. This Is NOT Multiple Choice It's Either One Or The Other. permalink award report block reply Michalusmichalus 2 points 2 days ago It's designed failure. This is what all those NGO's were doing. When USAID got nixxed Redditpra were crying about losing their jobs. Most of them were wtf jobs. permalink parent award report block reply DarthEP 3 points 2 days ago From FDR To Cloward-Piven: Wave After Wave Of This BS permalink parent award report block reply\nMichalusmichalus 2 points 2 days ago It's designed failure. This is what all those NGO's were doing. When USAID got nixxed Redditpra were crying about losing their jobs. Most of them were wtf jobs. permalink parent award report block reply DarthEP 3 points 2 days ago From FDR To Cloward-Piven: Wave After Wave Of This BS permalink parent award report block reply\nDarthEP 3 points 2 days ago From FDR To Cloward-Piven: Wave After Wave Of This BS permalink parent award report block reply\nSDsc0rch 2 points 2 days ago imagine if the great rush limbaugh were still alive            what would he be saying... permalink award report block reply\n123breadman 2 points 2 days ago Housing is BS because illegals get 1 legal citizen to rent it out, then 20 move into one home. permalink award report block reply\nChickensaurus 1 points 2 days ago It also polarized the left and created huge crowds at national protests. permalink award report block reply booblitchutz 2 points 2 days ago The \"huge crowds\" are the result of an extraordinarily well funded advertising campaign and organizational effort. The GOP doesn't have access to that kind of cash. The dems can simply reach into the pot and take all they want. permalink parent award report block reply Chickensaurus 1 points 2 days ago Some are indeed paid, but the vast majority are normal retards. permalink parent award report block reply booblitchutz 2 points 2 days ago Not what I said. permalink parent award report block reply Chickensaurus 1 points 2 days ago Yes, I understand yoyr point and don't disagree. And it's definitely mostly because of the paid influence peddling, professional signs, etc. The GOP has money. They spend it o n shit that doesn't help politically. permalink parent award report block reply\nbooblitchutz 2 points 2 days ago The \"huge crowds\" are the result of an extraordinarily well funded advertising campaign and organizational effort. The GOP doesn't have access to that kind of cash. The dems can simply reach into the pot and take all they want. permalink parent award report block reply Chickensaurus 1 points 2 days ago Some are indeed paid, but the vast majority are normal retards. permalink parent award report block reply booblitchutz 2 points 2 days ago Not what I said. permalink parent award report block reply Chickensaurus 1 points 2 days ago Yes, I understand yoyr point and don't disagree. And it's definitely mostly because of the paid influence peddling, professional signs, etc. The GOP has money. They spend it o n shit that doesn't help politically. permalink parent award report block reply\nChickensaurus 1 points 2 days ago Some are indeed paid, but the vast majority are normal retards. permalink parent award report block reply booblitchutz 2 points 2 days ago Not what I said. permalink parent award report block reply Chickensaurus 1 points 2 days ago Yes, I understand yoyr point and don't disagree. And it's definitely mostly because of the paid influence peddling, professional signs, etc. The GOP has money. They spend it o n shit that doesn't help politically. permalink parent award report block reply\nbooblitchutz 2 points 2 days ago Not what I said. permalink parent award report block reply Chickensaurus 1 points 2 days ago Yes, I understand yoyr point and don't disagree. And it's definitely mostly because of the paid influence peddling, professional signs, etc. The GOP has money. They spend it o n shit that doesn't help politically. permalink parent award report block reply\nChickensaurus 1 points 2 days ago Yes, I understand yoyr point and don't disagree. And it's definitely mostly because of the paid influence peddling, professional signs, etc. The GOP has money. They spend it o n shit that doesn't help politically. permalink parent award report block reply\nDem_slayer 1 points 2 days ago Illegals and legal immigrants should not get one fucking cent in aid.... wtf... permalink award report block reply\nMaskurbator 1 points 2 days ago If we got rid of all benefits, the US would be 80% white within two years. permalink award report block reply\nthp2034 1 points 2 days ago Hey now wait a minute. Didn't they say that Illegal Aliens were not eligible for welfare & other gubbermint bennies???\nDon't tell me we were lied to?!?! permalink award report block reply\nLive_free_or_die_55 1 points 2 days ago No more welfare !! Deport them all Now!! permalink award report block reply\ndres3 1 points 2 days ago Framework idea to lefties: \"Dis' monies coulda been goin' to y'alls EBTs.\" permalink award report block reply\nRandyMoss 1 points 2 days ago And Trump will sign a bill continuing the scam permalink award report block reply\nShaffro 1 points 2 days ago Deport the parasites. I am sick of them. permalink award report block reply\nleast_counties_ever 1 points 2 days ago We’re subsidizing someone else’s cheap labor. permalink award report block reply\nmohel 1 points 2 days ago News at 11. Americans are dumber than anyone could have expected. permalink award report block reply\nGottaMemberMyPW 1 points 2 days ago Here’s a link to the report this chart is from. permalink award report block reply\nTheSHazDroid 1 points 2 days ago We will find out from now to the midterms if the new media has replaced.the influence of the old guard legacy news. I think that they are at near parity with a slight lead and momentum for the new media. IMHO I think more Americans learned more about how bad Obamacare is and the level of fraud in it.  And because the Dems stretched the shutdown to threaten SNAP benefits and now that was exposed  to even more Americans. Dems are trying to spike the football over winning 2 blue states and a deep blue city. But Mamdani is going to be talking point for the entire year leading up to the midterms. permalink award report block reply\nStanwyk74 1 points 2 days ago Git their fake base out for the elections permalink award report block reply\nPede 1 points 2 days ago It also accomplished exposing SNAP Americans. Now we all know that SNAP people are largely obese and are spending the money carelessly when they aren't committing fraud by selling it. permalink award report block reply\nBetaMan1313 1 points 2 days ago Chuck? More like cuck permalink award report block reply\nVorgar 1 points 2 days ago 52% of legal immigrants receiving any is too high as well. permalink award report block reply\nIm_RickSteves_bitch 1 points 2 days ago I really doubt it's only 39% permalink award report block reply\nBigMikesChef 1 points 2 days ago Any \"legal\" immigrant on welfare needs to be deported immediately as well. permalink award report block reply\nFurtherRight 1 points 2 days ago Comment removed by community filter, pending further review. permalink award report block reply"
}