{
  "id": "1ARK9iqOx8",
  "url": "https://patriots.win/p/1ARK9iqOx8/arkansas-tennessee-and-utah-are-/c",
  "content": "334 Arkansas, Tennessee and Utah are the first states to enact laws that require public schools to teach children as young as 5 the basics of gun safety and how to properly store guns in the home. (bearingarms.com) SAVE AMERICA posted 2 days ago by basedboston 21 comments award share report block Three States Now Require Gun Safety Training in Schools Three states now mandate gun safety training in schools for students of all ages. bearingarms.com\n21 comments Sort by Top Top New Worst Old Save Around the Web One Piece Kills All Parasites in Your Body! Paratoxil Scatter-Shot 10 points 2 days ago Excellent idea. If kids are taught civics and how to exercise their 1A, they should likewise be taught how to exercise 2A. In fact, I will go as far as to require HS students to pass gun safety and hit a human torso size target at 100yd with a rifle and 25yd with a handgun to graduate. permalink award report block reply Counterwhat 3 points 2 days ago This is the right approach. We used to do this. It hell time we start doing it again. permalink parent award report block reply BlackLabsMatter 1 points 2 days ago 25 yards with a pistol is irresponsible for most people.  I do like the notion, just not that distance.  :) permalink parent award report block reply Deplora 4 points 2 days ago I want them taught how to shoot.  Not to run and \"tell an adult\" if they see a gun, or to keep home protection guns unloaded and locked up (and inaccessible to minors!). u/Scatter-Shot u/Gunmolester u/1inchgroup permalink award report block reply Your-personal-FBI 4 points 2 days ago NRA started the Eddie Eagle kid gun safety guide 30+ years ago. I taught my two kids that way back then. https://eddieeagle.nra.org/media/1701/prek-k-instructor-guide.pdf?utm_source=chatgpt.com permalink award report block reply 1inchgroup 3 points 2 days ago Cub Scouts was where I shot my first bow and my first rifle.  At one of the Jamborees, or summer camp. Back when nobody was getting diddled by Scoutmasters.  Kids should know they aren't scary if you know how they work. permalink parent award report block reply Deplora 2 points 2 days ago Not a fan.  This is basically just brainwashing kids to be terrified of guns.  Makes them much more susceptible to continuing that same kind of thinking when they're older. To teach children to follow a safety procedure if they see a gun: Stop! Don't Touch Run Away Tell A Grown-up Of course, it's better when a non-gunphobic parent is doing the teaching and modifying it as appropriate.  But this approach has been promoted for use by parents who are indeed gun-phobic and by schools (same schools that will simply skip the 2nd Amendment when teaching the Constitution in later years, or explicitly teach that it only applied to a government-organized militia and is really obsolete now). permalink parent award report block reply Gunmolester 3 points 2 days ago good idea permalink award report block reply 1inchgroup 3 points 2 days ago Absolutely Fucking Awesome!!!!!! permalink award report block reply the-new-style 2 points 2 days ago Panel 2: and filing their taxes ? permalink award report block reply TGNX 2 points 2 days ago This used to be called \"parenting.\" permalink award report block reply J_Comey_is_a_Weasel 1 points 2 days ago Remember when schools had competitive shooting teams? Pepperidge farm remembers. permalink award report block reply BlackLabsMatter 1 points 2 days ago Many still do.  Even in blue states. Trap shooting is one of the most popular activities available currently. permalink parent award report block reply basedboston OP 1 points 2 days ago #JESUSLANDFLAIR permalink award report block reply AgnesDomini 1 points 2 days ago Are you paying attention,  Texas??? permalink award report block reply Your-personal-FBI 1 points 2 days ago https://eddieeagle.nra.org/media/1701/prek-k-instructor-guide.pdf?utm_source=chatgpt.com permalink award report block reply Saxonlady 0 points 2 days ago Should this not be the job for parents? Will the school be responsible if this backfires? permalink award report block reply BlackLabsMatter 2 points 2 days ago It should, but just because parents refuse to teach it does not mean the child will never find/see/interact with a gun at some point. Responsible for what failing, exactly? There isn't really a failure point in this. permalink parent award report block reply Saxonlady 2 points 1 day ago I don't suddenly trust teachers now. Who knows whether their intentions will be honourable when teaching gun safety. That's the potential failure. permalink parent award report block reply BlackLabsMatter 2 points 1 day ago Look at the Eddie Eagle curriculum.  It pretty much boils down to don't touch, leave, tell an adult. I don't think schools are going to be teaching kids to shoot.  Though one could argue that the massive failure they foist upon their students in math, science and economics actually does more harm that your misguided-teachers fear might. This material is impossible to screw up unless you literally tell kids to pick up the gun and wave it around.  That might actually constitute criminal negligence, now that i think about it. Your fears logically must lead to 100% home or curated private schooling.  Not a bad idea, but also not one that is going to happen without massive changes in congress. permalink parent award report block reply\nScatter-Shot 10 points 2 days ago Excellent idea. If kids are taught civics and how to exercise their 1A, they should likewise be taught how to exercise 2A. In fact, I will go as far as to require HS students to pass gun safety and hit a human torso size target at 100yd with a rifle and 25yd with a handgun to graduate. permalink award report block reply Counterwhat 3 points 2 days ago This is the right approach. We used to do this. It hell time we start doing it again. permalink parent award report block reply BlackLabsMatter 1 points 2 days ago 25 yards with a pistol is irresponsible for most people.  I do like the notion, just not that distance.  :) permalink parent award report block reply\nCounterwhat 3 points 2 days ago This is the right approach. We used to do this. It hell time we start doing it again. permalink parent award report block reply\nBlackLabsMatter 1 points 2 days ago 25 yards with a pistol is irresponsible for most people.  I do like the notion, just not that distance.  :) permalink parent award report block reply\nDeplora 4 points 2 days ago I want them taught how to shoot.  Not to run and \"tell an adult\" if they see a gun, or to keep home protection guns unloaded and locked up (and inaccessible to minors!). u/Scatter-Shot u/Gunmolester u/1inchgroup permalink award report block reply\nYour-personal-FBI 4 points 2 days ago NRA started the Eddie Eagle kid gun safety guide 30+ years ago. I taught my two kids that way back then. https://eddieeagle.nra.org/media/1701/prek-k-instructor-guide.pdf?utm_source=chatgpt.com permalink award report block reply 1inchgroup 3 points 2 days ago Cub Scouts was where I shot my first bow and my first rifle.  At one of the Jamborees, or summer camp. Back when nobody was getting diddled by Scoutmasters.  Kids should know they aren't scary if you know how they work. permalink parent award report block reply Deplora 2 points 2 days ago Not a fan.  This is basically just brainwashing kids to be terrified of guns.  Makes them much more susceptible to continuing that same kind of thinking when they're older. To teach children to follow a safety procedure if they see a gun: Stop! Don't Touch Run Away Tell A Grown-up Of course, it's better when a non-gunphobic parent is doing the teaching and modifying it as appropriate.  But this approach has been promoted for use by parents who are indeed gun-phobic and by schools (same schools that will simply skip the 2nd Amendment when teaching the Constitution in later years, or explicitly teach that it only applied to a government-organized militia and is really obsolete now). permalink parent award report block reply\n1inchgroup 3 points 2 days ago Cub Scouts was where I shot my first bow and my first rifle.  At one of the Jamborees, or summer camp. Back when nobody was getting diddled by Scoutmasters.  Kids should know they aren't scary if you know how they work. permalink parent award report block reply\nDeplora 2 points 2 days ago Not a fan.  This is basically just brainwashing kids to be terrified of guns.  Makes them much more susceptible to continuing that same kind of thinking when they're older. To teach children to follow a safety procedure if they see a gun: Stop! Don't Touch Run Away Tell A Grown-up Of course, it's better when a non-gunphobic parent is doing the teaching and modifying it as appropriate.  But this approach has been promoted for use by parents who are indeed gun-phobic and by schools (same schools that will simply skip the 2nd Amendment when teaching the Constitution in later years, or explicitly teach that it only applied to a government-organized militia and is really obsolete now). permalink parent award report block reply\nGunmolester 3 points 2 days ago good idea permalink award report block reply\n1inchgroup 3 points 2 days ago Absolutely Fucking Awesome!!!!!! permalink award report block reply\nthe-new-style 2 points 2 days ago Panel 2: and filing their taxes ? permalink award report block reply\nTGNX 2 points 2 days ago This used to be called \"parenting.\" permalink award report block reply\nJ_Comey_is_a_Weasel 1 points 2 days ago Remember when schools had competitive shooting teams? Pepperidge farm remembers. permalink award report block reply BlackLabsMatter 1 points 2 days ago Many still do.  Even in blue states. Trap shooting is one of the most popular activities available currently. permalink parent award report block reply\nBlackLabsMatter 1 points 2 days ago Many still do.  Even in blue states. Trap shooting is one of the most popular activities available currently. permalink parent award report block reply\nbasedboston OP 1 points 2 days ago #JESUSLANDFLAIR permalink award report block reply\nAgnesDomini 1 points 2 days ago Are you paying attention,  Texas??? permalink award report block reply\nYour-personal-FBI 1 points 2 days ago https://eddieeagle.nra.org/media/1701/prek-k-instructor-guide.pdf?utm_source=chatgpt.com permalink award report block reply\nSaxonlady 0 points 2 days ago Should this not be the job for parents? Will the school be responsible if this backfires? permalink award report block reply BlackLabsMatter 2 points 2 days ago It should, but just because parents refuse to teach it does not mean the child will never find/see/interact with a gun at some point. Responsible for what failing, exactly? There isn't really a failure point in this. permalink parent award report block reply Saxonlady 2 points 1 day ago I don't suddenly trust teachers now. Who knows whether their intentions will be honourable when teaching gun safety. That's the potential failure. permalink parent award report block reply BlackLabsMatter 2 points 1 day ago Look at the Eddie Eagle curriculum.  It pretty much boils down to don't touch, leave, tell an adult. I don't think schools are going to be teaching kids to shoot.  Though one could argue that the massive failure they foist upon their students in math, science and economics actually does more harm that your misguided-teachers fear might. This material is impossible to screw up unless you literally tell kids to pick up the gun and wave it around.  That might actually constitute criminal negligence, now that i think about it. Your fears logically must lead to 100% home or curated private schooling.  Not a bad idea, but also not one that is going to happen without massive changes in congress. permalink parent award report block reply\nBlackLabsMatter 2 points 2 days ago It should, but just because parents refuse to teach it does not mean the child will never find/see/interact with a gun at some point. Responsible for what failing, exactly? There isn't really a failure point in this. permalink parent award report block reply Saxonlady 2 points 1 day ago I don't suddenly trust teachers now. Who knows whether their intentions will be honourable when teaching gun safety. That's the potential failure. permalink parent award report block reply BlackLabsMatter 2 points 1 day ago Look at the Eddie Eagle curriculum.  It pretty much boils down to don't touch, leave, tell an adult. I don't think schools are going to be teaching kids to shoot.  Though one could argue that the massive failure they foist upon their students in math, science and economics actually does more harm that your misguided-teachers fear might. This material is impossible to screw up unless you literally tell kids to pick up the gun and wave it around.  That might actually constitute criminal negligence, now that i think about it. Your fears logically must lead to 100% home or curated private schooling.  Not a bad idea, but also not one that is going to happen without massive changes in congress. permalink parent award report block reply\nSaxonlady 2 points 1 day ago I don't suddenly trust teachers now. Who knows whether their intentions will be honourable when teaching gun safety. That's the potential failure. permalink parent award report block reply BlackLabsMatter 2 points 1 day ago Look at the Eddie Eagle curriculum.  It pretty much boils down to don't touch, leave, tell an adult. I don't think schools are going to be teaching kids to shoot.  Though one could argue that the massive failure they foist upon their students in math, science and economics actually does more harm that your misguided-teachers fear might. This material is impossible to screw up unless you literally tell kids to pick up the gun and wave it around.  That might actually constitute criminal negligence, now that i think about it. Your fears logically must lead to 100% home or curated private schooling.  Not a bad idea, but also not one that is going to happen without massive changes in congress. permalink parent award report block reply\nBlackLabsMatter 2 points 1 day ago Look at the Eddie Eagle curriculum.  It pretty much boils down to don't touch, leave, tell an adult. I don't think schools are going to be teaching kids to shoot.  Though one could argue that the massive failure they foist upon their students in math, science and economics actually does more harm that your misguided-teachers fear might. This material is impossible to screw up unless you literally tell kids to pick up the gun and wave it around.  That might actually constitute criminal negligence, now that i think about it. Your fears logically must lead to 100% home or curated private schooling.  Not a bad idea, but also not one that is going to happen without massive changes in congress. permalink parent award report block reply",
  "fetched_at": "2025-11-12T22:59:10.276372Z"
}