{
  "id": "8171519",
  "title": "1507Supreme Court allows Trump administration to limit gender passport markers(www.lex18.com)posted6",
  "url": "https://patriots.win/p/1ARK52CFcf/supreme-court-allows-trump-admin/c",
  "content": "1507 Supreme Court allows Trump administration to limit gender passport markers (www.lex18.com) posted 6 days ago by TheMrStone 68 comments award share report block Supreme Court allows Trump administration to limit gender passport markers The Supreme Court will allow the Trump administration to block transgender and nonbinary Americans from choosing passport sex markers. www.lex18.com\n68 comments Sort by Top Top New Worst Old Save Pyroth5687 107 points 6 days ago Well, Of course... The state department determines what will be on the passport not a retarded troon. permalink award report block reply BlackPilledMAGA 33 points 6 days ago Actually biology determines it, not some fucking troom's wish. permalink parent award report block reply The_Return_of_User_x 11 points 6 days ago I hope he/she passports get invalidated while abroad. permalink parent award report block reply Choppermagic 2 points 6 days ago send them to the middle east permalink parent award report block reply Valiazaner 26 points 6 days ago I mean it's not even that. A Passport is a document owned by the US government entrusted to a citizen. That document is asking a foreign government to allow that citizen entry and to afford them all the rights and privileges an American citizen can expect to enjoy while in that nation. If you are trying to enter a nation such as Saudi Arabia that has none of that non sense then an X or a \"they/them\" on a passport will not only devalue the passport but also potentially put the holder in danger. A passport is a document that is supposed to grant entry to other nations. Weird gender shit weakens the US passport. permalink parent award report block reply NotYourMan 2 points 6 days ago Well that isn't a surprise.  One of the goals of a passport is to identify somebody and they can't be identified by their latest crazy idea of who they are.  But they can be identified by the biological sex.  That works great. permalink parent award report block reply Just_a_Patriot 56 points 6 days ago No one has to pay along with these people's unchecked imaginations. permalink award report block reply Johnkimble111 2 points 6 days ago I think the genuinely intersex people might have had a case here legally but there’s barely any of those around. Pretty retarded to have trannies bring this case. They always use intersex people as proof of things not being binary and it would be assured to recognise people just basically pretending to be intersex or the opposite sex. permalink parent award report block reply xanax123 3 points 6 days ago Drop the intersex nonsense. Besides the fact it is so insanely rare, a doctor determines their sex at birth so that’s what they are classified as. Continuing to mention them just muddles up the argument and makes it seem like a bigger issue than it is. permalink parent award report block reply BoberFett 2 points 6 days ago The existence of intersex mutations is just the excuse that predators use to gain access to women. Intersex is rare, and they generally don't want to call attention to their condition. It's the predators that announce their presence at every opportunity and threaten women who don't bow in obedience. That's almost all troons. permalink parent award report block reply fazaman 1 points 5 days ago Intersex people are still male or female. They just have abnormalities making it less clear. permalink parent award report block reply Bldg_2019 45 points 6 days ago Cool. Now invalidate the active ones that already have them. Catch some of those faggots overseas as they try to come back and before the holidays. permalink award report block reply CleanUpPhillyTrump24 22 points 6 days ago That's what happens. Their passport gets invalidated and they have to go in and fix it. permalink parent award report block reply Bldg_2019 15 points 6 days ago I misspoke. What I meant to say is invalidate the ones that already have them AND add the individuals to the no fly list. They need to come here like the Cubans do. Or maybe in a shipping container. My apologies to all for not being clear. permalink parent award report block reply PoohBearBalloon 7 points 6 days ago Kek! permalink parent award report block reply possibletower 1 points 6 days ago They do in fact invalidate old passports and give correct gender passports now. Hollywood tranny actor Hunter Schafer crashed out when he received his rightful male passport in the mail and he is the main reason behind this lawsuit. https://www.youtube.com/watch?v=bfcFw_YTOUE permalink parent award report block reply HellNoKameltoe 30 points 6 days ago \"Allows\" as if this is something he needs permission for permalink award report block reply Awan-CIA-Car-Lot 22 points 6 days ago Every time I see the word ALLOWS on a post about courts, I cringe pretty damn hard.  I hate it. permalink parent award report block reply Kraken_V_Algorithm 9 points 6 days ago Supreme Court caves to State Department authority to limit gender passport markers. permalink parent award report block reply Awan-CIA-Car-Lot 6 points 6 days ago Much better 👍 permalink parent award report block reply TenFeetHigher 6 points 6 days ago Correct. \"Allows\" implies the Judicial Branch is above the Executive Branch. permalink parent award report block reply ColonelKlink 25 points 6 days ago Lying on documents is wrong. How about that. permalink award report block reply drattastic1 7 points 6 days ago This is all pretty minor compared to what I fear the SCOTUS is about to do to Trump's tariffs which will pretty much destroy our foreign policy leverage. Then I'm sure they're also going to rule in favor of allowing anchor babies to continue the scam to finish off this country. Ruling for Trump on this minor stuff is window dressing. permalink parent award report block reply possibletower 3 points 6 days ago The problem is Trump is using the type of tariffs that don't have precedents to cover his ass. Some of them like the metals tariffs do have precedents. He declared a state of emergency/state of war for some of his tariffs for example and some retard from the Heritage Foundation told him it is 100% SCOTUS-proof. Heritage fags are fucking retarded. Whomever advised him to use that method was a fucking retard. Trump and his people didn't do their due diligence and they only have themselves to blame if SCOTUS rules against him. Don't be surprised if even Alito and Thomas vote against him. permalink parent award report block reply Appeal2Heaven98 2 points 6 days ago If SCOTUS screws Trump on tariffs, I'm preparing for a long and tumultuous next few decades. That's been the only thing going for him, outside of a few other economic factors. permalink parent award report block reply KernalMustard -2 points 6 days ago Money the root of all evil. Start checking bank accounts of Scotus permalink parent award report block reply possibletower 3 points 6 days ago The problem is Trump is using the type of tariffs that don't have precedents to cover his ass. Some of them like the metals tariffs do have precedents. He declared a state of emergency/state of war for some of his tariffs for example and some retard from the Heritage Foundation told him it is 100% SCOTUS-proof. Heritage fags are fucking retarded. Whomever advised him to use that method was a fucking retard. Trump and his people didn't do their due diligence and they only have themselves to blame if SCOTUS rules against him. Don't be surprised if even Alito and Thomas vote against him. permalink parent award report block reply Watermelons 1 points 5 days ago For the love of money is the root of all evil: which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows. 1TIM 6:10 permalink parent award report block reply JimmyRussler 12 points 6 days ago Trust the science troons. permalink award report block reply ESAsher 3 points 6 days ago They trust the Soyance! permalink parent award report block reply Formerlurker92 9 points 6 days ago When are they gonna get to the birthright citizenship question, cause that's overdue permalink award report block reply YouEssAye 2 points 6 days ago Two more weeks brother. Trust the plan. Trust Sessions. permalink parent award report block reply CleanUpPhillyTrump24 8 points 6 days ago Cue the REEEEE ZIRSELF IS BEING GENOCIDED. Love it. permalink award report block reply RememberCharlieKirk 8 points 6 days ago \"Allows\" The Judicial branch is ridiculous with its unearned and unwarranted authority over every movement by the Trump administration permalink award report block reply Smurfection 5 points 6 days ago ohhhh, Brittany Griner is going to have to a marked as a male again! permalink award report block reply Tookens 5 points 6 days ago The Supreme Court doesn't \"allow\" the executive branch to perform it's legitimate duties.  Fuck right off with that BS. permalink award report block reply Scatter-Shot 5 points 6 days ago Passport is the jurisdiction of the State Department. It is absurd so much money is spent defending this. permalink award report block reply CyanScales 5 points 6 days ago What about Tariffs? permalink award report block reply mathteach314159 7 points 6 days ago Give him the W on this BS, and the L on the important one. I hope I am wrong…. But the 6-3 majority is not really that much of a majority. permalink parent award report block reply CleanUpPhillyTrump24 4 points 6 days ago Soon. permalink parent award report block reply AerialRush 4 points 6 days ago Is anyone else getting tired of these superficial non-\"victories\" over garbage that is ultimately inconsequential? Yes, it's a win for basic common sense and biology, but we have existential problems going on in this country, and it seems like 99% of politicians are doing jack squat about it. permalink award report block reply BurtMcGirt 4 points 6 days ago Absolutely retarded that even went to court. permalink award report block reply F_the_Admin_State 4 points 6 days ago Someone’s gotta take one for the team and put together a Reddit salt collage on this one. permalink award report block reply Deport_O_Matic 4 points 6 days ago Instead of outlawing it as we rightfully should. Just limpdick compromise permalink award report block reply DEPORT50M 4 points 6 days ago Wow, what a big win. A communist pajeet muslim is mayor of New York. So glad we won the battle for faggots playing with vanity genders on passports. Woooooo. Fucking boomers for ruining this fucking country permalink award report block reply Chickensaurus 4 points 6 days ago This is the \"win\" ahead of the tariff loss... permalink award report block reply spezisacuckold 3 points 6 days ago Stop using the word \"allows\". Fundamentally that is NOT what the Supreme Court does. permalink award report block reply FuckU/Spez 3 points 6 days ago Awwwww shit, here we go again.... REEEEEEEEEEEEEEEEEEE permalink award report block reply Quiznos585 3 points 6 days ago Federal judge overrules Supreme Court, orders Trump administration to allow gender identity on passports. permalink award report block reply 67Vert 3 points 6 days ago Other countries should reject passport with incorrect sex permalink award report block reply donkeyKang 2 points 6 days ago Ahh yes. Supreme anti-American Court of Retards. Why do we let them rule on things that are none of their business? permalink award report block reply 26magarat 2 points 6 days ago Literal genocide. permalink award report block reply mateus 2 points 6 days ago They didn't \"allow\" anything. Stop using the left's language. The OP should've used his OWN words. And maybe do a little research or include a proper link to inform us that this was a 6-3 decision, with the Wise Latina🦉, the cigar-smoker, and the DEI hire dissenting. (You're welcome, readers.😃) Trump won his case because SCOTUS ruled in his favor. That's what happened. permalink award report block reply IlhanOmarsFagBrother 2 points 6 days ago Hell yeah I voted for this permalink award report block reply GodKingHarambe 2 points 6 days ago 'On Today's Episode Of:  \"The Is Literally A Genocide\".....passports' permalink award report block reply GarudaDarkblack 2 points 6 days ago The fact that this even had to go to SCOTUS shows how unhealthy our society has become. permalink award report block reply 13Maga135 2 points 6 days ago in other news judge mcconnell just ordered trump to use all the funds to pay snap, all because some redditor thought it would be cool to call up the judge and tattle on trump over pausing the rest of the funds permalink award report block reply 67Vert 2 points 6 days ago Pretty sure it says sex, not make believe gender permalink award report block reply BlueKentuckyGirl 1 points 6 days ago Thanks for the lex18 post Mr Stone 🐸🍻 permalink award report block reply HoganT 1 points 6 days ago Yay. permalink award report block reply PatriotSam 1 points 6 days ago I don't care if Trump didn't accomplish anything else, the fact that he has killed this degenerate weird shit is more than enough for me to praise him as President. I was on the battlegrounds in the early 2010s, yes liberals were talking about it even back then, I saw it coming a mile away. Most of conservatives didn't know what time it was until 2018. permalink award report block reply RudeFrog 1 points 6 days ago Allows.... Yeah ok permalink award report block reply tlorsung 1 points 6 days ago ANOTHER WIN!   More Wins are coming and need to come before I will trust the SCOTUS or Majority of GOP  OR Trump's Staff!   Job Evaluations need to take place Pres T.  Remember your apprentice days, doing a great job just doesn't cut it to SAVE AMERICA Constitution and traditions!  Communism has been in this country for 100s of years but its hasn't been so stronger then now! permalink award report block reply KernalMustard 1 points 6 days ago Allows..... permalink award report block reply asiatrails 1 points 6 days ago Let the irrelevant howling commence..... permalink award report block reply BentoboxCapncrunch 1 points 6 days ago Now do the 4473 permalink award report block reply PeterThielAntiChrist 1 points 6 days ago Democrats won bellweather counties by double digits yesterday. The REAL problem is how to document fags. permalink award report block reply tuaris 0 points 6 days ago Sort of a win.  We need to get Male and Female enshrined in the constitution.  My goodness, why has it come to this?  You could say that the founders never foresaw this, but you'd be thrown in an asylum for simply suggesting such madness back then. permalink award report block reply VonArman 0 points 6 days ago A small win from the supreme court, a bone if you will, before they totally fuck us over on the tariffs  issue. permalink award report block reply\nPyroth5687 107 points 6 days ago Well, Of course... The state department determines what will be on the passport not a retarded troon. permalink award report block reply BlackPilledMAGA 33 points 6 days ago Actually biology determines it, not some fucking troom's wish. permalink parent award report block reply The_Return_of_User_x 11 points 6 days ago I hope he/she passports get invalidated while abroad. permalink parent award report block reply Choppermagic 2 points 6 days ago send them to the middle east permalink parent award report block reply Valiazaner 26 points 6 days ago I mean it's not even that. A Passport is a document owned by the US government entrusted to a citizen. That document is asking a foreign government to allow that citizen entry and to afford them all the rights and privileges an American citizen can expect to enjoy while in that nation. If you are trying to enter a nation such as Saudi Arabia that has none of that non sense then an X or a \"they/them\" on a passport will not only devalue the passport but also potentially put the holder in danger. A passport is a document that is supposed to grant entry to other nations. Weird gender shit weakens the US passport. permalink parent award report block reply NotYourMan 2 points 6 days ago Well that isn't a surprise.  One of the goals of a passport is to identify somebody and they can't be identified by their latest crazy idea of who they are.  But they can be identified by the biological sex.  That works great. permalink parent award report block reply\nBlackPilledMAGA 33 points 6 days ago Actually biology determines it, not some fucking troom's wish. permalink parent award report block reply The_Return_of_User_x 11 points 6 days ago I hope he/she passports get invalidated while abroad. permalink parent award report block reply Choppermagic 2 points 6 days ago send them to the middle east permalink parent award report block reply\nThe_Return_of_User_x 11 points 6 days ago I hope he/she passports get invalidated while abroad. permalink parent award report block reply Choppermagic 2 points 6 days ago send them to the middle east permalink parent award report block reply\nChoppermagic 2 points 6 days ago send them to the middle east permalink parent award report block reply\nValiazaner 26 points 6 days ago I mean it's not even that. A Passport is a document owned by the US government entrusted to a citizen. That document is asking a foreign government to allow that citizen entry and to afford them all the rights and privileges an American citizen can expect to enjoy while in that nation. If you are trying to enter a nation such as Saudi Arabia that has none of that non sense then an X or a \"they/them\" on a passport will not only devalue the passport but also potentially put the holder in danger. A passport is a document that is supposed to grant entry to other nations. Weird gender shit weakens the US passport. permalink parent award report block reply\nNotYourMan 2 points 6 days ago Well that isn't a surprise.  One of the goals of a passport is to identify somebody and they can't be identified by their latest crazy idea of who they are.  But they can be identified by the biological sex.  That works great. permalink parent award report block reply\nJust_a_Patriot 56 points 6 days ago No one has to pay along with these people's unchecked imaginations. permalink award report block reply Johnkimble111 2 points 6 days ago I think the genuinely intersex people might have had a case here legally but there’s barely any of those around. Pretty retarded to have trannies bring this case. They always use intersex people as proof of things not being binary and it would be assured to recognise people just basically pretending to be intersex or the opposite sex. permalink parent award report block reply xanax123 3 points 6 days ago Drop the intersex nonsense. Besides the fact it is so insanely rare, a doctor determines their sex at birth so that’s what they are classified as. Continuing to mention them just muddles up the argument and makes it seem like a bigger issue than it is. permalink parent award report block reply BoberFett 2 points 6 days ago The existence of intersex mutations is just the excuse that predators use to gain access to women. Intersex is rare, and they generally don't want to call attention to their condition. It's the predators that announce their presence at every opportunity and threaten women who don't bow in obedience. That's almost all troons. permalink parent award report block reply fazaman 1 points 5 days ago Intersex people are still male or female. They just have abnormalities making it less clear. permalink parent award report block reply\nJohnkimble111 2 points 6 days ago I think the genuinely intersex people might have had a case here legally but there’s barely any of those around. Pretty retarded to have trannies bring this case. They always use intersex people as proof of things not being binary and it would be assured to recognise people just basically pretending to be intersex or the opposite sex. permalink parent award report block reply xanax123 3 points 6 days ago Drop the intersex nonsense. Besides the fact it is so insanely rare, a doctor determines their sex at birth so that’s what they are classified as. Continuing to mention them just muddles up the argument and makes it seem like a bigger issue than it is. permalink parent award report block reply BoberFett 2 points 6 days ago The existence of intersex mutations is just the excuse that predators use to gain access to women. Intersex is rare, and they generally don't want to call attention to their condition. It's the predators that announce their presence at every opportunity and threaten women who don't bow in obedience. That's almost all troons. permalink parent award report block reply fazaman 1 points 5 days ago Intersex people are still male or female. They just have abnormalities making it less clear. permalink parent award report block reply\nxanax123 3 points 6 days ago Drop the intersex nonsense. Besides the fact it is so insanely rare, a doctor determines their sex at birth so that’s what they are classified as. Continuing to mention them just muddles up the argument and makes it seem like a bigger issue than it is. permalink parent award report block reply BoberFett 2 points 6 days ago The existence of intersex mutations is just the excuse that predators use to gain access to women. Intersex is rare, and they generally don't want to call attention to their condition. It's the predators that announce their presence at every opportunity and threaten women who don't bow in obedience. That's almost all troons. permalink parent award report block reply\nBoberFett 2 points 6 days ago The existence of intersex mutations is just the excuse that predators use to gain access to women. Intersex is rare, and they generally don't want to call attention to their condition. It's the predators that announce their presence at every opportunity and threaten women who don't bow in obedience. That's almost all troons. permalink parent award report block reply\nfazaman 1 points 5 days ago Intersex people are still male or female. They just have abnormalities making it less clear. permalink parent award report block reply\nBldg_2019 45 points 6 days ago Cool. Now invalidate the active ones that already have them. Catch some of those faggots overseas as they try to come back and before the holidays. permalink award report block reply CleanUpPhillyTrump24 22 points 6 days ago That's what happens. Their passport gets invalidated and they have to go in and fix it. permalink parent award report block reply Bldg_2019 15 points 6 days ago I misspoke. What I meant to say is invalidate the ones that already have them AND add the individuals to the no fly list. They need to come here like the Cubans do. Or maybe in a shipping container. My apologies to all for not being clear. permalink parent award report block reply PoohBearBalloon 7 points 6 days ago Kek! permalink parent award report block reply possibletower 1 points 6 days ago They do in fact invalidate old passports and give correct gender passports now. Hollywood tranny actor Hunter Schafer crashed out when he received his rightful male passport in the mail and he is the main reason behind this lawsuit. https://www.youtube.com/watch?v=bfcFw_YTOUE permalink parent award report block reply\nCleanUpPhillyTrump24 22 points 6 days ago That's what happens. Their passport gets invalidated and they have to go in and fix it. permalink parent award report block reply Bldg_2019 15 points 6 days ago I misspoke. What I meant to say is invalidate the ones that already have them AND add the individuals to the no fly list. They need to come here like the Cubans do. Or maybe in a shipping container. My apologies to all for not being clear. permalink parent award report block reply PoohBearBalloon 7 points 6 days ago Kek! permalink parent award report block reply\nBldg_2019 15 points 6 days ago I misspoke. What I meant to say is invalidate the ones that already have them AND add the individuals to the no fly list. They need to come here like the Cubans do. Or maybe in a shipping container. My apologies to all for not being clear. permalink parent award report block reply PoohBearBalloon 7 points 6 days ago Kek! permalink parent award report block reply\nPoohBearBalloon 7 points 6 days ago Kek! permalink parent award report block reply\npossibletower 1 points 6 days ago They do in fact invalidate old passports and give correct gender passports now. Hollywood tranny actor Hunter Schafer crashed out when he received his rightful male passport in the mail and he is the main reason behind this lawsuit. https://www.youtube.com/watch?v=bfcFw_YTOUE permalink parent award report block reply\nHellNoKameltoe 30 points 6 days ago \"Allows\" as if this is something he needs permission for permalink award report block reply Awan-CIA-Car-Lot 22 points 6 days ago Every time I see the word ALLOWS on a post about courts, I cringe pretty damn hard.  I hate it. permalink parent award report block reply Kraken_V_Algorithm 9 points 6 days ago Supreme Court caves to State Department authority to limit gender passport markers. permalink parent award report block reply Awan-CIA-Car-Lot 6 points 6 days ago Much better 👍 permalink parent award report block reply TenFeetHigher 6 points 6 days ago Correct. \"Allows\" implies the Judicial Branch is above the Executive Branch. permalink parent award report block reply\nAwan-CIA-Car-Lot 22 points 6 days ago Every time I see the word ALLOWS on a post about courts, I cringe pretty damn hard.  I hate it. permalink parent award report block reply Kraken_V_Algorithm 9 points 6 days ago Supreme Court caves to State Department authority to limit gender passport markers. permalink parent award report block reply Awan-CIA-Car-Lot 6 points 6 days ago Much better 👍 permalink parent award report block reply\nKraken_V_Algorithm 9 points 6 days ago Supreme Court caves to State Department authority to limit gender passport markers. permalink parent award report block reply Awan-CIA-Car-Lot 6 points 6 days ago Much better 👍 permalink parent award report block reply\nAwan-CIA-Car-Lot 6 points 6 days ago Much better 👍 permalink parent award report block reply\nTenFeetHigher 6 points 6 days ago Correct. \"Allows\" implies the Judicial Branch is above the Executive Branch. permalink parent award report block reply\nColonelKlink 25 points 6 days ago Lying on documents is wrong. How about that. permalink award report block reply drattastic1 7 points 6 days ago This is all pretty minor compared to what I fear the SCOTUS is about to do to Trump's tariffs which will pretty much destroy our foreign policy leverage. Then I'm sure they're also going to rule in favor of allowing anchor babies to continue the scam to finish off this country. Ruling for Trump on this minor stuff is window dressing. permalink parent award report block reply possibletower 3 points 6 days ago The problem is Trump is using the type of tariffs that don't have precedents to cover his ass. Some of them like the metals tariffs do have precedents. He declared a state of emergency/state of war for some of his tariffs for example and some retard from the Heritage Foundation told him it is 100% SCOTUS-proof. Heritage fags are fucking retarded. Whomever advised him to use that method was a fucking retard. Trump and his people didn't do their due diligence and they only have themselves to blame if SCOTUS rules against him. Don't be surprised if even Alito and Thomas vote against him. permalink parent award report block reply Appeal2Heaven98 2 points 6 days ago If SCOTUS screws Trump on tariffs, I'm preparing for a long and tumultuous next few decades. That's been the only thing going for him, outside of a few other economic factors. permalink parent award report block reply KernalMustard -2 points 6 days ago Money the root of all evil. Start checking bank accounts of Scotus permalink parent award report block reply possibletower 3 points 6 days ago The problem is Trump is using the type of tariffs that don't have precedents to cover his ass. Some of them like the metals tariffs do have precedents. He declared a state of emergency/state of war for some of his tariffs for example and some retard from the Heritage Foundation told him it is 100% SCOTUS-proof. Heritage fags are fucking retarded. Whomever advised him to use that method was a fucking retard. Trump and his people didn't do their due diligence and they only have themselves to blame if SCOTUS rules against him. Don't be surprised if even Alito and Thomas vote against him. permalink parent award report block reply Watermelons 1 points 5 days ago For the love of money is the root of all evil: which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows. 1TIM 6:10 permalink parent award report block reply\ndrattastic1 7 points 6 days ago This is all pretty minor compared to what I fear the SCOTUS is about to do to Trump's tariffs which will pretty much destroy our foreign policy leverage. Then I'm sure they're also going to rule in favor of allowing anchor babies to continue the scam to finish off this country. Ruling for Trump on this minor stuff is window dressing. permalink parent award report block reply possibletower 3 points 6 days ago The problem is Trump is using the type of tariffs that don't have precedents to cover his ass. Some of them like the metals tariffs do have precedents. He declared a state of emergency/state of war for some of his tariffs for example and some retard from the Heritage Foundation told him it is 100% SCOTUS-proof. Heritage fags are fucking retarded. Whomever advised him to use that method was a fucking retard. Trump and his people didn't do their due diligence and they only have themselves to blame if SCOTUS rules against him. Don't be surprised if even Alito and Thomas vote against him. permalink parent award report block reply Appeal2Heaven98 2 points 6 days ago If SCOTUS screws Trump on tariffs, I'm preparing for a long and tumultuous next few decades. That's been the only thing going for him, outside of a few other economic factors. permalink parent award report block reply KernalMustard -2 points 6 days ago Money the root of all evil. Start checking bank accounts of Scotus permalink parent award report block reply possibletower 3 points 6 days ago The problem is Trump is using the type of tariffs that don't have precedents to cover his ass. Some of them like the metals tariffs do have precedents. He declared a state of emergency/state of war for some of his tariffs for example and some retard from the Heritage Foundation told him it is 100% SCOTUS-proof. Heritage fags are fucking retarded. Whomever advised him to use that method was a fucking retard. Trump and his people didn't do their due diligence and they only have themselves to blame if SCOTUS rules against him. Don't be surprised if even Alito and Thomas vote against him. permalink parent award report block reply Watermelons 1 points 5 days ago For the love of money is the root of all evil: which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows. 1TIM 6:10 permalink parent award report block reply\npossibletower 3 points 6 days ago The problem is Trump is using the type of tariffs that don't have precedents to cover his ass. Some of them like the metals tariffs do have precedents. He declared a state of emergency/state of war for some of his tariffs for example and some retard from the Heritage Foundation told him it is 100% SCOTUS-proof. Heritage fags are fucking retarded. Whomever advised him to use that method was a fucking retard. Trump and his people didn't do their due diligence and they only have themselves to blame if SCOTUS rules against him. Don't be surprised if even Alito and Thomas vote against him. permalink parent award report block reply\nAppeal2Heaven98 2 points 6 days ago If SCOTUS screws Trump on tariffs, I'm preparing for a long and tumultuous next few decades. That's been the only thing going for him, outside of a few other economic factors. permalink parent award report block reply\nKernalMustard -2 points 6 days ago Money the root of all evil. Start checking bank accounts of Scotus permalink parent award report block reply possibletower 3 points 6 days ago The problem is Trump is using the type of tariffs that don't have precedents to cover his ass. Some of them like the metals tariffs do have precedents. He declared a state of emergency/state of war for some of his tariffs for example and some retard from the Heritage Foundation told him it is 100% SCOTUS-proof. Heritage fags are fucking retarded. Whomever advised him to use that method was a fucking retard. Trump and his people didn't do their due diligence and they only have themselves to blame if SCOTUS rules against him. Don't be surprised if even Alito and Thomas vote against him. permalink parent award report block reply Watermelons 1 points 5 days ago For the love of money is the root of all evil: which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows. 1TIM 6:10 permalink parent award report block reply\npossibletower 3 points 6 days ago The problem is Trump is using the type of tariffs that don't have precedents to cover his ass. Some of them like the metals tariffs do have precedents. He declared a state of emergency/state of war for some of his tariffs for example and some retard from the Heritage Foundation told him it is 100% SCOTUS-proof. Heritage fags are fucking retarded. Whomever advised him to use that method was a fucking retard. Trump and his people didn't do their due diligence and they only have themselves to blame if SCOTUS rules against him. Don't be surprised if even Alito and Thomas vote against him. permalink parent award report block reply\nWatermelons 1 points 5 days ago For the love of money is the root of all evil: which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows. 1TIM 6:10 permalink parent award report block reply\nJimmyRussler 12 points 6 days ago Trust the science troons. permalink award report block reply ESAsher 3 points 6 days ago They trust the Soyance! permalink parent award report block reply\nESAsher 3 points 6 days ago They trust the Soyance! permalink parent award report block reply\nFormerlurker92 9 points 6 days ago When are they gonna get to the birthright citizenship question, cause that's overdue permalink award report block reply YouEssAye 2 points 6 days ago Two more weeks brother. Trust the plan. Trust Sessions. permalink parent award report block reply\nYouEssAye 2 points 6 days ago Two more weeks brother. Trust the plan. Trust Sessions. permalink parent award report block reply\nCleanUpPhillyTrump24 8 points 6 days ago Cue the REEEEE ZIRSELF IS BEING GENOCIDED. Love it. permalink award report block reply\nRememberCharlieKirk 8 points 6 days ago \"Allows\" The Judicial branch is ridiculous with its unearned and unwarranted authority over every movement by the Trump administration permalink award report block reply\nSmurfection 5 points 6 days ago ohhhh, Brittany Griner is going to have to a marked as a male again! permalink award report block reply\nTookens 5 points 6 days ago The Supreme Court doesn't \"allow\" the executive branch to perform it's legitimate duties.  Fuck right off with that BS. permalink award report block reply\nScatter-Shot 5 points 6 days ago Passport is the jurisdiction of the State Department. It is absurd so much money is spent defending this. permalink award report block reply\nCyanScales 5 points 6 days ago What about Tariffs? permalink award report block reply mathteach314159 7 points 6 days ago Give him the W on this BS, and the L on the important one. I hope I am wrong…. But the 6-3 majority is not really that much of a majority. permalink parent award report block reply CleanUpPhillyTrump24 4 points 6 days ago Soon. permalink parent award report block reply\nmathteach314159 7 points 6 days ago Give him the W on this BS, and the L on the important one. I hope I am wrong…. But the 6-3 majority is not really that much of a majority. permalink parent award report block reply\nCleanUpPhillyTrump24 4 points 6 days ago Soon. permalink parent award report block reply\nAerialRush 4 points 6 days ago Is anyone else getting tired of these superficial non-\"victories\" over garbage that is ultimately inconsequential? Yes, it's a win for basic common sense and biology, but we have existential problems going on in this country, and it seems like 99% of politicians are doing jack squat about it. permalink award report block reply\nBurtMcGirt 4 points 6 days ago Absolutely retarded that even went to court. permalink award report block reply\nF_the_Admin_State 4 points 6 days ago Someone’s gotta take one for the team and put together a Reddit salt collage on this one. permalink award report block reply\nDeport_O_Matic 4 points 6 days ago Instead of outlawing it as we rightfully should. Just limpdick compromise permalink award report block reply\nDEPORT50M 4 points 6 days ago Wow, what a big win. A communist pajeet muslim is mayor of New York. So glad we won the battle for faggots playing with vanity genders on passports. Woooooo. Fucking boomers for ruining this fucking country permalink award report block reply\nChickensaurus 4 points 6 days ago This is the \"win\" ahead of the tariff loss... permalink award report block reply\nspezisacuckold 3 points 6 days ago Stop using the word \"allows\". Fundamentally that is NOT what the Supreme Court does. permalink award report block reply\nFuckU/Spez 3 points 6 days ago Awwwww shit, here we go again.... REEEEEEEEEEEEEEEEEEE permalink award report block reply\nQuiznos585 3 points 6 days ago Federal judge overrules Supreme Court, orders Trump administration to allow gender identity on passports. permalink award report block reply\n67Vert 3 points 6 days ago Other countries should reject passport with incorrect sex permalink award report block reply\ndonkeyKang 2 points 6 days ago Ahh yes. Supreme anti-American Court of Retards. Why do we let them rule on things that are none of their business? permalink award report block reply\n26magarat 2 points 6 days ago Literal genocide. permalink award report block reply\nmateus 2 points 6 days ago They didn't \"allow\" anything. Stop using the left's language. The OP should've used his OWN words. And maybe do a little research or include a proper link to inform us that this was a 6-3 decision, with the Wise Latina🦉, the cigar-smoker, and the DEI hire dissenting. (You're welcome, readers.😃) Trump won his case because SCOTUS ruled in his favor. That's what happened. permalink award report block reply\nIlhanOmarsFagBrother 2 points 6 days ago Hell yeah I voted for this permalink award report block reply\nGodKingHarambe 2 points 6 days ago 'On Today's Episode Of:  \"The Is Literally A Genocide\".....passports' permalink award report block reply\nGarudaDarkblack 2 points 6 days ago The fact that this even had to go to SCOTUS shows how unhealthy our society has become. permalink award report block reply\n13Maga135 2 points 6 days ago in other news judge mcconnell just ordered trump to use all the funds to pay snap, all because some redditor thought it would be cool to call up the judge and tattle on trump over pausing the rest of the funds permalink award report block reply\n67Vert 2 points 6 days ago Pretty sure it says sex, not make believe gender permalink award report block reply\nBlueKentuckyGirl 1 points 6 days ago Thanks for the lex18 post Mr Stone 🐸🍻 permalink award report block reply\nHoganT 1 points 6 days ago Yay. permalink award report block reply\nPatriotSam 1 points 6 days ago I don't care if Trump didn't accomplish anything else, the fact that he has killed this degenerate weird shit is more than enough for me to praise him as President. I was on the battlegrounds in the early 2010s, yes liberals were talking about it even back then, I saw it coming a mile away. Most of conservatives didn't know what time it was until 2018. permalink award report block reply\nRudeFrog 1 points 6 days ago Allows.... Yeah ok permalink award report block reply\ntlorsung 1 points 6 days ago ANOTHER WIN!   More Wins are coming and need to come before I will trust the SCOTUS or Majority of GOP  OR Trump's Staff!   Job Evaluations need to take place Pres T.  Remember your apprentice days, doing a great job just doesn't cut it to SAVE AMERICA Constitution and traditions!  Communism has been in this country for 100s of years but its hasn't been so stronger then now! permalink award report block reply\nKernalMustard 1 points 6 days ago Allows..... permalink award report block reply\nasiatrails 1 points 6 days ago Let the irrelevant howling commence..... permalink award report block reply\nBentoboxCapncrunch 1 points 6 days ago Now do the 4473 permalink award report block reply\nPeterThielAntiChrist 1 points 6 days ago Democrats won bellweather counties by double digits yesterday. The REAL problem is how to document fags. permalink award report block reply\ntuaris 0 points 6 days ago Sort of a win.  We need to get Male and Female enshrined in the constitution.  My goodness, why has it come to this?  You could say that the founders never foresaw this, but you'd be thrown in an asylum for simply suggesting such madness back then. permalink award report block reply\nVonArman 0 points 6 days ago A small win from the supreme court, a bone if you will, before they totally fuck us over on the tariffs  issue. permalink award report block reply"
}