{
  "id": "8176961",
  "title": "1278Trump Considers REVOKING Entire Childhood Vaccine Schedule..(eccentrik.substack.com)posted4 days",
  "url": "https://patriots.win/p/1ARK57tKkb/trump-considers-revoking-entire-/c",
  "content": "1278 Trump Considers REVOKING Entire Childhood Vaccine Schedule.. (eccentrik.substack.com) posted 4 days ago by Eccentrik 71 comments award share report block \"Trump Wants the Entire Childhood Vaccine Schedule Revisited\" This, according to Dr. Robert W. Malone who was recently named to the Advisory Committee on Immunization Practices by RFK Jr. eccentrik.substack.com\n71 comments Sort by Top Top New Worst Old Save MemeWarsVet 65 points 4 days ago Revised is not revoked. permalink award report block reply Hanging_Chad 29 points 4 days ago revisited isn’t always revised permalink parent award report block reply Simple_Doot 19 points 4 days ago Revisited isn't always anything at all. permalink parent award report block reply mikethemarine 14 points 4 days ago not a single illegal HAS to take any of them, ever wonder why? permalink parent award report block reply rebuildingMyself 12 points 4 days ago They also got to stream over the border without as much as a qtip up the nose during COVID when they were harassing priests for having service permalink parent award report block reply carpetxparmesan 3 points 4 days ago Rhetorical question aside it's because the government doesn't impeach and hang judges. Half of them are pieces of shit and they tend to be responsible for almost all the problems. Your gun rights are gone? Blame a judge. Illegals being flooded into the US so Democrats and Uniparty rinos can get \"elected\"? Blame a judge. Those fucks need to be removed from office at a minimum, and some of them need to be put on trial and killed. If you can't read the second amendment in plain english, put them on trial and fucking hang them. Do you see \"shall not be infringed\"? GET IN THE FUCKING NOOSE! I don't mean any of you should hang judges, I mean the executive should prosecute them and hang every judge who can't read \"shall not be infringed\" in plain english. That's not a judicial \"opinion\". That's motherfucking infringement of the highest order of a citizen's God given rights. It's both a legal AND religious VIOLATION. As in they stuck their legal dick in you and RAPED you where your God lives. permalink parent award report block reply suckmycorona 2 points 4 days ago Hey we looked at it. permalink parent award report block reply guywholikesDjtof2024 14 points 4 days ago This. Why did OP say \"revoked\"? permalink parent award report block reply MemeWarsVet 16 points 4 days ago OP retarded. permalink parent award report block reply zooty 13 points 4 days ago OP vaccinated. Or Tylenated. permalink parent award report block reply Error404 2 points 4 days ago Could also be dilated! permalink parent award report block reply MaxJohnson 7 points 4 days ago OP prolly geh permalink parent award report block reply True_Curmudgeon 5 points 4 days ago BIG GAY permalink parent award report block reply view 1 more comments... Washington_Redskins 6 points 4 days ago Considers.\n.\nNot sure of the validity of the article, but the article does have the following alleged quote from Dr Malone: \"He wants to know whether or not there’s actual science behind that entire schedule, and whether or not it needs to be reconsidered or even revoked\" permalink parent award report block reply thrakaa40k 3 points 4 days ago \"Reconsidered or Revoked\" is appropriate.  Revisited, Reconsidered, and Revoked are used in the article/video.  Revised is not. permalink parent award report block reply ADAM_SCHITT 0 points 4 days ago Click the link permalink parent award report block reply MSG1000 4 points 4 days ago The article includes revoked as a possibility. permalink parent award report block reply deleted 23 points 4 days ago SpellingContable 15 points 4 days ago Teachers enter the chat. permalink parent award report block reply Cowboy888 5 points 4 days ago Teachers get over 10 covid shots a year. permalink parent award report block reply SpellingContable 4 points 4 days ago Their elixir of a gay and happy life permalink parent award report block reply deleted 3 points 4 days ago duznmatter 4 points 4 days ago The Amish are in my neighbor hood and their children are without blemish skin wise. Healthy vibrant kids with what looks like clean inside and out. permalink parent award report block reply carpetxparmesan 1 points 4 days ago Ukrainians don't make enough money every month to afford food. There, I've solved the mystery for you. Their average salary is like 1000 to 1500 euros a month. They pay 4-600 euros in rent. Look up the average ukrainian hruschinka or stalinka apartment. Don't pay attention to those coked up fuckheads driving ferraris off laundered NATO money. They drink vodka and eat RAW FAT and still can't get fat because they're STILL in a caloric deficit. Also, let me tell you something that will blow your fucking mind about Ukraine. You ready? This is going to seem trivial and inconsequential to you but... imagine... you could only wear ONE pair of pants for the next 10 years because pants are hard to buy. You can't find pants. You have to go to a big city to even find two different styles of pants. Or you have to shop on alibaba. Do you think your ass would A. get fatter and fatter, changing pant sizes every month until by month 4 you had to LITERALLY walk outside in the freezing cold in nothing but your underwear or ... B. you would watch your portion size to KEEP YOUR PANT SIZE. Might seem crazy to people in the USA but that shit is reality for a lot of the globe. permalink parent award report block reply _Sully_ 1 points 4 days ago I honestly wish that were true but I wouldn't want to take away the blame from the retarded parents that made them. permalink parent award report block reply DiamondDroid 1 points 4 days ago ...and the frogs. permalink parent award report block reply utfanx2 19 points 4 days ago Vaccines cause autism, and social disorders make it harder to  breed. Just another depopulation scam like abortion and LGBT. permalink award report block reply TenaciousDT 2 points 4 days ago I concur... unless you're Elon permalink parent award report block reply Cowboy888 17 points 4 days ago Dr. Malone is a genius! Turn him loose! permalink award report block reply DingleBalls 16 points 4 days ago Good. Schools have driven this crap forever. They won't let you register your kid without proof of a host of vaccines. Its no one's goddamn business what shots my kid has had or not had. If your kid had theirs and you trust it then its supposed to be a shield so my kid couldn't infect yours. Its not an \"everyone needs to take it to make it work for anyone\" thing. permalink award report block reply zooty 10 points 4 days ago Follow the money and you'll end back at the pharma industry, guaranteed. There's no ideology about this, just profit. permalink parent award report block reply TrumpAndGodWin 3 points 4 days ago If it were just about profit they wouldn't've put sv40 etc in there and cause tens of millions of cancer deaths over the decades. permalink parent award report block reply suckmycorona 1 points 4 days ago Well they have pills for that as well so there it is. permalink parent award report block reply Filo76 3 points 4 days ago Doctors, pediatricians… are motivated to push the full schedule. They get bonus money for doing so. It’s like a retard pyramid scheme of making money by making kids, and civilization, sick. permalink parent award report block reply zooty 4 points 4 days ago Yes. But I bet you'll find it in these school mandates too. In a way, they're worse. You can say no to a doctor but the school system is more of a forcing factor. permalink parent award report block reply True_Curmudgeon 4 points 4 days ago Tards sending their tard spawn to .gov schools permalink parent award report block reply Grindelwald 13 points 4 days ago Do it! permalink award report block reply GenWashington 6 points 4 days ago We need complete freedom from bureaucrats permalink parent award report block reply SorosHasBallsackEyes 6 points 4 days ago Vaccines should be optional.\nThere should be no protection for the manufacturers.\nDamages should have no limit.\nThe real price for fear is higher than people calculate. My son's autism was due to the MMR vaccine. If I could change one moment jn time, it would be that one. permalink award report block reply ColonelKlink 6 points 4 days ago It should be. permalink award report block reply alina_habbas_fanclub 5 points 4 days ago Bye Bye Autism and SIDS.......and a few other things. permalink award report block reply Lady_MaGa 1 points 4 days ago Autoimmune problems on that list. permalink parent award report block reply LordOfTheReeeeengs 1 points 4 days ago Cancers too permalink parent award report block reply Oldman1234 4 points 4 days ago And a radical activist District Court Judge will overturn Trump's determination and will not only reinstate the Childhood Vaccination Schedule but will summarily order the immediate vaccination of every child in America. permalink award report block reply tired-of-crap 4 points 4 days ago Why not?? I don't see vaccine administration as an enumerated power of the federal government so this should be done solely by the states. Let's bring the federal government back to only it's enumerated powers. permalink award report block reply Sh1nyH4ppy 3 points 4 days ago If you read and/or watched, Dr Malone actually said the word revoked:\n“He wants to know whether or not there’s actual science behind that entire schedule, and whether or not it needs to be reconsidered or even revoked.” permalink award report block reply keeman 3 points 4 days ago Which part of the Constitution gives the fedgov permission to create a vaccine schedule?  Which part authorizes the FDA or CDC to exist or to require prescriptions or drug authorization?  Why to we the people put up with this shit? permalink award report block reply TrumpAndGodWin 2 points 4 days ago Good news is that depending on the poll, 40 to 80% of Americans don't trust the CDC. permalink parent award report block reply unotrumpcard 3 points 4 days ago Trump, the 79 year old consideroor. \"Im gonna considooooor\" permalink award report block reply FreedomFlowerDelta 3 points 4 days ago If you so much as trip and fall on my property, I am liable for lifelong injuries. But if I manufacture a \"pharmaceutical injection\",  meh....use at your own required risk permalink award report block reply Smurfection 3 points 4 days ago It should all be revoked.  All of it. Watch this movie by Del Bigtree: https://www.aninconvenientstudy.com permalink award report block reply 5DchessWatch 3 points 4 days ago Stop considering Stop mulling Stop thinking about Stop proposing Stop looking into As sloppy steve says Action Action Action permalink award report block reply carpetxparmesan 2 points 4 days ago FUCK. YES. Let people make informed decisions. Yeah, I want to stick this needle in my kid, no I don't want to stick that needle in my kid, no I don't want to stick any needles in my kid and play the survival lottery. Bring back freedom of fucking association. Just get government the fuck out of EVERYTHING related to healthcare. They do not know what the fuck they are doing and when they DO know, half the time it's to fuck YOU over. It's none of their fucking business how you treat your kid until they turn 18 or if they can even read or eat dirt or not. Not your kid, not your problem, deal with them however you will once they turn 18. If their dumb ass dies of cholera, so be it. If their dumb ass gets shot by another citizen because they robbed a 7/11, the more the fucking merrier. I guarantee I can protect my family better than the government can. In every which way except for communists. I still, as of yet, have not found a personal solution to communists. But every fucking other problem, I can take care of myself. ALL problems, I can deal with myself. No challenge too great, no toilet water pipe too dirty. Except communists, because those have to be eradicated by the millions and I can't save up enough money to nuke their fucking ass out of the atmosphere to be scattered to the solar winds they came from. I do not need to be taxed for anything except the eradication of every communist in every crevice of this planet. But I'll settle for exterminating all of them here at home. I will work for MY PEOPLE, the American people, for free, out of the goodness of my heart, educating them on how to keep their kids safe - if that's what it has to come to. You don't have to put a gun to my head to take money out of my pocket to tell my neighbor you're going to burn their fucking kids to a crisp if they don't vaxx them. permalink award report block reply AgnesDomini 2 points 4 days ago Let's fucking gooooooo already! RFK, Jr. Is on record saying that NONE of them were properly tested! permalink award report block reply Covfefe_And_Justice 2 points 4 days ago Don't consider it, just do it! permalink award report block reply BigE_123456 2 points 4 days ago Let's keep revisiting FOREVER and harming more children!!!!!!!! Meanwhile in an Ahmish community................................................................................................................................................................................................................................................................................................................................\"Look Mom! No Autism!\" permalink award report block reply Krat 1 points 4 days ago And when states ignore it and demand it anyways ? permalink award report block reply carpetxparmesan 1 points 4 days ago That's a good point. Do you want to answer your own question? I feel like you know the answer to that. I know the answer, you know the answer. Maybe some people that drive by don't know the answer. So let's talk about it! permalink parent award report block reply ThisIsHowItStarts 1 points 4 days ago But discounted Ozempic for everyone permalink award report block reply Cuttinmuffins 1 points 4 days ago Trump considers, Trump suggests, Trump asks for help, Trump pleads, Trump threatens. Sorry, didn't vote for Trump to ask for help from the people I voted for Trump to prosecute and toss in prison. This admin has been nothing but empty threats, broke promises, and buried conspiracy with Israel the only party to actually get anything out of it. What happened to MAGA, to I will prosecute election fraud, mass deportation, arrests and prosecution of Antifa, some kind of benefit for the people that suffered 4 years of torture, starvation, and beatings for standing up for him in 2020, to throwing the crooked pols in the Dem and rep party in prison for good? We get Trust Graham, he never lets us down? We got three years to kick Trump in his ass to get the fuck to work. Standing around pretending anything he has done is of any consequence to this point is idiotic to say the least. As soon as the left is back in power, and Trump just told you all \"if and when they take back power\", this country is done. USSA with all the murder, starvation, and death that every color revolution has brought along with it will befall the American people. Will befall YOU.  So call me black pilled or whatever lefty type label you can apply to close people's eyes, but know, this is what approaches, and we have little time, but enough time at this point, to stop it. permalink award report block reply JesusTheOnlyWay 1 points 4 days ago Considers... Revisiting.... Yawn permalink award report block reply FUCK_TYLER 1 points 3 days ago YES!!! permalink award report block reply Stanwyk74 1 points 4 days ago Long fucking overdue permalink award report block reply DiamondDroid 1 points 4 days ago Good, go back to the pre seventies schedule. Keep it light, simple and only what is essential. permalink award report block reply AlphaOmaga 1 points 3 days ago Revise. To old definition of necessary vaccines. Also should be a parent’s choice. And yes. Some vaccines should be necessary to attend public schools. Better to homeschool anyway. But let’s face it. We bred generations of parents that are incapable. Would be great to reverse that honestly. Start with virtual public school if you can. permalink award report block reply ingrowntoenail -7 points 4 days ago No.  Pre-covid vaccines save lives.  We used to make fun of the liberals that were anti-vaxxers before covid. permalink award report block reply LordKuroTheGreat 12 points 4 days ago And that was wrongheaded and driven largely by pharma bots on reddit and paid off media shills. Everything should always be under review and axed if uneeded or too risky. permalink parent award report block reply carpetxparmesan 2 points 4 days ago Axed?! Why Axed?! Why can't a company just make a drug and sell it to you and you buy it? What the fuck is we axing here? Don't answer that, it's rhetorical question. permalink parent award report block reply zooty 5 points 4 days ago No. I just thought they were misguided. But they have questions which deserve answers, especially since it turns out that the 'trust the science' people often skip the science part. permalink parent award report block reply TheGreatWhiteNorth 3 points 4 days ago Good luck proving that.  Big Pharma controls the info and Big Pharma says 'vaccines' save lives.  \"Safe and effective.\"  See where I'm going with this? permalink parent award report block reply carpetxparmesan 1 points 4 days ago DO THEY tho? Or do the amish just die at the same rates of DIFFERENT diseases than you? Honestly don't remember the answer. You should look up the mortality and educate me. permalink parent award report block reply\nMemeWarsVet 65 points 4 days ago Revised is not revoked. permalink award report block reply Hanging_Chad 29 points 4 days ago revisited isn’t always revised permalink parent award report block reply Simple_Doot 19 points 4 days ago Revisited isn't always anything at all. permalink parent award report block reply mikethemarine 14 points 4 days ago not a single illegal HAS to take any of them, ever wonder why? permalink parent award report block reply rebuildingMyself 12 points 4 days ago They also got to stream over the border without as much as a qtip up the nose during COVID when they were harassing priests for having service permalink parent award report block reply carpetxparmesan 3 points 4 days ago Rhetorical question aside it's because the government doesn't impeach and hang judges. Half of them are pieces of shit and they tend to be responsible for almost all the problems. Your gun rights are gone? Blame a judge. Illegals being flooded into the US so Democrats and Uniparty rinos can get \"elected\"? Blame a judge. Those fucks need to be removed from office at a minimum, and some of them need to be put on trial and killed. If you can't read the second amendment in plain english, put them on trial and fucking hang them. Do you see \"shall not be infringed\"? GET IN THE FUCKING NOOSE! I don't mean any of you should hang judges, I mean the executive should prosecute them and hang every judge who can't read \"shall not be infringed\" in plain english. That's not a judicial \"opinion\". That's motherfucking infringement of the highest order of a citizen's God given rights. It's both a legal AND religious VIOLATION. As in they stuck their legal dick in you and RAPED you where your God lives. permalink parent award report block reply suckmycorona 2 points 4 days ago Hey we looked at it. permalink parent award report block reply guywholikesDjtof2024 14 points 4 days ago This. Why did OP say \"revoked\"? permalink parent award report block reply MemeWarsVet 16 points 4 days ago OP retarded. permalink parent award report block reply zooty 13 points 4 days ago OP vaccinated. Or Tylenated. permalink parent award report block reply Error404 2 points 4 days ago Could also be dilated! permalink parent award report block reply MaxJohnson 7 points 4 days ago OP prolly geh permalink parent award report block reply True_Curmudgeon 5 points 4 days ago BIG GAY permalink parent award report block reply view 1 more comments... Washington_Redskins 6 points 4 days ago Considers.\n.\nNot sure of the validity of the article, but the article does have the following alleged quote from Dr Malone: \"He wants to know whether or not there’s actual science behind that entire schedule, and whether or not it needs to be reconsidered or even revoked\" permalink parent award report block reply thrakaa40k 3 points 4 days ago \"Reconsidered or Revoked\" is appropriate.  Revisited, Reconsidered, and Revoked are used in the article/video.  Revised is not. permalink parent award report block reply ADAM_SCHITT 0 points 4 days ago Click the link permalink parent award report block reply MSG1000 4 points 4 days ago The article includes revoked as a possibility. permalink parent award report block reply\nHanging_Chad 29 points 4 days ago revisited isn’t always revised permalink parent award report block reply Simple_Doot 19 points 4 days ago Revisited isn't always anything at all. permalink parent award report block reply mikethemarine 14 points 4 days ago not a single illegal HAS to take any of them, ever wonder why? permalink parent award report block reply rebuildingMyself 12 points 4 days ago They also got to stream over the border without as much as a qtip up the nose during COVID when they were harassing priests for having service permalink parent award report block reply carpetxparmesan 3 points 4 days ago Rhetorical question aside it's because the government doesn't impeach and hang judges. Half of them are pieces of shit and they tend to be responsible for almost all the problems. Your gun rights are gone? Blame a judge. Illegals being flooded into the US so Democrats and Uniparty rinos can get \"elected\"? Blame a judge. Those fucks need to be removed from office at a minimum, and some of them need to be put on trial and killed. If you can't read the second amendment in plain english, put them on trial and fucking hang them. Do you see \"shall not be infringed\"? GET IN THE FUCKING NOOSE! I don't mean any of you should hang judges, I mean the executive should prosecute them and hang every judge who can't read \"shall not be infringed\" in plain english. That's not a judicial \"opinion\". That's motherfucking infringement of the highest order of a citizen's God given rights. It's both a legal AND religious VIOLATION. As in they stuck their legal dick in you and RAPED you where your God lives. permalink parent award report block reply suckmycorona 2 points 4 days ago Hey we looked at it. permalink parent award report block reply\nSimple_Doot 19 points 4 days ago Revisited isn't always anything at all. permalink parent award report block reply mikethemarine 14 points 4 days ago not a single illegal HAS to take any of them, ever wonder why? permalink parent award report block reply rebuildingMyself 12 points 4 days ago They also got to stream over the border without as much as a qtip up the nose during COVID when they were harassing priests for having service permalink parent award report block reply carpetxparmesan 3 points 4 days ago Rhetorical question aside it's because the government doesn't impeach and hang judges. Half of them are pieces of shit and they tend to be responsible for almost all the problems. Your gun rights are gone? Blame a judge. Illegals being flooded into the US so Democrats and Uniparty rinos can get \"elected\"? Blame a judge. Those fucks need to be removed from office at a minimum, and some of them need to be put on trial and killed. If you can't read the second amendment in plain english, put them on trial and fucking hang them. Do you see \"shall not be infringed\"? GET IN THE FUCKING NOOSE! I don't mean any of you should hang judges, I mean the executive should prosecute them and hang every judge who can't read \"shall not be infringed\" in plain english. That's not a judicial \"opinion\". That's motherfucking infringement of the highest order of a citizen's God given rights. It's both a legal AND religious VIOLATION. As in they stuck their legal dick in you and RAPED you where your God lives. permalink parent award report block reply\nmikethemarine 14 points 4 days ago not a single illegal HAS to take any of them, ever wonder why? permalink parent award report block reply rebuildingMyself 12 points 4 days ago They also got to stream over the border without as much as a qtip up the nose during COVID when they were harassing priests for having service permalink parent award report block reply carpetxparmesan 3 points 4 days ago Rhetorical question aside it's because the government doesn't impeach and hang judges. Half of them are pieces of shit and they tend to be responsible for almost all the problems. Your gun rights are gone? Blame a judge. Illegals being flooded into the US so Democrats and Uniparty rinos can get \"elected\"? Blame a judge. Those fucks need to be removed from office at a minimum, and some of them need to be put on trial and killed. If you can't read the second amendment in plain english, put them on trial and fucking hang them. Do you see \"shall not be infringed\"? GET IN THE FUCKING NOOSE! I don't mean any of you should hang judges, I mean the executive should prosecute them and hang every judge who can't read \"shall not be infringed\" in plain english. That's not a judicial \"opinion\". That's motherfucking infringement of the highest order of a citizen's God given rights. It's both a legal AND religious VIOLATION. As in they stuck their legal dick in you and RAPED you where your God lives. permalink parent award report block reply\nrebuildingMyself 12 points 4 days ago They also got to stream over the border without as much as a qtip up the nose during COVID when they were harassing priests for having service permalink parent award report block reply\ncarpetxparmesan 3 points 4 days ago Rhetorical question aside it's because the government doesn't impeach and hang judges. Half of them are pieces of shit and they tend to be responsible for almost all the problems. Your gun rights are gone? Blame a judge. Illegals being flooded into the US so Democrats and Uniparty rinos can get \"elected\"? Blame a judge. Those fucks need to be removed from office at a minimum, and some of them need to be put on trial and killed. If you can't read the second amendment in plain english, put them on trial and fucking hang them. Do you see \"shall not be infringed\"? GET IN THE FUCKING NOOSE! I don't mean any of you should hang judges, I mean the executive should prosecute them and hang every judge who can't read \"shall not be infringed\" in plain english. That's not a judicial \"opinion\". That's motherfucking infringement of the highest order of a citizen's God given rights. It's both a legal AND religious VIOLATION. As in they stuck their legal dick in you and RAPED you where your God lives. permalink parent award report block reply\nsuckmycorona 2 points 4 days ago Hey we looked at it. permalink parent award report block reply\nguywholikesDjtof2024 14 points 4 days ago This. Why did OP say \"revoked\"? permalink parent award report block reply MemeWarsVet 16 points 4 days ago OP retarded. permalink parent award report block reply zooty 13 points 4 days ago OP vaccinated. Or Tylenated. permalink parent award report block reply Error404 2 points 4 days ago Could also be dilated! permalink parent award report block reply MaxJohnson 7 points 4 days ago OP prolly geh permalink parent award report block reply True_Curmudgeon 5 points 4 days ago BIG GAY permalink parent award report block reply view 1 more comments... Washington_Redskins 6 points 4 days ago Considers.\n.\nNot sure of the validity of the article, but the article does have the following alleged quote from Dr Malone: \"He wants to know whether or not there’s actual science behind that entire schedule, and whether or not it needs to be reconsidered or even revoked\" permalink parent award report block reply thrakaa40k 3 points 4 days ago \"Reconsidered or Revoked\" is appropriate.  Revisited, Reconsidered, and Revoked are used in the article/video.  Revised is not. permalink parent award report block reply ADAM_SCHITT 0 points 4 days ago Click the link permalink parent award report block reply\nMemeWarsVet 16 points 4 days ago OP retarded. permalink parent award report block reply zooty 13 points 4 days ago OP vaccinated. Or Tylenated. permalink parent award report block reply Error404 2 points 4 days ago Could also be dilated! permalink parent award report block reply MaxJohnson 7 points 4 days ago OP prolly geh permalink parent award report block reply True_Curmudgeon 5 points 4 days ago BIG GAY permalink parent award report block reply view 1 more comments...\nzooty 13 points 4 days ago OP vaccinated. Or Tylenated. permalink parent award report block reply Error404 2 points 4 days ago Could also be dilated! permalink parent award report block reply\nError404 2 points 4 days ago Could also be dilated! permalink parent award report block reply\nMaxJohnson 7 points 4 days ago OP prolly geh permalink parent award report block reply True_Curmudgeon 5 points 4 days ago BIG GAY permalink parent award report block reply view 1 more comments...\nTrue_Curmudgeon 5 points 4 days ago BIG GAY permalink parent award report block reply view 1 more comments...\nWashington_Redskins 6 points 4 days ago Considers.\n.\nNot sure of the validity of the article, but the article does have the following alleged quote from Dr Malone: \"He wants to know whether or not there’s actual science behind that entire schedule, and whether or not it needs to be reconsidered or even revoked\" permalink parent award report block reply\nthrakaa40k 3 points 4 days ago \"Reconsidered or Revoked\" is appropriate.  Revisited, Reconsidered, and Revoked are used in the article/video.  Revised is not. permalink parent award report block reply\nADAM_SCHITT 0 points 4 days ago Click the link permalink parent award report block reply\nMSG1000 4 points 4 days ago The article includes revoked as a possibility. permalink parent award report block reply\ndeleted 23 points 4 days ago SpellingContable 15 points 4 days ago Teachers enter the chat. permalink parent award report block reply Cowboy888 5 points 4 days ago Teachers get over 10 covid shots a year. permalink parent award report block reply SpellingContable 4 points 4 days ago Their elixir of a gay and happy life permalink parent award report block reply deleted 3 points 4 days ago duznmatter 4 points 4 days ago The Amish are in my neighbor hood and their children are without blemish skin wise. Healthy vibrant kids with what looks like clean inside and out. permalink parent award report block reply carpetxparmesan 1 points 4 days ago Ukrainians don't make enough money every month to afford food. There, I've solved the mystery for you. Their average salary is like 1000 to 1500 euros a month. They pay 4-600 euros in rent. Look up the average ukrainian hruschinka or stalinka apartment. Don't pay attention to those coked up fuckheads driving ferraris off laundered NATO money. They drink vodka and eat RAW FAT and still can't get fat because they're STILL in a caloric deficit. Also, let me tell you something that will blow your fucking mind about Ukraine. You ready? This is going to seem trivial and inconsequential to you but... imagine... you could only wear ONE pair of pants for the next 10 years because pants are hard to buy. You can't find pants. You have to go to a big city to even find two different styles of pants. Or you have to shop on alibaba. Do you think your ass would A. get fatter and fatter, changing pant sizes every month until by month 4 you had to LITERALLY walk outside in the freezing cold in nothing but your underwear or ... B. you would watch your portion size to KEEP YOUR PANT SIZE. Might seem crazy to people in the USA but that shit is reality for a lot of the globe. permalink parent award report block reply _Sully_ 1 points 4 days ago I honestly wish that were true but I wouldn't want to take away the blame from the retarded parents that made them. permalink parent award report block reply DiamondDroid 1 points 4 days ago ...and the frogs. permalink parent award report block reply\nSpellingContable 15 points 4 days ago Teachers enter the chat. permalink parent award report block reply Cowboy888 5 points 4 days ago Teachers get over 10 covid shots a year. permalink parent award report block reply SpellingContable 4 points 4 days ago Their elixir of a gay and happy life permalink parent award report block reply\nCowboy888 5 points 4 days ago Teachers get over 10 covid shots a year. permalink parent award report block reply SpellingContable 4 points 4 days ago Their elixir of a gay and happy life permalink parent award report block reply\nSpellingContable 4 points 4 days ago Their elixir of a gay and happy life permalink parent award report block reply\ndeleted 3 points 4 days ago duznmatter 4 points 4 days ago The Amish are in my neighbor hood and their children are without blemish skin wise. Healthy vibrant kids with what looks like clean inside and out. permalink parent award report block reply carpetxparmesan 1 points 4 days ago Ukrainians don't make enough money every month to afford food. There, I've solved the mystery for you. Their average salary is like 1000 to 1500 euros a month. They pay 4-600 euros in rent. Look up the average ukrainian hruschinka or stalinka apartment. Don't pay attention to those coked up fuckheads driving ferraris off laundered NATO money. They drink vodka and eat RAW FAT and still can't get fat because they're STILL in a caloric deficit. Also, let me tell you something that will blow your fucking mind about Ukraine. You ready? This is going to seem trivial and inconsequential to you but... imagine... you could only wear ONE pair of pants for the next 10 years because pants are hard to buy. You can't find pants. You have to go to a big city to even find two different styles of pants. Or you have to shop on alibaba. Do you think your ass would A. get fatter and fatter, changing pant sizes every month until by month 4 you had to LITERALLY walk outside in the freezing cold in nothing but your underwear or ... B. you would watch your portion size to KEEP YOUR PANT SIZE. Might seem crazy to people in the USA but that shit is reality for a lot of the globe. permalink parent award report block reply\nduznmatter 4 points 4 days ago The Amish are in my neighbor hood and their children are without blemish skin wise. Healthy vibrant kids with what looks like clean inside and out. permalink parent award report block reply\ncarpetxparmesan 1 points 4 days ago Ukrainians don't make enough money every month to afford food. There, I've solved the mystery for you. Their average salary is like 1000 to 1500 euros a month. They pay 4-600 euros in rent. Look up the average ukrainian hruschinka or stalinka apartment. Don't pay attention to those coked up fuckheads driving ferraris off laundered NATO money. They drink vodka and eat RAW FAT and still can't get fat because they're STILL in a caloric deficit. Also, let me tell you something that will blow your fucking mind about Ukraine. You ready? This is going to seem trivial and inconsequential to you but... imagine... you could only wear ONE pair of pants for the next 10 years because pants are hard to buy. You can't find pants. You have to go to a big city to even find two different styles of pants. Or you have to shop on alibaba. Do you think your ass would A. get fatter and fatter, changing pant sizes every month until by month 4 you had to LITERALLY walk outside in the freezing cold in nothing but your underwear or ... B. you would watch your portion size to KEEP YOUR PANT SIZE. Might seem crazy to people in the USA but that shit is reality for a lot of the globe. permalink parent award report block reply\n_Sully_ 1 points 4 days ago I honestly wish that were true but I wouldn't want to take away the blame from the retarded parents that made them. permalink parent award report block reply\nDiamondDroid 1 points 4 days ago ...and the frogs. permalink parent award report block reply\nutfanx2 19 points 4 days ago Vaccines cause autism, and social disorders make it harder to  breed. Just another depopulation scam like abortion and LGBT. permalink award report block reply TenaciousDT 2 points 4 days ago I concur... unless you're Elon permalink parent award report block reply\nTenaciousDT 2 points 4 days ago I concur... unless you're Elon permalink parent award report block reply\nCowboy888 17 points 4 days ago Dr. Malone is a genius! Turn him loose! permalink award report block reply\nDingleBalls 16 points 4 days ago Good. Schools have driven this crap forever. They won't let you register your kid without proof of a host of vaccines. Its no one's goddamn business what shots my kid has had or not had. If your kid had theirs and you trust it then its supposed to be a shield so my kid couldn't infect yours. Its not an \"everyone needs to take it to make it work for anyone\" thing. permalink award report block reply zooty 10 points 4 days ago Follow the money and you'll end back at the pharma industry, guaranteed. There's no ideology about this, just profit. permalink parent award report block reply TrumpAndGodWin 3 points 4 days ago If it were just about profit they wouldn't've put sv40 etc in there and cause tens of millions of cancer deaths over the decades. permalink parent award report block reply suckmycorona 1 points 4 days ago Well they have pills for that as well so there it is. permalink parent award report block reply Filo76 3 points 4 days ago Doctors, pediatricians… are motivated to push the full schedule. They get bonus money for doing so. It’s like a retard pyramid scheme of making money by making kids, and civilization, sick. permalink parent award report block reply zooty 4 points 4 days ago Yes. But I bet you'll find it in these school mandates too. In a way, they're worse. You can say no to a doctor but the school system is more of a forcing factor. permalink parent award report block reply True_Curmudgeon 4 points 4 days ago Tards sending their tard spawn to .gov schools permalink parent award report block reply\nzooty 10 points 4 days ago Follow the money and you'll end back at the pharma industry, guaranteed. There's no ideology about this, just profit. permalink parent award report block reply TrumpAndGodWin 3 points 4 days ago If it were just about profit they wouldn't've put sv40 etc in there and cause tens of millions of cancer deaths over the decades. permalink parent award report block reply suckmycorona 1 points 4 days ago Well they have pills for that as well so there it is. permalink parent award report block reply Filo76 3 points 4 days ago Doctors, pediatricians… are motivated to push the full schedule. They get bonus money for doing so. It’s like a retard pyramid scheme of making money by making kids, and civilization, sick. permalink parent award report block reply zooty 4 points 4 days ago Yes. But I bet you'll find it in these school mandates too. In a way, they're worse. You can say no to a doctor but the school system is more of a forcing factor. permalink parent award report block reply\nTrumpAndGodWin 3 points 4 days ago If it were just about profit they wouldn't've put sv40 etc in there and cause tens of millions of cancer deaths over the decades. permalink parent award report block reply suckmycorona 1 points 4 days ago Well they have pills for that as well so there it is. permalink parent award report block reply\nsuckmycorona 1 points 4 days ago Well they have pills for that as well so there it is. permalink parent award report block reply\nFilo76 3 points 4 days ago Doctors, pediatricians… are motivated to push the full schedule. They get bonus money for doing so. It’s like a retard pyramid scheme of making money by making kids, and civilization, sick. permalink parent award report block reply zooty 4 points 4 days ago Yes. But I bet you'll find it in these school mandates too. In a way, they're worse. You can say no to a doctor but the school system is more of a forcing factor. permalink parent award report block reply\nzooty 4 points 4 days ago Yes. But I bet you'll find it in these school mandates too. In a way, they're worse. You can say no to a doctor but the school system is more of a forcing factor. permalink parent award report block reply\nTrue_Curmudgeon 4 points 4 days ago Tards sending their tard spawn to .gov schools permalink parent award report block reply\nGrindelwald 13 points 4 days ago Do it! permalink award report block reply GenWashington 6 points 4 days ago We need complete freedom from bureaucrats permalink parent award report block reply\nGenWashington 6 points 4 days ago We need complete freedom from bureaucrats permalink parent award report block reply\nSorosHasBallsackEyes 6 points 4 days ago Vaccines should be optional.\nThere should be no protection for the manufacturers.\nDamages should have no limit.\nThe real price for fear is higher than people calculate. My son's autism was due to the MMR vaccine. If I could change one moment jn time, it would be that one. permalink award report block reply\nColonelKlink 6 points 4 days ago It should be. permalink award report block reply\nalina_habbas_fanclub 5 points 4 days ago Bye Bye Autism and SIDS.......and a few other things. permalink award report block reply Lady_MaGa 1 points 4 days ago Autoimmune problems on that list. permalink parent award report block reply LordOfTheReeeeengs 1 points 4 days ago Cancers too permalink parent award report block reply\nLady_MaGa 1 points 4 days ago Autoimmune problems on that list. permalink parent award report block reply LordOfTheReeeeengs 1 points 4 days ago Cancers too permalink parent award report block reply\nLordOfTheReeeeengs 1 points 4 days ago Cancers too permalink parent award report block reply\nOldman1234 4 points 4 days ago And a radical activist District Court Judge will overturn Trump's determination and will not only reinstate the Childhood Vaccination Schedule but will summarily order the immediate vaccination of every child in America. permalink award report block reply\ntired-of-crap 4 points 4 days ago Why not?? I don't see vaccine administration as an enumerated power of the federal government so this should be done solely by the states. Let's bring the federal government back to only it's enumerated powers. permalink award report block reply\nSh1nyH4ppy 3 points 4 days ago If you read and/or watched, Dr Malone actually said the word revoked:\n“He wants to know whether or not there’s actual science behind that entire schedule, and whether or not it needs to be reconsidered or even revoked.” permalink award report block reply\nkeeman 3 points 4 days ago Which part of the Constitution gives the fedgov permission to create a vaccine schedule?  Which part authorizes the FDA or CDC to exist or to require prescriptions or drug authorization?  Why to we the people put up with this shit? permalink award report block reply TrumpAndGodWin 2 points 4 days ago Good news is that depending on the poll, 40 to 80% of Americans don't trust the CDC. permalink parent award report block reply\nTrumpAndGodWin 2 points 4 days ago Good news is that depending on the poll, 40 to 80% of Americans don't trust the CDC. permalink parent award report block reply\nunotrumpcard 3 points 4 days ago Trump, the 79 year old consideroor. \"Im gonna considooooor\" permalink award report block reply\nFreedomFlowerDelta 3 points 4 days ago If you so much as trip and fall on my property, I am liable for lifelong injuries. But if I manufacture a \"pharmaceutical injection\",  meh....use at your own required risk permalink award report block reply\nSmurfection 3 points 4 days ago It should all be revoked.  All of it. Watch this movie by Del Bigtree: https://www.aninconvenientstudy.com permalink award report block reply\n5DchessWatch 3 points 4 days ago Stop considering Stop mulling Stop thinking about Stop proposing Stop looking into As sloppy steve says Action Action Action permalink award report block reply\ncarpetxparmesan 2 points 4 days ago FUCK. YES. Let people make informed decisions. Yeah, I want to stick this needle in my kid, no I don't want to stick that needle in my kid, no I don't want to stick any needles in my kid and play the survival lottery. Bring back freedom of fucking association. Just get government the fuck out of EVERYTHING related to healthcare. They do not know what the fuck they are doing and when they DO know, half the time it's to fuck YOU over. It's none of their fucking business how you treat your kid until they turn 18 or if they can even read or eat dirt or not. Not your kid, not your problem, deal with them however you will once they turn 18. If their dumb ass dies of cholera, so be it. If their dumb ass gets shot by another citizen because they robbed a 7/11, the more the fucking merrier. I guarantee I can protect my family better than the government can. In every which way except for communists. I still, as of yet, have not found a personal solution to communists. But every fucking other problem, I can take care of myself. ALL problems, I can deal with myself. No challenge too great, no toilet water pipe too dirty. Except communists, because those have to be eradicated by the millions and I can't save up enough money to nuke their fucking ass out of the atmosphere to be scattered to the solar winds they came from. I do not need to be taxed for anything except the eradication of every communist in every crevice of this planet. But I'll settle for exterminating all of them here at home. I will work for MY PEOPLE, the American people, for free, out of the goodness of my heart, educating them on how to keep their kids safe - if that's what it has to come to. You don't have to put a gun to my head to take money out of my pocket to tell my neighbor you're going to burn their fucking kids to a crisp if they don't vaxx them. permalink award report block reply\nAgnesDomini 2 points 4 days ago Let's fucking gooooooo already! RFK, Jr. Is on record saying that NONE of them were properly tested! permalink award report block reply\nCovfefe_And_Justice 2 points 4 days ago Don't consider it, just do it! permalink award report block reply\nBigE_123456 2 points 4 days ago Let's keep revisiting FOREVER and harming more children!!!!!!!! Meanwhile in an Ahmish community................................................................................................................................................................................................................................................................................................................................\"Look Mom! No Autism!\" permalink award report block reply\nKrat 1 points 4 days ago And when states ignore it and demand it anyways ? permalink award report block reply carpetxparmesan 1 points 4 days ago That's a good point. Do you want to answer your own question? I feel like you know the answer to that. I know the answer, you know the answer. Maybe some people that drive by don't know the answer. So let's talk about it! permalink parent award report block reply\ncarpetxparmesan 1 points 4 days ago That's a good point. Do you want to answer your own question? I feel like you know the answer to that. I know the answer, you know the answer. Maybe some people that drive by don't know the answer. So let's talk about it! permalink parent award report block reply\nThisIsHowItStarts 1 points 4 days ago But discounted Ozempic for everyone permalink award report block reply\nCuttinmuffins 1 points 4 days ago Trump considers, Trump suggests, Trump asks for help, Trump pleads, Trump threatens. Sorry, didn't vote for Trump to ask for help from the people I voted for Trump to prosecute and toss in prison. This admin has been nothing but empty threats, broke promises, and buried conspiracy with Israel the only party to actually get anything out of it. What happened to MAGA, to I will prosecute election fraud, mass deportation, arrests and prosecution of Antifa, some kind of benefit for the people that suffered 4 years of torture, starvation, and beatings for standing up for him in 2020, to throwing the crooked pols in the Dem and rep party in prison for good? We get Trust Graham, he never lets us down? We got three years to kick Trump in his ass to get the fuck to work. Standing around pretending anything he has done is of any consequence to this point is idiotic to say the least. As soon as the left is back in power, and Trump just told you all \"if and when they take back power\", this country is done. USSA with all the murder, starvation, and death that every color revolution has brought along with it will befall the American people. Will befall YOU.  So call me black pilled or whatever lefty type label you can apply to close people's eyes, but know, this is what approaches, and we have little time, but enough time at this point, to stop it. permalink award report block reply\nJesusTheOnlyWay 1 points 4 days ago Considers... Revisiting.... Yawn permalink award report block reply\nFUCK_TYLER 1 points 3 days ago YES!!! permalink award report block reply\nStanwyk74 1 points 4 days ago Long fucking overdue permalink award report block reply\nDiamondDroid 1 points 4 days ago Good, go back to the pre seventies schedule. Keep it light, simple and only what is essential. permalink award report block reply\nAlphaOmaga 1 points 3 days ago Revise. To old definition of necessary vaccines. Also should be a parent’s choice. And yes. Some vaccines should be necessary to attend public schools. Better to homeschool anyway. But let’s face it. We bred generations of parents that are incapable. Would be great to reverse that honestly. Start with virtual public school if you can. permalink award report block reply\ningrowntoenail -7 points 4 days ago No.  Pre-covid vaccines save lives.  We used to make fun of the liberals that were anti-vaxxers before covid. permalink award report block reply LordKuroTheGreat 12 points 4 days ago And that was wrongheaded and driven largely by pharma bots on reddit and paid off media shills. Everything should always be under review and axed if uneeded or too risky. permalink parent award report block reply carpetxparmesan 2 points 4 days ago Axed?! Why Axed?! Why can't a company just make a drug and sell it to you and you buy it? What the fuck is we axing here? Don't answer that, it's rhetorical question. permalink parent award report block reply zooty 5 points 4 days ago No. I just thought they were misguided. But they have questions which deserve answers, especially since it turns out that the 'trust the science' people often skip the science part. permalink parent award report block reply TheGreatWhiteNorth 3 points 4 days ago Good luck proving that.  Big Pharma controls the info and Big Pharma says 'vaccines' save lives.  \"Safe and effective.\"  See where I'm going with this? permalink parent award report block reply carpetxparmesan 1 points 4 days ago DO THEY tho? Or do the amish just die at the same rates of DIFFERENT diseases than you? Honestly don't remember the answer. You should look up the mortality and educate me. permalink parent award report block reply\nLordKuroTheGreat 12 points 4 days ago And that was wrongheaded and driven largely by pharma bots on reddit and paid off media shills. Everything should always be under review and axed if uneeded or too risky. permalink parent award report block reply carpetxparmesan 2 points 4 days ago Axed?! Why Axed?! Why can't a company just make a drug and sell it to you and you buy it? What the fuck is we axing here? Don't answer that, it's rhetorical question. permalink parent award report block reply\ncarpetxparmesan 2 points 4 days ago Axed?! Why Axed?! Why can't a company just make a drug and sell it to you and you buy it? What the fuck is we axing here? Don't answer that, it's rhetorical question. permalink parent award report block reply\nzooty 5 points 4 days ago No. I just thought they were misguided. But they have questions which deserve answers, especially since it turns out that the 'trust the science' people often skip the science part. permalink parent award report block reply\nTheGreatWhiteNorth 3 points 4 days ago Good luck proving that.  Big Pharma controls the info and Big Pharma says 'vaccines' save lives.  \"Safe and effective.\"  See where I'm going with this? permalink parent award report block reply\ncarpetxparmesan 1 points 4 days ago DO THEY tho? Or do the amish just die at the same rates of DIFFERENT diseases than you? Honestly don't remember the answer. You should look up the mortality and educate me. permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:11:12.935337Z"
}