{
  "id": "1ARK9k0Rxx",
  "url": "https://patriots.win/p/1ARK9k0Rxx/in-half-a-lifetime/c",
  "content": "275 In half a lifetime... posted 1 day ago by perma-maga 9 comments award share report block The American Tribune @TAmTrib • 4d “In half a lifetime, many Americans have seen their God dethroned, their heroes defiled, their culture polluted, their values assaulted, their country invaded, and themselves demonized as extremists and bigots for holding on to beliefs Americans have held for generations.” -Pat\n9 comments Sort by Top Top New Worst Old Save Around the Web Hair Grows Back! At Any Stage of Baldness HaloGrow FusionBlack 11 points 1 day ago I voted for him in the primary against Bush and had the privilege of seeing one of his rallies. This man was so ahead of his time its hard to comprehend it. He spoke up on immigration both legal and illegal ,foreign entanglements and our ridiculous support of our greatest allie  and was falsely labeled a racist and anti smite.  Good little piece written about him. https://itrfoundation.org/honor-patrick-j-buchanan-with-presidential-medal-of-freedom/ permalink award report block reply Samsonlike 11 points 1 day ago God Bless Pat Buchanan! permalink award report block reply DrCowboyPresident 6 points 1 day ago This is the guy Mark Levin was recently bragging about canceling. permalink parent award report block reply Madnote1984 5 points 1 day ago \"We destroyed Pat Buchanan, and we will destroy them too!! Reeeeee!\" permalink parent award report block reply referencevariable 8 points 1 day ago Thank you for all that you've done Mr. Buchanan. You would have been a GREAT president. permalink award report block reply Awakened 6 points 1 day ago A great American hero. He deserves a giant statue. permalink award report block reply Feelsgood2020 4 points 1 day ago Believe or believe my ancestors. The choice is simple. permalink award report block reply Perseverant 2 points 1 day ago Great overall message, but he should have said \"maligned\" or \"insulted\" instead of \"dethroned\".  No one has dethroned God, nor can they ever hope to.  God is Lord over all forever and ever. permalink award report block reply\nFusionBlack 11 points 1 day ago I voted for him in the primary against Bush and had the privilege of seeing one of his rallies. This man was so ahead of his time its hard to comprehend it. He spoke up on immigration both legal and illegal ,foreign entanglements and our ridiculous support of our greatest allie  and was falsely labeled a racist and anti smite.  Good little piece written about him. https://itrfoundation.org/honor-patrick-j-buchanan-with-presidential-medal-of-freedom/ permalink award report block reply\nSamsonlike 11 points 1 day ago God Bless Pat Buchanan! permalink award report block reply DrCowboyPresident 6 points 1 day ago This is the guy Mark Levin was recently bragging about canceling. permalink parent award report block reply Madnote1984 5 points 1 day ago \"We destroyed Pat Buchanan, and we will destroy them too!! Reeeeee!\" permalink parent award report block reply\nDrCowboyPresident 6 points 1 day ago This is the guy Mark Levin was recently bragging about canceling. permalink parent award report block reply Madnote1984 5 points 1 day ago \"We destroyed Pat Buchanan, and we will destroy them too!! Reeeeee!\" permalink parent award report block reply\nMadnote1984 5 points 1 day ago \"We destroyed Pat Buchanan, and we will destroy them too!! Reeeeee!\" permalink parent award report block reply\nreferencevariable 8 points 1 day ago Thank you for all that you've done Mr. Buchanan. You would have been a GREAT president. permalink award report block reply\nAwakened 6 points 1 day ago A great American hero. He deserves a giant statue. permalink award report block reply\nFeelsgood2020 4 points 1 day ago Believe or believe my ancestors. The choice is simple. permalink award report block reply\nPerseverant 2 points 1 day ago Great overall message, but he should have said \"maligned\" or \"insulted\" instead of \"dethroned\".  No one has dethroned God, nor can they ever hope to.  God is Lord over all forever and ever. permalink award report block reply",
  "fetched_at": "2025-11-12T23:09:01.568776Z"
}