{
  "id": "8174062",
  "title": "1455The US Sixth Circuit Court of Appeals Just Ruled That Schools CAN NOT Force Students to use \"pre",
  "url": "https://patriots.win/p/1ARK55a4Go/the-us-sixth-circuit-court-of-ap/c",
  "content": "1455 The US Sixth Circuit Court of Appeals Just Ruled That Schools CAN NOT Force Students to use \"preferred pronouns\". The ruling states that there is \"no evidence that the use of biological pronouns would disrupt school functions or qualify as harassment under Ohio law.\" BIG WIN for Ohio Families... LAWFARE posted 5 days ago by 5121313 53 comments award share report block Libs of TikTok @libsoftiktok • 5d BREAKING: The US Sixth Circuit Court of Appeals just ruled that schools CAN NOT force students to use \"preferred pronouns\" The ruling states that there is \"no evidence that the use of biological pronouns would disrupt school functions or qualify as harassment under Ohio law.\"\n53 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget TheSwampThang 60 points 5 days ago The fact that the teacher's union will fight with all their might to defend all these weirdos but can't be bothered to do anything about abysmal test scores, rampant illiteracy, and out of control class rooms..tells you everything you need to know. permalink award report block reply EgregiousPhilbin 32 points 5 days ago They're all women and gay men. The ones we bent over backwards for so we didnt get called mean names. Totally worth it. permalink parent award report block reply Christineblaseyford 10 points 5 days ago Well they bend over forward so... permalink parent award report block reply The_Return_of_User_x 4 points 5 days ago I prefer to use the proper pronown... Here watch. FAGGOT! GET YOU ASS OUT OF THE GIRLS LOCKER ROOM! Simple. permalink parent award report block reply LLP2 3 points 5 days ago It helps to send blood to the hippocampus : ) permalink parent award report block reply booblitchutz 2 points 4 days ago Now, what did we learn? permalink parent award report block reply possibletower 0 points 5 days ago Mostly white women* Yet stormfags keep telling us to simp for all white women and calling them a bunch of dindus despite 75% of white American women are a bunch of commie cunts and far outnumber all other non-white groups (who stormfags blame everything on) by a lot. permalink parent award report block reply ModernKnight 8 points 5 days ago And yet, so many conservatives around me vote in favor of every single levy, because we apparently need to shovel money into the dumpster fire that is Government Education in order to keep house prices way higher than they should be. permalink parent award report block reply Christineblaseyford 7 points 5 days ago I used to do that 15 years ago, now I vote against every fucking one because fuck em. permalink parent award report block reply PiratePatriot 5 points 5 days ago ditto.\nwe need to publicise the names of the teachers union leaders who pushed for this, the names of school board members who pushed for this etc. those people are all replaceable. not everyone in the school system was for the toxic idealogy, find them, promote them. while some parents have school choice, can homeschool etc, the ones left behind will be programmed with the idealogy allowed to flourish. permalink parent award report block reply DCPower 5 points 5 days ago Don’t forget they also defend rape in the girl’s bathroom because “he felt like a girl that day and needed to change there.” permalink parent award report block reply 5121313 OP 4 points 5 days ago ☝️Too True!!! permalink parent award report block reply load 1 more comments... TheRedPilledArtist 12 points 5 days ago Good, fuck that commie bullshit. Get/Fucked, leftists. permalink award report block reply AVeryNakedMan 10 points 5 days ago It's time to tell the mentally ill tranny brigade: Shut up and go vent to a therapist, instead of forcing your bullshit on the rest of society. permalink award report block reply BigMikesSwingingCock 7 points 5 days ago They should be venting to their orderlies in an insane asylum. permalink parent award report block reply PensivePatriot 4 points 5 days ago Oh my god yes . I had one in class today screaming “I’m gonna go crazy, I’M GONNA GO CRAZY” at a truly random moment, and the entire class is just like “…..Yeahhhhhh…” 😬 They’re all mind virus victims, but hearing that  said aloud, in a suitably actually crazy voice, successfully cut through their programming, even if just for that moment. permalink parent award report block reply UCantStumpTheTrump 4 points 5 days ago The tranny Kermit voice is so fucking grating. I’m in SF and there’s a tranny in my shared workplace that doesn’t pass very well, the voice is a dead giveaway every time permalink parent award report block reply Gunmolester 8 points 5 days ago its called Compelled Speech and in no alternate universe would this be legal permalink award report block reply Constantin2024 7 points 5 days ago There is no Constitutional allowance for COMPELLED SPEECH. In other words, there may be circumstances where the government can bar certain language (for example, you aren't allowed to yell \"fire\" in a crowded movie theater), but NO ONE has the AUTHORITY to FORCE anyone's speech. In fact, the schools in question should be sued into oblivion and every individual who made or approved that decision should be included personally in the lawsuits. permalink award report block reply 5121313 OP 7 points 5 days ago Back Up Link: https://x.com/libsoftiktok/status/1986826784038437246 permalink award report block reply Cuck-WTF 7 points 5 days ago Compelled speech is a new level of tyranny permalink award report block reply TrumpAndGodWin 4 points 5 days ago Similar to the 18(?) US states that now force anyone working for the government to agree to never criticize Israel or lose their jobs (contractors etc). permalink parent award report block reply Cuck-WTF 3 points 5 days ago Or denying FEMA aid unless you pledge loyalty to Israel permalink parent award report block reply Johnkimble111 6 points 5 days ago What’s the name of the school that compelled speech on its student? Name and shame. permalink award report block reply nthd 8 points 5 days ago Olentangy. It's an affluent district north of Columbus. Bleeding heart NIMBY libs. ie, the worst. permalink parent award report block reply Johnkimble111 4 points 5 days ago Thanks, I already found it. They have an X account open to replies… permalink parent award report block reply rowdyraider 3 points 4 days ago Correct. It’s about as gross as possible too, they went hard on the safetyism gas lighting and put that into their “anti-bullying” policy.  When a person whose wife works there told me about the lawsuit (acting like parents were tards) I just said “good!”.  lol not the response they expected. permalink parent award report block reply Chickensaurus 6 points 5 days ago Dems will codify it once they regain power in a little over a year. permalink award report block reply UCantStumpTheTrump 2 points 5 days ago What was your prediction about the outcome of the 2024 election? permalink parent award report block reply Chickensaurus 2 points 5 days ago That Trump would take it in a squeaker due to poor Dem turnout, similar to 2016. They ran Kamala, a terrible candidate. I figured there was an off chance the masses would still pick her. permalink parent award report block reply booblitchutz 2 points 4 days ago No they won’t because Trump won’t sign it and they won’t have a veto-proof majority. Also the RINOs won’t nuke the filibuster. permalink parent award report block reply Chickensaurus 2 points 4 days ago They're gonna start the impeachment of both Trump and Vance on January 7, 2027. There are enough RINOS to convict this time. Hakeem Jeffries will President after that. permalink parent award report block reply booblitchutz 3 points 4 days ago No, they’ve figured out how to contain Trump now. He’s playing ball with their judicial games. permalink parent award report block reply MythArcana 6 points 5 days ago Biden is a pedophile asshole. That is all. permalink award report block reply OnlyTrump20 5 points 5 days ago Besides which, use of correct pronouns is a simple recognition of fact, not an opinion.   Harassment or disruption would be something that comes from opinions or other non-scientific non-facts and that's only what the democrats are trying to force on others, which makes them the guilty, offensive harassers. permalink award report block reply RStroud 2 points 5 days ago Just bake the cake, composeb a diversity statement, and say the woke doxology.  It is called being a good person. permalink parent award report block reply YodaBannon 5 points 5 days ago holy she-it permalink award report block reply Illuminaughty 5 points 5 days ago Freedom of speech includes freedom NOT to say things permalink award report block reply Side_o_beef_curtains 4 points 5 days ago Suck it, fags! permalink award report block reply Cyber1776 4 points 5 days ago This is forced speech which is unconstitutional. To make leftist understand it, imagine if a school forced students to say a Christian prayer permalink award report block reply AgnesDomini 6 points 5 days ago Exactly so.  SCOTUS already ruled, unanimously,  decades ago, in the case involving students being forced to say the pledge of allegiance. Freedom of speech, which is an explicit right, as is freedom of religion, is inextricably linked to the implicit right to freedom of conscience. SCOTUS ruled that the law makes no distinction between thought and speech when it comes to the First Amendment, hence you cannot be forced to say what you do not believe, so students who did not believe what the pledge involves could not be compelled to say it, just as Hindus cannot be forced to pray to or honor Allah. In that same vein, if you do not believe in the concept of transgenderism or gender fluidity, you cannot be compelled to acknowledge them by being forced to recognize bullshit identities and pronouns. permalink parent award report block reply DCPower 4 points 5 days ago Big win? Nah this is just sanity. Big win would be lifetime jail sentences for all the creeps pushing this stuff. permalink award report block reply booblitchutz 3 points 4 days ago That’s where we are now. Basic sanity is a massive win. permalink parent award report block reply ApplyingForce 3 points 5 days ago Another civics 101 victory Learn your civics gents permalink award report block reply Johnkimble111 3 points 5 days ago The groomer school district responsible is called Olentangy schools. Yes they have an X account open to replies.. permalink award report block reply pococurante 3 points 4 days ago How did this even get to this point? The First Amendment guarantees freedom of speech, and it was even being considered to force students to lie? permalink award report block reply Michalusmichalus 2 points 4 days ago Teachers Unions were the first to fall. permalink parent award report block reply surgeriot 3 points 5 days ago Fuck yea, another win for destroying the trans agenda permalink award report block reply snorkle 2 points 5 days ago Whats the matter with a three legged frog permalink award report block reply MisprisionIsEvil 2 points 5 days ago The fact this must be ruled on is madness. I mean that literally. We have the mentally ill driving society. permalink award report block reply h203h 2 points 5 days ago How about we tell these schools and big businesses that we don't do gay shit around here and that we live in a Christian Nation UNDER GOD ALWAYS! permalink award report block reply LLP2 2 points 5 days ago Fuck those people with \"she/ they\". Pick one, looney tune. permalink award report block reply\nTheSwampThang 60 points 5 days ago The fact that the teacher's union will fight with all their might to defend all these weirdos but can't be bothered to do anything about abysmal test scores, rampant illiteracy, and out of control class rooms..tells you everything you need to know. permalink award report block reply EgregiousPhilbin 32 points 5 days ago They're all women and gay men. The ones we bent over backwards for so we didnt get called mean names. Totally worth it. permalink parent award report block reply Christineblaseyford 10 points 5 days ago Well they bend over forward so... permalink parent award report block reply The_Return_of_User_x 4 points 5 days ago I prefer to use the proper pronown... Here watch. FAGGOT! GET YOU ASS OUT OF THE GIRLS LOCKER ROOM! Simple. permalink parent award report block reply LLP2 3 points 5 days ago It helps to send blood to the hippocampus : ) permalink parent award report block reply booblitchutz 2 points 4 days ago Now, what did we learn? permalink parent award report block reply possibletower 0 points 5 days ago Mostly white women* Yet stormfags keep telling us to simp for all white women and calling them a bunch of dindus despite 75% of white American women are a bunch of commie cunts and far outnumber all other non-white groups (who stormfags blame everything on) by a lot. permalink parent award report block reply ModernKnight 8 points 5 days ago And yet, so many conservatives around me vote in favor of every single levy, because we apparently need to shovel money into the dumpster fire that is Government Education in order to keep house prices way higher than they should be. permalink parent award report block reply Christineblaseyford 7 points 5 days ago I used to do that 15 years ago, now I vote against every fucking one because fuck em. permalink parent award report block reply PiratePatriot 5 points 5 days ago ditto.\nwe need to publicise the names of the teachers union leaders who pushed for this, the names of school board members who pushed for this etc. those people are all replaceable. not everyone in the school system was for the toxic idealogy, find them, promote them. while some parents have school choice, can homeschool etc, the ones left behind will be programmed with the idealogy allowed to flourish. permalink parent award report block reply DCPower 5 points 5 days ago Don’t forget they also defend rape in the girl’s bathroom because “he felt like a girl that day and needed to change there.” permalink parent award report block reply 5121313 OP 4 points 5 days ago ☝️Too True!!! permalink parent award report block reply load 1 more comments...\nEgregiousPhilbin 32 points 5 days ago They're all women and gay men. The ones we bent over backwards for so we didnt get called mean names. Totally worth it. permalink parent award report block reply Christineblaseyford 10 points 5 days ago Well they bend over forward so... permalink parent award report block reply The_Return_of_User_x 4 points 5 days ago I prefer to use the proper pronown... Here watch. FAGGOT! GET YOU ASS OUT OF THE GIRLS LOCKER ROOM! Simple. permalink parent award report block reply LLP2 3 points 5 days ago It helps to send blood to the hippocampus : ) permalink parent award report block reply booblitchutz 2 points 4 days ago Now, what did we learn? permalink parent award report block reply possibletower 0 points 5 days ago Mostly white women* Yet stormfags keep telling us to simp for all white women and calling them a bunch of dindus despite 75% of white American women are a bunch of commie cunts and far outnumber all other non-white groups (who stormfags blame everything on) by a lot. permalink parent award report block reply\nChristineblaseyford 10 points 5 days ago Well they bend over forward so... permalink parent award report block reply The_Return_of_User_x 4 points 5 days ago I prefer to use the proper pronown... Here watch. FAGGOT! GET YOU ASS OUT OF THE GIRLS LOCKER ROOM! Simple. permalink parent award report block reply LLP2 3 points 5 days ago It helps to send blood to the hippocampus : ) permalink parent award report block reply\nThe_Return_of_User_x 4 points 5 days ago I prefer to use the proper pronown... Here watch. FAGGOT! GET YOU ASS OUT OF THE GIRLS LOCKER ROOM! Simple. permalink parent award report block reply\nLLP2 3 points 5 days ago It helps to send blood to the hippocampus : ) permalink parent award report block reply\nbooblitchutz 2 points 4 days ago Now, what did we learn? permalink parent award report block reply\npossibletower 0 points 5 days ago Mostly white women* Yet stormfags keep telling us to simp for all white women and calling them a bunch of dindus despite 75% of white American women are a bunch of commie cunts and far outnumber all other non-white groups (who stormfags blame everything on) by a lot. permalink parent award report block reply\nModernKnight 8 points 5 days ago And yet, so many conservatives around me vote in favor of every single levy, because we apparently need to shovel money into the dumpster fire that is Government Education in order to keep house prices way higher than they should be. permalink parent award report block reply Christineblaseyford 7 points 5 days ago I used to do that 15 years ago, now I vote against every fucking one because fuck em. permalink parent award report block reply\nChristineblaseyford 7 points 5 days ago I used to do that 15 years ago, now I vote against every fucking one because fuck em. permalink parent award report block reply\nPiratePatriot 5 points 5 days ago ditto.\nwe need to publicise the names of the teachers union leaders who pushed for this, the names of school board members who pushed for this etc. those people are all replaceable. not everyone in the school system was for the toxic idealogy, find them, promote them. while some parents have school choice, can homeschool etc, the ones left behind will be programmed with the idealogy allowed to flourish. permalink parent award report block reply\nDCPower 5 points 5 days ago Don’t forget they also defend rape in the girl’s bathroom because “he felt like a girl that day and needed to change there.” permalink parent award report block reply\n5121313 OP 4 points 5 days ago ☝️Too True!!! permalink parent award report block reply\nTheRedPilledArtist 12 points 5 days ago Good, fuck that commie bullshit. Get/Fucked, leftists. permalink award report block reply\nAVeryNakedMan 10 points 5 days ago It's time to tell the mentally ill tranny brigade: Shut up and go vent to a therapist, instead of forcing your bullshit on the rest of society. permalink award report block reply BigMikesSwingingCock 7 points 5 days ago They should be venting to their orderlies in an insane asylum. permalink parent award report block reply PensivePatriot 4 points 5 days ago Oh my god yes . I had one in class today screaming “I’m gonna go crazy, I’M GONNA GO CRAZY” at a truly random moment, and the entire class is just like “…..Yeahhhhhh…” 😬 They’re all mind virus victims, but hearing that  said aloud, in a suitably actually crazy voice, successfully cut through their programming, even if just for that moment. permalink parent award report block reply UCantStumpTheTrump 4 points 5 days ago The tranny Kermit voice is so fucking grating. I’m in SF and there’s a tranny in my shared workplace that doesn’t pass very well, the voice is a dead giveaway every time permalink parent award report block reply\nBigMikesSwingingCock 7 points 5 days ago They should be venting to their orderlies in an insane asylum. permalink parent award report block reply PensivePatriot 4 points 5 days ago Oh my god yes . I had one in class today screaming “I’m gonna go crazy, I’M GONNA GO CRAZY” at a truly random moment, and the entire class is just like “…..Yeahhhhhh…” 😬 They’re all mind virus victims, but hearing that  said aloud, in a suitably actually crazy voice, successfully cut through their programming, even if just for that moment. permalink parent award report block reply UCantStumpTheTrump 4 points 5 days ago The tranny Kermit voice is so fucking grating. I’m in SF and there’s a tranny in my shared workplace that doesn’t pass very well, the voice is a dead giveaway every time permalink parent award report block reply\nPensivePatriot 4 points 5 days ago Oh my god yes . I had one in class today screaming “I’m gonna go crazy, I’M GONNA GO CRAZY” at a truly random moment, and the entire class is just like “…..Yeahhhhhh…” 😬 They’re all mind virus victims, but hearing that  said aloud, in a suitably actually crazy voice, successfully cut through their programming, even if just for that moment. permalink parent award report block reply UCantStumpTheTrump 4 points 5 days ago The tranny Kermit voice is so fucking grating. I’m in SF and there’s a tranny in my shared workplace that doesn’t pass very well, the voice is a dead giveaway every time permalink parent award report block reply\nUCantStumpTheTrump 4 points 5 days ago The tranny Kermit voice is so fucking grating. I’m in SF and there’s a tranny in my shared workplace that doesn’t pass very well, the voice is a dead giveaway every time permalink parent award report block reply\nGunmolester 8 points 5 days ago its called Compelled Speech and in no alternate universe would this be legal permalink award report block reply\nConstantin2024 7 points 5 days ago There is no Constitutional allowance for COMPELLED SPEECH. In other words, there may be circumstances where the government can bar certain language (for example, you aren't allowed to yell \"fire\" in a crowded movie theater), but NO ONE has the AUTHORITY to FORCE anyone's speech. In fact, the schools in question should be sued into oblivion and every individual who made or approved that decision should be included personally in the lawsuits. permalink award report block reply\n5121313 OP 7 points 5 days ago Back Up Link: https://x.com/libsoftiktok/status/1986826784038437246 permalink award report block reply\nCuck-WTF 7 points 5 days ago Compelled speech is a new level of tyranny permalink award report block reply TrumpAndGodWin 4 points 5 days ago Similar to the 18(?) US states that now force anyone working for the government to agree to never criticize Israel or lose their jobs (contractors etc). permalink parent award report block reply Cuck-WTF 3 points 5 days ago Or denying FEMA aid unless you pledge loyalty to Israel permalink parent award report block reply\nTrumpAndGodWin 4 points 5 days ago Similar to the 18(?) US states that now force anyone working for the government to agree to never criticize Israel or lose their jobs (contractors etc). permalink parent award report block reply Cuck-WTF 3 points 5 days ago Or denying FEMA aid unless you pledge loyalty to Israel permalink parent award report block reply\nCuck-WTF 3 points 5 days ago Or denying FEMA aid unless you pledge loyalty to Israel permalink parent award report block reply\nJohnkimble111 6 points 5 days ago What’s the name of the school that compelled speech on its student? Name and shame. permalink award report block reply nthd 8 points 5 days ago Olentangy. It's an affluent district north of Columbus. Bleeding heart NIMBY libs. ie, the worst. permalink parent award report block reply Johnkimble111 4 points 5 days ago Thanks, I already found it. They have an X account open to replies… permalink parent award report block reply rowdyraider 3 points 4 days ago Correct. It’s about as gross as possible too, they went hard on the safetyism gas lighting and put that into their “anti-bullying” policy.  When a person whose wife works there told me about the lawsuit (acting like parents were tards) I just said “good!”.  lol not the response they expected. permalink parent award report block reply\nnthd 8 points 5 days ago Olentangy. It's an affluent district north of Columbus. Bleeding heart NIMBY libs. ie, the worst. permalink parent award report block reply Johnkimble111 4 points 5 days ago Thanks, I already found it. They have an X account open to replies… permalink parent award report block reply rowdyraider 3 points 4 days ago Correct. It’s about as gross as possible too, they went hard on the safetyism gas lighting and put that into their “anti-bullying” policy.  When a person whose wife works there told me about the lawsuit (acting like parents were tards) I just said “good!”.  lol not the response they expected. permalink parent award report block reply\nJohnkimble111 4 points 5 days ago Thanks, I already found it. They have an X account open to replies… permalink parent award report block reply\nrowdyraider 3 points 4 days ago Correct. It’s about as gross as possible too, they went hard on the safetyism gas lighting and put that into their “anti-bullying” policy.  When a person whose wife works there told me about the lawsuit (acting like parents were tards) I just said “good!”.  lol not the response they expected. permalink parent award report block reply\nChickensaurus 6 points 5 days ago Dems will codify it once they regain power in a little over a year. permalink award report block reply UCantStumpTheTrump 2 points 5 days ago What was your prediction about the outcome of the 2024 election? permalink parent award report block reply Chickensaurus 2 points 5 days ago That Trump would take it in a squeaker due to poor Dem turnout, similar to 2016. They ran Kamala, a terrible candidate. I figured there was an off chance the masses would still pick her. permalink parent award report block reply booblitchutz 2 points 4 days ago No they won’t because Trump won’t sign it and they won’t have a veto-proof majority. Also the RINOs won’t nuke the filibuster. permalink parent award report block reply Chickensaurus 2 points 4 days ago They're gonna start the impeachment of both Trump and Vance on January 7, 2027. There are enough RINOS to convict this time. Hakeem Jeffries will President after that. permalink parent award report block reply booblitchutz 3 points 4 days ago No, they’ve figured out how to contain Trump now. He’s playing ball with their judicial games. permalink parent award report block reply\nUCantStumpTheTrump 2 points 5 days ago What was your prediction about the outcome of the 2024 election? permalink parent award report block reply Chickensaurus 2 points 5 days ago That Trump would take it in a squeaker due to poor Dem turnout, similar to 2016. They ran Kamala, a terrible candidate. I figured there was an off chance the masses would still pick her. permalink parent award report block reply\nChickensaurus 2 points 5 days ago That Trump would take it in a squeaker due to poor Dem turnout, similar to 2016. They ran Kamala, a terrible candidate. I figured there was an off chance the masses would still pick her. permalink parent award report block reply\nbooblitchutz 2 points 4 days ago No they won’t because Trump won’t sign it and they won’t have a veto-proof majority. Also the RINOs won’t nuke the filibuster. permalink parent award report block reply Chickensaurus 2 points 4 days ago They're gonna start the impeachment of both Trump and Vance on January 7, 2027. There are enough RINOS to convict this time. Hakeem Jeffries will President after that. permalink parent award report block reply booblitchutz 3 points 4 days ago No, they’ve figured out how to contain Trump now. He’s playing ball with their judicial games. permalink parent award report block reply\nChickensaurus 2 points 4 days ago They're gonna start the impeachment of both Trump and Vance on January 7, 2027. There are enough RINOS to convict this time. Hakeem Jeffries will President after that. permalink parent award report block reply booblitchutz 3 points 4 days ago No, they’ve figured out how to contain Trump now. He’s playing ball with their judicial games. permalink parent award report block reply\nbooblitchutz 3 points 4 days ago No, they’ve figured out how to contain Trump now. He’s playing ball with their judicial games. permalink parent award report block reply\nMythArcana 6 points 5 days ago Biden is a pedophile asshole. That is all. permalink award report block reply\nOnlyTrump20 5 points 5 days ago Besides which, use of correct pronouns is a simple recognition of fact, not an opinion.   Harassment or disruption would be something that comes from opinions or other non-scientific non-facts and that's only what the democrats are trying to force on others, which makes them the guilty, offensive harassers. permalink award report block reply RStroud 2 points 5 days ago Just bake the cake, composeb a diversity statement, and say the woke doxology.  It is called being a good person. permalink parent award report block reply\nRStroud 2 points 5 days ago Just bake the cake, composeb a diversity statement, and say the woke doxology.  It is called being a good person. permalink parent award report block reply\nYodaBannon 5 points 5 days ago holy she-it permalink award report block reply\nIlluminaughty 5 points 5 days ago Freedom of speech includes freedom NOT to say things permalink award report block reply\nSide_o_beef_curtains 4 points 5 days ago Suck it, fags! permalink award report block reply\nCyber1776 4 points 5 days ago This is forced speech which is unconstitutional. To make leftist understand it, imagine if a school forced students to say a Christian prayer permalink award report block reply AgnesDomini 6 points 5 days ago Exactly so.  SCOTUS already ruled, unanimously,  decades ago, in the case involving students being forced to say the pledge of allegiance. Freedom of speech, which is an explicit right, as is freedom of religion, is inextricably linked to the implicit right to freedom of conscience. SCOTUS ruled that the law makes no distinction between thought and speech when it comes to the First Amendment, hence you cannot be forced to say what you do not believe, so students who did not believe what the pledge involves could not be compelled to say it, just as Hindus cannot be forced to pray to or honor Allah. In that same vein, if you do not believe in the concept of transgenderism or gender fluidity, you cannot be compelled to acknowledge them by being forced to recognize bullshit identities and pronouns. permalink parent award report block reply\nAgnesDomini 6 points 5 days ago Exactly so.  SCOTUS already ruled, unanimously,  decades ago, in the case involving students being forced to say the pledge of allegiance. Freedom of speech, which is an explicit right, as is freedom of religion, is inextricably linked to the implicit right to freedom of conscience. SCOTUS ruled that the law makes no distinction between thought and speech when it comes to the First Amendment, hence you cannot be forced to say what you do not believe, so students who did not believe what the pledge involves could not be compelled to say it, just as Hindus cannot be forced to pray to or honor Allah. In that same vein, if you do not believe in the concept of transgenderism or gender fluidity, you cannot be compelled to acknowledge them by being forced to recognize bullshit identities and pronouns. permalink parent award report block reply\nDCPower 4 points 5 days ago Big win? Nah this is just sanity. Big win would be lifetime jail sentences for all the creeps pushing this stuff. permalink award report block reply booblitchutz 3 points 4 days ago That’s where we are now. Basic sanity is a massive win. permalink parent award report block reply\nbooblitchutz 3 points 4 days ago That’s where we are now. Basic sanity is a massive win. permalink parent award report block reply\nApplyingForce 3 points 5 days ago Another civics 101 victory Learn your civics gents permalink award report block reply\nJohnkimble111 3 points 5 days ago The groomer school district responsible is called Olentangy schools. Yes they have an X account open to replies.. permalink award report block reply\npococurante 3 points 4 days ago How did this even get to this point? The First Amendment guarantees freedom of speech, and it was even being considered to force students to lie? permalink award report block reply Michalusmichalus 2 points 4 days ago Teachers Unions were the first to fall. permalink parent award report block reply\nMichalusmichalus 2 points 4 days ago Teachers Unions were the first to fall. permalink parent award report block reply\nsurgeriot 3 points 5 days ago Fuck yea, another win for destroying the trans agenda permalink award report block reply\nsnorkle 2 points 5 days ago Whats the matter with a three legged frog permalink award report block reply\nMisprisionIsEvil 2 points 5 days ago The fact this must be ruled on is madness. I mean that literally. We have the mentally ill driving society. permalink award report block reply\nh203h 2 points 5 days ago How about we tell these schools and big businesses that we don't do gay shit around here and that we live in a Christian Nation UNDER GOD ALWAYS! permalink award report block reply\nLLP2 2 points 5 days ago Fuck those people with \"she/ they\". Pick one, looney tune. permalink award report block reply"
}