{
  "id": "1ARK54U8vK",
  "url": "https://patriots.win/p/1ARK54U8vK/karoline-leavitt-just-decimated-/c",
  "content": "1515 Karoline Leavitt just DECIMATED a reporter so hard that Hungarian PM Orban asked Trump if he could HIRE her 🤣 posted 5 days ago by CatalystForChange 110 comments award share report block Eric Daugherty @EricLDaugh • 5d 🚨 BREAKING: Karoline Leavitt just DECIMATED a reporter so hard that Hungarian PM Orban asked Trump if he could HIRE her 🤣 “Please don't leave us Karoline!” LMAO!\n110 comments Sort by Top Top New Worst Old Save ciaramella_is_gay 92 points 5 days ago Why do we put up with it? Why don't we just end these fucking liars? I'm tired of these fucks. permalink award report block reply ToxicAvengerOhio 38 points 5 days ago Let's just keep calling them fake news. It seems to work. 🤦‍♂️ permalink parent award report block reply mojorisen 47 points 5 days ago There are still millions of Americans who are either mentally retarded, low IQ, boomers, politically ignorant etc. that believe every word that comes from the MSM. The MSM is the uniparties greatest weapon against the American people.  Without it, they wouldn't even be able to cheat enough to win. permalink parent award report block reply Aquamine-Amarine 22 points 5 days ago They brainwash people in school too. Both the education system and media are absolute garbage in this country. permalink parent award report block reply KernalMustard -16 points 5 days ago People get brainwashed because they want to get brainwashed. We wouldnt have religion otherwise. I'm restistant to it. I dont seek to be part of a group. I think for myself. You give me something I'm going to test if its real. Trust no one. permalink parent award report block reply ianpatrick1966 9 points 5 days ago boomers Surely you mean zoomers, the generation that voted most overwhelmingly democrat. Probably a typo EDIT: Since this seems to piss off so many of you, because you've been fed false numbers by your influencers: I created a post from the Pew research that u/anotherthing literally tried to use to prove me wrong. #It proves the EXACT FUCKING OPPOSITE. https://patriots.win/p/1ARK56kw1y/ Zoomers went overwhelmingly dem (+13), Boomers went overwhelmingly Trump (+10) permalink parent award report block reply SicSemperTyrannis2 0 points 4 days ago You're carrying water for the WEF. Cease and desist! permalink parent award report block reply view 1 more comments... anotherthing -5 points 5 days ago Boomers are the first generation that swung left as they got older. permalink parent award report block reply view 10 more comments... BlueKentuckyGirl 5 points 5 days ago 🍻 they’ve just been busy enjoying the freedoms of USA to be bothered about what’s really happening. Not really dumb maybe ignorant and selfish. That’s the democrats problem that I have observed is they are so selfish, self-centered and okay, maybe a bit low IQ. 😂🍻 permalink parent award report block reply Maskurbator -3 points 5 days ago mentally retarded, low IQ, boomers, politically ignorant\nI read this as:\n\"Boomers, boomers, boomers, boomers\" permalink parent award report block reply HuntersDeeler 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply imnotdeadyet 25 points 5 days ago I heard about a study that asked younger people 18 to 25 if they believed the MSM.  Approximately 85% said no and when asked what the MSM was good at, they said \"lying!\"  A lot of the comments included the term \"fake news\" so it is having an impact! permalink parent award report block reply Returningtogod 7 points 5 days ago You know, that’s a good start. But just because they’re not watching msm, we shouldn’t assume they’re getting their news from the Epoch Times. I fear for the younger generations. permalink parent award report block reply imnotdeadyet 4 points 5 days ago I'm more concerned about their teachers and the BS they are teaching them. permalink parent award report block reply aaafirefly123 3 points 5 days ago I’ve seen leftists unironically call the Washington Post and CNN Rightwing propaganda. permalink parent award report block reply view 1 more comments... Quietam_Unum 3 points 5 days ago we shouldn’t assume they’re getting their news from the Epoch Times. Damrite, Returning.  We know people in whatever generation came after boomers who only what they read on face berg book; all that a pack of lies straight out of  Marxist Sycophant Media (a.k.a. MSM). They are just getting the lies from a different source. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Let's refine your verbiage: just because this demographic doesn't actively watch MSM does NOT mean they've shed that evil influence. Dispense red pills and man the meme cannons! permalink parent award report block reply 2020Gop 2 points 5 days ago AND GHEY! permalink parent award report block reply ianpatrick1966 2 points 5 days ago But lets not do anything... because you know the optics. Meanwhile trannies are popping us left and right, and the democrats just voted in an AG who said he wanted to shoot trump supporters and their kids in front of their wives. But MUH OPTICS!!!!!! one !!! permalink parent award report block reply TheRedPilledArtist 12 points 5 days ago Enemy of the people. permalink parent award report block reply Covidrrhea 3 points 5 days ago I simply don't understand.  Is Trump afraid of bad reports if he just takes out the media?  The only people left would be the ones giving accurate news, so it would make him look good because the TV would also start saying he was good.  It's simple, just do it!!!! permalink parent award report block reply OldBark2 2 points 5 days ago How do we end them?? I have no legal means. And I'm too old to do it myself. permalink parent award report block reply NomadicKrow2 2 points 5 days ago Find out who is pulling the strings, build your case, don't let them kill you. File a lawsuit and release all your info on the internet at the same time. If you hold it like a \"dead man switch\" thinking it'll protect you, McAfee showed you it won't. Release it. Once its out there, your part is done and killing you would just be a personal vendetta thing, no longer \"protecting the empire.\" permalink parent award report block reply load 1 more comments... KuzoKevin 40 points 5 days ago I love her. permalink award report block reply DickTick PRO 27 points 5 days ago I do too. She is so sharp and you can tell she has that fire and anger inside of her at the way the media handles Trump and his administration. You can't really have a dude up there anymore because the very first time they ever get aggressive at a stupid ass reporter a question, it's just going to be claimed that they are bullying her or being misogynistic or what the fuck ever. They can't say fucking thing like that when it's a sharp beautiful lady tearing them a new asshole permalink parent award report block reply Here_we_go 13 points 5 days ago Can we have her as the AG? permalink parent award report block reply Ligersrule1 9 points 5 days ago Sorry, best we can do is 1 Scam Blondie permalink parent award report block reply Viewer01 25 points 5 days ago Trump is doing a good job of long term improvement. We all knew this would be short term pain for long term prosperity. However, you can’t lie to the American people. Just flat out say hey the wheel on this ship is turning but it’s slow. Come ask us next year. Because let me tell you, the gen z boys are about out of college and they’re ready to start rebelling if there isn’t a job and a family waiting on them. We are in a very dangerous time and we’re in the run up to a massive conflict of communists vs right wingers and it needs to be full tilt on jobs income and babies for the next 12 months. No sojourns into the Middle East. No more foreign peace deals. This country first and only. permalink award report block reply MAGABOND 15 points 5 days ago Those GenZ kids need to be told who it is those jobs are actually going to, as well as who their taxes are being spent on. We need to let president Trump know that we will not stand for outsourcing jobs, and ridiculous entitlements anymore. permalink parent award report block reply Maskurbator 1 points 5 days ago Yes, but Trump isn't doing himself any favors by slow walking the visa issue. Zoomers know they were fucked over by foreigners. They want action now. permalink parent award report block reply MAGABOND 9 points 5 days ago Long term is something Panicans don’t under. permalink parent award report block reply ianpatrick1966 1 points 5 days ago Per capita is something the melanin enhanced don't under. permalink parent award report block reply mav7579 4 points 5 days ago Good luck getting young women on board with that! permalink parent award report block reply Viewer01 6 points 5 days ago Yea that’s got me worried most of all. Gen Z had 15 million of their brothers and sisters aborted. Their views on women are…. Dim. permalink parent award report block reply TearsAficionado 3 points 5 days ago Amen, fren. permalink parent award report block reply Maskurbator 1 points 5 days ago Honestly they should just do a federal income tax holiday or something for a few months and/or eliminate payroll tax for any Industry oil or gasoline related. Drills, refineries, fuel/oil shipping companies, even gas stations. Reduce the costs of fuel at the source and it will cascade to everything else. Almost everything else will gradually come down, and by A LOT. Maybe it won't make your student debt go away, but it'll make all your other expenses go down (energy, food, travel) to make the other unimpacted things more bearable. permalink parent award report block reply load 3 more comments... Rerun1Central 17 points 5 days ago she is so well spoken and quick on her feet - she's unstoppable permalink award report block reply Old_Timer 16 points 5 days ago When your boss publicly appreciates you because you are GREAT at your job!!! permalink award report block reply Get_Off_Big_Tech 6 points 5 days ago And he is a great boss. permalink parent award report block reply Genericwhitemale 5 points 5 days ago When another world leader publicly asks to hire you, you know you’re crushing it. permalink parent award report block reply NancyPeloci 15 points 5 days ago Reported for \"BREAKING\" and \"DECIMATED\" . permalink award report block reply eaton_twot 11 points 5 days ago Hello 911? I'd like to report a MURDER!!! permalink parent award report block reply HellNoKameltoe 4 points 5 days ago 🔔🚨FOX NEWS ALERT! permalink parent award report block reply FearGodTheAlmighty 3 points 5 days ago SLAMMED permalink parent award report block reply EvJohn 3 points 5 days ago DECIMATED lol permalink parent award report block reply SnowSnake 13 points 5 days ago Decimation means 10% killed. The remaining 90% see what you did and the fear of death straightens their shit right out. permalink award report block reply BlueKentuckyGirl 6 points 5 days ago 🍻 permalink parent award report block reply ModernKnight 11 points 5 days ago Destroyed one tenth of a reporter? permalink award report block reply MAGABOND 9 points 5 days ago Pet peeve of mine too. permalink parent award report block reply IncredibleMrE1 5 points 5 days ago Yeah, the one tenth that was left after the nine previous decimations. permalink parent award report block reply I_Am_John_Galt 2 points 5 days ago I thought it meant destroying most of something and leaving one tenth? permalink parent award report block reply SirPokeSmottington 4 points 5 days ago Nope, it means to reduce by 1/10th Decim- tenth ate- to do Therefore, the suffix -ate helps form the verb meaning \"to take a tenth of\" or \"to kill one in every ten\". This originates from the Roman military practice of punishing a rebellious unit by executing one out of every ten men. permalink parent award report block reply LUXURY_USERNAME 1 points 4 days ago huh I thought it meant cut into 10 pieces permalink parent award report block reply ImYourHuckleberry24 -1 points 5 days ago Right?! Dumb fucking moron. permalink parent award report block reply Formerlurker92 5 points 5 days ago Lol permalink award report block reply JoeMcCarthyWasRight 5 points 5 days ago DECIMATED!!!!!! Give me a break. None of this shit impresses me anymore. Announce an arrest or stfu. permalink award report block reply NonbinaryPotatohead 5 points 5 days ago She does an excellent job imo. All of Trump's picks for Press Secretary have been solid. permalink award report block reply TheSwampThang 5 points 5 days ago Lecturing people that are going to straight up ignore you,  isn't the decimation I imagined. permalink award report block reply Gunmolester 4 points 5 days ago its time for a MAJOR Public awareness campaign exposing the media as blatant liars permalink award report block reply Captain_Updoot 4 points 5 days ago Give her a raise permalink award report block reply Bramage 3 points 5 days ago She got huge balls... permalink award report block reply j2daeww 3 points 5 days ago That’s hilarious and what a proud moment permalink award report block reply BlueKentuckyGirl 3 points 5 days ago 🍻 permalink award report block reply NecturusMaculosus 3 points 5 days ago She is FABULOUS permalink award report block reply NecturusMaculosus 3 points 5 days ago Younger Generations are getting their info from internet podcasters. These podcasters have exponentially larger audiences than msm. permalink award report block reply NoticesBugleOWO 2 points 5 days ago SWEET KAROLINE permalink award report block reply SaltExtractor 2 points 5 days ago Just pull thier licences and let REAL media take thier place, these commie orgs must wither and die. permalink award report block reply Keep_on_winning_kag 2 points 5 days ago Reinstate the Smith mundt act now permalink award report block reply HockeyMom4Trump 2 points 4 days ago Trump has the best sense of humor. He could have been a comedian. Much funnier than most of them. permalink award report block reply YodaBannon 2 points 5 days ago good times permalink award report block reply I_Love_45-70_Gov 2 points 5 days ago That is too cool. permalink award report block reply edxzxz 1 points 5 days ago You keep using that word 'DECIMATED', I do not think it means what you think it means. permalink award report block reply FearGodTheAlmighty 1 points 5 days ago DECIMATED BRO permalink award report block reply Tandoor 1 points 5 days ago Gas is $3.99 in Tampa. A pound of good butter is $13. Produce prices keep rising and rising. I love you President Trump, but this still needs to be fixed. permalink award report block reply CatalystForChange OP 0 points 5 days ago Only way I can think of prices coming down is having feds cut down interest rates. Because people have to pay their mortgage and rents to sustain, they can't reduce prices unless something gives. If they are offered lower rents and lower mortgages, they can think of reducing prices. I doubt government can do anything else other than reducing fed interest. permalink parent award report block reply SirPokeSmottington 1 points 5 days ago DECIMATED! TO REDUCE BY ONE TENTH.... THAT IS THE ONLY GODDAMNED DEFINITION OF THE WORD! SO... DiD KAROLINE LITERALLY REDUCE THEM BY 1/10th OR IS TWITTER OP A LOW IQ RETARD? permalink parent award report block reply LessSwampMoreMAGA 1 points 5 days ago Interest rates are a big one. Im curious to how tied these layoff announcements are with low interest loans from 3-5 years ago needing to be refinanced at now higher rates. permalink parent award report block reply Atruckdriver 1 points 4 days ago Prices will NEVER come down. The dollar has lost value because so much is being “printed”. More money is printed when the interest rates are lowered. Low interest rates equal easier debt creation (money printing). The ONLY way to lower costs is through deflation. permalink parent award report block reply SigSauer1776 1 points 5 days ago lol decimated is a strong word permalink award report block reply SirPokeSmottington 0 points 5 days ago And improperly used. Which means if you think it's a strong word, you too do not know the fucking meaning. permalink parent award report block reply Eddie_LeBec 1 points 5 days ago Kek permalink award report block reply JackOfAllTirades 1 points 5 days ago Sweet Karoline. permalink award report block reply Taupkek 1 points 5 days ago Leavitt/Vance 2028! permalink award report block reply lostremote- 1 points 5 days ago I'm waiting for one of the Fuentites on this board to tell us how its Israels fault. permalink award report block reply CasuallyObservant 1 points 5 days ago Where's the lie?  Kek. permalink parent award report block reply Musicbymuzak 1 points 5 days ago I was laughing so hard in the car listening to a few minutes before and after this I almost had to pull over permalink award report block reply ragnarokrobo 0 points 5 days ago he do good thing you not cover good thing on news Wowee D E C I M A T E D permalink award report block reply RhodesianRidgeback -1 points 5 days ago I would like to decimate Karoline's vagina. permalink award report block reply Vinnie -1 points 5 days ago \"decimated\" is inaccurate. Decimation was the Roman strategy of killing every tenth soldier for a regiment that failed its mission. Did every tenth reporter get killed? No, so stop the hyperbole. permalink award report block reply AlmostFullyDilated -1 points 5 days ago is this the same eric that was arrested for having gay sex with children? permalink award report block reply NowTheyAllLose 1 points 4 days ago No, that’s Swalwell here in a couple years… permalink parent award report block reply ImYourHuckleberry24 -1 points 5 days ago Stupid grifter doesn't even know what decimated means permalink award report block reply RememberCharlieKirk 0 points 5 days ago Comment removed by community moderators. permalink award report block reply\nciaramella_is_gay 92 points 5 days ago Why do we put up with it? Why don't we just end these fucking liars? I'm tired of these fucks. permalink award report block reply ToxicAvengerOhio 38 points 5 days ago Let's just keep calling them fake news. It seems to work. 🤦‍♂️ permalink parent award report block reply mojorisen 47 points 5 days ago There are still millions of Americans who are either mentally retarded, low IQ, boomers, politically ignorant etc. that believe every word that comes from the MSM. The MSM is the uniparties greatest weapon against the American people.  Without it, they wouldn't even be able to cheat enough to win. permalink parent award report block reply Aquamine-Amarine 22 points 5 days ago They brainwash people in school too. Both the education system and media are absolute garbage in this country. permalink parent award report block reply KernalMustard -16 points 5 days ago People get brainwashed because they want to get brainwashed. We wouldnt have religion otherwise. I'm restistant to it. I dont seek to be part of a group. I think for myself. You give me something I'm going to test if its real. Trust no one. permalink parent award report block reply ianpatrick1966 9 points 5 days ago boomers Surely you mean zoomers, the generation that voted most overwhelmingly democrat. Probably a typo EDIT: Since this seems to piss off so many of you, because you've been fed false numbers by your influencers: I created a post from the Pew research that u/anotherthing literally tried to use to prove me wrong. #It proves the EXACT FUCKING OPPOSITE. https://patriots.win/p/1ARK56kw1y/ Zoomers went overwhelmingly dem (+13), Boomers went overwhelmingly Trump (+10) permalink parent award report block reply SicSemperTyrannis2 0 points 4 days ago You're carrying water for the WEF. Cease and desist! permalink parent award report block reply view 1 more comments... anotherthing -5 points 5 days ago Boomers are the first generation that swung left as they got older. permalink parent award report block reply view 10 more comments... BlueKentuckyGirl 5 points 5 days ago 🍻 they’ve just been busy enjoying the freedoms of USA to be bothered about what’s really happening. Not really dumb maybe ignorant and selfish. That’s the democrats problem that I have observed is they are so selfish, self-centered and okay, maybe a bit low IQ. 😂🍻 permalink parent award report block reply Maskurbator -3 points 5 days ago mentally retarded, low IQ, boomers, politically ignorant\nI read this as:\n\"Boomers, boomers, boomers, boomers\" permalink parent award report block reply HuntersDeeler 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply imnotdeadyet 25 points 5 days ago I heard about a study that asked younger people 18 to 25 if they believed the MSM.  Approximately 85% said no and when asked what the MSM was good at, they said \"lying!\"  A lot of the comments included the term \"fake news\" so it is having an impact! permalink parent award report block reply Returningtogod 7 points 5 days ago You know, that’s a good start. But just because they’re not watching msm, we shouldn’t assume they’re getting their news from the Epoch Times. I fear for the younger generations. permalink parent award report block reply imnotdeadyet 4 points 5 days ago I'm more concerned about their teachers and the BS they are teaching them. permalink parent award report block reply aaafirefly123 3 points 5 days ago I’ve seen leftists unironically call the Washington Post and CNN Rightwing propaganda. permalink parent award report block reply view 1 more comments... Quietam_Unum 3 points 5 days ago we shouldn’t assume they’re getting their news from the Epoch Times. Damrite, Returning.  We know people in whatever generation came after boomers who only what they read on face berg book; all that a pack of lies straight out of  Marxist Sycophant Media (a.k.a. MSM). They are just getting the lies from a different source. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Let's refine your verbiage: just because this demographic doesn't actively watch MSM does NOT mean they've shed that evil influence. Dispense red pills and man the meme cannons! permalink parent award report block reply 2020Gop 2 points 5 days ago AND GHEY! permalink parent award report block reply ianpatrick1966 2 points 5 days ago But lets not do anything... because you know the optics. Meanwhile trannies are popping us left and right, and the democrats just voted in an AG who said he wanted to shoot trump supporters and their kids in front of their wives. But MUH OPTICS!!!!!! one !!! permalink parent award report block reply TheRedPilledArtist 12 points 5 days ago Enemy of the people. permalink parent award report block reply Covidrrhea 3 points 5 days ago I simply don't understand.  Is Trump afraid of bad reports if he just takes out the media?  The only people left would be the ones giving accurate news, so it would make him look good because the TV would also start saying he was good.  It's simple, just do it!!!! permalink parent award report block reply OldBark2 2 points 5 days ago How do we end them?? I have no legal means. And I'm too old to do it myself. permalink parent award report block reply NomadicKrow2 2 points 5 days ago Find out who is pulling the strings, build your case, don't let them kill you. File a lawsuit and release all your info on the internet at the same time. If you hold it like a \"dead man switch\" thinking it'll protect you, McAfee showed you it won't. Release it. Once its out there, your part is done and killing you would just be a personal vendetta thing, no longer \"protecting the empire.\" permalink parent award report block reply load 1 more comments...\nToxicAvengerOhio 38 points 5 days ago Let's just keep calling them fake news. It seems to work. 🤦‍♂️ permalink parent award report block reply mojorisen 47 points 5 days ago There are still millions of Americans who are either mentally retarded, low IQ, boomers, politically ignorant etc. that believe every word that comes from the MSM. The MSM is the uniparties greatest weapon against the American people.  Without it, they wouldn't even be able to cheat enough to win. permalink parent award report block reply Aquamine-Amarine 22 points 5 days ago They brainwash people in school too. Both the education system and media are absolute garbage in this country. permalink parent award report block reply KernalMustard -16 points 5 days ago People get brainwashed because they want to get brainwashed. We wouldnt have religion otherwise. I'm restistant to it. I dont seek to be part of a group. I think for myself. You give me something I'm going to test if its real. Trust no one. permalink parent award report block reply ianpatrick1966 9 points 5 days ago boomers Surely you mean zoomers, the generation that voted most overwhelmingly democrat. Probably a typo EDIT: Since this seems to piss off so many of you, because you've been fed false numbers by your influencers: I created a post from the Pew research that u/anotherthing literally tried to use to prove me wrong. #It proves the EXACT FUCKING OPPOSITE. https://patriots.win/p/1ARK56kw1y/ Zoomers went overwhelmingly dem (+13), Boomers went overwhelmingly Trump (+10) permalink parent award report block reply SicSemperTyrannis2 0 points 4 days ago You're carrying water for the WEF. Cease and desist! permalink parent award report block reply view 1 more comments... anotherthing -5 points 5 days ago Boomers are the first generation that swung left as they got older. permalink parent award report block reply view 10 more comments... BlueKentuckyGirl 5 points 5 days ago 🍻 they’ve just been busy enjoying the freedoms of USA to be bothered about what’s really happening. Not really dumb maybe ignorant and selfish. That’s the democrats problem that I have observed is they are so selfish, self-centered and okay, maybe a bit low IQ. 😂🍻 permalink parent award report block reply Maskurbator -3 points 5 days ago mentally retarded, low IQ, boomers, politically ignorant\nI read this as:\n\"Boomers, boomers, boomers, boomers\" permalink parent award report block reply HuntersDeeler 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply imnotdeadyet 25 points 5 days ago I heard about a study that asked younger people 18 to 25 if they believed the MSM.  Approximately 85% said no and when asked what the MSM was good at, they said \"lying!\"  A lot of the comments included the term \"fake news\" so it is having an impact! permalink parent award report block reply Returningtogod 7 points 5 days ago You know, that’s a good start. But just because they’re not watching msm, we shouldn’t assume they’re getting their news from the Epoch Times. I fear for the younger generations. permalink parent award report block reply imnotdeadyet 4 points 5 days ago I'm more concerned about their teachers and the BS they are teaching them. permalink parent award report block reply aaafirefly123 3 points 5 days ago I’ve seen leftists unironically call the Washington Post and CNN Rightwing propaganda. permalink parent award report block reply view 1 more comments... Quietam_Unum 3 points 5 days ago we shouldn’t assume they’re getting their news from the Epoch Times. Damrite, Returning.  We know people in whatever generation came after boomers who only what they read on face berg book; all that a pack of lies straight out of  Marxist Sycophant Media (a.k.a. MSM). They are just getting the lies from a different source. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Let's refine your verbiage: just because this demographic doesn't actively watch MSM does NOT mean they've shed that evil influence. Dispense red pills and man the meme cannons! permalink parent award report block reply 2020Gop 2 points 5 days ago AND GHEY! permalink parent award report block reply ianpatrick1966 2 points 5 days ago But lets not do anything... because you know the optics. Meanwhile trannies are popping us left and right, and the democrats just voted in an AG who said he wanted to shoot trump supporters and their kids in front of their wives. But MUH OPTICS!!!!!! one !!! permalink parent award report block reply\nmojorisen 47 points 5 days ago There are still millions of Americans who are either mentally retarded, low IQ, boomers, politically ignorant etc. that believe every word that comes from the MSM. The MSM is the uniparties greatest weapon against the American people.  Without it, they wouldn't even be able to cheat enough to win. permalink parent award report block reply Aquamine-Amarine 22 points 5 days ago They brainwash people in school too. Both the education system and media are absolute garbage in this country. permalink parent award report block reply KernalMustard -16 points 5 days ago People get brainwashed because they want to get brainwashed. We wouldnt have religion otherwise. I'm restistant to it. I dont seek to be part of a group. I think for myself. You give me something I'm going to test if its real. Trust no one. permalink parent award report block reply ianpatrick1966 9 points 5 days ago boomers Surely you mean zoomers, the generation that voted most overwhelmingly democrat. Probably a typo EDIT: Since this seems to piss off so many of you, because you've been fed false numbers by your influencers: I created a post from the Pew research that u/anotherthing literally tried to use to prove me wrong. #It proves the EXACT FUCKING OPPOSITE. https://patriots.win/p/1ARK56kw1y/ Zoomers went overwhelmingly dem (+13), Boomers went overwhelmingly Trump (+10) permalink parent award report block reply SicSemperTyrannis2 0 points 4 days ago You're carrying water for the WEF. Cease and desist! permalink parent award report block reply view 1 more comments... anotherthing -5 points 5 days ago Boomers are the first generation that swung left as they got older. permalink parent award report block reply view 10 more comments... BlueKentuckyGirl 5 points 5 days ago 🍻 they’ve just been busy enjoying the freedoms of USA to be bothered about what’s really happening. Not really dumb maybe ignorant and selfish. That’s the democrats problem that I have observed is they are so selfish, self-centered and okay, maybe a bit low IQ. 😂🍻 permalink parent award report block reply Maskurbator -3 points 5 days ago mentally retarded, low IQ, boomers, politically ignorant\nI read this as:\n\"Boomers, boomers, boomers, boomers\" permalink parent award report block reply HuntersDeeler 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nAquamine-Amarine 22 points 5 days ago They brainwash people in school too. Both the education system and media are absolute garbage in this country. permalink parent award report block reply KernalMustard -16 points 5 days ago People get brainwashed because they want to get brainwashed. We wouldnt have religion otherwise. I'm restistant to it. I dont seek to be part of a group. I think for myself. You give me something I'm going to test if its real. Trust no one. permalink parent award report block reply\nKernalMustard -16 points 5 days ago People get brainwashed because they want to get brainwashed. We wouldnt have religion otherwise. I'm restistant to it. I dont seek to be part of a group. I think for myself. You give me something I'm going to test if its real. Trust no one. permalink parent award report block reply\nianpatrick1966 9 points 5 days ago boomers Surely you mean zoomers, the generation that voted most overwhelmingly democrat. Probably a typo EDIT: Since this seems to piss off so many of you, because you've been fed false numbers by your influencers: I created a post from the Pew research that u/anotherthing literally tried to use to prove me wrong. #It proves the EXACT FUCKING OPPOSITE. https://patriots.win/p/1ARK56kw1y/ Zoomers went overwhelmingly dem (+13), Boomers went overwhelmingly Trump (+10) permalink parent award report block reply SicSemperTyrannis2 0 points 4 days ago You're carrying water for the WEF. Cease and desist! permalink parent award report block reply view 1 more comments... anotherthing -5 points 5 days ago Boomers are the first generation that swung left as they got older. permalink parent award report block reply view 10 more comments...\nSicSemperTyrannis2 0 points 4 days ago You're carrying water for the WEF. Cease and desist! permalink parent award report block reply view 1 more comments...\nanotherthing -5 points 5 days ago Boomers are the first generation that swung left as they got older. permalink parent award report block reply view 10 more comments...\nBlueKentuckyGirl 5 points 5 days ago 🍻 they’ve just been busy enjoying the freedoms of USA to be bothered about what’s really happening. Not really dumb maybe ignorant and selfish. That’s the democrats problem that I have observed is they are so selfish, self-centered and okay, maybe a bit low IQ. 😂🍻 permalink parent award report block reply\nMaskurbator -3 points 5 days ago mentally retarded, low IQ, boomers, politically ignorant\nI read this as:\n\"Boomers, boomers, boomers, boomers\" permalink parent award report block reply\nHuntersDeeler 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nimnotdeadyet 25 points 5 days ago I heard about a study that asked younger people 18 to 25 if they believed the MSM.  Approximately 85% said no and when asked what the MSM was good at, they said \"lying!\"  A lot of the comments included the term \"fake news\" so it is having an impact! permalink parent award report block reply Returningtogod 7 points 5 days ago You know, that’s a good start. But just because they’re not watching msm, we shouldn’t assume they’re getting their news from the Epoch Times. I fear for the younger generations. permalink parent award report block reply imnotdeadyet 4 points 5 days ago I'm more concerned about their teachers and the BS they are teaching them. permalink parent award report block reply aaafirefly123 3 points 5 days ago I’ve seen leftists unironically call the Washington Post and CNN Rightwing propaganda. permalink parent award report block reply view 1 more comments... Quietam_Unum 3 points 5 days ago we shouldn’t assume they’re getting their news from the Epoch Times. Damrite, Returning.  We know people in whatever generation came after boomers who only what they read on face berg book; all that a pack of lies straight out of  Marxist Sycophant Media (a.k.a. MSM). They are just getting the lies from a different source. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Let's refine your verbiage: just because this demographic doesn't actively watch MSM does NOT mean they've shed that evil influence. Dispense red pills and man the meme cannons! permalink parent award report block reply\nReturningtogod 7 points 5 days ago You know, that’s a good start. But just because they’re not watching msm, we shouldn’t assume they’re getting their news from the Epoch Times. I fear for the younger generations. permalink parent award report block reply imnotdeadyet 4 points 5 days ago I'm more concerned about their teachers and the BS they are teaching them. permalink parent award report block reply aaafirefly123 3 points 5 days ago I’ve seen leftists unironically call the Washington Post and CNN Rightwing propaganda. permalink parent award report block reply view 1 more comments... Quietam_Unum 3 points 5 days ago we shouldn’t assume they’re getting their news from the Epoch Times. Damrite, Returning.  We know people in whatever generation came after boomers who only what they read on face berg book; all that a pack of lies straight out of  Marxist Sycophant Media (a.k.a. MSM). They are just getting the lies from a different source. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Let's refine your verbiage: just because this demographic doesn't actively watch MSM does NOT mean they've shed that evil influence. Dispense red pills and man the meme cannons! permalink parent award report block reply\nimnotdeadyet 4 points 5 days ago I'm more concerned about their teachers and the BS they are teaching them. permalink parent award report block reply\naaafirefly123 3 points 5 days ago I’ve seen leftists unironically call the Washington Post and CNN Rightwing propaganda. permalink parent award report block reply view 1 more comments...\nQuietam_Unum 3 points 5 days ago we shouldn’t assume they’re getting their news from the Epoch Times. Damrite, Returning.  We know people in whatever generation came after boomers who only what they read on face berg book; all that a pack of lies straight out of  Marxist Sycophant Media (a.k.a. MSM). They are just getting the lies from a different source. permalink parent award report block reply\nSicSemperTyrannis2 1 points 4 days ago Let's refine your verbiage: just because this demographic doesn't actively watch MSM does NOT mean they've shed that evil influence. Dispense red pills and man the meme cannons! permalink parent award report block reply\n2020Gop 2 points 5 days ago AND GHEY! permalink parent award report block reply\nianpatrick1966 2 points 5 days ago But lets not do anything... because you know the optics. Meanwhile trannies are popping us left and right, and the democrats just voted in an AG who said he wanted to shoot trump supporters and their kids in front of their wives. But MUH OPTICS!!!!!! one !!! permalink parent award report block reply\nTheRedPilledArtist 12 points 5 days ago Enemy of the people. permalink parent award report block reply\nCovidrrhea 3 points 5 days ago I simply don't understand.  Is Trump afraid of bad reports if he just takes out the media?  The only people left would be the ones giving accurate news, so it would make him look good because the TV would also start saying he was good.  It's simple, just do it!!!! permalink parent award report block reply\nOldBark2 2 points 5 days ago How do we end them?? I have no legal means. And I'm too old to do it myself. permalink parent award report block reply\nNomadicKrow2 2 points 5 days ago Find out who is pulling the strings, build your case, don't let them kill you. File a lawsuit and release all your info on the internet at the same time. If you hold it like a \"dead man switch\" thinking it'll protect you, McAfee showed you it won't. Release it. Once its out there, your part is done and killing you would just be a personal vendetta thing, no longer \"protecting the empire.\" permalink parent award report block reply\nKuzoKevin 40 points 5 days ago I love her. permalink award report block reply DickTick PRO 27 points 5 days ago I do too. She is so sharp and you can tell she has that fire and anger inside of her at the way the media handles Trump and his administration. You can't really have a dude up there anymore because the very first time they ever get aggressive at a stupid ass reporter a question, it's just going to be claimed that they are bullying her or being misogynistic or what the fuck ever. They can't say fucking thing like that when it's a sharp beautiful lady tearing them a new asshole permalink parent award report block reply Here_we_go 13 points 5 days ago Can we have her as the AG? permalink parent award report block reply Ligersrule1 9 points 5 days ago Sorry, best we can do is 1 Scam Blondie permalink parent award report block reply\nDickTick PRO 27 points 5 days ago I do too. She is so sharp and you can tell she has that fire and anger inside of her at the way the media handles Trump and his administration. You can't really have a dude up there anymore because the very first time they ever get aggressive at a stupid ass reporter a question, it's just going to be claimed that they are bullying her or being misogynistic or what the fuck ever. They can't say fucking thing like that when it's a sharp beautiful lady tearing them a new asshole permalink parent award report block reply\nHere_we_go 13 points 5 days ago Can we have her as the AG? permalink parent award report block reply Ligersrule1 9 points 5 days ago Sorry, best we can do is 1 Scam Blondie permalink parent award report block reply\nLigersrule1 9 points 5 days ago Sorry, best we can do is 1 Scam Blondie permalink parent award report block reply\nViewer01 25 points 5 days ago Trump is doing a good job of long term improvement. We all knew this would be short term pain for long term prosperity. However, you can’t lie to the American people. Just flat out say hey the wheel on this ship is turning but it’s slow. Come ask us next year. Because let me tell you, the gen z boys are about out of college and they’re ready to start rebelling if there isn’t a job and a family waiting on them. We are in a very dangerous time and we’re in the run up to a massive conflict of communists vs right wingers and it needs to be full tilt on jobs income and babies for the next 12 months. No sojourns into the Middle East. No more foreign peace deals. This country first and only. permalink award report block reply MAGABOND 15 points 5 days ago Those GenZ kids need to be told who it is those jobs are actually going to, as well as who their taxes are being spent on. We need to let president Trump know that we will not stand for outsourcing jobs, and ridiculous entitlements anymore. permalink parent award report block reply Maskurbator 1 points 5 days ago Yes, but Trump isn't doing himself any favors by slow walking the visa issue. Zoomers know they were fucked over by foreigners. They want action now. permalink parent award report block reply MAGABOND 9 points 5 days ago Long term is something Panicans don’t under. permalink parent award report block reply ianpatrick1966 1 points 5 days ago Per capita is something the melanin enhanced don't under. permalink parent award report block reply mav7579 4 points 5 days ago Good luck getting young women on board with that! permalink parent award report block reply Viewer01 6 points 5 days ago Yea that’s got me worried most of all. Gen Z had 15 million of their brothers and sisters aborted. Their views on women are…. Dim. permalink parent award report block reply TearsAficionado 3 points 5 days ago Amen, fren. permalink parent award report block reply Maskurbator 1 points 5 days ago Honestly they should just do a federal income tax holiday or something for a few months and/or eliminate payroll tax for any Industry oil or gasoline related. Drills, refineries, fuel/oil shipping companies, even gas stations. Reduce the costs of fuel at the source and it will cascade to everything else. Almost everything else will gradually come down, and by A LOT. Maybe it won't make your student debt go away, but it'll make all your other expenses go down (energy, food, travel) to make the other unimpacted things more bearable. permalink parent award report block reply load 3 more comments...\nMAGABOND 15 points 5 days ago Those GenZ kids need to be told who it is those jobs are actually going to, as well as who their taxes are being spent on. We need to let president Trump know that we will not stand for outsourcing jobs, and ridiculous entitlements anymore. permalink parent award report block reply Maskurbator 1 points 5 days ago Yes, but Trump isn't doing himself any favors by slow walking the visa issue. Zoomers know they were fucked over by foreigners. They want action now. permalink parent award report block reply\nMaskurbator 1 points 5 days ago Yes, but Trump isn't doing himself any favors by slow walking the visa issue. Zoomers know they were fucked over by foreigners. They want action now. permalink parent award report block reply\nMAGABOND 9 points 5 days ago Long term is something Panicans don’t under. permalink parent award report block reply ianpatrick1966 1 points 5 days ago Per capita is something the melanin enhanced don't under. permalink parent award report block reply\nianpatrick1966 1 points 5 days ago Per capita is something the melanin enhanced don't under. permalink parent award report block reply\nmav7579 4 points 5 days ago Good luck getting young women on board with that! permalink parent award report block reply Viewer01 6 points 5 days ago Yea that’s got me worried most of all. Gen Z had 15 million of their brothers and sisters aborted. Their views on women are…. Dim. permalink parent award report block reply\nViewer01 6 points 5 days ago Yea that’s got me worried most of all. Gen Z had 15 million of their brothers and sisters aborted. Their views on women are…. Dim. permalink parent award report block reply\nTearsAficionado 3 points 5 days ago Amen, fren. permalink parent award report block reply\nMaskurbator 1 points 5 days ago Honestly they should just do a federal income tax holiday or something for a few months and/or eliminate payroll tax for any Industry oil or gasoline related. Drills, refineries, fuel/oil shipping companies, even gas stations. Reduce the costs of fuel at the source and it will cascade to everything else. Almost everything else will gradually come down, and by A LOT. Maybe it won't make your student debt go away, but it'll make all your other expenses go down (energy, food, travel) to make the other unimpacted things more bearable. permalink parent award report block reply\nRerun1Central 17 points 5 days ago she is so well spoken and quick on her feet - she's unstoppable permalink award report block reply\nOld_Timer 16 points 5 days ago When your boss publicly appreciates you because you are GREAT at your job!!! permalink award report block reply Get_Off_Big_Tech 6 points 5 days ago And he is a great boss. permalink parent award report block reply Genericwhitemale 5 points 5 days ago When another world leader publicly asks to hire you, you know you’re crushing it. permalink parent award report block reply\nGet_Off_Big_Tech 6 points 5 days ago And he is a great boss. permalink parent award report block reply\nGenericwhitemale 5 points 5 days ago When another world leader publicly asks to hire you, you know you’re crushing it. permalink parent award report block reply\nNancyPeloci 15 points 5 days ago Reported for \"BREAKING\" and \"DECIMATED\" . permalink award report block reply eaton_twot 11 points 5 days ago Hello 911? I'd like to report a MURDER!!! permalink parent award report block reply HellNoKameltoe 4 points 5 days ago 🔔🚨FOX NEWS ALERT! permalink parent award report block reply FearGodTheAlmighty 3 points 5 days ago SLAMMED permalink parent award report block reply EvJohn 3 points 5 days ago DECIMATED lol permalink parent award report block reply\neaton_twot 11 points 5 days ago Hello 911? I'd like to report a MURDER!!! permalink parent award report block reply HellNoKameltoe 4 points 5 days ago 🔔🚨FOX NEWS ALERT! permalink parent award report block reply\nHellNoKameltoe 4 points 5 days ago 🔔🚨FOX NEWS ALERT! permalink parent award report block reply\nFearGodTheAlmighty 3 points 5 days ago SLAMMED permalink parent award report block reply\nEvJohn 3 points 5 days ago DECIMATED lol permalink parent award report block reply\nSnowSnake 13 points 5 days ago Decimation means 10% killed. The remaining 90% see what you did and the fear of death straightens their shit right out. permalink award report block reply BlueKentuckyGirl 6 points 5 days ago 🍻 permalink parent award report block reply\nBlueKentuckyGirl 6 points 5 days ago 🍻 permalink parent award report block reply\nModernKnight 11 points 5 days ago Destroyed one tenth of a reporter? permalink award report block reply MAGABOND 9 points 5 days ago Pet peeve of mine too. permalink parent award report block reply IncredibleMrE1 5 points 5 days ago Yeah, the one tenth that was left after the nine previous decimations. permalink parent award report block reply I_Am_John_Galt 2 points 5 days ago I thought it meant destroying most of something and leaving one tenth? permalink parent award report block reply SirPokeSmottington 4 points 5 days ago Nope, it means to reduce by 1/10th Decim- tenth ate- to do Therefore, the suffix -ate helps form the verb meaning \"to take a tenth of\" or \"to kill one in every ten\". This originates from the Roman military practice of punishing a rebellious unit by executing one out of every ten men. permalink parent award report block reply LUXURY_USERNAME 1 points 4 days ago huh I thought it meant cut into 10 pieces permalink parent award report block reply ImYourHuckleberry24 -1 points 5 days ago Right?! Dumb fucking moron. permalink parent award report block reply\nMAGABOND 9 points 5 days ago Pet peeve of mine too. permalink parent award report block reply\nIncredibleMrE1 5 points 5 days ago Yeah, the one tenth that was left after the nine previous decimations. permalink parent award report block reply\nI_Am_John_Galt 2 points 5 days ago I thought it meant destroying most of something and leaving one tenth? permalink parent award report block reply SirPokeSmottington 4 points 5 days ago Nope, it means to reduce by 1/10th Decim- tenth ate- to do Therefore, the suffix -ate helps form the verb meaning \"to take a tenth of\" or \"to kill one in every ten\". This originates from the Roman military practice of punishing a rebellious unit by executing one out of every ten men. permalink parent award report block reply LUXURY_USERNAME 1 points 4 days ago huh I thought it meant cut into 10 pieces permalink parent award report block reply\nSirPokeSmottington 4 points 5 days ago Nope, it means to reduce by 1/10th Decim- tenth ate- to do Therefore, the suffix -ate helps form the verb meaning \"to take a tenth of\" or \"to kill one in every ten\". This originates from the Roman military practice of punishing a rebellious unit by executing one out of every ten men. permalink parent award report block reply LUXURY_USERNAME 1 points 4 days ago huh I thought it meant cut into 10 pieces permalink parent award report block reply\nLUXURY_USERNAME 1 points 4 days ago huh I thought it meant cut into 10 pieces permalink parent award report block reply\nImYourHuckleberry24 -1 points 5 days ago Right?! Dumb fucking moron. permalink parent award report block reply\nFormerlurker92 5 points 5 days ago Lol permalink award report block reply\nJoeMcCarthyWasRight 5 points 5 days ago DECIMATED!!!!!! Give me a break. None of this shit impresses me anymore. Announce an arrest or stfu. permalink award report block reply\nNonbinaryPotatohead 5 points 5 days ago She does an excellent job imo. All of Trump's picks for Press Secretary have been solid. permalink award report block reply\nTheSwampThang 5 points 5 days ago Lecturing people that are going to straight up ignore you,  isn't the decimation I imagined. permalink award report block reply\nGunmolester 4 points 5 days ago its time for a MAJOR Public awareness campaign exposing the media as blatant liars permalink award report block reply\nCaptain_Updoot 4 points 5 days ago Give her a raise permalink award report block reply\nBramage 3 points 5 days ago She got huge balls... permalink award report block reply\nj2daeww 3 points 5 days ago That’s hilarious and what a proud moment permalink award report block reply\nBlueKentuckyGirl 3 points 5 days ago 🍻 permalink award report block reply\nNecturusMaculosus 3 points 5 days ago She is FABULOUS permalink award report block reply\nNecturusMaculosus 3 points 5 days ago Younger Generations are getting their info from internet podcasters. These podcasters have exponentially larger audiences than msm. permalink award report block reply\nNoticesBugleOWO 2 points 5 days ago SWEET KAROLINE permalink award report block reply\nSaltExtractor 2 points 5 days ago Just pull thier licences and let REAL media take thier place, these commie orgs must wither and die. permalink award report block reply\nKeep_on_winning_kag 2 points 5 days ago Reinstate the Smith mundt act now permalink award report block reply\nHockeyMom4Trump 2 points 4 days ago Trump has the best sense of humor. He could have been a comedian. Much funnier than most of them. permalink award report block reply\nYodaBannon 2 points 5 days ago good times permalink award report block reply\nI_Love_45-70_Gov 2 points 5 days ago That is too cool. permalink award report block reply\nedxzxz 1 points 5 days ago You keep using that word 'DECIMATED', I do not think it means what you think it means. permalink award report block reply\nFearGodTheAlmighty 1 points 5 days ago DECIMATED BRO permalink award report block reply\nTandoor 1 points 5 days ago Gas is $3.99 in Tampa. A pound of good butter is $13. Produce prices keep rising and rising. I love you President Trump, but this still needs to be fixed. permalink award report block reply CatalystForChange OP 0 points 5 days ago Only way I can think of prices coming down is having feds cut down interest rates. Because people have to pay their mortgage and rents to sustain, they can't reduce prices unless something gives. If they are offered lower rents and lower mortgages, they can think of reducing prices. I doubt government can do anything else other than reducing fed interest. permalink parent award report block reply SirPokeSmottington 1 points 5 days ago DECIMATED! TO REDUCE BY ONE TENTH.... THAT IS THE ONLY GODDAMNED DEFINITION OF THE WORD! SO... DiD KAROLINE LITERALLY REDUCE THEM BY 1/10th OR IS TWITTER OP A LOW IQ RETARD? permalink parent award report block reply LessSwampMoreMAGA 1 points 5 days ago Interest rates are a big one. Im curious to how tied these layoff announcements are with low interest loans from 3-5 years ago needing to be refinanced at now higher rates. permalink parent award report block reply Atruckdriver 1 points 4 days ago Prices will NEVER come down. The dollar has lost value because so much is being “printed”. More money is printed when the interest rates are lowered. Low interest rates equal easier debt creation (money printing). The ONLY way to lower costs is through deflation. permalink parent award report block reply\nCatalystForChange OP 0 points 5 days ago Only way I can think of prices coming down is having feds cut down interest rates. Because people have to pay their mortgage and rents to sustain, they can't reduce prices unless something gives. If they are offered lower rents and lower mortgages, they can think of reducing prices. I doubt government can do anything else other than reducing fed interest. permalink parent award report block reply SirPokeSmottington 1 points 5 days ago DECIMATED! TO REDUCE BY ONE TENTH.... THAT IS THE ONLY GODDAMNED DEFINITION OF THE WORD! SO... DiD KAROLINE LITERALLY REDUCE THEM BY 1/10th OR IS TWITTER OP A LOW IQ RETARD? permalink parent award report block reply LessSwampMoreMAGA 1 points 5 days ago Interest rates are a big one. Im curious to how tied these layoff announcements are with low interest loans from 3-5 years ago needing to be refinanced at now higher rates. permalink parent award report block reply Atruckdriver 1 points 4 days ago Prices will NEVER come down. The dollar has lost value because so much is being “printed”. More money is printed when the interest rates are lowered. Low interest rates equal easier debt creation (money printing). The ONLY way to lower costs is through deflation. permalink parent award report block reply\nSirPokeSmottington 1 points 5 days ago DECIMATED! TO REDUCE BY ONE TENTH.... THAT IS THE ONLY GODDAMNED DEFINITION OF THE WORD! SO... DiD KAROLINE LITERALLY REDUCE THEM BY 1/10th OR IS TWITTER OP A LOW IQ RETARD? permalink parent award report block reply\nLessSwampMoreMAGA 1 points 5 days ago Interest rates are a big one. Im curious to how tied these layoff announcements are with low interest loans from 3-5 years ago needing to be refinanced at now higher rates. permalink parent award report block reply\nAtruckdriver 1 points 4 days ago Prices will NEVER come down. The dollar has lost value because so much is being “printed”. More money is printed when the interest rates are lowered. Low interest rates equal easier debt creation (money printing). The ONLY way to lower costs is through deflation. permalink parent award report block reply\nSigSauer1776 1 points 5 days ago lol decimated is a strong word permalink award report block reply SirPokeSmottington 0 points 5 days ago And improperly used. Which means if you think it's a strong word, you too do not know the fucking meaning. permalink parent award report block reply\nSirPokeSmottington 0 points 5 days ago And improperly used. Which means if you think it's a strong word, you too do not know the fucking meaning. permalink parent award report block reply\nEddie_LeBec 1 points 5 days ago Kek permalink award report block reply\nJackOfAllTirades 1 points 5 days ago Sweet Karoline. permalink award report block reply\nTaupkek 1 points 5 days ago Leavitt/Vance 2028! permalink award report block reply\nlostremote- 1 points 5 days ago I'm waiting for one of the Fuentites on this board to tell us how its Israels fault. permalink award report block reply CasuallyObservant 1 points 5 days ago Where's the lie?  Kek. permalink parent award report block reply\nCasuallyObservant 1 points 5 days ago Where's the lie?  Kek. permalink parent award report block reply\nMusicbymuzak 1 points 5 days ago I was laughing so hard in the car listening to a few minutes before and after this I almost had to pull over permalink award report block reply\nragnarokrobo 0 points 5 days ago he do good thing you not cover good thing on news Wowee D E C I M A T E D permalink award report block reply\nRhodesianRidgeback -1 points 5 days ago I would like to decimate Karoline's vagina. permalink award report block reply\nVinnie -1 points 5 days ago \"decimated\" is inaccurate. Decimation was the Roman strategy of killing every tenth soldier for a regiment that failed its mission. Did every tenth reporter get killed? No, so stop the hyperbole. permalink award report block reply\nAlmostFullyDilated -1 points 5 days ago is this the same eric that was arrested for having gay sex with children? permalink award report block reply NowTheyAllLose 1 points 4 days ago No, that’s Swalwell here in a couple years… permalink parent award report block reply\nNowTheyAllLose 1 points 4 days ago No, that’s Swalwell here in a couple years… permalink parent award report block reply\nImYourHuckleberry24 -1 points 5 days ago Stupid grifter doesn't even know what decimated means permalink award report block reply\nRememberCharlieKirk 0 points 5 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T21:00:43.990333Z"
}