{
  "id": "1ARK9irm47",
  "url": "https://patriots.win/p/1ARK9irm47/im-prepping-a-formal-talk-on-the/c",
  "content": "734 I'm prepping a formal talk on the CIA's role in the music industry, covering all the networks, programs & partnerships of the covert influence side of USAID, NED & State Dept with record labels, streaming platforms, entertainment lawyers, A&Rs, events/tours, & artists themselves posted 2 days ago by ALT26 71 comments award share report block Mike Benz @MikeBenzCyber • 2d I'm prepping a formal talk on the CIA's role in the music industry, covering all the networks, programs & partnerships of the covert influence side of USAID, NED & State Dept with record labels, streaming platforms, entertainment lawyers, A&Rs, events/tours, & artists themselves Despa Robinson @DespaRobinson • 2d I’ve been thinking about that Mike Benz DJ Vlad interview all day.\n71 comments Sort by Top Top New Worst Old Save MAGA9428 70 points 2 days ago This will be interesting. Expose the music industry’s role in promoting degeneracy given that half of mainstream music today makes that its primary mission. permalink award report block reply Viewer01 35 points 2 days ago Taylor swift has to be one. permalink parent award report block reply Dway 14 points 2 days ago She couldn’t even carry a tune when she first came out. They groomed teenage girls at the time. Just like Britney Spears and Madonna. permalink parent award report block reply The_Return_of_User_x 5 points 2 days ago Brittany Spears had her MKUltra triggered early... Shaving her head and such. But on a serious note, I wouldnt put it past the CIA and the three letter organizations we haven't hear of yet to have recruited her. permalink parent award report block reply Dway 4 points 2 days ago Cher and even Janice Joplin, at least Joplin had great songs permalink parent award report block reply THELEADERSOFMEN 2 points 2 days ago Joplin was legit, they just had to stand back and let her go, poor thing. But there’s all kinds of mystery surrounding the whole Laurel Canyon scene given half the artists who came out of there were military/intelligence brats. Jim Morrison, Zappa etc. “Weird Scenes Inside the Canyon” permalink parent award report block reply anotherthing 2 points 1 day ago Britney Spears was a Mouseketeer. You ever notice how the original Mouseketeers were all normal and well adjusted kids when Walt Disney did the original Mickey Mouse Club, but a lot the kids from the revival of it for the Disney Channel are all completely mind fucked? The only one I can think of from the original Mickey Mouse Club that ran in to problems was Darlene Gillespie, and she got popped for shoplifting in the late 90s. permalink parent award report block reply IncredibleMrE1 4 points 2 days ago Bono and U2 Beyonce/Jay-Z The Grateful Dead permalink parent award report block reply Ostia 3 points 2 days ago Nah, she’s just a liberal white woman we supported to the hilt until she made her views known. permalink parent award report block reply ImYourHuckleberry24 9 points 2 days ago Speak for yourself. She's been part of it from the beginning. permalink parent award report block reply Ostia -2 points 2 days ago Yeah, man. Fearless was such a subversive CIA beneficial album. They go back to December all the time. permalink parent award report block reply Here_we_go 2 points 2 days ago Nickleback. Fucking Nickleback. permalink parent award report block reply Ostia 3 points 2 days ago Nickleback doesn’t matter enough to be a CIA hook. permalink parent award report block reply Here_we_go 6 points 2 days ago But they keep screaming at me to look at this stupid fucking photograph. permalink parent award report block reply Cacciali_Via 1 points 2 days ago Nickelback was actually pretty good. Hating them does not make you cool. permalink parent award report block reply Ostia 3 points 1 day ago Nickleback is fucking awful, fren. Your musical input is fully revoked. permalink parent award report block reply upside-downPHflag 1 points 1 day ago It's still funny to me that Avril Lavigne first married the lead singer of Sum 41, only to then go after Chad Kroeger. Then again that's the Canadian music scene for you. permalink parent award report block reply Hanging_Chad 1 points 2 days ago Bad Bunny permalink parent award report block reply MAG_n_KAG 8 points 2 days ago Isn't it funny how the ones behind it are exactly who you'd expect? permalink parent award report block reply Ralphusthegreatus -1 points 2 days ago A few thousand people will hear the story and then it will be forgotten about. permalink parent award report block reply Snek_Plissken 28 points 2 days ago Is this why rap didn’t hit the top 40? No more usaids? permalink award report block reply UCantStumpTheTrump 16 points 2 days ago Very astute observation. To a large extent, 'popular music' is propped up by payola and streaming platforms giving preferential treatment to specific major-labels & their artists permalink parent award report block reply DeportThemAllForever 9 points 2 days ago Wildest story was how they pumped up that lesbian singer in Russia, that Putin arrested. Who at CIA thought that’s a great idea to spend money on.  What’s with the goal of making everything gay across the globe. permalink parent award report block reply gorilla_grip 4 points 2 days ago Taking people out of the gene pool.  Gays, lesbians, trans, incels etc all take themselves out of breeding.  Less people equals less carbon emissions.  Also less white people equals less people who are likely to rise up against tyranny permalink parent award report block reply TexasDusty 1 points 2 days ago So their master plan is to stop the bloodlines of the people who support them, fund them and vote for their puppets? Leaving behind only their opposition to reproduce? AND YOU WANT TO STOP THEM?!? permalink parent award report block reply ViagraFalls 4 points 2 days ago I always thought it was degrading to listen to ni66er garbage but so many other white kids don’t have standards. I’m not even opposed to listening to black musicians like Wes Montgomery or Boyz II Men. I’m talking about the degenerate garbage that’s all about being a ni66er. permalink parent award report block reply South_Florida_Guy 18 points 2 days ago MK Ultra permalink award report block reply UCantStumpTheTrump 11 points 2 days ago There is a theory (with some credence to it) that the 'entertainment' industry deliberately glorifies murder music to keep the prison pipeline full of new inmates permalink parent award report block reply Cacciali_Via -3 points 2 days ago Ridiculous. permalink parent award report block reply Hanging_Chad 14 points 2 days ago Benz didn’t kill himself permalink award report block reply DeportThemAllForever 12 points 2 days ago I think Mike just proved that no matter how hard cia tries, no one likes country music. permalink parent award report block reply scruffyshoulders 4 points 2 days ago It's pretty interesting the two most hated genres, pop rap and pop country, are tied up in this shit. It's almost like we've subconsciously known this whole time. permalink parent award report block reply I_Love_45-70_Gov 12 points 2 days ago USAID funding has dried up, and now, for the first time since 1990 ('95?), a rap song has not been in the top 40.  🤔 permalink award report block reply booblitchutz 6 points 2 days ago Ice Ice Baby was the #1 song on the Billboard charts in the country in 1990, btw. permalink parent award report block reply MixedBlacknWhite 10 points 2 days ago I have been saying this for years!! Once I got into pop country (shush, I had to start somewhere and it's catchy) I started comparing the top song lyrics in country vs rap .. and my god there is a huge difference. but wait, there's more. So I went down a rabbit hole of \"maybe it's about income disparity\" and that's why the different tones in the music. Not so fast. There are many majority poor white towns in \"country\" areas, like W.V and KY who don't have violent crimes like they do in the equally poor majority black towns of near the same populations (and I did per capita too to make sure I got solid metrics) So how is it that two groups of people from the same income levels listen to two types of different music with wildly different messages? Is it only the people or is it something else? God, fishing, beer, friends, family first, checking in on loved ones, loves lost and loves found vs Shooting, violence, drugs, materialism, treating people like shit and a hate of law and order Fucking wild to me permalink award report block reply MuslimsWorshipSatan 4 points 2 days ago Don't neglect the genetic factor either. permalink parent award report block reply tholinz 10 points 2 days ago Good, make those Satanists squirm. permalink award report block reply Thatunknownguy 8 points 2 days ago I've never heard of this guy but I have a feeling hes somehow going to shift the blame off joggers to the CIA permalink award report block reply SwedishChainsaw2 6 points 1 day ago Benz is the one who showed how NGOs were all government funded and how the sensorship machine worked. He's good at info gathering and research. permalink parent award report block reply SenorTrumper 6 points 2 days ago They are in bed together. permalink parent award report block reply Thatunknownguy 6 points 2 days ago Literally permalink parent award report block reply ElectionMeddler 7 points 2 days ago Make music great again! No more gangsta rap, no more hot slut pop.  Let's just make enjoyable songs that we can sing with friends and family.  Give it a good beat. Good rhythm.  And good lyrics.   Give America a culture to be proud of for the next 50 years permalink award report block reply anotherviewpoint 3 points 2 days ago Go back to the standards even better, check out Artie Shaw, Tommy Dorsey, Glenn Miller and then all the players and their records like Ziggy Elman, or a whole host of others.  Its a rabbit hole of good times, warmth and musical talent. permalink parent award report block reply DonnieRamesJio 3 points 2 days ago Jack Sheldon - \"I'm Just A Bill Up On Capitol Hill\", also cameo'd in a lot of Dragnet episodes permalink parent award report block reply guywholikesDjtof2024 6 points 2 days ago \" B b bBUT IT WAS A KONSPERACE THERIY!!!111!1! REEEEEEEEEEE!!11!1!11\" permalink award report block reply BrainwashedbyTrump 6 points 2 days ago THANK YOU FOR THIS! Their manipulation must stop. The mainstream garbage of sex, drugs, murder, and culture manipulation is degrading our society. Are they really pro America or just trying to subvert us into idiots? How will, or do they even think they'll ever need to/have to regain their trust to the American people? What have they done for Americans lately? permalink award report block reply SmokeyAF 6 points 2 days ago Mike Benz is awesome. permalink award report block reply gorilla_grip 5 points 2 days ago I think I heard an ex cia guy talking about this on Joe Rogan a year or so ago.  About how they influenced musical acts to speak about certain social issues to sway public opinion in other nations .  And admitted they did it in the US too. permalink award report block reply MAG_n_KAG 5 points 2 days ago Make 432 hz the standard again permalink award report block reply Obambi 5 points 2 days ago Guess who controls the music industry??! permalink award report block reply freeperjim 5 points 2 days ago Rap/HipHop is to music...as Ebonics is to the English language. \"Culture drives politics\" - Andrew Breitbart permalink award report block reply panic_scam 5 points 2 days ago Watch the video of the Tupac interview when he was 17; effeminate mannerisms, voice, ideals, etc permalink award report block reply SwedishChainsaw2 3 points 1 day ago Gay theater kid who was groomed into a gangster rapper. Mf was a backup dancer. Totally gay. permalink parent award report block reply RoughBoy 4 points 2 days ago Is this why modern music sucks? permalink award report block reply friedchicken 3 points 2 days ago Fuck the CIA permalink award report block reply JJohnJohnson 3 points 2 days ago Why just rap? We need to have a conversation about why just about every mainstream form of music since 1980 has been a steaming mound of shit. permalink award report block reply onesummerdream 1 points 1 day ago MTV permalink parent award report block reply JJohnJohnson 1 points 1 day ago It's deeper than that. https://youtu.be/KZazEM8cgt0 permalink parent award report block reply Lib_Women_Have_HSV 3 points 2 days ago It's the tribe of Benjamin permalink award report block reply Dev404 2 points 2 days ago Their influence is strongly in Hollywood as well. In fact, if you want access to certain resources like shooting locations or the use of military assets, you have to play ball with the CIA in that they get to dictate what's allowed and not allowed in your movie as well as parrot whatever message they want you to say in the movie. They have more influence than people realize. permalink award report block reply eel003 2 points 2 days ago I remember when Rap changed and so did the people doin the Rapping...one even wrote song about it... I present PM Dawn's...Plastic. https://youtu.be/P0No7iAqLHM?si=1bsLhgTQuKaiDiE0 Listen close he rips more then just just house beats. Enjoy\n(they paid a price as they faded out after this album and opportunities disappeared) permalink award report block reply lovemylibs 2 points 2 days ago The A & R man has always been evil. permalink award report block reply NoMoreShinesBilly 1 points 2 days ago sounds like a good talk.  kek. permalink award report block reply Mhmm2MoreWeeks 1 points 2 days ago In the end you will find out that Jesuits and Secret Societies (BAD WHITE PEOPLE) were behind the organized crime that fueled the American Deep State since day one. They (The Globalist 5000) are the modern incarnations of the NAZIS. And they know how to use unscrupulous Jews, Indians, and Asians as front men. permalink award report block reply highenergywinning 1 points 2 days ago Everything changed when they changed the hz of music permalink award report block reply edxzxz 1 points 1 day ago There was a big stock fund manager guy who said in regards to Enron before it self destructed that 'if you see a company's stock skyrocketing, but you can't figure out how they make money, it's probably a scam and they're not actually making money'.  Since 'rap music' is absolute shit, and its target audience is too poor to spend money on it, I assumed for forever that it was all some kind of scam and the money was coming from somewhere but not from people buying it. permalink award report block reply Ostia -3 points 2 days ago Lee Greenwood was 100% funded and aided in the rise of his one hit during Desert Storm. Never questioned how suddenly this super patriotic support song materialized out of nowhere, and got used everywhere, right as we were starting our first actual war in decades, did you? It was all wrapped out together as a military action support sell. Under Mr. Bush CIA Senior no less. That was back when propaganda was used for good though. The good ole’ days. Now it’s just subversion, not persuasion to Americanism. EDIT: Why on earth would you downvote this in this thread, when it’s so obviously true that they may have well just wrapped it around a brick and hit you in the face with it? permalink award report block reply lul_cheto 5 points 2 days ago Invading Iraq for gaaysreal was never good, no matter how many \"murica\" anthems it was wrapped in permalink parent award report block reply Ostia -1 points 2 days ago Sure, edgelord. permalink parent award report block reply lul_cheto 2 points 2 days ago Glad we agree 🫡 permalink parent award report block reply TexasDusty -3 points 2 days ago Oh cool, more red lines pointing to boxes so people who literally think Hillary has been cloned can make everyone who hates celebrity degenerates look like Qtards. Great. Don’t know why people think we’re stupid. permalink award report block reply\nMAGA9428 70 points 2 days ago This will be interesting. Expose the music industry’s role in promoting degeneracy given that half of mainstream music today makes that its primary mission. permalink award report block reply Viewer01 35 points 2 days ago Taylor swift has to be one. permalink parent award report block reply Dway 14 points 2 days ago She couldn’t even carry a tune when she first came out. They groomed teenage girls at the time. Just like Britney Spears and Madonna. permalink parent award report block reply The_Return_of_User_x 5 points 2 days ago Brittany Spears had her MKUltra triggered early... Shaving her head and such. But on a serious note, I wouldnt put it past the CIA and the three letter organizations we haven't hear of yet to have recruited her. permalink parent award report block reply Dway 4 points 2 days ago Cher and even Janice Joplin, at least Joplin had great songs permalink parent award report block reply THELEADERSOFMEN 2 points 2 days ago Joplin was legit, they just had to stand back and let her go, poor thing. But there’s all kinds of mystery surrounding the whole Laurel Canyon scene given half the artists who came out of there were military/intelligence brats. Jim Morrison, Zappa etc. “Weird Scenes Inside the Canyon” permalink parent award report block reply anotherthing 2 points 1 day ago Britney Spears was a Mouseketeer. You ever notice how the original Mouseketeers were all normal and well adjusted kids when Walt Disney did the original Mickey Mouse Club, but a lot the kids from the revival of it for the Disney Channel are all completely mind fucked? The only one I can think of from the original Mickey Mouse Club that ran in to problems was Darlene Gillespie, and she got popped for shoplifting in the late 90s. permalink parent award report block reply IncredibleMrE1 4 points 2 days ago Bono and U2 Beyonce/Jay-Z The Grateful Dead permalink parent award report block reply Ostia 3 points 2 days ago Nah, she’s just a liberal white woman we supported to the hilt until she made her views known. permalink parent award report block reply ImYourHuckleberry24 9 points 2 days ago Speak for yourself. She's been part of it from the beginning. permalink parent award report block reply Ostia -2 points 2 days ago Yeah, man. Fearless was such a subversive CIA beneficial album. They go back to December all the time. permalink parent award report block reply Here_we_go 2 points 2 days ago Nickleback. Fucking Nickleback. permalink parent award report block reply Ostia 3 points 2 days ago Nickleback doesn’t matter enough to be a CIA hook. permalink parent award report block reply Here_we_go 6 points 2 days ago But they keep screaming at me to look at this stupid fucking photograph. permalink parent award report block reply Cacciali_Via 1 points 2 days ago Nickelback was actually pretty good. Hating them does not make you cool. permalink parent award report block reply Ostia 3 points 1 day ago Nickleback is fucking awful, fren. Your musical input is fully revoked. permalink parent award report block reply upside-downPHflag 1 points 1 day ago It's still funny to me that Avril Lavigne first married the lead singer of Sum 41, only to then go after Chad Kroeger. Then again that's the Canadian music scene for you. permalink parent award report block reply Hanging_Chad 1 points 2 days ago Bad Bunny permalink parent award report block reply MAG_n_KAG 8 points 2 days ago Isn't it funny how the ones behind it are exactly who you'd expect? permalink parent award report block reply Ralphusthegreatus -1 points 2 days ago A few thousand people will hear the story and then it will be forgotten about. permalink parent award report block reply\nViewer01 35 points 2 days ago Taylor swift has to be one. permalink parent award report block reply Dway 14 points 2 days ago She couldn’t even carry a tune when she first came out. They groomed teenage girls at the time. Just like Britney Spears and Madonna. permalink parent award report block reply The_Return_of_User_x 5 points 2 days ago Brittany Spears had her MKUltra triggered early... Shaving her head and such. But on a serious note, I wouldnt put it past the CIA and the three letter organizations we haven't hear of yet to have recruited her. permalink parent award report block reply Dway 4 points 2 days ago Cher and even Janice Joplin, at least Joplin had great songs permalink parent award report block reply THELEADERSOFMEN 2 points 2 days ago Joplin was legit, they just had to stand back and let her go, poor thing. But there’s all kinds of mystery surrounding the whole Laurel Canyon scene given half the artists who came out of there were military/intelligence brats. Jim Morrison, Zappa etc. “Weird Scenes Inside the Canyon” permalink parent award report block reply anotherthing 2 points 1 day ago Britney Spears was a Mouseketeer. You ever notice how the original Mouseketeers were all normal and well adjusted kids when Walt Disney did the original Mickey Mouse Club, but a lot the kids from the revival of it for the Disney Channel are all completely mind fucked? The only one I can think of from the original Mickey Mouse Club that ran in to problems was Darlene Gillespie, and she got popped for shoplifting in the late 90s. permalink parent award report block reply IncredibleMrE1 4 points 2 days ago Bono and U2 Beyonce/Jay-Z The Grateful Dead permalink parent award report block reply Ostia 3 points 2 days ago Nah, she’s just a liberal white woman we supported to the hilt until she made her views known. permalink parent award report block reply ImYourHuckleberry24 9 points 2 days ago Speak for yourself. She's been part of it from the beginning. permalink parent award report block reply Ostia -2 points 2 days ago Yeah, man. Fearless was such a subversive CIA beneficial album. They go back to December all the time. permalink parent award report block reply Here_we_go 2 points 2 days ago Nickleback. Fucking Nickleback. permalink parent award report block reply Ostia 3 points 2 days ago Nickleback doesn’t matter enough to be a CIA hook. permalink parent award report block reply Here_we_go 6 points 2 days ago But they keep screaming at me to look at this stupid fucking photograph. permalink parent award report block reply Cacciali_Via 1 points 2 days ago Nickelback was actually pretty good. Hating them does not make you cool. permalink parent award report block reply Ostia 3 points 1 day ago Nickleback is fucking awful, fren. Your musical input is fully revoked. permalink parent award report block reply upside-downPHflag 1 points 1 day ago It's still funny to me that Avril Lavigne first married the lead singer of Sum 41, only to then go after Chad Kroeger. Then again that's the Canadian music scene for you. permalink parent award report block reply Hanging_Chad 1 points 2 days ago Bad Bunny permalink parent award report block reply\nDway 14 points 2 days ago She couldn’t even carry a tune when she first came out. They groomed teenage girls at the time. Just like Britney Spears and Madonna. permalink parent award report block reply The_Return_of_User_x 5 points 2 days ago Brittany Spears had her MKUltra triggered early... Shaving her head and such. But on a serious note, I wouldnt put it past the CIA and the three letter organizations we haven't hear of yet to have recruited her. permalink parent award report block reply Dway 4 points 2 days ago Cher and even Janice Joplin, at least Joplin had great songs permalink parent award report block reply THELEADERSOFMEN 2 points 2 days ago Joplin was legit, they just had to stand back and let her go, poor thing. But there’s all kinds of mystery surrounding the whole Laurel Canyon scene given half the artists who came out of there were military/intelligence brats. Jim Morrison, Zappa etc. “Weird Scenes Inside the Canyon” permalink parent award report block reply anotherthing 2 points 1 day ago Britney Spears was a Mouseketeer. You ever notice how the original Mouseketeers were all normal and well adjusted kids when Walt Disney did the original Mickey Mouse Club, but a lot the kids from the revival of it for the Disney Channel are all completely mind fucked? The only one I can think of from the original Mickey Mouse Club that ran in to problems was Darlene Gillespie, and she got popped for shoplifting in the late 90s. permalink parent award report block reply\nThe_Return_of_User_x 5 points 2 days ago Brittany Spears had her MKUltra triggered early... Shaving her head and such. But on a serious note, I wouldnt put it past the CIA and the three letter organizations we haven't hear of yet to have recruited her. permalink parent award report block reply\nDway 4 points 2 days ago Cher and even Janice Joplin, at least Joplin had great songs permalink parent award report block reply THELEADERSOFMEN 2 points 2 days ago Joplin was legit, they just had to stand back and let her go, poor thing. But there’s all kinds of mystery surrounding the whole Laurel Canyon scene given half the artists who came out of there were military/intelligence brats. Jim Morrison, Zappa etc. “Weird Scenes Inside the Canyon” permalink parent award report block reply\nTHELEADERSOFMEN 2 points 2 days ago Joplin was legit, they just had to stand back and let her go, poor thing. But there’s all kinds of mystery surrounding the whole Laurel Canyon scene given half the artists who came out of there were military/intelligence brats. Jim Morrison, Zappa etc. “Weird Scenes Inside the Canyon” permalink parent award report block reply\nanotherthing 2 points 1 day ago Britney Spears was a Mouseketeer. You ever notice how the original Mouseketeers were all normal and well adjusted kids when Walt Disney did the original Mickey Mouse Club, but a lot the kids from the revival of it for the Disney Channel are all completely mind fucked? The only one I can think of from the original Mickey Mouse Club that ran in to problems was Darlene Gillespie, and she got popped for shoplifting in the late 90s. permalink parent award report block reply\nIncredibleMrE1 4 points 2 days ago Bono and U2 Beyonce/Jay-Z The Grateful Dead permalink parent award report block reply\nOstia 3 points 2 days ago Nah, she’s just a liberal white woman we supported to the hilt until she made her views known. permalink parent award report block reply ImYourHuckleberry24 9 points 2 days ago Speak for yourself. She's been part of it from the beginning. permalink parent award report block reply Ostia -2 points 2 days ago Yeah, man. Fearless was such a subversive CIA beneficial album. They go back to December all the time. permalink parent award report block reply\nImYourHuckleberry24 9 points 2 days ago Speak for yourself. She's been part of it from the beginning. permalink parent award report block reply Ostia -2 points 2 days ago Yeah, man. Fearless was such a subversive CIA beneficial album. They go back to December all the time. permalink parent award report block reply\nOstia -2 points 2 days ago Yeah, man. Fearless was such a subversive CIA beneficial album. They go back to December all the time. permalink parent award report block reply\nHere_we_go 2 points 2 days ago Nickleback. Fucking Nickleback. permalink parent award report block reply Ostia 3 points 2 days ago Nickleback doesn’t matter enough to be a CIA hook. permalink parent award report block reply Here_we_go 6 points 2 days ago But they keep screaming at me to look at this stupid fucking photograph. permalink parent award report block reply Cacciali_Via 1 points 2 days ago Nickelback was actually pretty good. Hating them does not make you cool. permalink parent award report block reply Ostia 3 points 1 day ago Nickleback is fucking awful, fren. Your musical input is fully revoked. permalink parent award report block reply upside-downPHflag 1 points 1 day ago It's still funny to me that Avril Lavigne first married the lead singer of Sum 41, only to then go after Chad Kroeger. Then again that's the Canadian music scene for you. permalink parent award report block reply\nOstia 3 points 2 days ago Nickleback doesn’t matter enough to be a CIA hook. permalink parent award report block reply Here_we_go 6 points 2 days ago But they keep screaming at me to look at this stupid fucking photograph. permalink parent award report block reply\nHere_we_go 6 points 2 days ago But they keep screaming at me to look at this stupid fucking photograph. permalink parent award report block reply\nCacciali_Via 1 points 2 days ago Nickelback was actually pretty good. Hating them does not make you cool. permalink parent award report block reply Ostia 3 points 1 day ago Nickleback is fucking awful, fren. Your musical input is fully revoked. permalink parent award report block reply\nOstia 3 points 1 day ago Nickleback is fucking awful, fren. Your musical input is fully revoked. permalink parent award report block reply\nupside-downPHflag 1 points 1 day ago It's still funny to me that Avril Lavigne first married the lead singer of Sum 41, only to then go after Chad Kroeger. Then again that's the Canadian music scene for you. permalink parent award report block reply\nHanging_Chad 1 points 2 days ago Bad Bunny permalink parent award report block reply\nMAG_n_KAG 8 points 2 days ago Isn't it funny how the ones behind it are exactly who you'd expect? permalink parent award report block reply\nRalphusthegreatus -1 points 2 days ago A few thousand people will hear the story and then it will be forgotten about. permalink parent award report block reply\nSnek_Plissken 28 points 2 days ago Is this why rap didn’t hit the top 40? No more usaids? permalink award report block reply UCantStumpTheTrump 16 points 2 days ago Very astute observation. To a large extent, 'popular music' is propped up by payola and streaming platforms giving preferential treatment to specific major-labels & their artists permalink parent award report block reply DeportThemAllForever 9 points 2 days ago Wildest story was how they pumped up that lesbian singer in Russia, that Putin arrested. Who at CIA thought that’s a great idea to spend money on.  What’s with the goal of making everything gay across the globe. permalink parent award report block reply gorilla_grip 4 points 2 days ago Taking people out of the gene pool.  Gays, lesbians, trans, incels etc all take themselves out of breeding.  Less people equals less carbon emissions.  Also less white people equals less people who are likely to rise up against tyranny permalink parent award report block reply TexasDusty 1 points 2 days ago So their master plan is to stop the bloodlines of the people who support them, fund them and vote for their puppets? Leaving behind only their opposition to reproduce? AND YOU WANT TO STOP THEM?!? permalink parent award report block reply ViagraFalls 4 points 2 days ago I always thought it was degrading to listen to ni66er garbage but so many other white kids don’t have standards. I’m not even opposed to listening to black musicians like Wes Montgomery or Boyz II Men. I’m talking about the degenerate garbage that’s all about being a ni66er. permalink parent award report block reply\nUCantStumpTheTrump 16 points 2 days ago Very astute observation. To a large extent, 'popular music' is propped up by payola and streaming platforms giving preferential treatment to specific major-labels & their artists permalink parent award report block reply\nDeportThemAllForever 9 points 2 days ago Wildest story was how they pumped up that lesbian singer in Russia, that Putin arrested. Who at CIA thought that’s a great idea to spend money on.  What’s with the goal of making everything gay across the globe. permalink parent award report block reply gorilla_grip 4 points 2 days ago Taking people out of the gene pool.  Gays, lesbians, trans, incels etc all take themselves out of breeding.  Less people equals less carbon emissions.  Also less white people equals less people who are likely to rise up against tyranny permalink parent award report block reply TexasDusty 1 points 2 days ago So their master plan is to stop the bloodlines of the people who support them, fund them and vote for their puppets? Leaving behind only their opposition to reproduce? AND YOU WANT TO STOP THEM?!? permalink parent award report block reply\ngorilla_grip 4 points 2 days ago Taking people out of the gene pool.  Gays, lesbians, trans, incels etc all take themselves out of breeding.  Less people equals less carbon emissions.  Also less white people equals less people who are likely to rise up against tyranny permalink parent award report block reply TexasDusty 1 points 2 days ago So their master plan is to stop the bloodlines of the people who support them, fund them and vote for their puppets? Leaving behind only their opposition to reproduce? AND YOU WANT TO STOP THEM?!? permalink parent award report block reply\nTexasDusty 1 points 2 days ago So their master plan is to stop the bloodlines of the people who support them, fund them and vote for their puppets? Leaving behind only their opposition to reproduce? AND YOU WANT TO STOP THEM?!? permalink parent award report block reply\nViagraFalls 4 points 2 days ago I always thought it was degrading to listen to ni66er garbage but so many other white kids don’t have standards. I’m not even opposed to listening to black musicians like Wes Montgomery or Boyz II Men. I’m talking about the degenerate garbage that’s all about being a ni66er. permalink parent award report block reply\nSouth_Florida_Guy 18 points 2 days ago MK Ultra permalink award report block reply UCantStumpTheTrump 11 points 2 days ago There is a theory (with some credence to it) that the 'entertainment' industry deliberately glorifies murder music to keep the prison pipeline full of new inmates permalink parent award report block reply Cacciali_Via -3 points 2 days ago Ridiculous. permalink parent award report block reply\nUCantStumpTheTrump 11 points 2 days ago There is a theory (with some credence to it) that the 'entertainment' industry deliberately glorifies murder music to keep the prison pipeline full of new inmates permalink parent award report block reply Cacciali_Via -3 points 2 days ago Ridiculous. permalink parent award report block reply\nCacciali_Via -3 points 2 days ago Ridiculous. permalink parent award report block reply\nHanging_Chad 14 points 2 days ago Benz didn’t kill himself permalink award report block reply DeportThemAllForever 12 points 2 days ago I think Mike just proved that no matter how hard cia tries, no one likes country music. permalink parent award report block reply scruffyshoulders 4 points 2 days ago It's pretty interesting the two most hated genres, pop rap and pop country, are tied up in this shit. It's almost like we've subconsciously known this whole time. permalink parent award report block reply\nDeportThemAllForever 12 points 2 days ago I think Mike just proved that no matter how hard cia tries, no one likes country music. permalink parent award report block reply scruffyshoulders 4 points 2 days ago It's pretty interesting the two most hated genres, pop rap and pop country, are tied up in this shit. It's almost like we've subconsciously known this whole time. permalink parent award report block reply\nscruffyshoulders 4 points 2 days ago It's pretty interesting the two most hated genres, pop rap and pop country, are tied up in this shit. It's almost like we've subconsciously known this whole time. permalink parent award report block reply\nI_Love_45-70_Gov 12 points 2 days ago USAID funding has dried up, and now, for the first time since 1990 ('95?), a rap song has not been in the top 40.  🤔 permalink award report block reply booblitchutz 6 points 2 days ago Ice Ice Baby was the #1 song on the Billboard charts in the country in 1990, btw. permalink parent award report block reply\nbooblitchutz 6 points 2 days ago Ice Ice Baby was the #1 song on the Billboard charts in the country in 1990, btw. permalink parent award report block reply\nMixedBlacknWhite 10 points 2 days ago I have been saying this for years!! Once I got into pop country (shush, I had to start somewhere and it's catchy) I started comparing the top song lyrics in country vs rap .. and my god there is a huge difference. but wait, there's more. So I went down a rabbit hole of \"maybe it's about income disparity\" and that's why the different tones in the music. Not so fast. There are many majority poor white towns in \"country\" areas, like W.V and KY who don't have violent crimes like they do in the equally poor majority black towns of near the same populations (and I did per capita too to make sure I got solid metrics) So how is it that two groups of people from the same income levels listen to two types of different music with wildly different messages? Is it only the people or is it something else? God, fishing, beer, friends, family first, checking in on loved ones, loves lost and loves found vs Shooting, violence, drugs, materialism, treating people like shit and a hate of law and order Fucking wild to me permalink award report block reply MuslimsWorshipSatan 4 points 2 days ago Don't neglect the genetic factor either. permalink parent award report block reply\nMuslimsWorshipSatan 4 points 2 days ago Don't neglect the genetic factor either. permalink parent award report block reply\ntholinz 10 points 2 days ago Good, make those Satanists squirm. permalink award report block reply\nThatunknownguy 8 points 2 days ago I've never heard of this guy but I have a feeling hes somehow going to shift the blame off joggers to the CIA permalink award report block reply SwedishChainsaw2 6 points 1 day ago Benz is the one who showed how NGOs were all government funded and how the sensorship machine worked. He's good at info gathering and research. permalink parent award report block reply SenorTrumper 6 points 2 days ago They are in bed together. permalink parent award report block reply Thatunknownguy 6 points 2 days ago Literally permalink parent award report block reply\nSwedishChainsaw2 6 points 1 day ago Benz is the one who showed how NGOs were all government funded and how the sensorship machine worked. He's good at info gathering and research. permalink parent award report block reply\nSenorTrumper 6 points 2 days ago They are in bed together. permalink parent award report block reply Thatunknownguy 6 points 2 days ago Literally permalink parent award report block reply\nThatunknownguy 6 points 2 days ago Literally permalink parent award report block reply\nElectionMeddler 7 points 2 days ago Make music great again! No more gangsta rap, no more hot slut pop.  Let's just make enjoyable songs that we can sing with friends and family.  Give it a good beat. Good rhythm.  And good lyrics.   Give America a culture to be proud of for the next 50 years permalink award report block reply anotherviewpoint 3 points 2 days ago Go back to the standards even better, check out Artie Shaw, Tommy Dorsey, Glenn Miller and then all the players and their records like Ziggy Elman, or a whole host of others.  Its a rabbit hole of good times, warmth and musical talent. permalink parent award report block reply DonnieRamesJio 3 points 2 days ago Jack Sheldon - \"I'm Just A Bill Up On Capitol Hill\", also cameo'd in a lot of Dragnet episodes permalink parent award report block reply\nanotherviewpoint 3 points 2 days ago Go back to the standards even better, check out Artie Shaw, Tommy Dorsey, Glenn Miller and then all the players and their records like Ziggy Elman, or a whole host of others.  Its a rabbit hole of good times, warmth and musical talent. permalink parent award report block reply DonnieRamesJio 3 points 2 days ago Jack Sheldon - \"I'm Just A Bill Up On Capitol Hill\", also cameo'd in a lot of Dragnet episodes permalink parent award report block reply\nDonnieRamesJio 3 points 2 days ago Jack Sheldon - \"I'm Just A Bill Up On Capitol Hill\", also cameo'd in a lot of Dragnet episodes permalink parent award report block reply\nguywholikesDjtof2024 6 points 2 days ago \" B b bBUT IT WAS A KONSPERACE THERIY!!!111!1! REEEEEEEEEEE!!11!1!11\" permalink award report block reply\nBrainwashedbyTrump 6 points 2 days ago THANK YOU FOR THIS! Their manipulation must stop. The mainstream garbage of sex, drugs, murder, and culture manipulation is degrading our society. Are they really pro America or just trying to subvert us into idiots? How will, or do they even think they'll ever need to/have to regain their trust to the American people? What have they done for Americans lately? permalink award report block reply\nSmokeyAF 6 points 2 days ago Mike Benz is awesome. permalink award report block reply\ngorilla_grip 5 points 2 days ago I think I heard an ex cia guy talking about this on Joe Rogan a year or so ago.  About how they influenced musical acts to speak about certain social issues to sway public opinion in other nations .  And admitted they did it in the US too. permalink award report block reply\nMAG_n_KAG 5 points 2 days ago Make 432 hz the standard again permalink award report block reply\nObambi 5 points 2 days ago Guess who controls the music industry??! permalink award report block reply\nfreeperjim 5 points 2 days ago Rap/HipHop is to music...as Ebonics is to the English language. \"Culture drives politics\" - Andrew Breitbart permalink award report block reply\npanic_scam 5 points 2 days ago Watch the video of the Tupac interview when he was 17; effeminate mannerisms, voice, ideals, etc permalink award report block reply SwedishChainsaw2 3 points 1 day ago Gay theater kid who was groomed into a gangster rapper. Mf was a backup dancer. Totally gay. permalink parent award report block reply\nSwedishChainsaw2 3 points 1 day ago Gay theater kid who was groomed into a gangster rapper. Mf was a backup dancer. Totally gay. permalink parent award report block reply\nRoughBoy 4 points 2 days ago Is this why modern music sucks? permalink award report block reply\nfriedchicken 3 points 2 days ago Fuck the CIA permalink award report block reply\nJJohnJohnson 3 points 2 days ago Why just rap? We need to have a conversation about why just about every mainstream form of music since 1980 has been a steaming mound of shit. permalink award report block reply onesummerdream 1 points 1 day ago MTV permalink parent award report block reply JJohnJohnson 1 points 1 day ago It's deeper than that. https://youtu.be/KZazEM8cgt0 permalink parent award report block reply\nonesummerdream 1 points 1 day ago MTV permalink parent award report block reply JJohnJohnson 1 points 1 day ago It's deeper than that. https://youtu.be/KZazEM8cgt0 permalink parent award report block reply\nJJohnJohnson 1 points 1 day ago It's deeper than that. https://youtu.be/KZazEM8cgt0 permalink parent award report block reply\nLib_Women_Have_HSV 3 points 2 days ago It's the tribe of Benjamin permalink award report block reply\nDev404 2 points 2 days ago Their influence is strongly in Hollywood as well. In fact, if you want access to certain resources like shooting locations or the use of military assets, you have to play ball with the CIA in that they get to dictate what's allowed and not allowed in your movie as well as parrot whatever message they want you to say in the movie. They have more influence than people realize. permalink award report block reply\neel003 2 points 2 days ago I remember when Rap changed and so did the people doin the Rapping...one even wrote song about it... I present PM Dawn's...Plastic. https://youtu.be/P0No7iAqLHM?si=1bsLhgTQuKaiDiE0 Listen close he rips more then just just house beats. Enjoy\n(they paid a price as they faded out after this album and opportunities disappeared) permalink award report block reply\nlovemylibs 2 points 2 days ago The A & R man has always been evil. permalink award report block reply\nNoMoreShinesBilly 1 points 2 days ago sounds like a good talk.  kek. permalink award report block reply\nMhmm2MoreWeeks 1 points 2 days ago In the end you will find out that Jesuits and Secret Societies (BAD WHITE PEOPLE) were behind the organized crime that fueled the American Deep State since day one. They (The Globalist 5000) are the modern incarnations of the NAZIS. And they know how to use unscrupulous Jews, Indians, and Asians as front men. permalink award report block reply\nhighenergywinning 1 points 2 days ago Everything changed when they changed the hz of music permalink award report block reply\nedxzxz 1 points 1 day ago There was a big stock fund manager guy who said in regards to Enron before it self destructed that 'if you see a company's stock skyrocketing, but you can't figure out how they make money, it's probably a scam and they're not actually making money'.  Since 'rap music' is absolute shit, and its target audience is too poor to spend money on it, I assumed for forever that it was all some kind of scam and the money was coming from somewhere but not from people buying it. permalink award report block reply\nOstia -3 points 2 days ago Lee Greenwood was 100% funded and aided in the rise of his one hit during Desert Storm. Never questioned how suddenly this super patriotic support song materialized out of nowhere, and got used everywhere, right as we were starting our first actual war in decades, did you? It was all wrapped out together as a military action support sell. Under Mr. Bush CIA Senior no less. That was back when propaganda was used for good though. The good ole’ days. Now it’s just subversion, not persuasion to Americanism. EDIT: Why on earth would you downvote this in this thread, when it’s so obviously true that they may have well just wrapped it around a brick and hit you in the face with it? permalink award report block reply lul_cheto 5 points 2 days ago Invading Iraq for gaaysreal was never good, no matter how many \"murica\" anthems it was wrapped in permalink parent award report block reply Ostia -1 points 2 days ago Sure, edgelord. permalink parent award report block reply lul_cheto 2 points 2 days ago Glad we agree 🫡 permalink parent award report block reply\nlul_cheto 5 points 2 days ago Invading Iraq for gaaysreal was never good, no matter how many \"murica\" anthems it was wrapped in permalink parent award report block reply Ostia -1 points 2 days ago Sure, edgelord. permalink parent award report block reply lul_cheto 2 points 2 days ago Glad we agree 🫡 permalink parent award report block reply\nOstia -1 points 2 days ago Sure, edgelord. permalink parent award report block reply lul_cheto 2 points 2 days ago Glad we agree 🫡 permalink parent award report block reply\nlul_cheto 2 points 2 days ago Glad we agree 🫡 permalink parent award report block reply\nTexasDusty -3 points 2 days ago Oh cool, more red lines pointing to boxes so people who literally think Hillary has been cloned can make everyone who hates celebrity degenerates look like Qtards. Great. Don’t know why people think we’re stupid. permalink award report block reply",
  "fetched_at": "2025-11-12T23:17:44.914793Z"
}