{
  "id": "1ARK54T2rQ",
  "url": "https://patriots.win/p/1ARK54T2rQ/a-100-year-old-british-royal-nav/c",
  "content": "1899 A 100 year old British Royal Navy veteran speaking on live TV, says that we fought WW2 for nothing.  Britain is less free than in 1945. (www.breitbart.com) posted 5 days ago by Landslide_2020 278 comments award share report block 100-Year-Old Veteran on Live TV: We Fought WW2 for Nothing A centenarian Navy veteran took full advantage of being on live TV to express his sorrow at the state of modern Britain. www.breitbart.com\n278 comments Sort by Top Top New Worst Old Save Elon Musk Confirms Sad News Today Read More Ads by Ad.Style ragnarokrobo 189 points 5 days ago While being interviewed by a harpy and a streetshitter. He's right. permalink award report block reply RINO_fatigue 80 points 5 days ago He might be correct, but did he have a loicense to say all that? permalink parent award report block reply ragnarokrobo 57 points 5 days ago No, he was arrested by jamaican and pakistani bobbies on his way out. permalink parent award report block reply Govtizbad 12 points 5 days ago A blonde female and a female muzz came on his door edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply EgregiousPhilbin 0 points 5 days ago Updoot is gay permalink parent award report block reply view 1 more comments... trumpORbust 10 points 5 days ago They don't issue licenses the honest and truthful speech permalink parent award report block reply Govtizbad 4 points 5 days ago U got a license to like bacon? edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply goatnuts 47 points 5 days ago A lot of people don't understand, Britain's population was higher before world war 2 than until 2017, that population includes the Pakis and Bangladeshis and Jamaicans and everybody else. Just actual ethnic British people, their population to this day has never recovered. That's how badly the Germans bombed them. So imagine being this man. Youre a child and britain is beautiful. Youre a young man and half of it is destroyed, the place looks like iraq. You fight, you win, you think it's time for things to get better. And they do. But the things your country does to rebuild completely destroys it, turns it into something alien to you. He might not even have an issue with immigrants, but it's still unrecognizable to him. It's a police state where his people are second class citizens among foreigners. Anyone too stupid to get this has no business interviewing anyone. permalink parent award report block reply PROCIsAsshoe 32 points 5 days ago Beautifully put. It's really a powerful thing to contemplate. I deeply admire this man for being brave enough to take this chance to speak out. To hear a 100 year old man that fought in the war sit there and say \"we fought for nothing, we are less free today\". wow! Talk about pathos! If that doesn't shock you awake whatever could? permalink parent award report block reply Tongs_Ya_Bass 22 points 5 days ago UK population 1939 was 47 million, in 2017 66.6 million and now nearly 70 million. Around 85% are Brits from the census. That makes about 59 million, 12 million more than 1939. During WW2 there were only 70k civilian deaths and about 350k military deaths. Germany did not bomb the UK so bad that the population never recovered. Tonnes of kids were evacuated to the country or abroad to places like Belfast or NYC. An estimated 2 million left for the Commonwealth countries, South Africa, USA etc post WW2. Your claims and the numbers don't align. permalink parent award report block reply MakeArdernGoAway 9 points 5 days ago Yeh his numbers are total horseshit. The population increased significantly between 1939 and 1948. permalink parent award report block reply TPMJB 7 points 5 days ago Around 85% are Brits from the census. Lol how many of those \"Brits\" have parents that are both brown? permalink parent award report block reply Tongs_Ya_Bass 0 points 5 days ago None, there's a separate category for mixed race or other races the category I referenced is White British. permalink parent award report block reply view 1 more comments... VictorThomas451 4 points 5 days ago So perfectly said - thanks from England. permalink parent award report block reply BotFinder 2 points 5 days ago ?? He’s an idiot and his numbers are nonsense permalink parent award report block reply PensivePatriot 4 points 5 days ago Bro you need to read some actual fucking history. The French endured far, far worse losses in WW1 than any part of the British empire did during the second, let alone just during the blitz. permalink parent award report block reply BotFinder 1 points 5 days ago FYI to future readers: This post above is a carefully crafted lie permalink parent award report block reply goatnuts 0 points 5 days ago How so? permalink parent award report block reply NotYourMan 26 points 5 days ago The sad part is bravery in the Dunkirk evacuation that is now forgotten by this generation as the UK slowly slips into liberal fascism.  The grooming and rape of white girls from 12 to 14 without any consequences is a terrible thing.  It ends when we can't protect little girls from invaders.  Rape and Pillage is happening. permalink parent award report block reply Wanderlust 16 points 5 days ago What bravery? Hitler held back and let Britain evacuate as another attempt at peace. permalink parent award report block reply StayoutOfit 15 points 5 days ago Most have a very one sided and propagandized view of history.  Many are unfamiliar with Hitler's attempts to strike piece with the Brits and how the Brits continually rejected those efforts from the top down. permalink parent award report block reply Tongs_Ya_Bass 6 points 5 days ago Churchill withheld the peace offers from the public. Rudolph Hess flew to Scotland to try and meet his friend the Duke of Hamilton to try and get the offer across. permalink parent award report block reply view 1 more comments... AmericanJawa 0 points 5 days ago Most have a very one sided and propagandized view of history. And yet somehow that claim that propaganda is responsible only ever goes one way; there's somehow no possible way that the pro-Hitler people could possibly be influenced by propaganda... permalink parent award report block reply view 6 more comments... wlatic 0 points 5 days ago What piece of material was trying to be struck? permalink parent award report block reply Pappy_Gunn 3 points 5 days ago The German ground units were overextended and out of supply.  And had to recover from all the drug use.  The Luftwaffe bombed the crap out of the beaches.  They weren't holding back.  The Brits lost 68000 soldiers..  6 destroyers were sunk, 23 damaged.  89 transport ships lost.  177 aircraft destroyed.  Goering lost some prestige in not doing better. permalink parent award report block reply henri_derelicte 3 points 5 days ago I don’t fully buy that logic. Britain suing for peace would have been viewed as a massive betrayal by the French and Polish. On top of that, the Brits correctly concluded that Germany lacked the ability to invade Great Britain, so from their point of view, Hitler couldn’t win. permalink parent award report block reply Wanderlust 1 points 5 days ago Germany sued for peace. They even air dropped royalty to UK. UK imprisoned him and he was never able to contact his cousin. UK wanted blood. Churchill was pretty public about it. permalink parent award report block reply AmericanJawa 2 points 5 days ago Hitler held back and let Britain evacuate as another attempt at peace. A lie will forever be a lie no matter how many times you tell it. permalink parent award report block reply PROCIsAsshoe 2 points 5 days ago not true, whatsoever. their response was confusing and slow but it wasn't some sort of olive branch. if he wanted peace he would have trapped their army on the beaches and forced a surrender, not allow the entire British army to retreat and live to fight another day. The successful withdrawal of hundreds of thousands of British infantrymen from Dunkirk is literally the only reason that Britain managed to stay in the fight! permalink parent award report block reply Dangerous 1 points 5 days ago You literally just helped another poster lie about British population numbers. Shut the fuck up liar permalink parent award report block reply view 1 more comments... tt777 0 points 5 days ago Hitler was peacenik, dontcha know? 😂 permalink parent award report block reply view 1 more comments... Pappy_Gunn 2 points 5 days ago The Brits don't really like talking about being routed in several theater in WW2.  Places like Singapore, etc.   They especially like to crap on the French, even when they covered their \"redeployment\" to England at Dunkirk.  There were some very dark days for the Empire. permalink parent award report block reply NomadicKrow2 1 points 5 days ago There has to be one manly British guy left. I haven't seen him, but I'm sure he's out there somewhere. permalink parent award report block reply BidenShowerDrool 1 points 5 days ago Tommy Robinson for PM!...Now.  And Stamer hangs for his crimes along with every other living PM before him for allowing this to happen.  Tony Blair hangs because he outright lied about Iraq in 2003. permalink parent award report block reply Mellop 12 points 5 days ago Judeo-Bolshevism, and its consequences, have been a disaster for the civilized human races. permalink parent award report block reply StayoutOfit 8 points 5 days ago Judeo anything really. permalink parent award report block reply AmericanJawa 0 points 5 days ago Judeo-Bolshevism, and its consequences, have been a disaster for the civilized human races. Wow, it's not enough to label everything you don't like \"Bolshevism\" anymore, now you got to upgrade it to Judeo-Bolshevism . permalink parent award report block reply ConfusedAngryArmed 3 points 5 days ago We definitely fought the wrong enemy in WW2. permalink parent award report block reply AmericanJawa 3 points 5 days ago We definitely fought the wrong enemy in WW2. Between Nazis and the USSR, neither one were the good guys. permalink parent award report block reply BenDoverAssho 81 points 5 days ago Imagine a Europe that is 95% White, Christian, Conservative Western European. Had the Germans won WWII, that is what Europe would be today. permalink award report block reply CrossTheRubixCube 34 points 5 days ago It’s going to be hard for people to realize the “good guys” did not win WWII. permalink parent award report block reply Rebooted 17 points 5 days ago Was hard for me until I internalized that we're all just people trying to live the best we can and no one is perfect.  The NatSocs were not perfect saints, they were just people who fought against the same international forces we struggle against today.  Accepting this allowed me to accept their flaws and good traits all in context and see their good deeds for what they were. WW2 was a struggle to continue western civilization as it was, and that war was lost.  Have hope though, as long as our blood remains our people can rebuild and expand upon what our ancestors first achieved.  It isn't over until each one of us is dead. permalink parent award report block reply Mecoperator2525 10 points 5 days ago Americans are already being replaced by immigrants that can easily be exploited. If you question the plan its because you hate brown people apparently. permalink parent award report block reply StayoutOfit 8 points 5 days ago It isn't over until each one of us is dead. They are certainly trying to make this a reality every single day. permalink parent award report block reply StayoutOfit 10 points 5 days ago It was one of the biggest black pills needing swallowed when realizing this. permalink parent award report block reply TrumpAndGodWin 0 points 5 days ago The US and the UK practiced some forms of eugenics and IBM etc had deals with him which is why Hitler thought they wouldn't turn on him. England especially was jealous of Germany so as they've done historically they worked to destroy them. permalink parent award report block reply YT45 11 points 5 days ago There is nothing Christian or conservative about national socialism.  It’s a godless marxist leftist abomination whose only real differences from communism are purely cosmetic.  Europe would be whiter, but that’s all. permalink parent award report block reply jdemarco2014 13 points 5 days ago There’s nothing Christian or conservative about Jews and Muslims taking over our country and there country either permalink parent award report block reply LizardKingx002 2 points 5 days ago Christianity literally came from the same place where those two groups come from permalink parent award report block reply jdemarco2014 10 points 5 days ago Christianity is better then the other 2 permalink parent award report block reply YT45 -2 points 5 days ago Your argument is that you’d rather be buttfucked by Prison Rapist A so that you don’t get buttfucked by Prison Rapist B.  I prefer to not get buttfucked at all. permalink parent award report block reply BenDoverAssho 6 points 5 days ago Now Europe is going to get both Communism and Islamization which is really weird. I predict that the Muslims will wipe out the Communists first. permalink parent award report block reply red_holiday2 6 points 5 days ago Gott mit uns permalink parent award report block reply someguy7738 5 points 5 days ago Europe would be whiter, but that’s all. You say that as if that wouldn't be a huge win in and of itself. Everything else is down stream of race, even religion. permalink parent award report block reply Pappy_Gunn 4 points 5 days ago Yup, they slaughtered plenty of white christians when they turned against the USSR.  The Ukraininans welcomed them, and they genocided the lot becasue they were slavs, sub-humans. permalink parent award report block reply load 1 more comments... jdemarco2014 9 points 5 days ago Imagine what the USA would look like with out these pesky Jews running around controlling our politicians permalink parent award report block reply WreckEm 7 points 5 days ago No, that is a fantasy.  They would have eventually cucked out like they are right now.  They believe all propaganda from the state.  As the state shifts so do the Germans permalink parent award report block reply Viewer01 29 points 5 days ago But without the Jews and Israel there is no subversive element in universities. permalink parent award report block reply anotherthing 1 points 4 days ago You mean without the Soviet Union there would be no subversive element in the universities. The Soviet Union had subversive plants in Hollywood long before they moved on to universities, and before Israel even existed. permalink parent award report block reply YT45 -11 points 5 days ago You actually believe that?  Jesus wept. permalink parent award report block reply Viewer01 10 points 5 days ago You mean Jesus whipped the Pharisees? permalink parent award report block reply Dangerous 4 points 5 days ago IMO Germany would have slid into degenerate communism the moment Hitler died. He was the only thing holding it all together by design and there didn't seem to be much of a plan set up by the late 40's for his exit permalink parent award report block reply Pappy_Gunn 4 points 5 days ago The Socialist Nazis were plenty degenerate. permalink parent award report block reply Burneraccountno4 4 points 5 days ago They are cucked after 80 years of USA funded propaganda and bullying. permalink parent award report block reply Navypilot100 3 points 5 days ago It would be a utopia world if only Germany had won permalink parent award report block reply StayoutOfit 0 points 5 days ago Interplanetary species by now. permalink parent award report block reply load 34 more comments... Lol_Garrus 58 points 5 days ago WW2 Veteran, \"My friends & I fought and died for this? This country is worse!\" Reporter, \"I'm sorry you feel that way.\" (Even though I voted to make it this way) \"Don't talk about the state of the country, here are some pretty women.\" Edit: They are not pretty women but the guy probably has bad eye-sight. permalink award report block reply RStroud 17 points 5 days ago 10/10 in bongland. But seriously, being attractive is not their main thing. They're not models but a singing group who do 1940s nostalgia music, swing, standards, and easy listening type stuff.  Andrew's Sisters LARP group. permalink parent award report block reply goatnuts 5 points 5 days ago At least they're not speaking German. permalink parent award report block reply SicilianOmega 14 points 5 days ago German is easier to learn than Arabic. permalink parent award report block reply charwoman 3 points 5 days ago 100 yo Vet replies to reporter who says here are some pretty women...\nBollocks! Those are Blokes! permalink parent award report block reply henri_derelicte 43 points 5 days ago Britain willingly decolonized (except in the United States of course). Never did they agree to being colonized themselves by the very savages they tried to civilize. Camp of the Saints should be required reading in high school. permalink award report block reply SilverStarv5 13 points 5 days ago That book is pretty damn close to what’s happening in Western Europe right now. Did that guy have a crystal ball or what? permalink parent award report block reply DontTreadOnSnek 11 points 5 days ago Camp of the Saints should be required reading in high school. Which is why it has been quasi banned. Physical editions are going for hundreds, if not thousands and digital editions are prone to being altered. Because of French copyright laws (life of author + 70 years) the book won't enter public domain until 2090. permalink parent award report block reply henri_derelicte 11 points 5 days ago I’m bringing it up because I’m well aware of how the book was effectively banned for years since they wouldn’t print it. However, in a fairly recent development, someone secured the rights to it and is printing it again in English. It’s available on Amazon for about $25. permalink parent award report block reply Dangerous 2 points 5 days ago They didn't willingly decolonize, socialist faggot politicians and American Jews forced them to against the wishes of British citizens and even most colonial subjects And now all those former colonies are shitholes, which is why the majority of the colonial subjects wanted the Empire to remain permalink parent award report block reply TheAttackTitan 1 points 5 days ago What is  it about? permalink parent award report block reply henri_derelicte 5 points 5 days ago Mass immigration from third world/shithole countries to Europe. It’s surprisingly accurate to how things have played out today. permalink parent award report block reply TrumpAndGodWin 1 points 5 days ago The Kalergi plan and the UN plan. permalink parent award report block reply YodaBannon 28 points 5 days ago Cheerio permalink award report block reply MAGAGIRL69 15 points 5 days ago Pip pip permalink parent award report block reply Samuel_L_Bronkowitz 11 points 5 days ago Good on ya lad. permalink parent award report block reply MemeWarsVet 4 points 5 days ago Cuppa? permalink parent award report block reply trumpORbust 4 points 5 days ago #wank me permalink parent award report block reply BlippiIsAPedo 25 points 5 days ago You fought the wrong people permalink award report block reply Mellop 11 points 5 days ago Fighting on the side of Judeo-Bolshevism should've been a big clue that you're going down the wrong path... permalink parent award report block reply Rakkasan91b 1 points 5 days ago No, fighting with them against the Nazis was fine.  The problem is we didn't then go on and defeat the commies when we finished off Hitler and Japan when we had the chance and upper hand with the atomic bomb and they had bled each other dry. permalink parent award report block reply BidensPrisonWallet 24 points 5 days ago I believe most GWOT Vets feel the same. permalink award report block reply Breacherbear 31 points 5 days ago Speaking for myself, we spent 20 years and billions for Afghanistan to go from Taliban control to better equipped Taliban control. We did our job and the weak people back here screwed it up. permalink parent award report block reply IlhansBrother 19 points 5 days ago we spent 20 years and billions for Afghanistan to go from Taliban control to better equipped Taliban control. And millions of Afghan gimmigrants are now in the West permalink parent award report block reply Mamapedia 16 points 5 days ago A few towns and cities that I drive through occasionally have banners with the pictures and names of their citizens who have fought and died for American interests over the decades hanging from light poles along the roads. Mostly fresh faced young men.  I wonder what they really suffered for. When the ruling class is shielded from the physical battlefield, bad things happen. permalink parent award report block reply Cyer6 12 points 5 days ago The WWI WWII, Korean, Vietnam and Gulf War vets... All the same. What was really accomplished? I was in during Desert Storm and finished my 8 years before 9/11 hit. I'm proud to have served my country. Today, our kids celebrated veterans and Veteran's Day at their school inviting all veteran family members. This was in Texas and that American pride was all over that school. But again I still don't know what was really accomplished.  A lot of good boys are gone and now being replaced with 3rd world dregs who are adored by white liberal women. permalink parent award report block reply Rebooted 7 points 5 days ago Yes, but now they have a central bank linked to the international system.  So, the goal was achieved. permalink parent award report block reply Pappy_Gunn 4 points 5 days ago Afghanistan was terrible.  Most NATO moochers went for non-combat roles (with exceptions being the US, UK, Canada and a few other) and \"reconstruction\" which was a big, fat through for NGOs and money laundering.  NATO helped write the constitution for the Afghan Republic (before the Taliban took over again).  Article 1 stated that Afghanistan is an Islamic Republic, article 2 was that Sharia was the law.  We fought and died to establish an Islamic Republic.  The last church in Afghanistan was burned under NATO's nose, Christians killed and taken as slaves. permalink parent award report block reply Breacherbear 2 points 5 days ago We had a male LT that was running on base at night in Kandahar. Some of our NATO \"allies\" grabbed and rapped him. We were ordered not to walk alone at night after that. permalink parent award report block reply Pappy_Gunn 3 points 5 days ago The media avoided at all cost to mention the institutional pedophilia (and some bestiality) that is part of the Afghan culture.  They alway showed the women as victims (and I can't argue with that), but never a peep about the boys. permalink parent award report block reply view 1 more comments... SaxonRealm 2 points 5 days ago We should have killed everything that moved and annexed Afghanistan. permalink parent award report block reply Pappy_Gunn 3 points 5 days ago We should have bombed Pakistan that was playing both sides. permalink parent award report block reply anotherrandomname 1 points 5 days ago But Pakistan is our \"ally\" somehow or something. permalink parent award report block reply BenDoverAssho 4 points 5 days ago Imagine what current vets must be feeling about a Communist/Islamist getting elected as mayor of NYC , especially since we still honor the dead from the 9/11 terrorist attack. permalink parent award report block reply newdaynewname9 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply BenDoverAssho 1 points 5 days ago Why have you deleted all your previous posts? Hiding something? permalink parent award report block reply joggin_noggin 2 points 5 days ago Hand icon next to the username line means newfag. permalink parent award report block reply newdaynewname9 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply HKFan 0 points 5 days ago we were on the wrong side in WWII.  We were on teh right side in GWOT but used the wrong tactics. permalink parent award report block reply SicilianOmega 5 points 5 days ago We fought the wrong enemy in both wars. permalink parent award report block reply Rebooted 3 points 5 days ago GWOT was primarily about resources and installing central banks controlled by the international banks.  Look at the countries we went into and compare that to which countries didn't have international bank allegiances. permalink parent award report block reply Oldman1234 21 points 5 days ago He'll be summarily arrested and, due to his advanced age, will only be given a few years in prison for speaking out against the UK Government. permalink award report block reply Breacherbear 12 points 5 days ago They will let out some pedos to make space permalink parent award report block reply JohnMiller2020 18 points 5 days ago He's right. permalink award report block reply Cyber1776 17 points 5 days ago He fought to stop an invasion of Germans, then the Labour party turned around and opened the doors to infinity third worlders.\nIn July 1945, Churchill lost his seat as Prime Minister to Clement Attlee of the Labour Party. Clement immediately made the call for subjects in British colonies in the Caribbean, Africa, and the Middle East to come into England in order to rebuild and repopulate the country, specifically London. From this move on, a never ending supply of third worlders continued to flood in and are now taking over the country. permalink award report block reply PROCIsAsshoe 12 points 5 days ago The fact that Churchill lost his role as PM in July, just a few months after the War ends, is so unbelievable fucking rotten. It'd be like kicking George Washington out of office in Christmas 1781, \"hey thanks for winning a literal life-and-death struggle for our Nation, now get out of here!\" Fucking communists inside the UK. Kicked him out of office and also delivered our atomic secrets to the Soviets all within two years of the war ending. With allies like that, who needs enemies? permalink parent award report block reply Pappy_Gunn 5 points 5 days ago The Brits gave the Soviets modern jet engines to \"equalize\" the cold war.  The Soviets reverse-engineered it (I thinkk it was the Nene), did a few improvements and it propelled the MiG 15 which was the scourge of the air war in Korea, downing many B-29s and asorted allied aircraft. permalink parent award report block reply covok48 2 points 5 days ago Bong politics are another level of fuckery that Americans cannot comprehend. What worse is that historically infinitely better than whatever was on the continent. permalink parent award report block reply LaptopDied 3 points 5 days ago Now that's interesting. permalink parent award report block reply Dangerous 2 points 5 days ago He fought because The Focus told him to to pay off his debts. He rallied for war for years and refused peace negotiations throughout. The Germans were never a legitimate threat to the UK before Churchill, and would never have been if not for him permalink parent award report block reply Cyber1776 2 points 5 days ago Retarded neo-nazi slop. The PM is not the dictator of the UK and cant make unilateral decisions to start wars. Either way, it was PM Neville Chamberlain who declared war on Germany, not Churchill. permalink parent award report block reply PoorMansPsychiatrist 14 points 5 days ago Based. Heartbreaking. permalink award report block reply sumnayin2 13 points 5 days ago WW2 was fought for the bankers and juice. We were the bad guys permalink award report block reply Roadpower 8 points 5 days ago You mean the \"leadership\" at the time. The American people were very much opposed to the war but we got dragged into it via an attack that the FDR administration knew full well that was coming. My big question is if the Imperial Japanese got hoodwinked into doing the attack or not. permalink parent award report block reply Pappy_Gunn 4 points 5 days ago The Japs were expanding their empire in the far east and the US embargo threatened their economy.  In order to secure resources the USN had to be neutralized.  They figured the US was soft and would not fight.  They didn't get hoodwinked, they had plans to act against the USN for a long time. permalink parent award report block reply Roadpower 1 points 5 days ago Thank you, you have a recommended book or author on this? permalink parent award report block reply Pappy_Gunn 2 points 5 days ago Not really it's just part of the general background prior to WW2.  I'd just research \"US embargo against Japan\", Roosevelt froze assets and did the oil embargo in July-August 1941. permalink parent award report block reply Dangerous 3 points 5 days ago My big question is if the Imperial Japanese got hoodwinked into doing the attack or not. Explicitly so, Japanese leadership were forced into the attack by a needless US campaign of sanctions and embargos that threatened to completely cripple the nation https://search.brave.com/search?q=USA+blocks+Imperial+Japan+supply+lines+pre+Pearl+Harbor&source=android&summary=1&conversation=e53268d0b3dd05a156b857 permalink parent award report block reply Roadpower 0 points 5 days ago Yeah those I knew about but I have wondered if there was anything more insidious. permalink parent award report block reply KekistanPM 11 points 5 days ago Britain ITV probably: \"We apologize for the technical issues with our broadcast. Here is a rebroadcast of the interview in full: \"No, I’m notsorry, the sacrifice wasworth the result that it is now...what we fought for was our freedom. We find that even now, it’s a..sight.\" permalink award report block reply HKFan 10 points 5 days ago BASED Austrian painter was right about just about everything permalink award report block reply lothrop_evola 11 points 5 days ago Everyone should watch his speeches. He never cucked, never backed down, always told his people the truth. And the crowds loved him for it. permalink parent award report block reply AmericanJawa 1 points 5 days ago BASED Austrian painter was right about just about everything You mean the same one who first tried to overthrow the German government by force then orchestrated political mechanations to have himself installed as unquestioned dictator? permalink parent award report block reply HKFan 1 points 5 days ago You mean the degenerate, corrupt, and ineffective Weimar government? permalink parent award report block reply AmericanJawa 1 points 3 days ago You mean the degenerate, corrupt, and ineffective Weimar government? Replacing one bad government with another bad government does not make someone a good person. permalink parent award report block reply triforce28 9 points 5 days ago We lost world war 2. And I feel awful for my grandparents having fought in it permalink award report block reply Bullet3250 9 points 5 days ago The Communists WON - don't forget. permalink award report block reply Scatter-Shot 7 points 5 days ago Good for this veteran for calling out modern day Britain. permalink award report block reply LostElf 7 points 5 days ago God bless him, still a warrior. permalink award report block reply SomecatsareMAGA 7 points 5 days ago God Bless you Sir. permalink award report block reply HazelHen 6 points 5 days ago 100% true for US WW2 vets, also. permalink award report block reply SuperHonkey 6 points 5 days ago Oye!! Arrest him for islamophobia!! permalink award report block reply FuhQ 5 points 5 days ago Less free and conquered by foreigners from other civilizations.  At least Germans were related. permalink award report block reply Grindelwald 5 points 5 days ago We fought a civil war for nothing too.   Should have just invented the combine earlier. Must have been a democrat politician stopping inventions. permalink award report block reply anotherrandomname 2 points 5 days ago Definitely don't look into the role \"European\" finance played in fomenting that conflict. permalink parent award report block reply LiveFreeInXorDie 5 points 5 days ago Tens of millions of gallons of human blood spilled, even more millions of dreams shattered forever--all ultimately in vain, and for the whims of a few evil men. What a nightmare, this mortal realm. permalink award report block reply anotherrandomname 2 points 5 days ago In vain? WWII was a wild success, for the powers that be. They essentially decimated the European population, opening the door for \"replacement migration\" not to mention the enormous quantities of debt it created (aka profit, for the bankers). permalink parent award report block reply canada_is_communist 1 points 5 days ago Well in vain no. WW2 brought us turing and eventually computers… and games… permalink parent award report block reply CrankyCrab 5 points 5 days ago Based AF!  Men of this era would not have allowed these third-world invaders into their countries.  And no way in hell would these lowlifes would get anything for free. This Vet is 100 years old.  He bravely fought for his country in a bloody war and survived.  He earned the right to drop truth bombs. permalink award report block reply RusherOfDin 4 points 5 days ago I can imagine there's a fight going on right now at the various legal institutions in the UK trying to decide if the PR nightmare of arresting this guy would be worth it to send a message to the rest of the rabble. permalink award report block reply canada_is_communist 2 points 5 days ago The other issue is that at his age the arrest might kill him lol permalink parent award report block reply PissJuggernaut 4 points 5 days ago \"We got you a music CD, cant you be grateful?!\" permalink award report block reply Billbuttlickerr 4 points 5 days ago Based. permalink award report block reply CaliAli 4 points 5 days ago I bet Antifa will attack this real anti-fascist, because Antifa is fascist. permalink award report block reply Rimbus_Reynolds 2 points 5 days ago Was gonna say thw same thing. Wouldn't be surprised if a band of punk haired lunatics burned his house down or something permalink parent award report block reply Megaboom2025 4 points 5 days ago Fought the wrong enemy permalink award report block reply BaronFalcon 4 points 5 days ago We fought the wrong people. George Patton permalink award report block reply auntjemima 4 points 5 days ago Poor guy, I feel his pain. permalink award report block reply based_trekkie 4 points 5 days ago Somehow I think that if Hitler had won, the UK would have fared better by now. They may have had to learn German but they would still be \"European\". permalink award report block reply Rimbus_Reynolds 4 points 5 days ago I feel so bad for this guy for having to witness his country become a ahit hole. I also feel bad for him because that patronizing cunt and the shit skin wouldn't even let him finish his point. What a disgusting lack of respect permalink award report block reply RememberCharlieKirk 4 points 5 days ago During the same television program, the 100-year-old veteran was \"presented with a compact-disc of Second World War-era popular music in thanks.\" Well, the WWII veteran did receive a compact disc for his troubles! I would say that the sacrifice was worth it. Screw freedom; give me a copy of easily pirated, widely available music! permalink award report block reply Beardholder 4 points 5 days ago The more I look back the more I realize that the United States almost spoke German as the main language. Now I see I'd rather be speaking German than have allowed all these Muslims and pagans into my country permalink award report block reply Bramage 4 points 5 days ago Om my...criticizing the authoritarian UK govt...toss him in the clink. permalink award report block reply nzsvz9 4 points 5 days ago Soon to go to high security prison for Islamophobia. permalink award report block reply Quiznos585 3 points 5 days ago Did they arrest him for hate speech after? permalink award report block reply JoeDapper 3 points 5 days ago We got Americans saying this already. 20 years in the Stan to replace the Taliban with the Taliban. It was all for nothing. permalink award report block reply American-Patriot 3 points 5 days ago Should have fought hard at home and raised his kids right, instead of giving up and lounging around like so many did after the war. Unfortunately, to preserve a country one must ALWAYS be vigilant permalink award report block reply Rock9Head 3 points 5 days ago Peace in our time. permalink award report block reply covok48 3 points 5 days ago He probably wanted to say some other things too… permalink award report block reply ParadigmShift2070 3 points 5 days ago https://youtu.be/AcSE9MdUKVc permalink award report block reply Forty_Five 3 points 5 days ago WWII era men wouldn't put up with this bullshit. permalink award report block reply Dangerous 3 points 5 days ago WWII era men were lied to so they would fight to create this bullshit permalink parent award report block reply Pappy_Gunn 3 points 5 days ago You don't have to be a hundred year old or British to feel the same. permalink award report block reply bobbacringo 3 points 5 days ago The bad guys won WW2. The sooner you understand that, the sooner we can get to work fixing this shit hole. permalink award report block reply clickinheelz 3 points 5 days ago He should be sad if the people in the land he fought for are not willing to show any kind of allegiance or patriotism to the values that they fought to protect. I had a chat with a nanny (she's in her late 50's) at our school pickup today about the fireworks show she went to for bonfire night and learned that patriotism isn't a thing for some people in England. She basically said that she feels that any patriotic behavior is actually far right behavior and should be avoided at all costs lest you are labeled to be a fascist (flying flags, being proud of your country achievements, playing the national anthem, etc...). Very sad. permalink award report block reply Dangerous 1 points 5 days ago WWII was explicitly a global war against the very concept of Nationalism in favor of internationalist globalism. The Japanese, Germans, and Italians were nationalist/nationalist socialist and the USA, UK, French, and Soviets were openly Communist/Globalist. The UN was created in the aftermath explicitly as a Globalist function. of course this would lead to decreased patriotism and such ideas being labeled \"far right wing\" that was the entire point of the war permalink parent award report block reply McLemore800 2 points 5 days ago Absolutely hilarious. You didn’t fight for anything, you blindly went to war for Jewish degeneracy with a smile on your face and your friends all died for Jewish degeneracy permalink award report block reply shogun5000 2 points 5 days ago Basically we fought the wrong side permalink award report block reply fr33d0mTruck 2 points 5 days ago that generation got fucked in their prime and at the end of their lives permalink award report block reply MinneMAGA 2 points 5 days ago And not only will he be arrested for hate speech but they’ll get his children as well since he may not be around much longer permalink award report block reply bluedevilga 2 points 5 days ago The reality is that Hitler love Muslims because Islam means to submit. He wanted to replace Christianity with Islam when the war was over.  I’m not sure if he would’ve been importing more people from the Middle East or just killing them, but the difference is probably that England would still be covered with goat fuckers and celebrating 5 AM call to prayer, but everyone would also be wearing swastika. Remember, Islam and the left go great together, just like New York is about to discover permalink award report block reply canada_is_communist 3 points 5 days ago Hitler didnt want islam in germany. He had no beef with island (nor japs) but he didnt exactly want that for germany neither. Culture was very important to him as well permalink parent award report block reply Krat 2 points 5 days ago All I hear is racism !!! Rrrrreeeeeeeeeee permalink award report block reply PearlyGaits57 2 points 5 days ago Now that is socialism. In it's way to total communism. permalink award report block reply quiznossucks 2 points 5 days ago Arrest him.....for bad speak permalink award report block reply TennesseeScorpio 2 points 5 days ago Here’s the meat n taters of this hero’s statement… https://www.tiktok.com/t/ZP8DHkvcA/ permalink award report block reply DoMagnum 2 points 5 days ago He is not wrong. The globalists/commies/feminists have made denigrating his entire generation's sacrifice their life's work. Never have so many owed so much to so few. permalink award report block reply MiserySnake 2 points 5 days ago And they’re probably screaming that he’s a racist! permalink award report block reply ravonaf 2 points 5 days ago Britain has never been free. permalink award report block reply vsekvsek 2 points 5 days ago And just think. Ww3 will be us defending nazis in Ukraine permalink award report block reply ElectionMeddler 2 points 5 days ago He'll be arrested for hate speech and wrong think shortly permalink award report block reply QueensOwn 2 points 5 days ago The old guy knows. permalink award report block reply Greenhills 2 points 5 days ago It held the wall for 60 years. permalink award report block reply RealTXPatriot 2 points 5 days ago Hes right. permalink award report block reply LibtardBusterMAGA 2 points 5 days ago So sad permalink award report block reply mailinvoter 2 points 5 days ago Oi! That's an arrest for hate speech!!! permalink award report block reply Hawksendoom 2 points 5 days ago Is he under arrest yet or nah? i mean it's the U.K. permalink award report block reply Landslide_2020 OP 2 points 5 days ago That thought came to my mind as well. permalink parent award report block reply 67Vert 2 points 5 days ago UK police will be knocking on his door permalink award report block reply Creepy_Joe 1 points 5 days ago How many years will he get in prison for saying that? permalink award report block reply Steve1 1 points 5 days ago Yeah well he’s Right - Call a spade a spade permalink award report block reply keeman 1 points 5 days ago Britain fought WW2 for the benefit of its empire.  It didn't work out so well for them, but that was their reason for picking a fight with Germany. permalink award report block reply Stanwyk74 1 points 5 days ago London fell before NYC permalink award report block reply Redpilled2Depression 1 points 5 days ago “My spirit will rise from the grave, and the world will know that I was right!” permalink award report block reply Stanwyk74 1 points 5 days ago You fought it for a purpose that wasn’t the actual purpose permalink award report block reply roadrunner0 1 points 5 days ago Greater Brittan has become what we were protecting it from for 85 years and it is disgusting.. The people are being stripped of their freedoms more and more every day and we should get out of Europe before it is too late or commit to a decade long battle with no guarantee we wont get stabbed in the back.. permalink award report block reply Papabravo12 1 points 5 days ago I mean yeah, obviously permalink award report block reply chicagoindustrial 1 points 5 days ago German was the language of peace. permalink award report block reply RadicalCovfefe 1 points 5 days ago Yeah, we know its a hellscape now. permalink award report block reply throttlejohnson 1 points 5 days ago time to pick up his rifle and get busy....or no? permalink award report block reply Meddlesom 1 points 5 days ago Meanwhile, modern day faggots are saying that this man (and all WWII veterans) are Antifa. permalink award report block reply MakinBacon 1 points 3 days ago true....and now it's also a caliphate....congrats uk permalink award report block reply RockFlagAndEagle2020 -1 points 5 days ago Look in the mirror my man. You're kids are the reason why this crap is happening. These people wanted to protect and shelter their children from reality resulting in them turning into a bunch of race/sex obsessed communists. permalink award report block reply ImYourHuckleberry24 1 points 5 days ago You know this guy's children, do ya? permalink parent award report block reply RockFlagAndEagle2020 1 points 5 days ago He might not be but his generation that raised the boomers is responsible for this woke crap. They have been in power since the 80s. permalink parent award report block reply FatigueIsReal -3 points 5 days ago Can't wait to see the mischaracterization of what he said to mean that Hitler was right and England was on the wrong side. Completely missing his point. permalink award report block reply Dangerous 2 points 5 days ago It's funny that you have the username you do when the single biggest fatigue on Earth right now from every nation is towards jews... permalink parent award report block reply FatigueIsReal 1 points 5 days ago I'm apathetic towards Jews.  Couldn't give a fuck one way or another about how they are doing. Not a single thing they do affects me so why would I care? permalink parent award report block reply UsernameChexOut -8 points 5 days ago What does WW2 have to do with the fact that British are cucked faggots who let their country be destroyed since then? permalink award report block reply Flying_Pede_121 16 points 5 days ago Because millions of young patriotic British men were fed to the slaughter by international banking jews to destroy Europe. Left behind were the weak and the easily led astray who took over with the strong men gone permalink parent award report block reply 1st_Covfefe 2 points 5 days ago You mean like the gays? permalink parent award report block reply UsernameChexOut 0 points 5 days ago Look, I can cosign with the sentiment of what you're saying but if you take out the colonies, 264k British military men died during WW2. Assuming 40 million population at the time, that's 0.6% of the population or if you assume 1:1 male to female ratio, 1.2% of men. Tragic and I agree, these were probably the best men out there. But statistically, it's not the most significant amount/percentage. permalink parent award report block reply Flying_Pede_121 3 points 5 days ago It’s an enormous loss. That figure doesn’t include those permanently and irreparably damaged from combat as well. If you knock out the best 1-2% of a population, you absolutely cripple it permalink parent award report block reply Konsaki 9 points 5 days ago The vet was saying that all the sacrifices the UK made to win WW2 were for naught. Might as well have let Germany win. permalink parent award report block reply RememberCharlieKirk 4 points 5 days ago Or, perhaps, the UK (Winston Churchill) could have never declared war on Germany, or the UK could have accepted one of the many peace deals (olive branches) proposed by the Germans. permalink parent award report block reply LawyersPlayDota -1 points 5 days ago He's saying they fought for freedom and future generations squandered it, not that he should have let the country be oveerrun by genocidal pagans, you impossibly retarded faggot. permalink parent award report block reply RememberCharlieKirk 1 points 5 days ago My comment was an addendum to the response by user Konsaki, who argued that a German victory over the UK would have been a better outcome for WWII. I suggested peace or non-engagement as other (better) outcomes. My comment was not an address to the veteran's on-air comment of reflection. I took user Konsaki's comment as being of two parts: (1) A summary of what the veteran said: \"The vet was saying... for naught.\" And this was followed by (2) user Konsaki's own opinion on what the veteran said: \"Might as well... German win.\" permalink parent award report block reply view 9 more comments... KernalMustard 0 points 5 days ago Well it got them WW2 in the first place. Hitler is harmless, we can work with him etc. permalink parent award report block reply HoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply corporateshizer 1 points 5 days ago Comment removed by community filter, pending further review. permalink award report block reply\nragnarokrobo 189 points 5 days ago While being interviewed by a harpy and a streetshitter. He's right. permalink award report block reply RINO_fatigue 80 points 5 days ago He might be correct, but did he have a loicense to say all that? permalink parent award report block reply ragnarokrobo 57 points 5 days ago No, he was arrested by jamaican and pakistani bobbies on his way out. permalink parent award report block reply Govtizbad 12 points 5 days ago A blonde female and a female muzz came on his door edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply EgregiousPhilbin 0 points 5 days ago Updoot is gay permalink parent award report block reply view 1 more comments... trumpORbust 10 points 5 days ago They don't issue licenses the honest and truthful speech permalink parent award report block reply Govtizbad 4 points 5 days ago U got a license to like bacon? edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply goatnuts 47 points 5 days ago A lot of people don't understand, Britain's population was higher before world war 2 than until 2017, that population includes the Pakis and Bangladeshis and Jamaicans and everybody else. Just actual ethnic British people, their population to this day has never recovered. That's how badly the Germans bombed them. So imagine being this man. Youre a child and britain is beautiful. Youre a young man and half of it is destroyed, the place looks like iraq. You fight, you win, you think it's time for things to get better. And they do. But the things your country does to rebuild completely destroys it, turns it into something alien to you. He might not even have an issue with immigrants, but it's still unrecognizable to him. It's a police state where his people are second class citizens among foreigners. Anyone too stupid to get this has no business interviewing anyone. permalink parent award report block reply PROCIsAsshoe 32 points 5 days ago Beautifully put. It's really a powerful thing to contemplate. I deeply admire this man for being brave enough to take this chance to speak out. To hear a 100 year old man that fought in the war sit there and say \"we fought for nothing, we are less free today\". wow! Talk about pathos! If that doesn't shock you awake whatever could? permalink parent award report block reply Tongs_Ya_Bass 22 points 5 days ago UK population 1939 was 47 million, in 2017 66.6 million and now nearly 70 million. Around 85% are Brits from the census. That makes about 59 million, 12 million more than 1939. During WW2 there were only 70k civilian deaths and about 350k military deaths. Germany did not bomb the UK so bad that the population never recovered. Tonnes of kids were evacuated to the country or abroad to places like Belfast or NYC. An estimated 2 million left for the Commonwealth countries, South Africa, USA etc post WW2. Your claims and the numbers don't align. permalink parent award report block reply MakeArdernGoAway 9 points 5 days ago Yeh his numbers are total horseshit. The population increased significantly between 1939 and 1948. permalink parent award report block reply TPMJB 7 points 5 days ago Around 85% are Brits from the census. Lol how many of those \"Brits\" have parents that are both brown? permalink parent award report block reply Tongs_Ya_Bass 0 points 5 days ago None, there's a separate category for mixed race or other races the category I referenced is White British. permalink parent award report block reply view 1 more comments... VictorThomas451 4 points 5 days ago So perfectly said - thanks from England. permalink parent award report block reply BotFinder 2 points 5 days ago ?? He’s an idiot and his numbers are nonsense permalink parent award report block reply PensivePatriot 4 points 5 days ago Bro you need to read some actual fucking history. The French endured far, far worse losses in WW1 than any part of the British empire did during the second, let alone just during the blitz. permalink parent award report block reply BotFinder 1 points 5 days ago FYI to future readers: This post above is a carefully crafted lie permalink parent award report block reply goatnuts 0 points 5 days ago How so? permalink parent award report block reply NotYourMan 26 points 5 days ago The sad part is bravery in the Dunkirk evacuation that is now forgotten by this generation as the UK slowly slips into liberal fascism.  The grooming and rape of white girls from 12 to 14 without any consequences is a terrible thing.  It ends when we can't protect little girls from invaders.  Rape and Pillage is happening. permalink parent award report block reply Wanderlust 16 points 5 days ago What bravery? Hitler held back and let Britain evacuate as another attempt at peace. permalink parent award report block reply StayoutOfit 15 points 5 days ago Most have a very one sided and propagandized view of history.  Many are unfamiliar with Hitler's attempts to strike piece with the Brits and how the Brits continually rejected those efforts from the top down. permalink parent award report block reply Tongs_Ya_Bass 6 points 5 days ago Churchill withheld the peace offers from the public. Rudolph Hess flew to Scotland to try and meet his friend the Duke of Hamilton to try and get the offer across. permalink parent award report block reply view 1 more comments... AmericanJawa 0 points 5 days ago Most have a very one sided and propagandized view of history. And yet somehow that claim that propaganda is responsible only ever goes one way; there's somehow no possible way that the pro-Hitler people could possibly be influenced by propaganda... permalink parent award report block reply view 6 more comments... wlatic 0 points 5 days ago What piece of material was trying to be struck? permalink parent award report block reply Pappy_Gunn 3 points 5 days ago The German ground units were overextended and out of supply.  And had to recover from all the drug use.  The Luftwaffe bombed the crap out of the beaches.  They weren't holding back.  The Brits lost 68000 soldiers..  6 destroyers were sunk, 23 damaged.  89 transport ships lost.  177 aircraft destroyed.  Goering lost some prestige in not doing better. permalink parent award report block reply henri_derelicte 3 points 5 days ago I don’t fully buy that logic. Britain suing for peace would have been viewed as a massive betrayal by the French and Polish. On top of that, the Brits correctly concluded that Germany lacked the ability to invade Great Britain, so from their point of view, Hitler couldn’t win. permalink parent award report block reply Wanderlust 1 points 5 days ago Germany sued for peace. They even air dropped royalty to UK. UK imprisoned him and he was never able to contact his cousin. UK wanted blood. Churchill was pretty public about it. permalink parent award report block reply AmericanJawa 2 points 5 days ago Hitler held back and let Britain evacuate as another attempt at peace. A lie will forever be a lie no matter how many times you tell it. permalink parent award report block reply PROCIsAsshoe 2 points 5 days ago not true, whatsoever. their response was confusing and slow but it wasn't some sort of olive branch. if he wanted peace he would have trapped their army on the beaches and forced a surrender, not allow the entire British army to retreat and live to fight another day. The successful withdrawal of hundreds of thousands of British infantrymen from Dunkirk is literally the only reason that Britain managed to stay in the fight! permalink parent award report block reply Dangerous 1 points 5 days ago You literally just helped another poster lie about British population numbers. Shut the fuck up liar permalink parent award report block reply view 1 more comments... tt777 0 points 5 days ago Hitler was peacenik, dontcha know? 😂 permalink parent award report block reply view 1 more comments... Pappy_Gunn 2 points 5 days ago The Brits don't really like talking about being routed in several theater in WW2.  Places like Singapore, etc.   They especially like to crap on the French, even when they covered their \"redeployment\" to England at Dunkirk.  There were some very dark days for the Empire. permalink parent award report block reply NomadicKrow2 1 points 5 days ago There has to be one manly British guy left. I haven't seen him, but I'm sure he's out there somewhere. permalink parent award report block reply BidenShowerDrool 1 points 5 days ago Tommy Robinson for PM!...Now.  And Stamer hangs for his crimes along with every other living PM before him for allowing this to happen.  Tony Blair hangs because he outright lied about Iraq in 2003. permalink parent award report block reply Mellop 12 points 5 days ago Judeo-Bolshevism, and its consequences, have been a disaster for the civilized human races. permalink parent award report block reply StayoutOfit 8 points 5 days ago Judeo anything really. permalink parent award report block reply AmericanJawa 0 points 5 days ago Judeo-Bolshevism, and its consequences, have been a disaster for the civilized human races. Wow, it's not enough to label everything you don't like \"Bolshevism\" anymore, now you got to upgrade it to Judeo-Bolshevism . permalink parent award report block reply ConfusedAngryArmed 3 points 5 days ago We definitely fought the wrong enemy in WW2. permalink parent award report block reply AmericanJawa 3 points 5 days ago We definitely fought the wrong enemy in WW2. Between Nazis and the USSR, neither one were the good guys. permalink parent award report block reply\nRINO_fatigue 80 points 5 days ago He might be correct, but did he have a loicense to say all that? permalink parent award report block reply ragnarokrobo 57 points 5 days ago No, he was arrested by jamaican and pakistani bobbies on his way out. permalink parent award report block reply Govtizbad 12 points 5 days ago A blonde female and a female muzz came on his door edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply EgregiousPhilbin 0 points 5 days ago Updoot is gay permalink parent award report block reply view 1 more comments... trumpORbust 10 points 5 days ago They don't issue licenses the honest and truthful speech permalink parent award report block reply Govtizbad 4 points 5 days ago U got a license to like bacon? edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply\nragnarokrobo 57 points 5 days ago No, he was arrested by jamaican and pakistani bobbies on his way out. permalink parent award report block reply Govtizbad 12 points 5 days ago A blonde female and a female muzz came on his door edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply EgregiousPhilbin 0 points 5 days ago Updoot is gay permalink parent award report block reply view 1 more comments...\nGovtizbad 12 points 5 days ago A blonde female and a female muzz came on his door edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply EgregiousPhilbin 0 points 5 days ago Updoot is gay permalink parent award report block reply view 1 more comments...\nEgregiousPhilbin 0 points 5 days ago Updoot is gay permalink parent award report block reply view 1 more comments...\ntrumpORbust 10 points 5 days ago They don't issue licenses the honest and truthful speech permalink parent award report block reply Govtizbad 4 points 5 days ago U got a license to like bacon? edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply\nGovtizbad 4 points 5 days ago U got a license to like bacon? edit: I'm being downvoted by feds and commies. Updoot! permalink parent award report block reply\ngoatnuts 47 points 5 days ago A lot of people don't understand, Britain's population was higher before world war 2 than until 2017, that population includes the Pakis and Bangladeshis and Jamaicans and everybody else. Just actual ethnic British people, their population to this day has never recovered. That's how badly the Germans bombed them. So imagine being this man. Youre a child and britain is beautiful. Youre a young man and half of it is destroyed, the place looks like iraq. You fight, you win, you think it's time for things to get better. And they do. But the things your country does to rebuild completely destroys it, turns it into something alien to you. He might not even have an issue with immigrants, but it's still unrecognizable to him. It's a police state where his people are second class citizens among foreigners. Anyone too stupid to get this has no business interviewing anyone. permalink parent award report block reply PROCIsAsshoe 32 points 5 days ago Beautifully put. It's really a powerful thing to contemplate. I deeply admire this man for being brave enough to take this chance to speak out. To hear a 100 year old man that fought in the war sit there and say \"we fought for nothing, we are less free today\". wow! Talk about pathos! If that doesn't shock you awake whatever could? permalink parent award report block reply Tongs_Ya_Bass 22 points 5 days ago UK population 1939 was 47 million, in 2017 66.6 million and now nearly 70 million. Around 85% are Brits from the census. That makes about 59 million, 12 million more than 1939. During WW2 there were only 70k civilian deaths and about 350k military deaths. Germany did not bomb the UK so bad that the population never recovered. Tonnes of kids were evacuated to the country or abroad to places like Belfast or NYC. An estimated 2 million left for the Commonwealth countries, South Africa, USA etc post WW2. Your claims and the numbers don't align. permalink parent award report block reply MakeArdernGoAway 9 points 5 days ago Yeh his numbers are total horseshit. The population increased significantly between 1939 and 1948. permalink parent award report block reply TPMJB 7 points 5 days ago Around 85% are Brits from the census. Lol how many of those \"Brits\" have parents that are both brown? permalink parent award report block reply Tongs_Ya_Bass 0 points 5 days ago None, there's a separate category for mixed race or other races the category I referenced is White British. permalink parent award report block reply view 1 more comments... VictorThomas451 4 points 5 days ago So perfectly said - thanks from England. permalink parent award report block reply BotFinder 2 points 5 days ago ?? He’s an idiot and his numbers are nonsense permalink parent award report block reply PensivePatriot 4 points 5 days ago Bro you need to read some actual fucking history. The French endured far, far worse losses in WW1 than any part of the British empire did during the second, let alone just during the blitz. permalink parent award report block reply BotFinder 1 points 5 days ago FYI to future readers: This post above is a carefully crafted lie permalink parent award report block reply goatnuts 0 points 5 days ago How so? permalink parent award report block reply\nPROCIsAsshoe 32 points 5 days ago Beautifully put. It's really a powerful thing to contemplate. I deeply admire this man for being brave enough to take this chance to speak out. To hear a 100 year old man that fought in the war sit there and say \"we fought for nothing, we are less free today\". wow! Talk about pathos! If that doesn't shock you awake whatever could? permalink parent award report block reply\nTongs_Ya_Bass 22 points 5 days ago UK population 1939 was 47 million, in 2017 66.6 million and now nearly 70 million. Around 85% are Brits from the census. That makes about 59 million, 12 million more than 1939. During WW2 there were only 70k civilian deaths and about 350k military deaths. Germany did not bomb the UK so bad that the population never recovered. Tonnes of kids were evacuated to the country or abroad to places like Belfast or NYC. An estimated 2 million left for the Commonwealth countries, South Africa, USA etc post WW2. Your claims and the numbers don't align. permalink parent award report block reply MakeArdernGoAway 9 points 5 days ago Yeh his numbers are total horseshit. The population increased significantly between 1939 and 1948. permalink parent award report block reply TPMJB 7 points 5 days ago Around 85% are Brits from the census. Lol how many of those \"Brits\" have parents that are both brown? permalink parent award report block reply Tongs_Ya_Bass 0 points 5 days ago None, there's a separate category for mixed race or other races the category I referenced is White British. permalink parent award report block reply view 1 more comments...\nMakeArdernGoAway 9 points 5 days ago Yeh his numbers are total horseshit. The population increased significantly between 1939 and 1948. permalink parent award report block reply\nTPMJB 7 points 5 days ago Around 85% are Brits from the census. Lol how many of those \"Brits\" have parents that are both brown? permalink parent award report block reply Tongs_Ya_Bass 0 points 5 days ago None, there's a separate category for mixed race or other races the category I referenced is White British. permalink parent award report block reply view 1 more comments...\nTongs_Ya_Bass 0 points 5 days ago None, there's a separate category for mixed race or other races the category I referenced is White British. permalink parent award report block reply view 1 more comments...\nVictorThomas451 4 points 5 days ago So perfectly said - thanks from England. permalink parent award report block reply BotFinder 2 points 5 days ago ?? He’s an idiot and his numbers are nonsense permalink parent award report block reply\nBotFinder 2 points 5 days ago ?? He’s an idiot and his numbers are nonsense permalink parent award report block reply\nPensivePatriot 4 points 5 days ago Bro you need to read some actual fucking history. The French endured far, far worse losses in WW1 than any part of the British empire did during the second, let alone just during the blitz. permalink parent award report block reply\nBotFinder 1 points 5 days ago FYI to future readers: This post above is a carefully crafted lie permalink parent award report block reply goatnuts 0 points 5 days ago How so? permalink parent award report block reply\ngoatnuts 0 points 5 days ago How so? permalink parent award report block reply\nNotYourMan 26 points 5 days ago The sad part is bravery in the Dunkirk evacuation that is now forgotten by this generation as the UK slowly slips into liberal fascism.  The grooming and rape of white girls from 12 to 14 without any consequences is a terrible thing.  It ends when we can't protect little girls from invaders.  Rape and Pillage is happening. permalink parent award report block reply Wanderlust 16 points 5 days ago What bravery? Hitler held back and let Britain evacuate as another attempt at peace. permalink parent award report block reply StayoutOfit 15 points 5 days ago Most have a very one sided and propagandized view of history.  Many are unfamiliar with Hitler's attempts to strike piece with the Brits and how the Brits continually rejected those efforts from the top down. permalink parent award report block reply Tongs_Ya_Bass 6 points 5 days ago Churchill withheld the peace offers from the public. Rudolph Hess flew to Scotland to try and meet his friend the Duke of Hamilton to try and get the offer across. permalink parent award report block reply view 1 more comments... AmericanJawa 0 points 5 days ago Most have a very one sided and propagandized view of history. And yet somehow that claim that propaganda is responsible only ever goes one way; there's somehow no possible way that the pro-Hitler people could possibly be influenced by propaganda... permalink parent award report block reply view 6 more comments... wlatic 0 points 5 days ago What piece of material was trying to be struck? permalink parent award report block reply Pappy_Gunn 3 points 5 days ago The German ground units were overextended and out of supply.  And had to recover from all the drug use.  The Luftwaffe bombed the crap out of the beaches.  They weren't holding back.  The Brits lost 68000 soldiers..  6 destroyers were sunk, 23 damaged.  89 transport ships lost.  177 aircraft destroyed.  Goering lost some prestige in not doing better. permalink parent award report block reply henri_derelicte 3 points 5 days ago I don’t fully buy that logic. Britain suing for peace would have been viewed as a massive betrayal by the French and Polish. On top of that, the Brits correctly concluded that Germany lacked the ability to invade Great Britain, so from their point of view, Hitler couldn’t win. permalink parent award report block reply Wanderlust 1 points 5 days ago Germany sued for peace. They even air dropped royalty to UK. UK imprisoned him and he was never able to contact his cousin. UK wanted blood. Churchill was pretty public about it. permalink parent award report block reply AmericanJawa 2 points 5 days ago Hitler held back and let Britain evacuate as another attempt at peace. A lie will forever be a lie no matter how many times you tell it. permalink parent award report block reply PROCIsAsshoe 2 points 5 days ago not true, whatsoever. their response was confusing and slow but it wasn't some sort of olive branch. if he wanted peace he would have trapped their army on the beaches and forced a surrender, not allow the entire British army to retreat and live to fight another day. The successful withdrawal of hundreds of thousands of British infantrymen from Dunkirk is literally the only reason that Britain managed to stay in the fight! permalink parent award report block reply Dangerous 1 points 5 days ago You literally just helped another poster lie about British population numbers. Shut the fuck up liar permalink parent award report block reply view 1 more comments... tt777 0 points 5 days ago Hitler was peacenik, dontcha know? 😂 permalink parent award report block reply view 1 more comments... Pappy_Gunn 2 points 5 days ago The Brits don't really like talking about being routed in several theater in WW2.  Places like Singapore, etc.   They especially like to crap on the French, even when they covered their \"redeployment\" to England at Dunkirk.  There were some very dark days for the Empire. permalink parent award report block reply NomadicKrow2 1 points 5 days ago There has to be one manly British guy left. I haven't seen him, but I'm sure he's out there somewhere. permalink parent award report block reply BidenShowerDrool 1 points 5 days ago Tommy Robinson for PM!...Now.  And Stamer hangs for his crimes along with every other living PM before him for allowing this to happen.  Tony Blair hangs because he outright lied about Iraq in 2003. permalink parent award report block reply\nWanderlust 16 points 5 days ago What bravery? Hitler held back and let Britain evacuate as another attempt at peace. permalink parent award report block reply StayoutOfit 15 points 5 days ago Most have a very one sided and propagandized view of history.  Many are unfamiliar with Hitler's attempts to strike piece with the Brits and how the Brits continually rejected those efforts from the top down. permalink parent award report block reply Tongs_Ya_Bass 6 points 5 days ago Churchill withheld the peace offers from the public. Rudolph Hess flew to Scotland to try and meet his friend the Duke of Hamilton to try and get the offer across. permalink parent award report block reply view 1 more comments... AmericanJawa 0 points 5 days ago Most have a very one sided and propagandized view of history. And yet somehow that claim that propaganda is responsible only ever goes one way; there's somehow no possible way that the pro-Hitler people could possibly be influenced by propaganda... permalink parent award report block reply view 6 more comments... wlatic 0 points 5 days ago What piece of material was trying to be struck? permalink parent award report block reply Pappy_Gunn 3 points 5 days ago The German ground units were overextended and out of supply.  And had to recover from all the drug use.  The Luftwaffe bombed the crap out of the beaches.  They weren't holding back.  The Brits lost 68000 soldiers..  6 destroyers were sunk, 23 damaged.  89 transport ships lost.  177 aircraft destroyed.  Goering lost some prestige in not doing better. permalink parent award report block reply henri_derelicte 3 points 5 days ago I don’t fully buy that logic. Britain suing for peace would have been viewed as a massive betrayal by the French and Polish. On top of that, the Brits correctly concluded that Germany lacked the ability to invade Great Britain, so from their point of view, Hitler couldn’t win. permalink parent award report block reply Wanderlust 1 points 5 days ago Germany sued for peace. They even air dropped royalty to UK. UK imprisoned him and he was never able to contact his cousin. UK wanted blood. Churchill was pretty public about it. permalink parent award report block reply AmericanJawa 2 points 5 days ago Hitler held back and let Britain evacuate as another attempt at peace. A lie will forever be a lie no matter how many times you tell it. permalink parent award report block reply PROCIsAsshoe 2 points 5 days ago not true, whatsoever. their response was confusing and slow but it wasn't some sort of olive branch. if he wanted peace he would have trapped their army on the beaches and forced a surrender, not allow the entire British army to retreat and live to fight another day. The successful withdrawal of hundreds of thousands of British infantrymen from Dunkirk is literally the only reason that Britain managed to stay in the fight! permalink parent award report block reply Dangerous 1 points 5 days ago You literally just helped another poster lie about British population numbers. Shut the fuck up liar permalink parent award report block reply view 1 more comments... tt777 0 points 5 days ago Hitler was peacenik, dontcha know? 😂 permalink parent award report block reply view 1 more comments...\nStayoutOfit 15 points 5 days ago Most have a very one sided and propagandized view of history.  Many are unfamiliar with Hitler's attempts to strike piece with the Brits and how the Brits continually rejected those efforts from the top down. permalink parent award report block reply Tongs_Ya_Bass 6 points 5 days ago Churchill withheld the peace offers from the public. Rudolph Hess flew to Scotland to try and meet his friend the Duke of Hamilton to try and get the offer across. permalink parent award report block reply view 1 more comments... AmericanJawa 0 points 5 days ago Most have a very one sided and propagandized view of history. And yet somehow that claim that propaganda is responsible only ever goes one way; there's somehow no possible way that the pro-Hitler people could possibly be influenced by propaganda... permalink parent award report block reply view 6 more comments... wlatic 0 points 5 days ago What piece of material was trying to be struck? permalink parent award report block reply\nTongs_Ya_Bass 6 points 5 days ago Churchill withheld the peace offers from the public. Rudolph Hess flew to Scotland to try and meet his friend the Duke of Hamilton to try and get the offer across. permalink parent award report block reply view 1 more comments...\nAmericanJawa 0 points 5 days ago Most have a very one sided and propagandized view of history. And yet somehow that claim that propaganda is responsible only ever goes one way; there's somehow no possible way that the pro-Hitler people could possibly be influenced by propaganda... permalink parent award report block reply view 6 more comments...\nwlatic 0 points 5 days ago What piece of material was trying to be struck? permalink parent award report block reply\nPappy_Gunn 3 points 5 days ago The German ground units were overextended and out of supply.  And had to recover from all the drug use.  The Luftwaffe bombed the crap out of the beaches.  They weren't holding back.  The Brits lost 68000 soldiers..  6 destroyers were sunk, 23 damaged.  89 transport ships lost.  177 aircraft destroyed.  Goering lost some prestige in not doing better. permalink parent award report block reply\nhenri_derelicte 3 points 5 days ago I don’t fully buy that logic. Britain suing for peace would have been viewed as a massive betrayal by the French and Polish. On top of that, the Brits correctly concluded that Germany lacked the ability to invade Great Britain, so from their point of view, Hitler couldn’t win. permalink parent award report block reply Wanderlust 1 points 5 days ago Germany sued for peace. They even air dropped royalty to UK. UK imprisoned him and he was never able to contact his cousin. UK wanted blood. Churchill was pretty public about it. permalink parent award report block reply\nWanderlust 1 points 5 days ago Germany sued for peace. They even air dropped royalty to UK. UK imprisoned him and he was never able to contact his cousin. UK wanted blood. Churchill was pretty public about it. permalink parent award report block reply\nAmericanJawa 2 points 5 days ago Hitler held back and let Britain evacuate as another attempt at peace. A lie will forever be a lie no matter how many times you tell it. permalink parent award report block reply\nPROCIsAsshoe 2 points 5 days ago not true, whatsoever. their response was confusing and slow but it wasn't some sort of olive branch. if he wanted peace he would have trapped their army on the beaches and forced a surrender, not allow the entire British army to retreat and live to fight another day. The successful withdrawal of hundreds of thousands of British infantrymen from Dunkirk is literally the only reason that Britain managed to stay in the fight! permalink parent award report block reply Dangerous 1 points 5 days ago You literally just helped another poster lie about British population numbers. Shut the fuck up liar permalink parent award report block reply view 1 more comments... tt777 0 points 5 days ago Hitler was peacenik, dontcha know? 😂 permalink parent award report block reply view 1 more comments...\nDangerous 1 points 5 days ago You literally just helped another poster lie about British population numbers. Shut the fuck up liar permalink parent award report block reply view 1 more comments...\ntt777 0 points 5 days ago Hitler was peacenik, dontcha know? 😂 permalink parent award report block reply view 1 more comments...\nPappy_Gunn 2 points 5 days ago The Brits don't really like talking about being routed in several theater in WW2.  Places like Singapore, etc.   They especially like to crap on the French, even when they covered their \"redeployment\" to England at Dunkirk.  There were some very dark days for the Empire. permalink parent award report block reply\nNomadicKrow2 1 points 5 days ago There has to be one manly British guy left. I haven't seen him, but I'm sure he's out there somewhere. permalink parent award report block reply\nBidenShowerDrool 1 points 5 days ago Tommy Robinson for PM!...Now.  And Stamer hangs for his crimes along with every other living PM before him for allowing this to happen.  Tony Blair hangs because he outright lied about Iraq in 2003. permalink parent award report block reply\nMellop 12 points 5 days ago Judeo-Bolshevism, and its consequences, have been a disaster for the civilized human races. permalink parent award report block reply StayoutOfit 8 points 5 days ago Judeo anything really. permalink parent award report block reply AmericanJawa 0 points 5 days ago Judeo-Bolshevism, and its consequences, have been a disaster for the civilized human races. Wow, it's not enough to label everything you don't like \"Bolshevism\" anymore, now you got to upgrade it to Judeo-Bolshevism . permalink parent award report block reply\nStayoutOfit 8 points 5 days ago Judeo anything really. permalink parent award report block reply\nAmericanJawa 0 points 5 days ago Judeo-Bolshevism, and its consequences, have been a disaster for the civilized human races. Wow, it's not enough to label everything you don't like \"Bolshevism\" anymore, now you got to upgrade it to Judeo-Bolshevism . permalink parent award report block reply\nConfusedAngryArmed 3 points 5 days ago We definitely fought the wrong enemy in WW2. permalink parent award report block reply AmericanJawa 3 points 5 days ago We definitely fought the wrong enemy in WW2. Between Nazis and the USSR, neither one were the good guys. permalink parent award report block reply\nAmericanJawa 3 points 5 days ago We definitely fought the wrong enemy in WW2. Between Nazis and the USSR, neither one were the good guys. permalink parent award report block reply\nBenDoverAssho 81 points 5 days ago Imagine a Europe that is 95% White, Christian, Conservative Western European. Had the Germans won WWII, that is what Europe would be today. permalink award report block reply CrossTheRubixCube 34 points 5 days ago It’s going to be hard for people to realize the “good guys” did not win WWII. permalink parent award report block reply Rebooted 17 points 5 days ago Was hard for me until I internalized that we're all just people trying to live the best we can and no one is perfect.  The NatSocs were not perfect saints, they were just people who fought against the same international forces we struggle against today.  Accepting this allowed me to accept their flaws and good traits all in context and see their good deeds for what they were. WW2 was a struggle to continue western civilization as it was, and that war was lost.  Have hope though, as long as our blood remains our people can rebuild and expand upon what our ancestors first achieved.  It isn't over until each one of us is dead. permalink parent award report block reply Mecoperator2525 10 points 5 days ago Americans are already being replaced by immigrants that can easily be exploited. If you question the plan its because you hate brown people apparently. permalink parent award report block reply StayoutOfit 8 points 5 days ago It isn't over until each one of us is dead. They are certainly trying to make this a reality every single day. permalink parent award report block reply StayoutOfit 10 points 5 days ago It was one of the biggest black pills needing swallowed when realizing this. permalink parent award report block reply TrumpAndGodWin 0 points 5 days ago The US and the UK practiced some forms of eugenics and IBM etc had deals with him which is why Hitler thought they wouldn't turn on him. England especially was jealous of Germany so as they've done historically they worked to destroy them. permalink parent award report block reply YT45 11 points 5 days ago There is nothing Christian or conservative about national socialism.  It’s a godless marxist leftist abomination whose only real differences from communism are purely cosmetic.  Europe would be whiter, but that’s all. permalink parent award report block reply jdemarco2014 13 points 5 days ago There’s nothing Christian or conservative about Jews and Muslims taking over our country and there country either permalink parent award report block reply LizardKingx002 2 points 5 days ago Christianity literally came from the same place where those two groups come from permalink parent award report block reply jdemarco2014 10 points 5 days ago Christianity is better then the other 2 permalink parent award report block reply YT45 -2 points 5 days ago Your argument is that you’d rather be buttfucked by Prison Rapist A so that you don’t get buttfucked by Prison Rapist B.  I prefer to not get buttfucked at all. permalink parent award report block reply BenDoverAssho 6 points 5 days ago Now Europe is going to get both Communism and Islamization which is really weird. I predict that the Muslims will wipe out the Communists first. permalink parent award report block reply red_holiday2 6 points 5 days ago Gott mit uns permalink parent award report block reply someguy7738 5 points 5 days ago Europe would be whiter, but that’s all. You say that as if that wouldn't be a huge win in and of itself. Everything else is down stream of race, even religion. permalink parent award report block reply Pappy_Gunn 4 points 5 days ago Yup, they slaughtered plenty of white christians when they turned against the USSR.  The Ukraininans welcomed them, and they genocided the lot becasue they were slavs, sub-humans. permalink parent award report block reply load 1 more comments... jdemarco2014 9 points 5 days ago Imagine what the USA would look like with out these pesky Jews running around controlling our politicians permalink parent award report block reply WreckEm 7 points 5 days ago No, that is a fantasy.  They would have eventually cucked out like they are right now.  They believe all propaganda from the state.  As the state shifts so do the Germans permalink parent award report block reply Viewer01 29 points 5 days ago But without the Jews and Israel there is no subversive element in universities. permalink parent award report block reply anotherthing 1 points 4 days ago You mean without the Soviet Union there would be no subversive element in the universities. The Soviet Union had subversive plants in Hollywood long before they moved on to universities, and before Israel even existed. permalink parent award report block reply YT45 -11 points 5 days ago You actually believe that?  Jesus wept. permalink parent award report block reply Viewer01 10 points 5 days ago You mean Jesus whipped the Pharisees? permalink parent award report block reply Dangerous 4 points 5 days ago IMO Germany would have slid into degenerate communism the moment Hitler died. He was the only thing holding it all together by design and there didn't seem to be much of a plan set up by the late 40's for his exit permalink parent award report block reply Pappy_Gunn 4 points 5 days ago The Socialist Nazis were plenty degenerate. permalink parent award report block reply Burneraccountno4 4 points 5 days ago They are cucked after 80 years of USA funded propaganda and bullying. permalink parent award report block reply Navypilot100 3 points 5 days ago It would be a utopia world if only Germany had won permalink parent award report block reply StayoutOfit 0 points 5 days ago Interplanetary species by now. permalink parent award report block reply load 34 more comments...\nCrossTheRubixCube 34 points 5 days ago It’s going to be hard for people to realize the “good guys” did not win WWII. permalink parent award report block reply Rebooted 17 points 5 days ago Was hard for me until I internalized that we're all just people trying to live the best we can and no one is perfect.  The NatSocs were not perfect saints, they were just people who fought against the same international forces we struggle against today.  Accepting this allowed me to accept their flaws and good traits all in context and see their good deeds for what they were. WW2 was a struggle to continue western civilization as it was, and that war was lost.  Have hope though, as long as our blood remains our people can rebuild and expand upon what our ancestors first achieved.  It isn't over until each one of us is dead. permalink parent award report block reply Mecoperator2525 10 points 5 days ago Americans are already being replaced by immigrants that can easily be exploited. If you question the plan its because you hate brown people apparently. permalink parent award report block reply StayoutOfit 8 points 5 days ago It isn't over until each one of us is dead. They are certainly trying to make this a reality every single day. permalink parent award report block reply StayoutOfit 10 points 5 days ago It was one of the biggest black pills needing swallowed when realizing this. permalink parent award report block reply TrumpAndGodWin 0 points 5 days ago The US and the UK practiced some forms of eugenics and IBM etc had deals with him which is why Hitler thought they wouldn't turn on him. England especially was jealous of Germany so as they've done historically they worked to destroy them. permalink parent award report block reply\nRebooted 17 points 5 days ago Was hard for me until I internalized that we're all just people trying to live the best we can and no one is perfect.  The NatSocs were not perfect saints, they were just people who fought against the same international forces we struggle against today.  Accepting this allowed me to accept their flaws and good traits all in context and see their good deeds for what they were. WW2 was a struggle to continue western civilization as it was, and that war was lost.  Have hope though, as long as our blood remains our people can rebuild and expand upon what our ancestors first achieved.  It isn't over until each one of us is dead. permalink parent award report block reply Mecoperator2525 10 points 5 days ago Americans are already being replaced by immigrants that can easily be exploited. If you question the plan its because you hate brown people apparently. permalink parent award report block reply StayoutOfit 8 points 5 days ago It isn't over until each one of us is dead. They are certainly trying to make this a reality every single day. permalink parent award report block reply\nMecoperator2525 10 points 5 days ago Americans are already being replaced by immigrants that can easily be exploited. If you question the plan its because you hate brown people apparently. permalink parent award report block reply\nStayoutOfit 8 points 5 days ago It isn't over until each one of us is dead. They are certainly trying to make this a reality every single day. permalink parent award report block reply\nStayoutOfit 10 points 5 days ago It was one of the biggest black pills needing swallowed when realizing this. permalink parent award report block reply\nTrumpAndGodWin 0 points 5 days ago The US and the UK practiced some forms of eugenics and IBM etc had deals with him which is why Hitler thought they wouldn't turn on him. England especially was jealous of Germany so as they've done historically they worked to destroy them. permalink parent award report block reply\nYT45 11 points 5 days ago There is nothing Christian or conservative about national socialism.  It’s a godless marxist leftist abomination whose only real differences from communism are purely cosmetic.  Europe would be whiter, but that’s all. permalink parent award report block reply jdemarco2014 13 points 5 days ago There’s nothing Christian or conservative about Jews and Muslims taking over our country and there country either permalink parent award report block reply LizardKingx002 2 points 5 days ago Christianity literally came from the same place where those two groups come from permalink parent award report block reply jdemarco2014 10 points 5 days ago Christianity is better then the other 2 permalink parent award report block reply YT45 -2 points 5 days ago Your argument is that you’d rather be buttfucked by Prison Rapist A so that you don’t get buttfucked by Prison Rapist B.  I prefer to not get buttfucked at all. permalink parent award report block reply BenDoverAssho 6 points 5 days ago Now Europe is going to get both Communism and Islamization which is really weird. I predict that the Muslims will wipe out the Communists first. permalink parent award report block reply red_holiday2 6 points 5 days ago Gott mit uns permalink parent award report block reply someguy7738 5 points 5 days ago Europe would be whiter, but that’s all. You say that as if that wouldn't be a huge win in and of itself. Everything else is down stream of race, even religion. permalink parent award report block reply Pappy_Gunn 4 points 5 days ago Yup, they slaughtered plenty of white christians when they turned against the USSR.  The Ukraininans welcomed them, and they genocided the lot becasue they were slavs, sub-humans. permalink parent award report block reply load 1 more comments...\njdemarco2014 13 points 5 days ago There’s nothing Christian or conservative about Jews and Muslims taking over our country and there country either permalink parent award report block reply LizardKingx002 2 points 5 days ago Christianity literally came from the same place where those two groups come from permalink parent award report block reply jdemarco2014 10 points 5 days ago Christianity is better then the other 2 permalink parent award report block reply YT45 -2 points 5 days ago Your argument is that you’d rather be buttfucked by Prison Rapist A so that you don’t get buttfucked by Prison Rapist B.  I prefer to not get buttfucked at all. permalink parent award report block reply\nLizardKingx002 2 points 5 days ago Christianity literally came from the same place where those two groups come from permalink parent award report block reply jdemarco2014 10 points 5 days ago Christianity is better then the other 2 permalink parent award report block reply\njdemarco2014 10 points 5 days ago Christianity is better then the other 2 permalink parent award report block reply\nYT45 -2 points 5 days ago Your argument is that you’d rather be buttfucked by Prison Rapist A so that you don’t get buttfucked by Prison Rapist B.  I prefer to not get buttfucked at all. permalink parent award report block reply\nBenDoverAssho 6 points 5 days ago Now Europe is going to get both Communism and Islamization which is really weird. I predict that the Muslims will wipe out the Communists first. permalink parent award report block reply\nred_holiday2 6 points 5 days ago Gott mit uns permalink parent award report block reply\nsomeguy7738 5 points 5 days ago Europe would be whiter, but that’s all. You say that as if that wouldn't be a huge win in and of itself. Everything else is down stream of race, even religion. permalink parent award report block reply\nPappy_Gunn 4 points 5 days ago Yup, they slaughtered plenty of white christians when they turned against the USSR.  The Ukraininans welcomed them, and they genocided the lot becasue they were slavs, sub-humans. permalink parent award report block reply\njdemarco2014 9 points 5 days ago Imagine what the USA would look like with out these pesky Jews running around controlling our politicians permalink parent award report block reply\nWreckEm 7 points 5 days ago No, that is a fantasy.  They would have eventually cucked out like they are right now.  They believe all propaganda from the state.  As the state shifts so do the Germans permalink parent award report block reply Viewer01 29 points 5 days ago But without the Jews and Israel there is no subversive element in universities. permalink parent award report block reply anotherthing 1 points 4 days ago You mean without the Soviet Union there would be no subversive element in the universities. The Soviet Union had subversive plants in Hollywood long before they moved on to universities, and before Israel even existed. permalink parent award report block reply YT45 -11 points 5 days ago You actually believe that?  Jesus wept. permalink parent award report block reply Viewer01 10 points 5 days ago You mean Jesus whipped the Pharisees? permalink parent award report block reply Dangerous 4 points 5 days ago IMO Germany would have slid into degenerate communism the moment Hitler died. He was the only thing holding it all together by design and there didn't seem to be much of a plan set up by the late 40's for his exit permalink parent award report block reply Pappy_Gunn 4 points 5 days ago The Socialist Nazis were plenty degenerate. permalink parent award report block reply Burneraccountno4 4 points 5 days ago They are cucked after 80 years of USA funded propaganda and bullying. permalink parent award report block reply\nViewer01 29 points 5 days ago But without the Jews and Israel there is no subversive element in universities. permalink parent award report block reply anotherthing 1 points 4 days ago You mean without the Soviet Union there would be no subversive element in the universities. The Soviet Union had subversive plants in Hollywood long before they moved on to universities, and before Israel even existed. permalink parent award report block reply YT45 -11 points 5 days ago You actually believe that?  Jesus wept. permalink parent award report block reply Viewer01 10 points 5 days ago You mean Jesus whipped the Pharisees? permalink parent award report block reply\nanotherthing 1 points 4 days ago You mean without the Soviet Union there would be no subversive element in the universities. The Soviet Union had subversive plants in Hollywood long before they moved on to universities, and before Israel even existed. permalink parent award report block reply\nYT45 -11 points 5 days ago You actually believe that?  Jesus wept. permalink parent award report block reply Viewer01 10 points 5 days ago You mean Jesus whipped the Pharisees? permalink parent award report block reply\nViewer01 10 points 5 days ago You mean Jesus whipped the Pharisees? permalink parent award report block reply\nDangerous 4 points 5 days ago IMO Germany would have slid into degenerate communism the moment Hitler died. He was the only thing holding it all together by design and there didn't seem to be much of a plan set up by the late 40's for his exit permalink parent award report block reply Pappy_Gunn 4 points 5 days ago The Socialist Nazis were plenty degenerate. permalink parent award report block reply\nPappy_Gunn 4 points 5 days ago The Socialist Nazis were plenty degenerate. permalink parent award report block reply\nBurneraccountno4 4 points 5 days ago They are cucked after 80 years of USA funded propaganda and bullying. permalink parent award report block reply\nNavypilot100 3 points 5 days ago It would be a utopia world if only Germany had won permalink parent award report block reply StayoutOfit 0 points 5 days ago Interplanetary species by now. permalink parent award report block reply\nStayoutOfit 0 points 5 days ago Interplanetary species by now. permalink parent award report block reply\nLol_Garrus 58 points 5 days ago WW2 Veteran, \"My friends & I fought and died for this? This country is worse!\" Reporter, \"I'm sorry you feel that way.\" (Even though I voted to make it this way) \"Don't talk about the state of the country, here are some pretty women.\" Edit: They are not pretty women but the guy probably has bad eye-sight. permalink award report block reply RStroud 17 points 5 days ago 10/10 in bongland. But seriously, being attractive is not their main thing. They're not models but a singing group who do 1940s nostalgia music, swing, standards, and easy listening type stuff.  Andrew's Sisters LARP group. permalink parent award report block reply goatnuts 5 points 5 days ago At least they're not speaking German. permalink parent award report block reply SicilianOmega 14 points 5 days ago German is easier to learn than Arabic. permalink parent award report block reply charwoman 3 points 5 days ago 100 yo Vet replies to reporter who says here are some pretty women...\nBollocks! Those are Blokes! permalink parent award report block reply\nRStroud 17 points 5 days ago 10/10 in bongland. But seriously, being attractive is not their main thing. They're not models but a singing group who do 1940s nostalgia music, swing, standards, and easy listening type stuff.  Andrew's Sisters LARP group. permalink parent award report block reply\ngoatnuts 5 points 5 days ago At least they're not speaking German. permalink parent award report block reply SicilianOmega 14 points 5 days ago German is easier to learn than Arabic. permalink parent award report block reply\nSicilianOmega 14 points 5 days ago German is easier to learn than Arabic. permalink parent award report block reply\ncharwoman 3 points 5 days ago 100 yo Vet replies to reporter who says here are some pretty women...\nBollocks! Those are Blokes! permalink parent award report block reply\nhenri_derelicte 43 points 5 days ago Britain willingly decolonized (except in the United States of course). Never did they agree to being colonized themselves by the very savages they tried to civilize. Camp of the Saints should be required reading in high school. permalink award report block reply SilverStarv5 13 points 5 days ago That book is pretty damn close to what’s happening in Western Europe right now. Did that guy have a crystal ball or what? permalink parent award report block reply DontTreadOnSnek 11 points 5 days ago Camp of the Saints should be required reading in high school. Which is why it has been quasi banned. Physical editions are going for hundreds, if not thousands and digital editions are prone to being altered. Because of French copyright laws (life of author + 70 years) the book won't enter public domain until 2090. permalink parent award report block reply henri_derelicte 11 points 5 days ago I’m bringing it up because I’m well aware of how the book was effectively banned for years since they wouldn’t print it. However, in a fairly recent development, someone secured the rights to it and is printing it again in English. It’s available on Amazon for about $25. permalink parent award report block reply Dangerous 2 points 5 days ago They didn't willingly decolonize, socialist faggot politicians and American Jews forced them to against the wishes of British citizens and even most colonial subjects And now all those former colonies are shitholes, which is why the majority of the colonial subjects wanted the Empire to remain permalink parent award report block reply TheAttackTitan 1 points 5 days ago What is  it about? permalink parent award report block reply henri_derelicte 5 points 5 days ago Mass immigration from third world/shithole countries to Europe. It’s surprisingly accurate to how things have played out today. permalink parent award report block reply TrumpAndGodWin 1 points 5 days ago The Kalergi plan and the UN plan. permalink parent award report block reply\nSilverStarv5 13 points 5 days ago That book is pretty damn close to what’s happening in Western Europe right now. Did that guy have a crystal ball or what? permalink parent award report block reply\nDontTreadOnSnek 11 points 5 days ago Camp of the Saints should be required reading in high school. Which is why it has been quasi banned. Physical editions are going for hundreds, if not thousands and digital editions are prone to being altered. Because of French copyright laws (life of author + 70 years) the book won't enter public domain until 2090. permalink parent award report block reply henri_derelicte 11 points 5 days ago I’m bringing it up because I’m well aware of how the book was effectively banned for years since they wouldn’t print it. However, in a fairly recent development, someone secured the rights to it and is printing it again in English. It’s available on Amazon for about $25. permalink parent award report block reply\nhenri_derelicte 11 points 5 days ago I’m bringing it up because I’m well aware of how the book was effectively banned for years since they wouldn’t print it. However, in a fairly recent development, someone secured the rights to it and is printing it again in English. It’s available on Amazon for about $25. permalink parent award report block reply\nDangerous 2 points 5 days ago They didn't willingly decolonize, socialist faggot politicians and American Jews forced them to against the wishes of British citizens and even most colonial subjects And now all those former colonies are shitholes, which is why the majority of the colonial subjects wanted the Empire to remain permalink parent award report block reply\nTheAttackTitan 1 points 5 days ago What is  it about? permalink parent award report block reply henri_derelicte 5 points 5 days ago Mass immigration from third world/shithole countries to Europe. It’s surprisingly accurate to how things have played out today. permalink parent award report block reply TrumpAndGodWin 1 points 5 days ago The Kalergi plan and the UN plan. permalink parent award report block reply\nhenri_derelicte 5 points 5 days ago Mass immigration from third world/shithole countries to Europe. It’s surprisingly accurate to how things have played out today. permalink parent award report block reply TrumpAndGodWin 1 points 5 days ago The Kalergi plan and the UN plan. permalink parent award report block reply\nTrumpAndGodWin 1 points 5 days ago The Kalergi plan and the UN plan. permalink parent award report block reply\nYodaBannon 28 points 5 days ago Cheerio permalink award report block reply MAGAGIRL69 15 points 5 days ago Pip pip permalink parent award report block reply Samuel_L_Bronkowitz 11 points 5 days ago Good on ya lad. permalink parent award report block reply MemeWarsVet 4 points 5 days ago Cuppa? permalink parent award report block reply trumpORbust 4 points 5 days ago #wank me permalink parent award report block reply\nMAGAGIRL69 15 points 5 days ago Pip pip permalink parent award report block reply Samuel_L_Bronkowitz 11 points 5 days ago Good on ya lad. permalink parent award report block reply MemeWarsVet 4 points 5 days ago Cuppa? permalink parent award report block reply trumpORbust 4 points 5 days ago #wank me permalink parent award report block reply\nSamuel_L_Bronkowitz 11 points 5 days ago Good on ya lad. permalink parent award report block reply MemeWarsVet 4 points 5 days ago Cuppa? permalink parent award report block reply trumpORbust 4 points 5 days ago #wank me permalink parent award report block reply\nMemeWarsVet 4 points 5 days ago Cuppa? permalink parent award report block reply trumpORbust 4 points 5 days ago #wank me permalink parent award report block reply\ntrumpORbust 4 points 5 days ago #wank me permalink parent award report block reply\nBlippiIsAPedo 25 points 5 days ago You fought the wrong people permalink award report block reply Mellop 11 points 5 days ago Fighting on the side of Judeo-Bolshevism should've been a big clue that you're going down the wrong path... permalink parent award report block reply Rakkasan91b 1 points 5 days ago No, fighting with them against the Nazis was fine.  The problem is we didn't then go on and defeat the commies when we finished off Hitler and Japan when we had the chance and upper hand with the atomic bomb and they had bled each other dry. permalink parent award report block reply\nMellop 11 points 5 days ago Fighting on the side of Judeo-Bolshevism should've been a big clue that you're going down the wrong path... permalink parent award report block reply Rakkasan91b 1 points 5 days ago No, fighting with them against the Nazis was fine.  The problem is we didn't then go on and defeat the commies when we finished off Hitler and Japan when we had the chance and upper hand with the atomic bomb and they had bled each other dry. permalink parent award report block reply\nRakkasan91b 1 points 5 days ago No, fighting with them against the Nazis was fine.  The problem is we didn't then go on and defeat the commies when we finished off Hitler and Japan when we had the chance and upper hand with the atomic bomb and they had bled each other dry. permalink parent award report block reply\nBidensPrisonWallet 24 points 5 days ago I believe most GWOT Vets feel the same. permalink award report block reply Breacherbear 31 points 5 days ago Speaking for myself, we spent 20 years and billions for Afghanistan to go from Taliban control to better equipped Taliban control. We did our job and the weak people back here screwed it up. permalink parent award report block reply IlhansBrother 19 points 5 days ago we spent 20 years and billions for Afghanistan to go from Taliban control to better equipped Taliban control. And millions of Afghan gimmigrants are now in the West permalink parent award report block reply Mamapedia 16 points 5 days ago A few towns and cities that I drive through occasionally have banners with the pictures and names of their citizens who have fought and died for American interests over the decades hanging from light poles along the roads. Mostly fresh faced young men.  I wonder what they really suffered for. When the ruling class is shielded from the physical battlefield, bad things happen. permalink parent award report block reply Cyer6 12 points 5 days ago The WWI WWII, Korean, Vietnam and Gulf War vets... All the same. What was really accomplished? I was in during Desert Storm and finished my 8 years before 9/11 hit. I'm proud to have served my country. Today, our kids celebrated veterans and Veteran's Day at their school inviting all veteran family members. This was in Texas and that American pride was all over that school. But again I still don't know what was really accomplished.  A lot of good boys are gone and now being replaced with 3rd world dregs who are adored by white liberal women. permalink parent award report block reply Rebooted 7 points 5 days ago Yes, but now they have a central bank linked to the international system.  So, the goal was achieved. permalink parent award report block reply Pappy_Gunn 4 points 5 days ago Afghanistan was terrible.  Most NATO moochers went for non-combat roles (with exceptions being the US, UK, Canada and a few other) and \"reconstruction\" which was a big, fat through for NGOs and money laundering.  NATO helped write the constitution for the Afghan Republic (before the Taliban took over again).  Article 1 stated that Afghanistan is an Islamic Republic, article 2 was that Sharia was the law.  We fought and died to establish an Islamic Republic.  The last church in Afghanistan was burned under NATO's nose, Christians killed and taken as slaves. permalink parent award report block reply Breacherbear 2 points 5 days ago We had a male LT that was running on base at night in Kandahar. Some of our NATO \"allies\" grabbed and rapped him. We were ordered not to walk alone at night after that. permalink parent award report block reply Pappy_Gunn 3 points 5 days ago The media avoided at all cost to mention the institutional pedophilia (and some bestiality) that is part of the Afghan culture.  They alway showed the women as victims (and I can't argue with that), but never a peep about the boys. permalink parent award report block reply view 1 more comments... SaxonRealm 2 points 5 days ago We should have killed everything that moved and annexed Afghanistan. permalink parent award report block reply Pappy_Gunn 3 points 5 days ago We should have bombed Pakistan that was playing both sides. permalink parent award report block reply anotherrandomname 1 points 5 days ago But Pakistan is our \"ally\" somehow or something. permalink parent award report block reply BenDoverAssho 4 points 5 days ago Imagine what current vets must be feeling about a Communist/Islamist getting elected as mayor of NYC , especially since we still honor the dead from the 9/11 terrorist attack. permalink parent award report block reply newdaynewname9 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply BenDoverAssho 1 points 5 days ago Why have you deleted all your previous posts? Hiding something? permalink parent award report block reply joggin_noggin 2 points 5 days ago Hand icon next to the username line means newfag. permalink parent award report block reply newdaynewname9 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply HKFan 0 points 5 days ago we were on the wrong side in WWII.  We were on teh right side in GWOT but used the wrong tactics. permalink parent award report block reply SicilianOmega 5 points 5 days ago We fought the wrong enemy in both wars. permalink parent award report block reply Rebooted 3 points 5 days ago GWOT was primarily about resources and installing central banks controlled by the international banks.  Look at the countries we went into and compare that to which countries didn't have international bank allegiances. permalink parent award report block reply\nBreacherbear 31 points 5 days ago Speaking for myself, we spent 20 years and billions for Afghanistan to go from Taliban control to better equipped Taliban control. We did our job and the weak people back here screwed it up. permalink parent award report block reply IlhansBrother 19 points 5 days ago we spent 20 years and billions for Afghanistan to go from Taliban control to better equipped Taliban control. And millions of Afghan gimmigrants are now in the West permalink parent award report block reply Mamapedia 16 points 5 days ago A few towns and cities that I drive through occasionally have banners with the pictures and names of their citizens who have fought and died for American interests over the decades hanging from light poles along the roads. Mostly fresh faced young men.  I wonder what they really suffered for. When the ruling class is shielded from the physical battlefield, bad things happen. permalink parent award report block reply Cyer6 12 points 5 days ago The WWI WWII, Korean, Vietnam and Gulf War vets... All the same. What was really accomplished? I was in during Desert Storm and finished my 8 years before 9/11 hit. I'm proud to have served my country. Today, our kids celebrated veterans and Veteran's Day at their school inviting all veteran family members. This was in Texas and that American pride was all over that school. But again I still don't know what was really accomplished.  A lot of good boys are gone and now being replaced with 3rd world dregs who are adored by white liberal women. permalink parent award report block reply Rebooted 7 points 5 days ago Yes, but now they have a central bank linked to the international system.  So, the goal was achieved. permalink parent award report block reply Pappy_Gunn 4 points 5 days ago Afghanistan was terrible.  Most NATO moochers went for non-combat roles (with exceptions being the US, UK, Canada and a few other) and \"reconstruction\" which was a big, fat through for NGOs and money laundering.  NATO helped write the constitution for the Afghan Republic (before the Taliban took over again).  Article 1 stated that Afghanistan is an Islamic Republic, article 2 was that Sharia was the law.  We fought and died to establish an Islamic Republic.  The last church in Afghanistan was burned under NATO's nose, Christians killed and taken as slaves. permalink parent award report block reply Breacherbear 2 points 5 days ago We had a male LT that was running on base at night in Kandahar. Some of our NATO \"allies\" grabbed and rapped him. We were ordered not to walk alone at night after that. permalink parent award report block reply Pappy_Gunn 3 points 5 days ago The media avoided at all cost to mention the institutional pedophilia (and some bestiality) that is part of the Afghan culture.  They alway showed the women as victims (and I can't argue with that), but never a peep about the boys. permalink parent award report block reply view 1 more comments... SaxonRealm 2 points 5 days ago We should have killed everything that moved and annexed Afghanistan. permalink parent award report block reply Pappy_Gunn 3 points 5 days ago We should have bombed Pakistan that was playing both sides. permalink parent award report block reply anotherrandomname 1 points 5 days ago But Pakistan is our \"ally\" somehow or something. permalink parent award report block reply\nIlhansBrother 19 points 5 days ago we spent 20 years and billions for Afghanistan to go from Taliban control to better equipped Taliban control. And millions of Afghan gimmigrants are now in the West permalink parent award report block reply\nMamapedia 16 points 5 days ago A few towns and cities that I drive through occasionally have banners with the pictures and names of their citizens who have fought and died for American interests over the decades hanging from light poles along the roads. Mostly fresh faced young men.  I wonder what they really suffered for. When the ruling class is shielded from the physical battlefield, bad things happen. permalink parent award report block reply Cyer6 12 points 5 days ago The WWI WWII, Korean, Vietnam and Gulf War vets... All the same. What was really accomplished? I was in during Desert Storm and finished my 8 years before 9/11 hit. I'm proud to have served my country. Today, our kids celebrated veterans and Veteran's Day at their school inviting all veteran family members. This was in Texas and that American pride was all over that school. But again I still don't know what was really accomplished.  A lot of good boys are gone and now being replaced with 3rd world dregs who are adored by white liberal women. permalink parent award report block reply\nCyer6 12 points 5 days ago The WWI WWII, Korean, Vietnam and Gulf War vets... All the same. What was really accomplished? I was in during Desert Storm and finished my 8 years before 9/11 hit. I'm proud to have served my country. Today, our kids celebrated veterans and Veteran's Day at their school inviting all veteran family members. This was in Texas and that American pride was all over that school. But again I still don't know what was really accomplished.  A lot of good boys are gone and now being replaced with 3rd world dregs who are adored by white liberal women. permalink parent award report block reply\nRebooted 7 points 5 days ago Yes, but now they have a central bank linked to the international system.  So, the goal was achieved. permalink parent award report block reply\nPappy_Gunn 4 points 5 days ago Afghanistan was terrible.  Most NATO moochers went for non-combat roles (with exceptions being the US, UK, Canada and a few other) and \"reconstruction\" which was a big, fat through for NGOs and money laundering.  NATO helped write the constitution for the Afghan Republic (before the Taliban took over again).  Article 1 stated that Afghanistan is an Islamic Republic, article 2 was that Sharia was the law.  We fought and died to establish an Islamic Republic.  The last church in Afghanistan was burned under NATO's nose, Christians killed and taken as slaves. permalink parent award report block reply Breacherbear 2 points 5 days ago We had a male LT that was running on base at night in Kandahar. Some of our NATO \"allies\" grabbed and rapped him. We were ordered not to walk alone at night after that. permalink parent award report block reply Pappy_Gunn 3 points 5 days ago The media avoided at all cost to mention the institutional pedophilia (and some bestiality) that is part of the Afghan culture.  They alway showed the women as victims (and I can't argue with that), but never a peep about the boys. permalink parent award report block reply view 1 more comments...\nBreacherbear 2 points 5 days ago We had a male LT that was running on base at night in Kandahar. Some of our NATO \"allies\" grabbed and rapped him. We were ordered not to walk alone at night after that. permalink parent award report block reply Pappy_Gunn 3 points 5 days ago The media avoided at all cost to mention the institutional pedophilia (and some bestiality) that is part of the Afghan culture.  They alway showed the women as victims (and I can't argue with that), but never a peep about the boys. permalink parent award report block reply view 1 more comments...\nPappy_Gunn 3 points 5 days ago The media avoided at all cost to mention the institutional pedophilia (and some bestiality) that is part of the Afghan culture.  They alway showed the women as victims (and I can't argue with that), but never a peep about the boys. permalink parent award report block reply view 1 more comments...\nSaxonRealm 2 points 5 days ago We should have killed everything that moved and annexed Afghanistan. permalink parent award report block reply Pappy_Gunn 3 points 5 days ago We should have bombed Pakistan that was playing both sides. permalink parent award report block reply anotherrandomname 1 points 5 days ago But Pakistan is our \"ally\" somehow or something. permalink parent award report block reply\nPappy_Gunn 3 points 5 days ago We should have bombed Pakistan that was playing both sides. permalink parent award report block reply anotherrandomname 1 points 5 days ago But Pakistan is our \"ally\" somehow or something. permalink parent award report block reply\nanotherrandomname 1 points 5 days ago But Pakistan is our \"ally\" somehow or something. permalink parent award report block reply\nBenDoverAssho 4 points 5 days ago Imagine what current vets must be feeling about a Communist/Islamist getting elected as mayor of NYC , especially since we still honor the dead from the 9/11 terrorist attack. permalink parent award report block reply newdaynewname9 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply BenDoverAssho 1 points 5 days ago Why have you deleted all your previous posts? Hiding something? permalink parent award report block reply joggin_noggin 2 points 5 days ago Hand icon next to the username line means newfag. permalink parent award report block reply newdaynewname9 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply BenDoverAssho 1 points 5 days ago Why have you deleted all your previous posts? Hiding something? permalink parent award report block reply joggin_noggin 2 points 5 days ago Hand icon next to the username line means newfag. permalink parent award report block reply newdaynewname9 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nBenDoverAssho 1 points 5 days ago Why have you deleted all your previous posts? Hiding something? permalink parent award report block reply joggin_noggin 2 points 5 days ago Hand icon next to the username line means newfag. permalink parent award report block reply newdaynewname9 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\njoggin_noggin 2 points 5 days ago Hand icon next to the username line means newfag. permalink parent award report block reply\nnewdaynewname9 0 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nHKFan 0 points 5 days ago we were on the wrong side in WWII.  We were on teh right side in GWOT but used the wrong tactics. permalink parent award report block reply SicilianOmega 5 points 5 days ago We fought the wrong enemy in both wars. permalink parent award report block reply Rebooted 3 points 5 days ago GWOT was primarily about resources and installing central banks controlled by the international banks.  Look at the countries we went into and compare that to which countries didn't have international bank allegiances. permalink parent award report block reply\nSicilianOmega 5 points 5 days ago We fought the wrong enemy in both wars. permalink parent award report block reply\nRebooted 3 points 5 days ago GWOT was primarily about resources and installing central banks controlled by the international banks.  Look at the countries we went into and compare that to which countries didn't have international bank allegiances. permalink parent award report block reply\nOldman1234 21 points 5 days ago He'll be summarily arrested and, due to his advanced age, will only be given a few years in prison for speaking out against the UK Government. permalink award report block reply Breacherbear 12 points 5 days ago They will let out some pedos to make space permalink parent award report block reply\nBreacherbear 12 points 5 days ago They will let out some pedos to make space permalink parent award report block reply\nJohnMiller2020 18 points 5 days ago He's right. permalink award report block reply\nCyber1776 17 points 5 days ago He fought to stop an invasion of Germans, then the Labour party turned around and opened the doors to infinity third worlders.\nIn July 1945, Churchill lost his seat as Prime Minister to Clement Attlee of the Labour Party. Clement immediately made the call for subjects in British colonies in the Caribbean, Africa, and the Middle East to come into England in order to rebuild and repopulate the country, specifically London. From this move on, a never ending supply of third worlders continued to flood in and are now taking over the country. permalink award report block reply PROCIsAsshoe 12 points 5 days ago The fact that Churchill lost his role as PM in July, just a few months after the War ends, is so unbelievable fucking rotten. It'd be like kicking George Washington out of office in Christmas 1781, \"hey thanks for winning a literal life-and-death struggle for our Nation, now get out of here!\" Fucking communists inside the UK. Kicked him out of office and also delivered our atomic secrets to the Soviets all within two years of the war ending. With allies like that, who needs enemies? permalink parent award report block reply Pappy_Gunn 5 points 5 days ago The Brits gave the Soviets modern jet engines to \"equalize\" the cold war.  The Soviets reverse-engineered it (I thinkk it was the Nene), did a few improvements and it propelled the MiG 15 which was the scourge of the air war in Korea, downing many B-29s and asorted allied aircraft. permalink parent award report block reply covok48 2 points 5 days ago Bong politics are another level of fuckery that Americans cannot comprehend. What worse is that historically infinitely better than whatever was on the continent. permalink parent award report block reply LaptopDied 3 points 5 days ago Now that's interesting. permalink parent award report block reply Dangerous 2 points 5 days ago He fought because The Focus told him to to pay off his debts. He rallied for war for years and refused peace negotiations throughout. The Germans were never a legitimate threat to the UK before Churchill, and would never have been if not for him permalink parent award report block reply Cyber1776 2 points 5 days ago Retarded neo-nazi slop. The PM is not the dictator of the UK and cant make unilateral decisions to start wars. Either way, it was PM Neville Chamberlain who declared war on Germany, not Churchill. permalink parent award report block reply\nPROCIsAsshoe 12 points 5 days ago The fact that Churchill lost his role as PM in July, just a few months after the War ends, is so unbelievable fucking rotten. It'd be like kicking George Washington out of office in Christmas 1781, \"hey thanks for winning a literal life-and-death struggle for our Nation, now get out of here!\" Fucking communists inside the UK. Kicked him out of office and also delivered our atomic secrets to the Soviets all within two years of the war ending. With allies like that, who needs enemies? permalink parent award report block reply Pappy_Gunn 5 points 5 days ago The Brits gave the Soviets modern jet engines to \"equalize\" the cold war.  The Soviets reverse-engineered it (I thinkk it was the Nene), did a few improvements and it propelled the MiG 15 which was the scourge of the air war in Korea, downing many B-29s and asorted allied aircraft. permalink parent award report block reply covok48 2 points 5 days ago Bong politics are another level of fuckery that Americans cannot comprehend. What worse is that historically infinitely better than whatever was on the continent. permalink parent award report block reply\nPappy_Gunn 5 points 5 days ago The Brits gave the Soviets modern jet engines to \"equalize\" the cold war.  The Soviets reverse-engineered it (I thinkk it was the Nene), did a few improvements and it propelled the MiG 15 which was the scourge of the air war in Korea, downing many B-29s and asorted allied aircraft. permalink parent award report block reply\ncovok48 2 points 5 days ago Bong politics are another level of fuckery that Americans cannot comprehend. What worse is that historically infinitely better than whatever was on the continent. permalink parent award report block reply\nLaptopDied 3 points 5 days ago Now that's interesting. permalink parent award report block reply\nDangerous 2 points 5 days ago He fought because The Focus told him to to pay off his debts. He rallied for war for years and refused peace negotiations throughout. The Germans were never a legitimate threat to the UK before Churchill, and would never have been if not for him permalink parent award report block reply Cyber1776 2 points 5 days ago Retarded neo-nazi slop. The PM is not the dictator of the UK and cant make unilateral decisions to start wars. Either way, it was PM Neville Chamberlain who declared war on Germany, not Churchill. permalink parent award report block reply\nCyber1776 2 points 5 days ago Retarded neo-nazi slop. The PM is not the dictator of the UK and cant make unilateral decisions to start wars. Either way, it was PM Neville Chamberlain who declared war on Germany, not Churchill. permalink parent award report block reply\nPoorMansPsychiatrist 14 points 5 days ago Based. Heartbreaking. permalink award report block reply\nsumnayin2 13 points 5 days ago WW2 was fought for the bankers and juice. We were the bad guys permalink award report block reply Roadpower 8 points 5 days ago You mean the \"leadership\" at the time. The American people were very much opposed to the war but we got dragged into it via an attack that the FDR administration knew full well that was coming. My big question is if the Imperial Japanese got hoodwinked into doing the attack or not. permalink parent award report block reply Pappy_Gunn 4 points 5 days ago The Japs were expanding their empire in the far east and the US embargo threatened their economy.  In order to secure resources the USN had to be neutralized.  They figured the US was soft and would not fight.  They didn't get hoodwinked, they had plans to act against the USN for a long time. permalink parent award report block reply Roadpower 1 points 5 days ago Thank you, you have a recommended book or author on this? permalink parent award report block reply Pappy_Gunn 2 points 5 days ago Not really it's just part of the general background prior to WW2.  I'd just research \"US embargo against Japan\", Roosevelt froze assets and did the oil embargo in July-August 1941. permalink parent award report block reply Dangerous 3 points 5 days ago My big question is if the Imperial Japanese got hoodwinked into doing the attack or not. Explicitly so, Japanese leadership were forced into the attack by a needless US campaign of sanctions and embargos that threatened to completely cripple the nation https://search.brave.com/search?q=USA+blocks+Imperial+Japan+supply+lines+pre+Pearl+Harbor&source=android&summary=1&conversation=e53268d0b3dd05a156b857 permalink parent award report block reply Roadpower 0 points 5 days ago Yeah those I knew about but I have wondered if there was anything more insidious. permalink parent award report block reply\nRoadpower 8 points 5 days ago You mean the \"leadership\" at the time. The American people were very much opposed to the war but we got dragged into it via an attack that the FDR administration knew full well that was coming. My big question is if the Imperial Japanese got hoodwinked into doing the attack or not. permalink parent award report block reply Pappy_Gunn 4 points 5 days ago The Japs were expanding their empire in the far east and the US embargo threatened their economy.  In order to secure resources the USN had to be neutralized.  They figured the US was soft and would not fight.  They didn't get hoodwinked, they had plans to act against the USN for a long time. permalink parent award report block reply Roadpower 1 points 5 days ago Thank you, you have a recommended book or author on this? permalink parent award report block reply Pappy_Gunn 2 points 5 days ago Not really it's just part of the general background prior to WW2.  I'd just research \"US embargo against Japan\", Roosevelt froze assets and did the oil embargo in July-August 1941. permalink parent award report block reply Dangerous 3 points 5 days ago My big question is if the Imperial Japanese got hoodwinked into doing the attack or not. Explicitly so, Japanese leadership were forced into the attack by a needless US campaign of sanctions and embargos that threatened to completely cripple the nation https://search.brave.com/search?q=USA+blocks+Imperial+Japan+supply+lines+pre+Pearl+Harbor&source=android&summary=1&conversation=e53268d0b3dd05a156b857 permalink parent award report block reply Roadpower 0 points 5 days ago Yeah those I knew about but I have wondered if there was anything more insidious. permalink parent award report block reply\nPappy_Gunn 4 points 5 days ago The Japs were expanding their empire in the far east and the US embargo threatened their economy.  In order to secure resources the USN had to be neutralized.  They figured the US was soft and would not fight.  They didn't get hoodwinked, they had plans to act against the USN for a long time. permalink parent award report block reply Roadpower 1 points 5 days ago Thank you, you have a recommended book or author on this? permalink parent award report block reply Pappy_Gunn 2 points 5 days ago Not really it's just part of the general background prior to WW2.  I'd just research \"US embargo against Japan\", Roosevelt froze assets and did the oil embargo in July-August 1941. permalink parent award report block reply\nRoadpower 1 points 5 days ago Thank you, you have a recommended book or author on this? permalink parent award report block reply Pappy_Gunn 2 points 5 days ago Not really it's just part of the general background prior to WW2.  I'd just research \"US embargo against Japan\", Roosevelt froze assets and did the oil embargo in July-August 1941. permalink parent award report block reply\nPappy_Gunn 2 points 5 days ago Not really it's just part of the general background prior to WW2.  I'd just research \"US embargo against Japan\", Roosevelt froze assets and did the oil embargo in July-August 1941. permalink parent award report block reply\nDangerous 3 points 5 days ago My big question is if the Imperial Japanese got hoodwinked into doing the attack or not. Explicitly so, Japanese leadership were forced into the attack by a needless US campaign of sanctions and embargos that threatened to completely cripple the nation https://search.brave.com/search?q=USA+blocks+Imperial+Japan+supply+lines+pre+Pearl+Harbor&source=android&summary=1&conversation=e53268d0b3dd05a156b857 permalink parent award report block reply Roadpower 0 points 5 days ago Yeah those I knew about but I have wondered if there was anything more insidious. permalink parent award report block reply\nRoadpower 0 points 5 days ago Yeah those I knew about but I have wondered if there was anything more insidious. permalink parent award report block reply\nKekistanPM 11 points 5 days ago Britain ITV probably: \"We apologize for the technical issues with our broadcast. Here is a rebroadcast of the interview in full: \"No, I’m notsorry, the sacrifice wasworth the result that it is now...what we fought for was our freedom. We find that even now, it’s a..sight.\" permalink award report block reply\nHKFan 10 points 5 days ago BASED Austrian painter was right about just about everything permalink award report block reply lothrop_evola 11 points 5 days ago Everyone should watch his speeches. He never cucked, never backed down, always told his people the truth. And the crowds loved him for it. permalink parent award report block reply AmericanJawa 1 points 5 days ago BASED Austrian painter was right about just about everything You mean the same one who first tried to overthrow the German government by force then orchestrated political mechanations to have himself installed as unquestioned dictator? permalink parent award report block reply HKFan 1 points 5 days ago You mean the degenerate, corrupt, and ineffective Weimar government? permalink parent award report block reply AmericanJawa 1 points 3 days ago You mean the degenerate, corrupt, and ineffective Weimar government? Replacing one bad government with another bad government does not make someone a good person. permalink parent award report block reply\nlothrop_evola 11 points 5 days ago Everyone should watch his speeches. He never cucked, never backed down, always told his people the truth. And the crowds loved him for it. permalink parent award report block reply\nAmericanJawa 1 points 5 days ago BASED Austrian painter was right about just about everything You mean the same one who first tried to overthrow the German government by force then orchestrated political mechanations to have himself installed as unquestioned dictator? permalink parent award report block reply HKFan 1 points 5 days ago You mean the degenerate, corrupt, and ineffective Weimar government? permalink parent award report block reply AmericanJawa 1 points 3 days ago You mean the degenerate, corrupt, and ineffective Weimar government? Replacing one bad government with another bad government does not make someone a good person. permalink parent award report block reply\nHKFan 1 points 5 days ago You mean the degenerate, corrupt, and ineffective Weimar government? permalink parent award report block reply AmericanJawa 1 points 3 days ago You mean the degenerate, corrupt, and ineffective Weimar government? Replacing one bad government with another bad government does not make someone a good person. permalink parent award report block reply\nAmericanJawa 1 points 3 days ago You mean the degenerate, corrupt, and ineffective Weimar government? Replacing one bad government with another bad government does not make someone a good person. permalink parent award report block reply\ntriforce28 9 points 5 days ago We lost world war 2. And I feel awful for my grandparents having fought in it permalink award report block reply\nBullet3250 9 points 5 days ago The Communists WON - don't forget. permalink award report block reply\nScatter-Shot 7 points 5 days ago Good for this veteran for calling out modern day Britain. permalink award report block reply\nLostElf 7 points 5 days ago God bless him, still a warrior. permalink award report block reply\nSomecatsareMAGA 7 points 5 days ago God Bless you Sir. permalink award report block reply\nHazelHen 6 points 5 days ago 100% true for US WW2 vets, also. permalink award report block reply\nSuperHonkey 6 points 5 days ago Oye!! Arrest him for islamophobia!! permalink award report block reply\nFuhQ 5 points 5 days ago Less free and conquered by foreigners from other civilizations.  At least Germans were related. permalink award report block reply\nGrindelwald 5 points 5 days ago We fought a civil war for nothing too.   Should have just invented the combine earlier. Must have been a democrat politician stopping inventions. permalink award report block reply anotherrandomname 2 points 5 days ago Definitely don't look into the role \"European\" finance played in fomenting that conflict. permalink parent award report block reply\nanotherrandomname 2 points 5 days ago Definitely don't look into the role \"European\" finance played in fomenting that conflict. permalink parent award report block reply\nLiveFreeInXorDie 5 points 5 days ago Tens of millions of gallons of human blood spilled, even more millions of dreams shattered forever--all ultimately in vain, and for the whims of a few evil men. What a nightmare, this mortal realm. permalink award report block reply anotherrandomname 2 points 5 days ago In vain? WWII was a wild success, for the powers that be. They essentially decimated the European population, opening the door for \"replacement migration\" not to mention the enormous quantities of debt it created (aka profit, for the bankers). permalink parent award report block reply canada_is_communist 1 points 5 days ago Well in vain no. WW2 brought us turing and eventually computers… and games… permalink parent award report block reply\nanotherrandomname 2 points 5 days ago In vain? WWII was a wild success, for the powers that be. They essentially decimated the European population, opening the door for \"replacement migration\" not to mention the enormous quantities of debt it created (aka profit, for the bankers). permalink parent award report block reply\ncanada_is_communist 1 points 5 days ago Well in vain no. WW2 brought us turing and eventually computers… and games… permalink parent award report block reply\nCrankyCrab 5 points 5 days ago Based AF!  Men of this era would not have allowed these third-world invaders into their countries.  And no way in hell would these lowlifes would get anything for free. This Vet is 100 years old.  He bravely fought for his country in a bloody war and survived.  He earned the right to drop truth bombs. permalink award report block reply\nRusherOfDin 4 points 5 days ago I can imagine there's a fight going on right now at the various legal institutions in the UK trying to decide if the PR nightmare of arresting this guy would be worth it to send a message to the rest of the rabble. permalink award report block reply canada_is_communist 2 points 5 days ago The other issue is that at his age the arrest might kill him lol permalink parent award report block reply\ncanada_is_communist 2 points 5 days ago The other issue is that at his age the arrest might kill him lol permalink parent award report block reply\nPissJuggernaut 4 points 5 days ago \"We got you a music CD, cant you be grateful?!\" permalink award report block reply\nBillbuttlickerr 4 points 5 days ago Based. permalink award report block reply\nCaliAli 4 points 5 days ago I bet Antifa will attack this real anti-fascist, because Antifa is fascist. permalink award report block reply Rimbus_Reynolds 2 points 5 days ago Was gonna say thw same thing. Wouldn't be surprised if a band of punk haired lunatics burned his house down or something permalink parent award report block reply\nRimbus_Reynolds 2 points 5 days ago Was gonna say thw same thing. Wouldn't be surprised if a band of punk haired lunatics burned his house down or something permalink parent award report block reply\nMegaboom2025 4 points 5 days ago Fought the wrong enemy permalink award report block reply\nBaronFalcon 4 points 5 days ago We fought the wrong people. George Patton permalink award report block reply\nauntjemima 4 points 5 days ago Poor guy, I feel his pain. permalink award report block reply\nbased_trekkie 4 points 5 days ago Somehow I think that if Hitler had won, the UK would have fared better by now. They may have had to learn German but they would still be \"European\". permalink award report block reply\nRimbus_Reynolds 4 points 5 days ago I feel so bad for this guy for having to witness his country become a ahit hole. I also feel bad for him because that patronizing cunt and the shit skin wouldn't even let him finish his point. What a disgusting lack of respect permalink award report block reply\nRememberCharlieKirk 4 points 5 days ago During the same television program, the 100-year-old veteran was \"presented with a compact-disc of Second World War-era popular music in thanks.\" Well, the WWII veteran did receive a compact disc for his troubles! I would say that the sacrifice was worth it. Screw freedom; give me a copy of easily pirated, widely available music! permalink award report block reply\nBeardholder 4 points 5 days ago The more I look back the more I realize that the United States almost spoke German as the main language. Now I see I'd rather be speaking German than have allowed all these Muslims and pagans into my country permalink award report block reply\nBramage 4 points 5 days ago Om my...criticizing the authoritarian UK govt...toss him in the clink. permalink award report block reply\nnzsvz9 4 points 5 days ago Soon to go to high security prison for Islamophobia. permalink award report block reply\nQuiznos585 3 points 5 days ago Did they arrest him for hate speech after? permalink award report block reply\nJoeDapper 3 points 5 days ago We got Americans saying this already. 20 years in the Stan to replace the Taliban with the Taliban. It was all for nothing. permalink award report block reply\nAmerican-Patriot 3 points 5 days ago Should have fought hard at home and raised his kids right, instead of giving up and lounging around like so many did after the war. Unfortunately, to preserve a country one must ALWAYS be vigilant permalink award report block reply\nRock9Head 3 points 5 days ago Peace in our time. permalink award report block reply\ncovok48 3 points 5 days ago He probably wanted to say some other things too… permalink award report block reply\nParadigmShift2070 3 points 5 days ago https://youtu.be/AcSE9MdUKVc permalink award report block reply\nForty_Five 3 points 5 days ago WWII era men wouldn't put up with this bullshit. permalink award report block reply Dangerous 3 points 5 days ago WWII era men were lied to so they would fight to create this bullshit permalink parent award report block reply\nDangerous 3 points 5 days ago WWII era men were lied to so they would fight to create this bullshit permalink parent award report block reply\nPappy_Gunn 3 points 5 days ago You don't have to be a hundred year old or British to feel the same. permalink award report block reply\nbobbacringo 3 points 5 days ago The bad guys won WW2. The sooner you understand that, the sooner we can get to work fixing this shit hole. permalink award report block reply\nclickinheelz 3 points 5 days ago He should be sad if the people in the land he fought for are not willing to show any kind of allegiance or patriotism to the values that they fought to protect. I had a chat with a nanny (she's in her late 50's) at our school pickup today about the fireworks show she went to for bonfire night and learned that patriotism isn't a thing for some people in England. She basically said that she feels that any patriotic behavior is actually far right behavior and should be avoided at all costs lest you are labeled to be a fascist (flying flags, being proud of your country achievements, playing the national anthem, etc...). Very sad. permalink award report block reply Dangerous 1 points 5 days ago WWII was explicitly a global war against the very concept of Nationalism in favor of internationalist globalism. The Japanese, Germans, and Italians were nationalist/nationalist socialist and the USA, UK, French, and Soviets were openly Communist/Globalist. The UN was created in the aftermath explicitly as a Globalist function. of course this would lead to decreased patriotism and such ideas being labeled \"far right wing\" that was the entire point of the war permalink parent award report block reply\nDangerous 1 points 5 days ago WWII was explicitly a global war against the very concept of Nationalism in favor of internationalist globalism. The Japanese, Germans, and Italians were nationalist/nationalist socialist and the USA, UK, French, and Soviets were openly Communist/Globalist. The UN was created in the aftermath explicitly as a Globalist function. of course this would lead to decreased patriotism and such ideas being labeled \"far right wing\" that was the entire point of the war permalink parent award report block reply\nMcLemore800 2 points 5 days ago Absolutely hilarious. You didn’t fight for anything, you blindly went to war for Jewish degeneracy with a smile on your face and your friends all died for Jewish degeneracy permalink award report block reply\nshogun5000 2 points 5 days ago Basically we fought the wrong side permalink award report block reply\nfr33d0mTruck 2 points 5 days ago that generation got fucked in their prime and at the end of their lives permalink award report block reply\nMinneMAGA 2 points 5 days ago And not only will he be arrested for hate speech but they’ll get his children as well since he may not be around much longer permalink award report block reply\nbluedevilga 2 points 5 days ago The reality is that Hitler love Muslims because Islam means to submit. He wanted to replace Christianity with Islam when the war was over.  I’m not sure if he would’ve been importing more people from the Middle East or just killing them, but the difference is probably that England would still be covered with goat fuckers and celebrating 5 AM call to prayer, but everyone would also be wearing swastika. Remember, Islam and the left go great together, just like New York is about to discover permalink award report block reply canada_is_communist 3 points 5 days ago Hitler didnt want islam in germany. He had no beef with island (nor japs) but he didnt exactly want that for germany neither. Culture was very important to him as well permalink parent award report block reply\ncanada_is_communist 3 points 5 days ago Hitler didnt want islam in germany. He had no beef with island (nor japs) but he didnt exactly want that for germany neither. Culture was very important to him as well permalink parent award report block reply\nKrat 2 points 5 days ago All I hear is racism !!! Rrrrreeeeeeeeeee permalink award report block reply\nPearlyGaits57 2 points 5 days ago Now that is socialism. In it's way to total communism. permalink award report block reply\nquiznossucks 2 points 5 days ago Arrest him.....for bad speak permalink award report block reply\nTennesseeScorpio 2 points 5 days ago Here’s the meat n taters of this hero’s statement… https://www.tiktok.com/t/ZP8DHkvcA/ permalink award report block reply\nDoMagnum 2 points 5 days ago He is not wrong. The globalists/commies/feminists have made denigrating his entire generation's sacrifice their life's work. Never have so many owed so much to so few. permalink award report block reply\nMiserySnake 2 points 5 days ago And they’re probably screaming that he’s a racist! permalink award report block reply\nravonaf 2 points 5 days ago Britain has never been free. permalink award report block reply\nvsekvsek 2 points 5 days ago And just think. Ww3 will be us defending nazis in Ukraine permalink award report block reply\nElectionMeddler 2 points 5 days ago He'll be arrested for hate speech and wrong think shortly permalink award report block reply\nQueensOwn 2 points 5 days ago The old guy knows. permalink award report block reply\nGreenhills 2 points 5 days ago It held the wall for 60 years. permalink award report block reply\nRealTXPatriot 2 points 5 days ago Hes right. permalink award report block reply\nLibtardBusterMAGA 2 points 5 days ago So sad permalink award report block reply\nmailinvoter 2 points 5 days ago Oi! That's an arrest for hate speech!!! permalink award report block reply\nHawksendoom 2 points 5 days ago Is he under arrest yet or nah? i mean it's the U.K. permalink award report block reply Landslide_2020 OP 2 points 5 days ago That thought came to my mind as well. permalink parent award report block reply\nLandslide_2020 OP 2 points 5 days ago That thought came to my mind as well. permalink parent award report block reply\n67Vert 2 points 5 days ago UK police will be knocking on his door permalink award report block reply\nCreepy_Joe 1 points 5 days ago How many years will he get in prison for saying that? permalink award report block reply\nSteve1 1 points 5 days ago Yeah well he’s Right - Call a spade a spade permalink award report block reply\nkeeman 1 points 5 days ago Britain fought WW2 for the benefit of its empire.  It didn't work out so well for them, but that was their reason for picking a fight with Germany. permalink award report block reply\nStanwyk74 1 points 5 days ago London fell before NYC permalink award report block reply\nRedpilled2Depression 1 points 5 days ago “My spirit will rise from the grave, and the world will know that I was right!” permalink award report block reply\nStanwyk74 1 points 5 days ago You fought it for a purpose that wasn’t the actual purpose permalink award report block reply\nroadrunner0 1 points 5 days ago Greater Brittan has become what we were protecting it from for 85 years and it is disgusting.. The people are being stripped of their freedoms more and more every day and we should get out of Europe before it is too late or commit to a decade long battle with no guarantee we wont get stabbed in the back.. permalink award report block reply\nPapabravo12 1 points 5 days ago I mean yeah, obviously permalink award report block reply\nchicagoindustrial 1 points 5 days ago German was the language of peace. permalink award report block reply\nRadicalCovfefe 1 points 5 days ago Yeah, we know its a hellscape now. permalink award report block reply\nthrottlejohnson 1 points 5 days ago time to pick up his rifle and get busy....or no? permalink award report block reply\nMeddlesom 1 points 5 days ago Meanwhile, modern day faggots are saying that this man (and all WWII veterans) are Antifa. permalink award report block reply\nMakinBacon 1 points 3 days ago true....and now it's also a caliphate....congrats uk permalink award report block reply\nRockFlagAndEagle2020 -1 points 5 days ago Look in the mirror my man. You're kids are the reason why this crap is happening. These people wanted to protect and shelter their children from reality resulting in them turning into a bunch of race/sex obsessed communists. permalink award report block reply ImYourHuckleberry24 1 points 5 days ago You know this guy's children, do ya? permalink parent award report block reply RockFlagAndEagle2020 1 points 5 days ago He might not be but his generation that raised the boomers is responsible for this woke crap. They have been in power since the 80s. permalink parent award report block reply\nImYourHuckleberry24 1 points 5 days ago You know this guy's children, do ya? permalink parent award report block reply RockFlagAndEagle2020 1 points 5 days ago He might not be but his generation that raised the boomers is responsible for this woke crap. They have been in power since the 80s. permalink parent award report block reply\nRockFlagAndEagle2020 1 points 5 days ago He might not be but his generation that raised the boomers is responsible for this woke crap. They have been in power since the 80s. permalink parent award report block reply\nFatigueIsReal -3 points 5 days ago Can't wait to see the mischaracterization of what he said to mean that Hitler was right and England was on the wrong side. Completely missing his point. permalink award report block reply Dangerous 2 points 5 days ago It's funny that you have the username you do when the single biggest fatigue on Earth right now from every nation is towards jews... permalink parent award report block reply FatigueIsReal 1 points 5 days ago I'm apathetic towards Jews.  Couldn't give a fuck one way or another about how they are doing. Not a single thing they do affects me so why would I care? permalink parent award report block reply\nDangerous 2 points 5 days ago It's funny that you have the username you do when the single biggest fatigue on Earth right now from every nation is towards jews... permalink parent award report block reply FatigueIsReal 1 points 5 days ago I'm apathetic towards Jews.  Couldn't give a fuck one way or another about how they are doing. Not a single thing they do affects me so why would I care? permalink parent award report block reply\nFatigueIsReal 1 points 5 days ago I'm apathetic towards Jews.  Couldn't give a fuck one way or another about how they are doing. Not a single thing they do affects me so why would I care? permalink parent award report block reply\nUsernameChexOut -8 points 5 days ago What does WW2 have to do with the fact that British are cucked faggots who let their country be destroyed since then? permalink award report block reply Flying_Pede_121 16 points 5 days ago Because millions of young patriotic British men were fed to the slaughter by international banking jews to destroy Europe. Left behind were the weak and the easily led astray who took over with the strong men gone permalink parent award report block reply 1st_Covfefe 2 points 5 days ago You mean like the gays? permalink parent award report block reply UsernameChexOut 0 points 5 days ago Look, I can cosign with the sentiment of what you're saying but if you take out the colonies, 264k British military men died during WW2. Assuming 40 million population at the time, that's 0.6% of the population or if you assume 1:1 male to female ratio, 1.2% of men. Tragic and I agree, these were probably the best men out there. But statistically, it's not the most significant amount/percentage. permalink parent award report block reply Flying_Pede_121 3 points 5 days ago It’s an enormous loss. That figure doesn’t include those permanently and irreparably damaged from combat as well. If you knock out the best 1-2% of a population, you absolutely cripple it permalink parent award report block reply Konsaki 9 points 5 days ago The vet was saying that all the sacrifices the UK made to win WW2 were for naught. Might as well have let Germany win. permalink parent award report block reply RememberCharlieKirk 4 points 5 days ago Or, perhaps, the UK (Winston Churchill) could have never declared war on Germany, or the UK could have accepted one of the many peace deals (olive branches) proposed by the Germans. permalink parent award report block reply LawyersPlayDota -1 points 5 days ago He's saying they fought for freedom and future generations squandered it, not that he should have let the country be oveerrun by genocidal pagans, you impossibly retarded faggot. permalink parent award report block reply RememberCharlieKirk 1 points 5 days ago My comment was an addendum to the response by user Konsaki, who argued that a German victory over the UK would have been a better outcome for WWII. I suggested peace or non-engagement as other (better) outcomes. My comment was not an address to the veteran's on-air comment of reflection. I took user Konsaki's comment as being of two parts: (1) A summary of what the veteran said: \"The vet was saying... for naught.\" And this was followed by (2) user Konsaki's own opinion on what the veteran said: \"Might as well... German win.\" permalink parent award report block reply view 9 more comments... KernalMustard 0 points 5 days ago Well it got them WW2 in the first place. Hitler is harmless, we can work with him etc. permalink parent award report block reply\nFlying_Pede_121 16 points 5 days ago Because millions of young patriotic British men were fed to the slaughter by international banking jews to destroy Europe. Left behind were the weak and the easily led astray who took over with the strong men gone permalink parent award report block reply 1st_Covfefe 2 points 5 days ago You mean like the gays? permalink parent award report block reply UsernameChexOut 0 points 5 days ago Look, I can cosign with the sentiment of what you're saying but if you take out the colonies, 264k British military men died during WW2. Assuming 40 million population at the time, that's 0.6% of the population or if you assume 1:1 male to female ratio, 1.2% of men. Tragic and I agree, these were probably the best men out there. But statistically, it's not the most significant amount/percentage. permalink parent award report block reply Flying_Pede_121 3 points 5 days ago It’s an enormous loss. That figure doesn’t include those permanently and irreparably damaged from combat as well. If you knock out the best 1-2% of a population, you absolutely cripple it permalink parent award report block reply\n1st_Covfefe 2 points 5 days ago You mean like the gays? permalink parent award report block reply\nUsernameChexOut 0 points 5 days ago Look, I can cosign with the sentiment of what you're saying but if you take out the colonies, 264k British military men died during WW2. Assuming 40 million population at the time, that's 0.6% of the population or if you assume 1:1 male to female ratio, 1.2% of men. Tragic and I agree, these were probably the best men out there. But statistically, it's not the most significant amount/percentage. permalink parent award report block reply Flying_Pede_121 3 points 5 days ago It’s an enormous loss. That figure doesn’t include those permanently and irreparably damaged from combat as well. If you knock out the best 1-2% of a population, you absolutely cripple it permalink parent award report block reply\nFlying_Pede_121 3 points 5 days ago It’s an enormous loss. That figure doesn’t include those permanently and irreparably damaged from combat as well. If you knock out the best 1-2% of a population, you absolutely cripple it permalink parent award report block reply\nKonsaki 9 points 5 days ago The vet was saying that all the sacrifices the UK made to win WW2 were for naught. Might as well have let Germany win. permalink parent award report block reply RememberCharlieKirk 4 points 5 days ago Or, perhaps, the UK (Winston Churchill) could have never declared war on Germany, or the UK could have accepted one of the many peace deals (olive branches) proposed by the Germans. permalink parent award report block reply LawyersPlayDota -1 points 5 days ago He's saying they fought for freedom and future generations squandered it, not that he should have let the country be oveerrun by genocidal pagans, you impossibly retarded faggot. permalink parent award report block reply RememberCharlieKirk 1 points 5 days ago My comment was an addendum to the response by user Konsaki, who argued that a German victory over the UK would have been a better outcome for WWII. I suggested peace or non-engagement as other (better) outcomes. My comment was not an address to the veteran's on-air comment of reflection. I took user Konsaki's comment as being of two parts: (1) A summary of what the veteran said: \"The vet was saying... for naught.\" And this was followed by (2) user Konsaki's own opinion on what the veteran said: \"Might as well... German win.\" permalink parent award report block reply view 9 more comments...\nRememberCharlieKirk 4 points 5 days ago Or, perhaps, the UK (Winston Churchill) could have never declared war on Germany, or the UK could have accepted one of the many peace deals (olive branches) proposed by the Germans. permalink parent award report block reply LawyersPlayDota -1 points 5 days ago He's saying they fought for freedom and future generations squandered it, not that he should have let the country be oveerrun by genocidal pagans, you impossibly retarded faggot. permalink parent award report block reply RememberCharlieKirk 1 points 5 days ago My comment was an addendum to the response by user Konsaki, who argued that a German victory over the UK would have been a better outcome for WWII. I suggested peace or non-engagement as other (better) outcomes. My comment was not an address to the veteran's on-air comment of reflection. I took user Konsaki's comment as being of two parts: (1) A summary of what the veteran said: \"The vet was saying... for naught.\" And this was followed by (2) user Konsaki's own opinion on what the veteran said: \"Might as well... German win.\" permalink parent award report block reply view 9 more comments...\nLawyersPlayDota -1 points 5 days ago He's saying they fought for freedom and future generations squandered it, not that he should have let the country be oveerrun by genocidal pagans, you impossibly retarded faggot. permalink parent award report block reply RememberCharlieKirk 1 points 5 days ago My comment was an addendum to the response by user Konsaki, who argued that a German victory over the UK would have been a better outcome for WWII. I suggested peace or non-engagement as other (better) outcomes. My comment was not an address to the veteran's on-air comment of reflection. I took user Konsaki's comment as being of two parts: (1) A summary of what the veteran said: \"The vet was saying... for naught.\" And this was followed by (2) user Konsaki's own opinion on what the veteran said: \"Might as well... German win.\" permalink parent award report block reply view 9 more comments...\nRememberCharlieKirk 1 points 5 days ago My comment was an addendum to the response by user Konsaki, who argued that a German victory over the UK would have been a better outcome for WWII. I suggested peace or non-engagement as other (better) outcomes. My comment was not an address to the veteran's on-air comment of reflection. I took user Konsaki's comment as being of two parts: (1) A summary of what the veteran said: \"The vet was saying... for naught.\" And this was followed by (2) user Konsaki's own opinion on what the veteran said: \"Might as well... German win.\" permalink parent award report block reply view 9 more comments...\nKernalMustard 0 points 5 days ago Well it got them WW2 in the first place. Hitler is harmless, we can work with him etc. permalink parent award report block reply\nHoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\ncorporateshizer 1 points 5 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T20:44:10.220873Z"
}