{
  "id": "8185652",
  "title": "41Having \"not enough workers\" is the only way to make wages go upposted2 hours agobyAVeryNakedMan5 c",
  "url": "https://patriots.win/p/1ARK9nPMDC/having-not-enough-workers-is-the/c",
  "content": "42 Having \"not enough workers\" is the only way to make wages go up posted 2 hours ago by AVeryNakedMan 5 comments award share report block I feel like Trump is meeting with so many CEO's that all want cheap labor, that he is out of touch with the average worker. He is only hearing the CEO perspective on wages. To a CEO, if wages are rising, it is a problem. But to 99.9% of America, it is a good thing. We need a Republican party that welcomes \"labor shortages\" to increase wages for workers. Not fights against them to help CEO's buy another yacht. Keep in mind that in the USA we have the world's 3rd largest population. There are plenty of workers to perform labor for ANY company and ANY role. But CEO's always want to import cheaper workers from abroad, to increase their profits. We should not sacrifice the wellbeing of 99.9% of America so that CEO's can go from being millionaires to being billionaires.\n5 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style HeavenlyTrumpets 4 points 2 hours ago absolutely . the trump train will run off the rails in a train wreck if he doesn't fix this shit quickly. permalink award report block reply _Sully_ 1 points 16 minutes ago Well you either trust that he knows what he's doing or you get the alternative. H1-Bs is a losing battle if you think you'll be able to torch the whole thing. You have to pick somewhere in between until it's easier for you to get exactly what you want. So many things are so beyond fucked. The 2nd story is currently on fire and people want to start re-building before the fire is put out. permalink parent award report block reply NotYourMan 1 points 15 minutes ago We will all support Trump.  Because the democrats are far worse then anything Trump is doing.  Remember: lock downs for a virus democrats created, mandate experimental vaccine, censor political opponents, censor doctors that disagreed with the vaccine mandate, censor any adverse reactions to the vaccine, dump ACA on the people and democratic politicians got rich off the stock for health insurance companies, taking children away from families to put them on pre-puberty blockers, convincing young adults to get trans surgery, satan worshipers in the schools, etc. permalink parent award report block reply NotYourMan 1 points 17 minutes ago Trump needs to have courage and go against the corporations.  20% of the salary of every H1B-visa worker every year is a good start to restoring jobs to Americans. permalink award report block reply henri_derelicte 1 points 2 hours ago The pandemic made more companies tolerate remote work. And unfortunately, some of those companies realized they didn’t care if back office tasks were being done in Boston, Buenos Aires, or Bangalore. And as a consequence, American workers are now competing against the world for jobs that used to belong to them. permalink award report block reply\nHeavenlyTrumpets 4 points 2 hours ago absolutely . the trump train will run off the rails in a train wreck if he doesn't fix this shit quickly. permalink award report block reply _Sully_ 1 points 16 minutes ago Well you either trust that he knows what he's doing or you get the alternative. H1-Bs is a losing battle if you think you'll be able to torch the whole thing. You have to pick somewhere in between until it's easier for you to get exactly what you want. So many things are so beyond fucked. The 2nd story is currently on fire and people want to start re-building before the fire is put out. permalink parent award report block reply NotYourMan 1 points 15 minutes ago We will all support Trump.  Because the democrats are far worse then anything Trump is doing.  Remember: lock downs for a virus democrats created, mandate experimental vaccine, censor political opponents, censor doctors that disagreed with the vaccine mandate, censor any adverse reactions to the vaccine, dump ACA on the people and democratic politicians got rich off the stock for health insurance companies, taking children away from families to put them on pre-puberty blockers, convincing young adults to get trans surgery, satan worshipers in the schools, etc. permalink parent award report block reply\n_Sully_ 1 points 16 minutes ago Well you either trust that he knows what he's doing or you get the alternative. H1-Bs is a losing battle if you think you'll be able to torch the whole thing. You have to pick somewhere in between until it's easier for you to get exactly what you want. So many things are so beyond fucked. The 2nd story is currently on fire and people want to start re-building before the fire is put out. permalink parent award report block reply\nNotYourMan 1 points 15 minutes ago We will all support Trump.  Because the democrats are far worse then anything Trump is doing.  Remember: lock downs for a virus democrats created, mandate experimental vaccine, censor political opponents, censor doctors that disagreed with the vaccine mandate, censor any adverse reactions to the vaccine, dump ACA on the people and democratic politicians got rich off the stock for health insurance companies, taking children away from families to put them on pre-puberty blockers, convincing young adults to get trans surgery, satan worshipers in the schools, etc. permalink parent award report block reply\nNotYourMan 1 points 17 minutes ago Trump needs to have courage and go against the corporations.  20% of the salary of every H1B-visa worker every year is a good start to restoring jobs to Americans. permalink award report block reply\nhenri_derelicte 1 points 2 hours ago The pandemic made more companies tolerate remote work. And unfortunately, some of those companies realized they didn’t care if back office tasks were being done in Boston, Buenos Aires, or Bangalore. And as a consequence, American workers are now competing against the world for jobs that used to belong to them. permalink award report block reply"
}