{
  "id": "1ARK54SDmZ",
  "url": "https://patriots.win/p/1ARK54SDmZ/cant-ever-even-be-close-to-being/c",
  "content": "421 Can't ever even be close to being POTUS. posted 5 days ago by wst4 18 comments award share download report block\n18 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style loooooof 12 points 5 days ago Didn't she fuck Weinstein?... An opportunistic whore of the highest order. permalink award report block reply SirBuzzKillingtonVI 4 points 5 days ago Yep. Fucked and slobbered all over his gross dong just to advance her career. And now Newsom kisses that same mouth and gets Weinstein's sloppy seconds. permalink parent award report block reply LiteraIIyHitIer 1 points 5 days ago Nah, he just fucks his best friend's wife instead. permalink parent award report block reply Califunya 6 points 5 days ago Prop 50 vote counter went Whirrrrrrrrrrrr permalink award report block reply CleanUpPhillyTrump24 6 points 5 days ago The FBI/DOJ must act. permalink award report block reply harryparatestes 3 points 5 days ago Nothing will happen. permalink parent award report block reply Protonboy 1 points 5 days ago Found Shecky Greene! permalink parent award report block reply HeatherSwanson 5 points 5 days ago He will be king president Gavin Newscum if nothing is done about ballot harvesting mail in votes permalink award report block reply keeptherepublic1776 5 points 5 days ago Correct permalink parent award report block reply Bullet3250 2 points 5 days ago Where is the Money Gavin? permalink award report block reply keeptherepublic1776 2 points 5 days ago How aren't we up and arms yet. I sit and type this aware that I am not. But what's it going to take? I think wit trump we have a chance to at least organize. Once he's gone all sites will be monitored and they will take swift action. We could at least have a plan on place permalink award report block reply harryparatestes 1 points 5 days ago Aunt Nancy taught him everything he knows about politics and theft. permalink award report block reply knnbccb 1 points 5 days ago NGOs are problematic. You have been gaslit into believing that in the name of 'democracy', you must let them be, let them go about their business unhindered. That must change. permalink award report block reply jsphere256 1 points 5 days ago Meet the New Scum, same as the old scum. permalink award report block reply Big_dick_cheney 1 points 5 days ago If aids was a politician it would be gavin permalink award report block reply Nothing007 1 points 5 days ago Worthless post.  No evidence.  No link.  Just Op jizzing in the wind. permalink award report block reply Bullet3250 2 points 5 days ago There is some smoke here.. Spencer Pratt, a reality TV personality who lost his home in the fires, has been vocal in demanding transparency about how the funds are being used and has accused the Newsom administration of withholding records. and this... https://www.prnewswire.com/news-releases/la-fire-survivors-urge-governor-newsom-to-call-for-commissioner-laras-resignation-says-consumer-watchdog-302607568.html permalink parent award report block reply Liberats 1 points 5 days ago Perfect Democrat President material. permalink award report block reply\nloooooof 12 points 5 days ago Didn't she fuck Weinstein?... An opportunistic whore of the highest order. permalink award report block reply SirBuzzKillingtonVI 4 points 5 days ago Yep. Fucked and slobbered all over his gross dong just to advance her career. And now Newsom kisses that same mouth and gets Weinstein's sloppy seconds. permalink parent award report block reply LiteraIIyHitIer 1 points 5 days ago Nah, he just fucks his best friend's wife instead. permalink parent award report block reply\nSirBuzzKillingtonVI 4 points 5 days ago Yep. Fucked and slobbered all over his gross dong just to advance her career. And now Newsom kisses that same mouth and gets Weinstein's sloppy seconds. permalink parent award report block reply LiteraIIyHitIer 1 points 5 days ago Nah, he just fucks his best friend's wife instead. permalink parent award report block reply\nLiteraIIyHitIer 1 points 5 days ago Nah, he just fucks his best friend's wife instead. permalink parent award report block reply\nCalifunya 6 points 5 days ago Prop 50 vote counter went Whirrrrrrrrrrrr permalink award report block reply\nCleanUpPhillyTrump24 6 points 5 days ago The FBI/DOJ must act. permalink award report block reply harryparatestes 3 points 5 days ago Nothing will happen. permalink parent award report block reply Protonboy 1 points 5 days ago Found Shecky Greene! permalink parent award report block reply\nharryparatestes 3 points 5 days ago Nothing will happen. permalink parent award report block reply\nProtonboy 1 points 5 days ago Found Shecky Greene! permalink parent award report block reply\nHeatherSwanson 5 points 5 days ago He will be king president Gavin Newscum if nothing is done about ballot harvesting mail in votes permalink award report block reply keeptherepublic1776 5 points 5 days ago Correct permalink parent award report block reply\nkeeptherepublic1776 5 points 5 days ago Correct permalink parent award report block reply\nBullet3250 2 points 5 days ago Where is the Money Gavin? permalink award report block reply\nkeeptherepublic1776 2 points 5 days ago How aren't we up and arms yet. I sit and type this aware that I am not. But what's it going to take? I think wit trump we have a chance to at least organize. Once he's gone all sites will be monitored and they will take swift action. We could at least have a plan on place permalink award report block reply\nharryparatestes 1 points 5 days ago Aunt Nancy taught him everything he knows about politics and theft. permalink award report block reply\nknnbccb 1 points 5 days ago NGOs are problematic. You have been gaslit into believing that in the name of 'democracy', you must let them be, let them go about their business unhindered. That must change. permalink award report block reply\njsphere256 1 points 5 days ago Meet the New Scum, same as the old scum. permalink award report block reply\nBig_dick_cheney 1 points 5 days ago If aids was a politician it would be gavin permalink award report block reply\nNothing007 1 points 5 days ago Worthless post.  No evidence.  No link.  Just Op jizzing in the wind. permalink award report block reply Bullet3250 2 points 5 days ago There is some smoke here.. Spencer Pratt, a reality TV personality who lost his home in the fires, has been vocal in demanding transparency about how the funds are being used and has accused the Newsom administration of withholding records. and this... https://www.prnewswire.com/news-releases/la-fire-survivors-urge-governor-newsom-to-call-for-commissioner-laras-resignation-says-consumer-watchdog-302607568.html permalink parent award report block reply\nBullet3250 2 points 5 days ago There is some smoke here.. Spencer Pratt, a reality TV personality who lost his home in the fires, has been vocal in demanding transparency about how the funds are being used and has accused the Newsom administration of withholding records. and this... https://www.prnewswire.com/news-releases/la-fire-survivors-urge-governor-newsom-to-call-for-commissioner-laras-resignation-says-consumer-watchdog-302607568.html permalink parent award report block reply\nLiberats 1 points 5 days ago Perfect Democrat President material. permalink award report block reply",
  "fetched_at": "2025-11-12T22:59:06.406567Z"
}