{
  "id": "1ARK9mHVzU",
  "url": "https://patriots.win/p/1ARK9mHVzU/the-mexican-president-is-buildin/c",
  "content": "246 The Mexican President is building a wall around the presidential palace. Oh, the irony posted 11 hours ago by alanocu 7 comments award share report block Bad Hombre @joma_gc • 22h The Mexican President is building a wall around the presidential palace. Oh, the irony.\n7 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Apersonofinterest 9 points 10 hours ago Damn that’s some ghetto ass shit. Looks like it’s made out of scrap metal they stole from a construction site. permalink award report block reply NotYourMan 4 points 10 hours ago IKR!  It looks like \"Escape from New York\" style walls.  They are preparing for the end of the fiat currency and riots. permalink parent award report block reply QSWO1 1 points 5 hours ago Well uh... permalink parent award report block reply Maga305_47 3 points 10 hours ago Seems as if every installed candidate that campaign against walls, are fast to erect them once they are in office. permalink award report block reply WanderingStar 3 points 8 hours ago Bunker mentality. permalink award report block reply Side_o_beef_curtains 3 points 8 hours ago As is the tradition of her people. In Israel. permalink award report block reply MyGrandpa4 1 points 5 hours ago The Presidential Palace seems excessive. permalink award report block reply\nApersonofinterest 9 points 10 hours ago Damn that’s some ghetto ass shit. Looks like it’s made out of scrap metal they stole from a construction site. permalink award report block reply NotYourMan 4 points 10 hours ago IKR!  It looks like \"Escape from New York\" style walls.  They are preparing for the end of the fiat currency and riots. permalink parent award report block reply QSWO1 1 points 5 hours ago Well uh... permalink parent award report block reply\nNotYourMan 4 points 10 hours ago IKR!  It looks like \"Escape from New York\" style walls.  They are preparing for the end of the fiat currency and riots. permalink parent award report block reply\nQSWO1 1 points 5 hours ago Well uh... permalink parent award report block reply\nMaga305_47 3 points 10 hours ago Seems as if every installed candidate that campaign against walls, are fast to erect them once they are in office. permalink award report block reply\nWanderingStar 3 points 8 hours ago Bunker mentality. permalink award report block reply\nSide_o_beef_curtains 3 points 8 hours ago As is the tradition of her people. In Israel. permalink award report block reply\nMyGrandpa4 1 points 5 hours ago The Presidential Palace seems excessive. permalink award report block reply",
  "fetched_at": "2025-11-12T23:05:45.922400Z"
}