{
  "id": "1ARK5148YD",
  "url": "https://patriots.win/p/1ARK5148YD/socialist-hypocrisy-newly-electe/c",
  "content": "1456 Socialist Hypocrisy: Newly Elected NYC Mayor Zohran Mamdani BEGS for Donations Less Than 24 Hours After His Win — Wants ‘Everything Free’ but Needs YOUR Money to Make It Happen (www.thegatewaypundit.com) 🤡🌎  HONK  HONK  🌎🤡 posted 6 days ago by Trick 176 comments award share report block Socialist Hypocrisy: Newly Elected NYC Mayor Zohran Mamdani BEGS for Donations Less Than 24 Hours After His Win — Wants ‘Everyth... Newly elected New York City Mayor Zohran Mamdani wasted no time exposing the glaring hypocrisy at the heart of his radical agenda. www.thegatewaypundit.com\n176 comments Sort by Top Top New Worst Old Save Side_o_beef_curtains 131 points 6 days ago \"I need to take your money to provide you with free stuff that you may or may not want.\" - every socialist retard, ever. permalink award report block reply mikethemarine 31 points 6 days ago listen to what this fuck says about where he is going to get information on how to run the government, I will be getting help from people around the state, country and the WORLD, to help tell me how to run this city. WHO do you think he's talking about? How does he now implement Sharia law The U.K. and all the other Muslims around the world Sharia law is not implemented in the UK, which maintains that its laws take precedence, though Sharia councils exist to provide advice on civil matters like marriage and divorce from an Islamic perspective; their rulings are non-binding. In Muslim-majority countries, Sharia law is incorporated at varying levels, often influencing family law but integrated with secular legal frameworks, although this varies significantly by country. Non-binding councils: Sharia councils in the UK offer recommendations on family law and other civil matters based on Islamic principles. permalink parent award report block reply ThouShallNotSteal 12 points 6 days ago \"to help tell me how to RUIN this city.\" FIFY permalink parent award report block reply deleted 8 points 6 days ago KernalMustard 1 points 6 days ago Hes a commie first muslim second. permalink parent award report block reply TwoArizonaPedes 6 points 6 days ago No Muslim is a Muslim \"second.\" They might tell you that, but they lie. permalink parent award report block reply booblitchutz 2 points 6 days ago He's using the commies, the commies are using the democrats. Nobody on that side is telling the truth about their intentions and they're all perfectly fine with that. permalink parent award report block reply RememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply mcoulton 4 points 6 days ago it is about binding arbitration, a normal arbitrator uses common law to decide cases, a sharia arbitrator uses sharia to make a decision, the people know that if they don’t agree, they will be ostracized permalink parent award report block reply Tacitus1963 2 points 6 days ago Watch this video- 10 mins- to see how much worse Mamdani actually is. https://youtu.be/KvnUIfvYV_E?si=O0BElYYCjGj8eGjO permalink parent award report block reply whiter5fx 1 points 6 days ago So bullshit permalink parent award report block reply load 12 more comments... bck- 10 points 6 days ago “Sorry the free stuff you applied for is declined because you make too much money “ permalink parent award report block reply permissible_missile 7 points 6 days ago you paid for* permalink parent award report block reply Hanging_Chad 8 points 6 days ago https://files.catbox.moe/dkkba3.gif permalink parent award report block reply TwoArizonaPedes 5 points 6 days ago His masks slips a little more. In the Islamic world view, it is the role of non-Muslims to support Muslims with goods, services, money, whatever the Muslims want. permalink parent award report block reply BejewelledBadger 3 points 6 days ago ...and even the part you might want will end up sucking because they always go over budget and behind schedule. permalink parent award report block reply load 2 more comments... BeauHD 33 points 6 days ago He is going to be more \"omnidirectional\" than even Lindsey Graham to get what he wants. Incoming Shariah Law and murdering of Jews. I see the NY financial sector moving elsewhere because lending is against their rules. permalink award report block reply Wehavelawsforareason 27 points 6 days ago 76% of Jews voted for Kamala even after the whole 2 years of the Free palestine bullshit. I hope they get what they deserve. permalink parent award report block reply PhantomShield72 27 points 6 days ago Somehow they never do. permalink parent award report block reply 1776er 7 points 6 days ago Laughs in Holocaust and Spanish Inquisition and kicked out of every Arab country etc… permalink parent award report block reply PhantomShield72 7 points 6 days ago How solidly were those lessons learned? permalink parent award report block reply view 5 more comments... Dangerous 3 points 6 days ago The Holocaust is victim porn revisionist history The Spanish Inquisition was actually incredibly lenient compared to its historical betrayal Jews were often high ranking administrators in Muslim societies, especially in Spain during the conquest era permalink parent award report block reply view 2 more comments... rebuildingMyself 7 points 6 days ago They don't really have to care since they all have only one foot in this country to begin with.  Even ones fleeing due to crimes are welcome into Israel with open arms and zero risk of extradition permalink parent award report block reply emorphia 2 points 6 days ago 65% of NYC jews voted for either cuomo or sliwa , 35% of jews in NYC voted for the muslim commie.   but yeah , most of them voted for kamala last time.   its still NYC , leftie hellhole. permalink parent award report block reply KernalMustard 1 points 6 days ago Vote blue no matter who. Brainwashed. permalink parent award report block reply Sunnybat2 11 points 6 days ago Remove KEBAB permalink parent award report block reply MatthiasBlack 4 points 6 days ago I hope the Texas Stock Exchange gets taken as a serious option. Right now it's only being eyed at by energy companies, but with energy so many other industries could follow. permalink parent award report block reply Shayhawk 3 points 6 days ago I hope New Yorkers get EXACTLY what they voted for... permalink parent award report block reply emorphia 1 points 6 days ago they can borrow money for a house or so ... they are not allowed to pay interest according to islam.  (in other words, they want the money but they found a way to not pay interest on the loan) permalink parent award report block reply load 5 more comments... rebuildingMyself 22 points 6 days ago First they politely ask, then they'll take it anyway when you say no. permalink award report block reply Say_what_again 8 points 6 days ago Which is the only reason you need to prove conclusively that socialism / communism are inherently evil. permalink parent award report block reply cd3dog 17 points 6 days ago Buyer's remorse yet? permalink award report block reply DT170x 25 points 6 days ago Nah, the Democrats will grit their teeth and say it was not real socialism. permalink parent award report block reply Belenus 7 points 6 days ago Or blame everyone else for any number of reasons and attempt to avoid the responsibility of their own actions as long as possible. permalink parent award report block reply USDMaga 7 points 6 days ago The way it works is someone on TV will say some obvious BS story about how all the problems are Trump's fault. They will then belive the story despite knowing it is a lie and seeing proof it is a lie because the guy on TV said it. Arguing with liberals is retarded.  They are dumber than rocks. permalink parent award report block reply Dangerous 2 points 6 days ago They aren't merely dumb, they are successfully humiliated. Liars often get what is called a \"Dupers high\" when they know they have successfully lied, well those who were tricked sink into a sunken cost cope where they cannot admit they were wrong. This is used to manipulate millions of dull bulbs and is central to Leftist/Jewish humiliation ritual. The other half is then using this massive body of dupes to cower those who weren't tricked into silence, humiliating them for failing to act We can see the Jewish factions of the \"right\" playing this whole spiel out now over Charlie Kirk and the \"Woke Right\" nonsense. permalink parent award report block reply YaharaRiver 1 points 6 days ago 🙄 muslim projection, using the trick “Make it look jewish!” to layer on multiple instances of deception. If only we could measure YOUR “duper’s high” I bet it’s off the charts right now! permalink parent award report block reply SteelBallRun1890 4 points 6 days ago They would have already felt it at his celebration party where he had a cash bar and there were no free drinks lol permalink parent award report block reply IncredibleMrE1 13 points 6 days ago I am once again asking for your money permalink award report block reply IllKissYourBoobies 2 points 6 days ago Came here for this. permalink parent award report block reply Aquamine-Amarine 1 points 6 days ago No refunds. permalink parent award report block reply 24601 13 points 6 days ago Communism always results in a violent non-functional society. permalink award report block reply ChyNahAzzWhole1 9 points 6 days ago Transition Money... to put people with integrity in positions of power... LOL! 18-30 WHITE CUNTS! Will you post your failures like you posted your support? He's going to defund the cops, allow \"morality patrols\" and if you get harmed, oh well. permalink award report block reply TGNX 7 points 6 days ago Were they white or were they \"white.\" permalink parent award report block reply Aquamine-Amarine 3 points 6 days ago Are they even female? Can a biologist confirm? permalink parent award report block reply PhantomShield72 2 points 6 days ago (((White))) permalink parent award report block reply hey_spike 1 points 6 days ago NYC government track record is corruption.  Start the opposition research on the transition team. Follow money trails. Check the financial disclosure statements. permalink parent award report block reply canada_is_communist 0 points 6 days ago Tbf at this point morality parole doesnt sound so bad permalink parent award report block reply obamagavemeaphone 7 points 6 days ago So basically, he Sally Struthers begging for money to feed the savages... permalink award report block reply PhantomShield72 7 points 6 days ago Typical commie. Can't even come up with his own \"I am once again asking for...\" speech - he has to steal the one Bernie Sanders has been peddling for decades. Sad... permalink award report block reply RogueLeaderX 6 points 6 days ago Hypocritical piece of shit maligns billionaires and has been photographed with them constantly. permalink award report block reply MisterMAGA 6 points 6 days ago Oh, and one more thing—remember how I told you a few months ago to stop sending us money? You can start again. This transition requires staff, research, and an infrastructure that can meet this moment, and it will be made possible by the people who built and believe in this movement. So I hope you’ll make a donation at Transition2025.com. permalink award report block reply linthat22 4 points 6 days ago Brought to you by ActBlue permalink parent award report block reply spinometer2 6 points 6 days ago how is this hypocrisy? this is exactly what he promised, to take for money and give it away (to himself) permalink award report block reply Shayhawk 6 points 6 days ago It wears the burka on its head or it gets the whip again... permalink award report block reply Hawksendoom 3 points 6 days ago funny fellow hawk ;) permalink parent award report block reply Dev404 5 points 6 days ago He's from a RICH family and wants more money. Typical champagne socialist. Another AOC/Bernie Sanders, but this one wants to blow you up instead of just robbing you. Make no mistake, he's going to rob you, too. permalink award report block reply Justlooking250 4 points 6 days ago Fuck off you commie retard permalink award report block reply RobinNet 1 points 6 days ago He's a male AOC, but more fucktarded and without a sweet rack & bubble butt. permalink parent award report block reply Live_free_or_die_55 3 points 6 days ago Deport him back to his goats 🐐 permalink award report block reply Liberats 3 points 6 days ago There is no 'free'. It's always someone else's money. permalink award report block reply hey_spike 2 points 6 days ago Out of state and foreign donors will suddenly lose interest. permalink award report block reply coffee_grdr 2 points 6 days ago i knew it... hes just trying to pad his own wallet! this guy was a socialist, now that he's mayor, he's in the \"make myself rich\" business. as jayz once said \"im not a businessman, i'm a business, man!\" permalink award report block reply TGNX 2 points 6 days ago It's not hypocrisy. permalink award report block reply IllKissYourBoobies 2 points 6 days ago Wait! No one every told me you needed MY money!?!????? permalink award report block reply FredRedd 2 points 6 days ago As GEOTUS said yesterday; \"And so it begins...\" permalink award report block reply NonyaDB 2 points 6 days ago \"On Wednesday, Communist Zohran Mamdani announced his all-female transition team for City Hall.\" LOL, that commies thinks he's Muammar Gaddafi. permalink award report block reply nomoreprinkles 2 points 6 days ago All smart states should immediately employ a 100% tariff on new yorkers. permalink award report block reply OnlyTrump20 1 points 6 days ago Can they at least check their voting records to verify they voted for this communist scum, or any other D?   I don't think true MAGA folks need to be punished. permalink parent award report block reply zoom19911991 2 points 6 days ago 🤡 permalink award report block reply lucifer_fit_deus 2 points 6 days ago What hypocrisy?  Isn’t that precisely how socialism is supposed to work? permalink award report block reply Tyscribz 2 points 6 days ago Right now , he just asking ... 😟 permalink award report block reply snoozeflu 2 points 6 days ago They voted for this guy and now they have started to flee New York and move to red states where they will continue to vote the same way. permalink award report block reply Luckycoz 2 points 6 days ago Gibs cost a shitload of money. permalink award report block reply TheSonOfGadsden 2 points 6 days ago He basically did the bernie sanders meme “I am once again asking you” permalink award report block reply NonbinaryPotatohead 2 points 6 days ago LOL why doesn't his BILLIONAIRE friend Alex Soros donate? permalink award report block reply YaharaRiver 1 points 6 days ago Draining YOUR accounts is fast, easy, and safe.  Soros will want something in return, and can hurt you if you break the agreement (which is always 100% with muslims). permalink parent award report block reply DCYR66 2 points 6 days ago 🖕I got plenty of these if he wants them. permalink award report block reply AmannamedRJ 2 points 6 days ago What's the lowest price memecoin we can donate 1 of to NYC? permalink award report block reply IncredibleMrE1 7 points 6 days ago A US dollar permalink parent award report block reply Beelzy 2 points 6 days ago Lol permalink parent award report block reply linthat22 1 points 6 days ago Fartcoin permalink parent award report block reply Granny 2 points 6 days ago This fool Mamdami doesn't realize that he'd better not make an enemy of Geotus. Very soon he's going to need him!!! permalink award report block reply linthat22 2 points 6 days ago Y'all see who is handling the transition money? Fuckin' ActBlue 🙄 permalink award report block reply canada_is_communist 1 points 6 days ago Well thats what socialism is lol. Someone else has to pay for it. See: Quebec permalink award report block reply thisisatestof2 1 points 6 days ago How long is he begging for money, again, after saying no more political insiders, new way of doing business essentially, he appointed all NYC political insiders who worked for previous administrations in high levels permalink award report block reply AmericanJawa 1 points 6 days ago What a surprise The Communist lies permalink award report block reply RobinNet 1 points 6 days ago First flaw of Socialism: You can't create wealth by dividing it, only by multiplying it. permalink award report block reply Glenlaw 1 points 6 days ago If I see Momdani on the street in NYC I will certainly spare him a dollar.  Unless I see a homeless person on the street.  In which case I will give the homeless person my dollar. permalink award report block reply HockeyMom4Trump 1 points 6 days ago He and his wife are trouble. He is giving Zelensky…watch your wallet. permalink award report block reply DJT4MoreYears 1 points 6 days ago I bet Soros and other billionaire globalists funnel billions to Mamdani and NYC to feed the cancer that Mamdani has started on the American people there.  We all think , Oh the billionaires will all leave NYC and it'll go broke. I bet not. It'll be funded and fueled by globalist money to rot NYC and it'll spread outward. permalink award report block reply hey_spike 1 points 6 days ago Transition team all want new cars. permalink award report block reply MonolitoVeritas 1 points 6 days ago that has always been the problem with socialism...eventually you run out of others peoples money....and then you have equality. Everybody is equally unhappy ... in other words what most democrats always are-unhappy. permalink award report block reply BeanieRed 1 points 6 days ago So, not free just like SNAP benefits.  I swear most of the nation needs a civics and economic education.  We should cancel all TV and make everyone pass those courses.  If you can’t, you don’t get the benefits and you can’t vote. permalink award report block reply Carmen1956 1 points 6 days ago NY, you get what you deserve.  IQ test before you are allowed to vote! permalink award report block reply TheRPatriot 1 points 6 days ago Imagine Cuomo pulls a Pinochet and says fuck this and takes over anyways…. lol I should write comic books permalink award report block reply unotrumpcard 3 points 6 days ago Imagine if Trump ripped of his shirt to reveal a six pack and then he punched the deepstate in the mouth xD Imagine tho, imagine. permalink parent award report block reply TheRPatriot 1 points 6 days ago While flying on a giant bald eagle? permalink parent award report block reply Smcnelly 1 points 6 days ago Will all the riggers that have voted for him don’t have any money to send him. They just want free stuff. permalink award report block reply TOPDAWG23 1 points 6 days ago this retard is not going to %90 of what he said. permalink award report block reply chefjeffb 1 points 6 days ago Since when does a mayor have the authority to do any of the shit he's proposing, lol permalink award report block reply RickSanchezC137 1 points 6 days ago Isnt his dad a multi billionaire in Turkey? Go beg your dad. permalink award report block reply LawyersPlayDota 1 points 6 days ago This is going to be the funniest fucking time in new york. Shithole is going to be on fire within six months. permalink award report block reply stephen 1 points 6 days ago Coming to a city near you permalink award report block reply canada_is_communist 1 points 6 days ago I checked and the tax rate in new York is already 50% for moderate/high earners. This is for a city with one of the higest cost of living in the world, second only to Zurich and a few others tax havens (monaco?). How exactly does he plan to get more money to pay for his trash programs? permalink award report block reply ParticleCannon 1 points 6 days ago He's asking now. But soon he won't ask. permalink award report block reply TonyIommi123 1 points 6 days ago That's like a child asking me for money to buy me an ugly ass tie for CHRISTmas. permalink award report block reply duznmatter 1 points 6 days ago Here comes the donations from foreign muslim countries by the millions maybe even billions. Watch and see. permalink award report block reply YaharaRiver 1 points 6 days ago Zoloft already looks homeless, fucking SCRUB. permalink award report block reply BrookieDragon 1 points 6 days ago I saw this and thought it was an AI video to smear him. You telling me he actually said this? permalink award report block reply Jimmyprawns 1 points 6 days ago It's the new bernie_sanders_begging_for_more_donations.jpeg permalink award report block reply ChewySoap 1 points 6 days ago Strategically, look at his alliance with Soros. They will get funding from big donors, that was almost assuredly set up before the election. It will pay for the bribes he needs to get things moving in NY. It will be sustainable for long enough to build good sentiment and prop this asshole up as the DSA face of the party. Socialism and Communism don't fail off the bat, it takes time for everyone in a position of authority to try to slice off their piece to get ahead of others, once the big donor money runs out, that's when everything collapses.\nThey will be able to string this along for a while permalink award report block reply brobama123 1 points 6 days ago They should have homeless people drive the bus in exchange for living on it. permalink award report block reply ncswicn 1 points 6 days ago 🍿🍿🍿🍿 permalink award report block reply Winter_Is_Coming2020 1 points 6 days ago Fake permalink award report block reply Easzq8 1 points 6 days ago Run of the mill commie. permalink award report block reply MajorClark 1 points 6 days ago White liberals in NYC owe him so he can support lazy people who don't want to work or pay their own way. permalink award report block reply Forty_Five 1 points 6 days ago It's terrifying that half the country is in a cult. permalink award report block reply YaharaRiver 1 points 6 days ago Settle down, lol. Nowhere NEAR half.  It’s the same small group that uses theatrics, paid crowds, baloney “testimonies” and sophisticated overreach (mostly illegal as F) to manipulate the image they’re going for. The desired image has shifted from religion of peace to helpless refugees to today: Super-Doop Excited About Sharia! permalink parent award report block reply Forty_Five 1 points 6 days ago Yet they continue to vote for it. permalink parent award report block reply TheHandofGodzilla 1 points 6 days ago Best candidate for the Antichrist I’ve seen in awhile permalink award report block reply Stormeyworld13 1 points 6 days ago What a stupid ass ugly man. He's so fake. Where is he going to get all the money that he promised those morons who voted for him? I hope he's deported! permalink award report block reply Induceddrag 1 points 6 days ago I learned an important lesson from working for an agency that was constantly taking equipment from the military re-use program.  There is nothing more expensive than “free.” permalink award report block reply GrizzlyT55 1 points 6 days ago Nothing is more expensive than a \"free government\" program. permalink award report block reply Noseeboh 1 points 6 days ago Let NY enjoy their socialism. Great example to the rest of the country of what NOT to do. permalink award report block reply Rock9Head 1 points 6 days ago How much will get pilfered and kicked back to nefarious players? permalink award report block reply 0Tolerence4Horseshit 1 points 6 days ago I have nothing to say, other than I'm thoroughly disgusted. Fuck New York, and fuck that Commie shit stirring faggot. permalink award report block reply knnbccb 1 points 6 days ago Are you surprised? Basically same as his comrades AOC and Bernie. permalink award report block reply MorningFrost 1 points 6 days ago One thing you can count on. No Transparency, and No Integrity. permalink award report block reply SavingPrivateGrace 1 points 6 days ago His transition team are experienced handlers from the Biden regime, puppet masters.  All he needs to do is say the lines to the camera because he's a good actor and can memorize or read the lines being fed to him. permalink award report block reply jhewish 1 points 6 days ago I need you to give me 10 dollars so that I can give you back 1 dollar. permalink award report block reply mateus 1 points 6 days ago Old News! LMAO I used that less than 24 hours blip when I posted it here.. 17 hours ago.🤣 permalink award report block reply Zarlino 1 points 6 days ago Not gonna lie id laugh if somebody blew this Fsggot away permalink award report block reply that_guy_pming_tits 1 points 6 days ago Donations for what? He already won… permalink award report block reply lispboy 1 points 6 days ago Never thought NYC could do worse than Warren Wilhelm Jr., but here we are. permalink award report block reply Idontevenknow 1 points 6 days ago Yes, now is the personal wealth generation phase of the grift. It continues until they are removed. permalink award report block reply Cyber1776 0 points 6 days ago Hypocrisy is a sign of power permalink award report block reply OTher55 0 points 6 days ago New York deserves him permalink award report block reply FullyDilated 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Eruditio 0 points 6 days ago Just raise taxes. This is what NYC voted for!!! permalink award report block reply RudeFrog 0 points 6 days ago Honestly starting to think about just voting for the worst candidates so we can just burn the whole place down and start over. Probably be much better for my mental health. permalink award report block reply yodayoda 0 points 6 days ago I really bore of the \"this crazy libtard did this! that crazy libtard did that!\" that the forum has degenerated into. permalink award report block reply MEME-SUPREME 0 points 6 days ago 🍿🍿🍿 permalink award report block reply barwhack 0 points 6 days ago I hate NY. permalink award report block reply Always_a_Marine 0 points 6 days ago Someday, a real rain will come and purge them from our streets. ✝️🇺🇲💯 permalink award report block reply daveyistheman 0 points 6 days ago Anybody who donated to a politician is a fucking retard. Doesn't matter what side of the aisle permalink award report block reply NebraskanPatriot -1 points 6 days ago Um...we did the same exact thing, no? permalink award report block reply RememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply FullyDilated 0 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply SCHULTZ -1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nSide_o_beef_curtains 131 points 6 days ago \"I need to take your money to provide you with free stuff that you may or may not want.\" - every socialist retard, ever. permalink award report block reply mikethemarine 31 points 6 days ago listen to what this fuck says about where he is going to get information on how to run the government, I will be getting help from people around the state, country and the WORLD, to help tell me how to run this city. WHO do you think he's talking about? How does he now implement Sharia law The U.K. and all the other Muslims around the world Sharia law is not implemented in the UK, which maintains that its laws take precedence, though Sharia councils exist to provide advice on civil matters like marriage and divorce from an Islamic perspective; their rulings are non-binding. In Muslim-majority countries, Sharia law is incorporated at varying levels, often influencing family law but integrated with secular legal frameworks, although this varies significantly by country. Non-binding councils: Sharia councils in the UK offer recommendations on family law and other civil matters based on Islamic principles. permalink parent award report block reply ThouShallNotSteal 12 points 6 days ago \"to help tell me how to RUIN this city.\" FIFY permalink parent award report block reply deleted 8 points 6 days ago KernalMustard 1 points 6 days ago Hes a commie first muslim second. permalink parent award report block reply TwoArizonaPedes 6 points 6 days ago No Muslim is a Muslim \"second.\" They might tell you that, but they lie. permalink parent award report block reply booblitchutz 2 points 6 days ago He's using the commies, the commies are using the democrats. Nobody on that side is telling the truth about their intentions and they're all perfectly fine with that. permalink parent award report block reply RememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply mcoulton 4 points 6 days ago it is about binding arbitration, a normal arbitrator uses common law to decide cases, a sharia arbitrator uses sharia to make a decision, the people know that if they don’t agree, they will be ostracized permalink parent award report block reply Tacitus1963 2 points 6 days ago Watch this video- 10 mins- to see how much worse Mamdani actually is. https://youtu.be/KvnUIfvYV_E?si=O0BElYYCjGj8eGjO permalink parent award report block reply whiter5fx 1 points 6 days ago So bullshit permalink parent award report block reply load 12 more comments... bck- 10 points 6 days ago “Sorry the free stuff you applied for is declined because you make too much money “ permalink parent award report block reply permissible_missile 7 points 6 days ago you paid for* permalink parent award report block reply Hanging_Chad 8 points 6 days ago https://files.catbox.moe/dkkba3.gif permalink parent award report block reply TwoArizonaPedes 5 points 6 days ago His masks slips a little more. In the Islamic world view, it is the role of non-Muslims to support Muslims with goods, services, money, whatever the Muslims want. permalink parent award report block reply BejewelledBadger 3 points 6 days ago ...and even the part you might want will end up sucking because they always go over budget and behind schedule. permalink parent award report block reply load 2 more comments...\nmikethemarine 31 points 6 days ago listen to what this fuck says about where he is going to get information on how to run the government, I will be getting help from people around the state, country and the WORLD, to help tell me how to run this city. WHO do you think he's talking about? How does he now implement Sharia law The U.K. and all the other Muslims around the world Sharia law is not implemented in the UK, which maintains that its laws take precedence, though Sharia councils exist to provide advice on civil matters like marriage and divorce from an Islamic perspective; their rulings are non-binding. In Muslim-majority countries, Sharia law is incorporated at varying levels, often influencing family law but integrated with secular legal frameworks, although this varies significantly by country. Non-binding councils: Sharia councils in the UK offer recommendations on family law and other civil matters based on Islamic principles. permalink parent award report block reply ThouShallNotSteal 12 points 6 days ago \"to help tell me how to RUIN this city.\" FIFY permalink parent award report block reply deleted 8 points 6 days ago KernalMustard 1 points 6 days ago Hes a commie first muslim second. permalink parent award report block reply TwoArizonaPedes 6 points 6 days ago No Muslim is a Muslim \"second.\" They might tell you that, but they lie. permalink parent award report block reply booblitchutz 2 points 6 days ago He's using the commies, the commies are using the democrats. Nobody on that side is telling the truth about their intentions and they're all perfectly fine with that. permalink parent award report block reply RememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply mcoulton 4 points 6 days ago it is about binding arbitration, a normal arbitrator uses common law to decide cases, a sharia arbitrator uses sharia to make a decision, the people know that if they don’t agree, they will be ostracized permalink parent award report block reply Tacitus1963 2 points 6 days ago Watch this video- 10 mins- to see how much worse Mamdani actually is. https://youtu.be/KvnUIfvYV_E?si=O0BElYYCjGj8eGjO permalink parent award report block reply whiter5fx 1 points 6 days ago So bullshit permalink parent award report block reply load 12 more comments...\nThouShallNotSteal 12 points 6 days ago \"to help tell me how to RUIN this city.\" FIFY permalink parent award report block reply\ndeleted 8 points 6 days ago KernalMustard 1 points 6 days ago Hes a commie first muslim second. permalink parent award report block reply TwoArizonaPedes 6 points 6 days ago No Muslim is a Muslim \"second.\" They might tell you that, but they lie. permalink parent award report block reply booblitchutz 2 points 6 days ago He's using the commies, the commies are using the democrats. Nobody on that side is telling the truth about their intentions and they're all perfectly fine with that. permalink parent award report block reply RememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nKernalMustard 1 points 6 days ago Hes a commie first muslim second. permalink parent award report block reply TwoArizonaPedes 6 points 6 days ago No Muslim is a Muslim \"second.\" They might tell you that, but they lie. permalink parent award report block reply booblitchutz 2 points 6 days ago He's using the commies, the commies are using the democrats. Nobody on that side is telling the truth about their intentions and they're all perfectly fine with that. permalink parent award report block reply\nTwoArizonaPedes 6 points 6 days ago No Muslim is a Muslim \"second.\" They might tell you that, but they lie. permalink parent award report block reply\nbooblitchutz 2 points 6 days ago He's using the commies, the commies are using the democrats. Nobody on that side is telling the truth about their intentions and they're all perfectly fine with that. permalink parent award report block reply\nRememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nmcoulton 4 points 6 days ago it is about binding arbitration, a normal arbitrator uses common law to decide cases, a sharia arbitrator uses sharia to make a decision, the people know that if they don’t agree, they will be ostracized permalink parent award report block reply\nTacitus1963 2 points 6 days ago Watch this video- 10 mins- to see how much worse Mamdani actually is. https://youtu.be/KvnUIfvYV_E?si=O0BElYYCjGj8eGjO permalink parent award report block reply\nwhiter5fx 1 points 6 days ago So bullshit permalink parent award report block reply\nbck- 10 points 6 days ago “Sorry the free stuff you applied for is declined because you make too much money “ permalink parent award report block reply permissible_missile 7 points 6 days ago you paid for* permalink parent award report block reply\npermissible_missile 7 points 6 days ago you paid for* permalink parent award report block reply\nHanging_Chad 8 points 6 days ago https://files.catbox.moe/dkkba3.gif permalink parent award report block reply\nTwoArizonaPedes 5 points 6 days ago His masks slips a little more. In the Islamic world view, it is the role of non-Muslims to support Muslims with goods, services, money, whatever the Muslims want. permalink parent award report block reply\nBejewelledBadger 3 points 6 days ago ...and even the part you might want will end up sucking because they always go over budget and behind schedule. permalink parent award report block reply\nBeauHD 33 points 6 days ago He is going to be more \"omnidirectional\" than even Lindsey Graham to get what he wants. Incoming Shariah Law and murdering of Jews. I see the NY financial sector moving elsewhere because lending is against their rules. permalink award report block reply Wehavelawsforareason 27 points 6 days ago 76% of Jews voted for Kamala even after the whole 2 years of the Free palestine bullshit. I hope they get what they deserve. permalink parent award report block reply PhantomShield72 27 points 6 days ago Somehow they never do. permalink parent award report block reply 1776er 7 points 6 days ago Laughs in Holocaust and Spanish Inquisition and kicked out of every Arab country etc… permalink parent award report block reply PhantomShield72 7 points 6 days ago How solidly were those lessons learned? permalink parent award report block reply view 5 more comments... Dangerous 3 points 6 days ago The Holocaust is victim porn revisionist history The Spanish Inquisition was actually incredibly lenient compared to its historical betrayal Jews were often high ranking administrators in Muslim societies, especially in Spain during the conquest era permalink parent award report block reply view 2 more comments... rebuildingMyself 7 points 6 days ago They don't really have to care since they all have only one foot in this country to begin with.  Even ones fleeing due to crimes are welcome into Israel with open arms and zero risk of extradition permalink parent award report block reply emorphia 2 points 6 days ago 65% of NYC jews voted for either cuomo or sliwa , 35% of jews in NYC voted for the muslim commie.   but yeah , most of them voted for kamala last time.   its still NYC , leftie hellhole. permalink parent award report block reply KernalMustard 1 points 6 days ago Vote blue no matter who. Brainwashed. permalink parent award report block reply Sunnybat2 11 points 6 days ago Remove KEBAB permalink parent award report block reply MatthiasBlack 4 points 6 days ago I hope the Texas Stock Exchange gets taken as a serious option. Right now it's only being eyed at by energy companies, but with energy so many other industries could follow. permalink parent award report block reply Shayhawk 3 points 6 days ago I hope New Yorkers get EXACTLY what they voted for... permalink parent award report block reply emorphia 1 points 6 days ago they can borrow money for a house or so ... they are not allowed to pay interest according to islam.  (in other words, they want the money but they found a way to not pay interest on the loan) permalink parent award report block reply load 5 more comments...\nWehavelawsforareason 27 points 6 days ago 76% of Jews voted for Kamala even after the whole 2 years of the Free palestine bullshit. I hope they get what they deserve. permalink parent award report block reply PhantomShield72 27 points 6 days ago Somehow they never do. permalink parent award report block reply 1776er 7 points 6 days ago Laughs in Holocaust and Spanish Inquisition and kicked out of every Arab country etc… permalink parent award report block reply PhantomShield72 7 points 6 days ago How solidly were those lessons learned? permalink parent award report block reply view 5 more comments... Dangerous 3 points 6 days ago The Holocaust is victim porn revisionist history The Spanish Inquisition was actually incredibly lenient compared to its historical betrayal Jews were often high ranking administrators in Muslim societies, especially in Spain during the conquest era permalink parent award report block reply view 2 more comments... rebuildingMyself 7 points 6 days ago They don't really have to care since they all have only one foot in this country to begin with.  Even ones fleeing due to crimes are welcome into Israel with open arms and zero risk of extradition permalink parent award report block reply emorphia 2 points 6 days ago 65% of NYC jews voted for either cuomo or sliwa , 35% of jews in NYC voted for the muslim commie.   but yeah , most of them voted for kamala last time.   its still NYC , leftie hellhole. permalink parent award report block reply KernalMustard 1 points 6 days ago Vote blue no matter who. Brainwashed. permalink parent award report block reply\nPhantomShield72 27 points 6 days ago Somehow they never do. permalink parent award report block reply 1776er 7 points 6 days ago Laughs in Holocaust and Spanish Inquisition and kicked out of every Arab country etc… permalink parent award report block reply PhantomShield72 7 points 6 days ago How solidly were those lessons learned? permalink parent award report block reply view 5 more comments... Dangerous 3 points 6 days ago The Holocaust is victim porn revisionist history The Spanish Inquisition was actually incredibly lenient compared to its historical betrayal Jews were often high ranking administrators in Muslim societies, especially in Spain during the conquest era permalink parent award report block reply view 2 more comments...\n1776er 7 points 6 days ago Laughs in Holocaust and Spanish Inquisition and kicked out of every Arab country etc… permalink parent award report block reply PhantomShield72 7 points 6 days ago How solidly were those lessons learned? permalink parent award report block reply view 5 more comments... Dangerous 3 points 6 days ago The Holocaust is victim porn revisionist history The Spanish Inquisition was actually incredibly lenient compared to its historical betrayal Jews were often high ranking administrators in Muslim societies, especially in Spain during the conquest era permalink parent award report block reply view 2 more comments...\nPhantomShield72 7 points 6 days ago How solidly were those lessons learned? permalink parent award report block reply view 5 more comments...\nDangerous 3 points 6 days ago The Holocaust is victim porn revisionist history The Spanish Inquisition was actually incredibly lenient compared to its historical betrayal Jews were often high ranking administrators in Muslim societies, especially in Spain during the conquest era permalink parent award report block reply view 2 more comments...\nrebuildingMyself 7 points 6 days ago They don't really have to care since they all have only one foot in this country to begin with.  Even ones fleeing due to crimes are welcome into Israel with open arms and zero risk of extradition permalink parent award report block reply\nemorphia 2 points 6 days ago 65% of NYC jews voted for either cuomo or sliwa , 35% of jews in NYC voted for the muslim commie.   but yeah , most of them voted for kamala last time.   its still NYC , leftie hellhole. permalink parent award report block reply\nKernalMustard 1 points 6 days ago Vote blue no matter who. Brainwashed. permalink parent award report block reply\nSunnybat2 11 points 6 days ago Remove KEBAB permalink parent award report block reply\nMatthiasBlack 4 points 6 days ago I hope the Texas Stock Exchange gets taken as a serious option. Right now it's only being eyed at by energy companies, but with energy so many other industries could follow. permalink parent award report block reply\nShayhawk 3 points 6 days ago I hope New Yorkers get EXACTLY what they voted for... permalink parent award report block reply\nemorphia 1 points 6 days ago they can borrow money for a house or so ... they are not allowed to pay interest according to islam.  (in other words, they want the money but they found a way to not pay interest on the loan) permalink parent award report block reply\nrebuildingMyself 22 points 6 days ago First they politely ask, then they'll take it anyway when you say no. permalink award report block reply Say_what_again 8 points 6 days ago Which is the only reason you need to prove conclusively that socialism / communism are inherently evil. permalink parent award report block reply\nSay_what_again 8 points 6 days ago Which is the only reason you need to prove conclusively that socialism / communism are inherently evil. permalink parent award report block reply\ncd3dog 17 points 6 days ago Buyer's remorse yet? permalink award report block reply DT170x 25 points 6 days ago Nah, the Democrats will grit their teeth and say it was not real socialism. permalink parent award report block reply Belenus 7 points 6 days ago Or blame everyone else for any number of reasons and attempt to avoid the responsibility of their own actions as long as possible. permalink parent award report block reply USDMaga 7 points 6 days ago The way it works is someone on TV will say some obvious BS story about how all the problems are Trump's fault. They will then belive the story despite knowing it is a lie and seeing proof it is a lie because the guy on TV said it. Arguing with liberals is retarded.  They are dumber than rocks. permalink parent award report block reply Dangerous 2 points 6 days ago They aren't merely dumb, they are successfully humiliated. Liars often get what is called a \"Dupers high\" when they know they have successfully lied, well those who were tricked sink into a sunken cost cope where they cannot admit they were wrong. This is used to manipulate millions of dull bulbs and is central to Leftist/Jewish humiliation ritual. The other half is then using this massive body of dupes to cower those who weren't tricked into silence, humiliating them for failing to act We can see the Jewish factions of the \"right\" playing this whole spiel out now over Charlie Kirk and the \"Woke Right\" nonsense. permalink parent award report block reply YaharaRiver 1 points 6 days ago 🙄 muslim projection, using the trick “Make it look jewish!” to layer on multiple instances of deception. If only we could measure YOUR “duper’s high” I bet it’s off the charts right now! permalink parent award report block reply SteelBallRun1890 4 points 6 days ago They would have already felt it at his celebration party where he had a cash bar and there were no free drinks lol permalink parent award report block reply\nDT170x 25 points 6 days ago Nah, the Democrats will grit their teeth and say it was not real socialism. permalink parent award report block reply Belenus 7 points 6 days ago Or blame everyone else for any number of reasons and attempt to avoid the responsibility of their own actions as long as possible. permalink parent award report block reply\nBelenus 7 points 6 days ago Or blame everyone else for any number of reasons and attempt to avoid the responsibility of their own actions as long as possible. permalink parent award report block reply\nUSDMaga 7 points 6 days ago The way it works is someone on TV will say some obvious BS story about how all the problems are Trump's fault. They will then belive the story despite knowing it is a lie and seeing proof it is a lie because the guy on TV said it. Arguing with liberals is retarded.  They are dumber than rocks. permalink parent award report block reply Dangerous 2 points 6 days ago They aren't merely dumb, they are successfully humiliated. Liars often get what is called a \"Dupers high\" when they know they have successfully lied, well those who were tricked sink into a sunken cost cope where they cannot admit they were wrong. This is used to manipulate millions of dull bulbs and is central to Leftist/Jewish humiliation ritual. The other half is then using this massive body of dupes to cower those who weren't tricked into silence, humiliating them for failing to act We can see the Jewish factions of the \"right\" playing this whole spiel out now over Charlie Kirk and the \"Woke Right\" nonsense. permalink parent award report block reply YaharaRiver 1 points 6 days ago 🙄 muslim projection, using the trick “Make it look jewish!” to layer on multiple instances of deception. If only we could measure YOUR “duper’s high” I bet it’s off the charts right now! permalink parent award report block reply\nDangerous 2 points 6 days ago They aren't merely dumb, they are successfully humiliated. Liars often get what is called a \"Dupers high\" when they know they have successfully lied, well those who were tricked sink into a sunken cost cope where they cannot admit they were wrong. This is used to manipulate millions of dull bulbs and is central to Leftist/Jewish humiliation ritual. The other half is then using this massive body of dupes to cower those who weren't tricked into silence, humiliating them for failing to act We can see the Jewish factions of the \"right\" playing this whole spiel out now over Charlie Kirk and the \"Woke Right\" nonsense. permalink parent award report block reply YaharaRiver 1 points 6 days ago 🙄 muslim projection, using the trick “Make it look jewish!” to layer on multiple instances of deception. If only we could measure YOUR “duper’s high” I bet it’s off the charts right now! permalink parent award report block reply\nYaharaRiver 1 points 6 days ago 🙄 muslim projection, using the trick “Make it look jewish!” to layer on multiple instances of deception. If only we could measure YOUR “duper’s high” I bet it’s off the charts right now! permalink parent award report block reply\nSteelBallRun1890 4 points 6 days ago They would have already felt it at his celebration party where he had a cash bar and there were no free drinks lol permalink parent award report block reply\nIncredibleMrE1 13 points 6 days ago I am once again asking for your money permalink award report block reply IllKissYourBoobies 2 points 6 days ago Came here for this. permalink parent award report block reply Aquamine-Amarine 1 points 6 days ago No refunds. permalink parent award report block reply\nIllKissYourBoobies 2 points 6 days ago Came here for this. permalink parent award report block reply\nAquamine-Amarine 1 points 6 days ago No refunds. permalink parent award report block reply\n24601 13 points 6 days ago Communism always results in a violent non-functional society. permalink award report block reply\nChyNahAzzWhole1 9 points 6 days ago Transition Money... to put people with integrity in positions of power... LOL! 18-30 WHITE CUNTS! Will you post your failures like you posted your support? He's going to defund the cops, allow \"morality patrols\" and if you get harmed, oh well. permalink award report block reply TGNX 7 points 6 days ago Were they white or were they \"white.\" permalink parent award report block reply Aquamine-Amarine 3 points 6 days ago Are they even female? Can a biologist confirm? permalink parent award report block reply PhantomShield72 2 points 6 days ago (((White))) permalink parent award report block reply hey_spike 1 points 6 days ago NYC government track record is corruption.  Start the opposition research on the transition team. Follow money trails. Check the financial disclosure statements. permalink parent award report block reply canada_is_communist 0 points 6 days ago Tbf at this point morality parole doesnt sound so bad permalink parent award report block reply\nTGNX 7 points 6 days ago Were they white or were they \"white.\" permalink parent award report block reply Aquamine-Amarine 3 points 6 days ago Are they even female? Can a biologist confirm? permalink parent award report block reply PhantomShield72 2 points 6 days ago (((White))) permalink parent award report block reply\nAquamine-Amarine 3 points 6 days ago Are they even female? Can a biologist confirm? permalink parent award report block reply\nPhantomShield72 2 points 6 days ago (((White))) permalink parent award report block reply\nhey_spike 1 points 6 days ago NYC government track record is corruption.  Start the opposition research on the transition team. Follow money trails. Check the financial disclosure statements. permalink parent award report block reply\ncanada_is_communist 0 points 6 days ago Tbf at this point morality parole doesnt sound so bad permalink parent award report block reply\nobamagavemeaphone 7 points 6 days ago So basically, he Sally Struthers begging for money to feed the savages... permalink award report block reply\nPhantomShield72 7 points 6 days ago Typical commie. Can't even come up with his own \"I am once again asking for...\" speech - he has to steal the one Bernie Sanders has been peddling for decades. Sad... permalink award report block reply\nRogueLeaderX 6 points 6 days ago Hypocritical piece of shit maligns billionaires and has been photographed with them constantly. permalink award report block reply\nMisterMAGA 6 points 6 days ago Oh, and one more thing—remember how I told you a few months ago to stop sending us money? You can start again. This transition requires staff, research, and an infrastructure that can meet this moment, and it will be made possible by the people who built and believe in this movement. So I hope you’ll make a donation at Transition2025.com. permalink award report block reply linthat22 4 points 6 days ago Brought to you by ActBlue permalink parent award report block reply\nlinthat22 4 points 6 days ago Brought to you by ActBlue permalink parent award report block reply\nspinometer2 6 points 6 days ago how is this hypocrisy? this is exactly what he promised, to take for money and give it away (to himself) permalink award report block reply\nShayhawk 6 points 6 days ago It wears the burka on its head or it gets the whip again... permalink award report block reply Hawksendoom 3 points 6 days ago funny fellow hawk ;) permalink parent award report block reply\nHawksendoom 3 points 6 days ago funny fellow hawk ;) permalink parent award report block reply\nDev404 5 points 6 days ago He's from a RICH family and wants more money. Typical champagne socialist. Another AOC/Bernie Sanders, but this one wants to blow you up instead of just robbing you. Make no mistake, he's going to rob you, too. permalink award report block reply\nJustlooking250 4 points 6 days ago Fuck off you commie retard permalink award report block reply RobinNet 1 points 6 days ago He's a male AOC, but more fucktarded and without a sweet rack & bubble butt. permalink parent award report block reply\nRobinNet 1 points 6 days ago He's a male AOC, but more fucktarded and without a sweet rack & bubble butt. permalink parent award report block reply\nLive_free_or_die_55 3 points 6 days ago Deport him back to his goats 🐐 permalink award report block reply\nLiberats 3 points 6 days ago There is no 'free'. It's always someone else's money. permalink award report block reply\nhey_spike 2 points 6 days ago Out of state and foreign donors will suddenly lose interest. permalink award report block reply\ncoffee_grdr 2 points 6 days ago i knew it... hes just trying to pad his own wallet! this guy was a socialist, now that he's mayor, he's in the \"make myself rich\" business. as jayz once said \"im not a businessman, i'm a business, man!\" permalink award report block reply\nTGNX 2 points 6 days ago It's not hypocrisy. permalink award report block reply\nIllKissYourBoobies 2 points 6 days ago Wait! No one every told me you needed MY money!?!????? permalink award report block reply\nFredRedd 2 points 6 days ago As GEOTUS said yesterday; \"And so it begins...\" permalink award report block reply\nNonyaDB 2 points 6 days ago \"On Wednesday, Communist Zohran Mamdani announced his all-female transition team for City Hall.\" LOL, that commies thinks he's Muammar Gaddafi. permalink award report block reply\nnomoreprinkles 2 points 6 days ago All smart states should immediately employ a 100% tariff on new yorkers. permalink award report block reply OnlyTrump20 1 points 6 days ago Can they at least check their voting records to verify they voted for this communist scum, or any other D?   I don't think true MAGA folks need to be punished. permalink parent award report block reply\nOnlyTrump20 1 points 6 days ago Can they at least check their voting records to verify they voted for this communist scum, or any other D?   I don't think true MAGA folks need to be punished. permalink parent award report block reply\nzoom19911991 2 points 6 days ago 🤡 permalink award report block reply\nlucifer_fit_deus 2 points 6 days ago What hypocrisy?  Isn’t that precisely how socialism is supposed to work? permalink award report block reply\nTyscribz 2 points 6 days ago Right now , he just asking ... 😟 permalink award report block reply\nsnoozeflu 2 points 6 days ago They voted for this guy and now they have started to flee New York and move to red states where they will continue to vote the same way. permalink award report block reply\nLuckycoz 2 points 6 days ago Gibs cost a shitload of money. permalink award report block reply\nTheSonOfGadsden 2 points 6 days ago He basically did the bernie sanders meme “I am once again asking you” permalink award report block reply\nNonbinaryPotatohead 2 points 6 days ago LOL why doesn't his BILLIONAIRE friend Alex Soros donate? permalink award report block reply YaharaRiver 1 points 6 days ago Draining YOUR accounts is fast, easy, and safe.  Soros will want something in return, and can hurt you if you break the agreement (which is always 100% with muslims). permalink parent award report block reply\nYaharaRiver 1 points 6 days ago Draining YOUR accounts is fast, easy, and safe.  Soros will want something in return, and can hurt you if you break the agreement (which is always 100% with muslims). permalink parent award report block reply\nDCYR66 2 points 6 days ago 🖕I got plenty of these if he wants them. permalink award report block reply\nAmannamedRJ 2 points 6 days ago What's the lowest price memecoin we can donate 1 of to NYC? permalink award report block reply IncredibleMrE1 7 points 6 days ago A US dollar permalink parent award report block reply Beelzy 2 points 6 days ago Lol permalink parent award report block reply linthat22 1 points 6 days ago Fartcoin permalink parent award report block reply\nIncredibleMrE1 7 points 6 days ago A US dollar permalink parent award report block reply Beelzy 2 points 6 days ago Lol permalink parent award report block reply\nBeelzy 2 points 6 days ago Lol permalink parent award report block reply\nlinthat22 1 points 6 days ago Fartcoin permalink parent award report block reply\nGranny 2 points 6 days ago This fool Mamdami doesn't realize that he'd better not make an enemy of Geotus. Very soon he's going to need him!!! permalink award report block reply\nlinthat22 2 points 6 days ago Y'all see who is handling the transition money? Fuckin' ActBlue 🙄 permalink award report block reply\ncanada_is_communist 1 points 6 days ago Well thats what socialism is lol. Someone else has to pay for it. See: Quebec permalink award report block reply\nthisisatestof2 1 points 6 days ago How long is he begging for money, again, after saying no more political insiders, new way of doing business essentially, he appointed all NYC political insiders who worked for previous administrations in high levels permalink award report block reply\nAmericanJawa 1 points 6 days ago What a surprise The Communist lies permalink award report block reply\nRobinNet 1 points 6 days ago First flaw of Socialism: You can't create wealth by dividing it, only by multiplying it. permalink award report block reply\nGlenlaw 1 points 6 days ago If I see Momdani on the street in NYC I will certainly spare him a dollar.  Unless I see a homeless person on the street.  In which case I will give the homeless person my dollar. permalink award report block reply\nHockeyMom4Trump 1 points 6 days ago He and his wife are trouble. He is giving Zelensky…watch your wallet. permalink award report block reply\nDJT4MoreYears 1 points 6 days ago I bet Soros and other billionaire globalists funnel billions to Mamdani and NYC to feed the cancer that Mamdani has started on the American people there.  We all think , Oh the billionaires will all leave NYC and it'll go broke. I bet not. It'll be funded and fueled by globalist money to rot NYC and it'll spread outward. permalink award report block reply\nhey_spike 1 points 6 days ago Transition team all want new cars. permalink award report block reply\nMonolitoVeritas 1 points 6 days ago that has always been the problem with socialism...eventually you run out of others peoples money....and then you have equality. Everybody is equally unhappy ... in other words what most democrats always are-unhappy. permalink award report block reply\nBeanieRed 1 points 6 days ago So, not free just like SNAP benefits.  I swear most of the nation needs a civics and economic education.  We should cancel all TV and make everyone pass those courses.  If you can’t, you don’t get the benefits and you can’t vote. permalink award report block reply\nCarmen1956 1 points 6 days ago NY, you get what you deserve.  IQ test before you are allowed to vote! permalink award report block reply\nTheRPatriot 1 points 6 days ago Imagine Cuomo pulls a Pinochet and says fuck this and takes over anyways…. lol I should write comic books permalink award report block reply unotrumpcard 3 points 6 days ago Imagine if Trump ripped of his shirt to reveal a six pack and then he punched the deepstate in the mouth xD Imagine tho, imagine. permalink parent award report block reply TheRPatriot 1 points 6 days ago While flying on a giant bald eagle? permalink parent award report block reply\nunotrumpcard 3 points 6 days ago Imagine if Trump ripped of his shirt to reveal a six pack and then he punched the deepstate in the mouth xD Imagine tho, imagine. permalink parent award report block reply TheRPatriot 1 points 6 days ago While flying on a giant bald eagle? permalink parent award report block reply\nTheRPatriot 1 points 6 days ago While flying on a giant bald eagle? permalink parent award report block reply\nSmcnelly 1 points 6 days ago Will all the riggers that have voted for him don’t have any money to send him. They just want free stuff. permalink award report block reply\nTOPDAWG23 1 points 6 days ago this retard is not going to %90 of what he said. permalink award report block reply\nchefjeffb 1 points 6 days ago Since when does a mayor have the authority to do any of the shit he's proposing, lol permalink award report block reply\nRickSanchezC137 1 points 6 days ago Isnt his dad a multi billionaire in Turkey? Go beg your dad. permalink award report block reply\nLawyersPlayDota 1 points 6 days ago This is going to be the funniest fucking time in new york. Shithole is going to be on fire within six months. permalink award report block reply\nstephen 1 points 6 days ago Coming to a city near you permalink award report block reply\ncanada_is_communist 1 points 6 days ago I checked and the tax rate in new York is already 50% for moderate/high earners. This is for a city with one of the higest cost of living in the world, second only to Zurich and a few others tax havens (monaco?). How exactly does he plan to get more money to pay for his trash programs? permalink award report block reply\nParticleCannon 1 points 6 days ago He's asking now. But soon he won't ask. permalink award report block reply\nTonyIommi123 1 points 6 days ago That's like a child asking me for money to buy me an ugly ass tie for CHRISTmas. permalink award report block reply\nduznmatter 1 points 6 days ago Here comes the donations from foreign muslim countries by the millions maybe even billions. Watch and see. permalink award report block reply\nYaharaRiver 1 points 6 days ago Zoloft already looks homeless, fucking SCRUB. permalink award report block reply\nBrookieDragon 1 points 6 days ago I saw this and thought it was an AI video to smear him. You telling me he actually said this? permalink award report block reply\nJimmyprawns 1 points 6 days ago It's the new bernie_sanders_begging_for_more_donations.jpeg permalink award report block reply\nChewySoap 1 points 6 days ago Strategically, look at his alliance with Soros. They will get funding from big donors, that was almost assuredly set up before the election. It will pay for the bribes he needs to get things moving in NY. It will be sustainable for long enough to build good sentiment and prop this asshole up as the DSA face of the party. Socialism and Communism don't fail off the bat, it takes time for everyone in a position of authority to try to slice off their piece to get ahead of others, once the big donor money runs out, that's when everything collapses.\nThey will be able to string this along for a while permalink award report block reply\nbrobama123 1 points 6 days ago They should have homeless people drive the bus in exchange for living on it. permalink award report block reply\nncswicn 1 points 6 days ago 🍿🍿🍿🍿 permalink award report block reply\nWinter_Is_Coming2020 1 points 6 days ago Fake permalink award report block reply\nEaszq8 1 points 6 days ago Run of the mill commie. permalink award report block reply\nMajorClark 1 points 6 days ago White liberals in NYC owe him so he can support lazy people who don't want to work or pay their own way. permalink award report block reply\nForty_Five 1 points 6 days ago It's terrifying that half the country is in a cult. permalink award report block reply YaharaRiver 1 points 6 days ago Settle down, lol. Nowhere NEAR half.  It’s the same small group that uses theatrics, paid crowds, baloney “testimonies” and sophisticated overreach (mostly illegal as F) to manipulate the image they’re going for. The desired image has shifted from religion of peace to helpless refugees to today: Super-Doop Excited About Sharia! permalink parent award report block reply Forty_Five 1 points 6 days ago Yet they continue to vote for it. permalink parent award report block reply\nYaharaRiver 1 points 6 days ago Settle down, lol. Nowhere NEAR half.  It’s the same small group that uses theatrics, paid crowds, baloney “testimonies” and sophisticated overreach (mostly illegal as F) to manipulate the image they’re going for. The desired image has shifted from religion of peace to helpless refugees to today: Super-Doop Excited About Sharia! permalink parent award report block reply Forty_Five 1 points 6 days ago Yet they continue to vote for it. permalink parent award report block reply\nForty_Five 1 points 6 days ago Yet they continue to vote for it. permalink parent award report block reply\nTheHandofGodzilla 1 points 6 days ago Best candidate for the Antichrist I’ve seen in awhile permalink award report block reply\nStormeyworld13 1 points 6 days ago What a stupid ass ugly man. He's so fake. Where is he going to get all the money that he promised those morons who voted for him? I hope he's deported! permalink award report block reply\nInduceddrag 1 points 6 days ago I learned an important lesson from working for an agency that was constantly taking equipment from the military re-use program.  There is nothing more expensive than “free.” permalink award report block reply\nGrizzlyT55 1 points 6 days ago Nothing is more expensive than a \"free government\" program. permalink award report block reply\nNoseeboh 1 points 6 days ago Let NY enjoy their socialism. Great example to the rest of the country of what NOT to do. permalink award report block reply\nRock9Head 1 points 6 days ago How much will get pilfered and kicked back to nefarious players? permalink award report block reply\n0Tolerence4Horseshit 1 points 6 days ago I have nothing to say, other than I'm thoroughly disgusted. Fuck New York, and fuck that Commie shit stirring faggot. permalink award report block reply\nknnbccb 1 points 6 days ago Are you surprised? Basically same as his comrades AOC and Bernie. permalink award report block reply\nMorningFrost 1 points 6 days ago One thing you can count on. No Transparency, and No Integrity. permalink award report block reply\nSavingPrivateGrace 1 points 6 days ago His transition team are experienced handlers from the Biden regime, puppet masters.  All he needs to do is say the lines to the camera because he's a good actor and can memorize or read the lines being fed to him. permalink award report block reply\njhewish 1 points 6 days ago I need you to give me 10 dollars so that I can give you back 1 dollar. permalink award report block reply\nmateus 1 points 6 days ago Old News! LMAO I used that less than 24 hours blip when I posted it here.. 17 hours ago.🤣 permalink award report block reply\nZarlino 1 points 6 days ago Not gonna lie id laugh if somebody blew this Fsggot away permalink award report block reply\nthat_guy_pming_tits 1 points 6 days ago Donations for what? He already won… permalink award report block reply\nlispboy 1 points 6 days ago Never thought NYC could do worse than Warren Wilhelm Jr., but here we are. permalink award report block reply\nIdontevenknow 1 points 6 days ago Yes, now is the personal wealth generation phase of the grift. It continues until they are removed. permalink award report block reply\nCyber1776 0 points 6 days ago Hypocrisy is a sign of power permalink award report block reply\nOTher55 0 points 6 days ago New York deserves him permalink award report block reply FullyDilated 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nFullyDilated 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nEruditio 0 points 6 days ago Just raise taxes. This is what NYC voted for!!! permalink award report block reply\nRudeFrog 0 points 6 days ago Honestly starting to think about just voting for the worst candidates so we can just burn the whole place down and start over. Probably be much better for my mental health. permalink award report block reply\nyodayoda 0 points 6 days ago I really bore of the \"this crazy libtard did this! that crazy libtard did that!\" that the forum has degenerated into. permalink award report block reply\nMEME-SUPREME 0 points 6 days ago 🍿🍿🍿 permalink award report block reply\nbarwhack 0 points 6 days ago I hate NY. permalink award report block reply\nAlways_a_Marine 0 points 6 days ago Someday, a real rain will come and purge them from our streets. ✝️🇺🇲💯 permalink award report block reply\ndaveyistheman 0 points 6 days ago Anybody who donated to a politician is a fucking retard. Doesn't matter what side of the aisle permalink award report block reply\nNebraskanPatriot -1 points 6 days ago Um...we did the same exact thing, no? permalink award report block reply\nRememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nFullyDilated 0 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nSCHULTZ -1 points 6 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:42:54.372151Z"
}