{
  "id": "1ARK9jztGr",
  "url": "https://patriots.win/p/1ARK9jztGr/-in-spain-a-27yearold-algerian-w/c",
  "content": "281 🇪🇸 In Spain, a 27-year-old Algerian woman has been arrested for attempting to blind her two-year-old son by repeatedly pouring an irritating liquid into his eyes over several months.\n\nShe also has a seven-year-old daughter who is blind. \n\nIt's believed that she did this for more social benefits. posted 1 day ago by IlhansBrother 9 comments award share report block Visegrád 24 @visegrad24 • 2d 🇪🇸 In Spain, a 27-year-old Algerian woman has been arrested for attempting to blind her two-year-old son by repeatedly pouring an irritating liquid into his eyes over several months. She also has a seven-year-old daughter who is blind. It's believed that she did this\n9 comments Sort by Top Top New Worst Old Save tralbolh 11 points 1 day ago Kick the Muslims out, and Algerians should only get welfare in Algeria, but don't think the usual welfare recipients would be far above this. Each generation on welfare becomes more debased. permalink award report block reply Tongs_Ya_Bass 7 points 1 day ago Who couldn't see this one coming? Pun intended. permalink award report block reply barwhack 4 points 1 day ago Late term abortion: the extended edition. permalink award report block reply Wexit-Delecto 4 points 1 day ago Not stupidity. There is so much premeditation involved. It’s evil. permalink award report block reply CheeseAndOnion 3 points 1 day ago Well is it a moslem. Filthy scum. permalink award report block reply olderndirt 3 points 1 day ago Welfare = perverse incentives.  End it. permalink award report block reply Danofdestiny 2 points 23 hours ago As it turns out, what civilized society deemed the \"fairer sex\" turned out to be sadistic sociopaths who will throw away civilization so they can murder and/or maim their children for their own selfish reasons. Maybe all of those old successful civilizations that we read about in history books that seriously limited women from positions of power and voting had some insight that we just refuse to see. permalink award report block reply freebirdie 2 points 1 day ago Off with her head. permalink award report block reply HoodooOperator 1 points 1 day ago Comment removed by community moderators. permalink award report block reply\ntralbolh 11 points 1 day ago Kick the Muslims out, and Algerians should only get welfare in Algeria, but don't think the usual welfare recipients would be far above this. Each generation on welfare becomes more debased. permalink award report block reply\nTongs_Ya_Bass 7 points 1 day ago Who couldn't see this one coming? Pun intended. permalink award report block reply\nbarwhack 4 points 1 day ago Late term abortion: the extended edition. permalink award report block reply\nWexit-Delecto 4 points 1 day ago Not stupidity. There is so much premeditation involved. It’s evil. permalink award report block reply\nCheeseAndOnion 3 points 1 day ago Well is it a moslem. Filthy scum. permalink award report block reply\nolderndirt 3 points 1 day ago Welfare = perverse incentives.  End it. permalink award report block reply\nDanofdestiny 2 points 23 hours ago As it turns out, what civilized society deemed the \"fairer sex\" turned out to be sadistic sociopaths who will throw away civilization so they can murder and/or maim their children for their own selfish reasons. Maybe all of those old successful civilizations that we read about in history books that seriously limited women from positions of power and voting had some insight that we just refuse to see. permalink award report block reply\nfreebirdie 2 points 1 day ago Off with her head. permalink award report block reply\nHoodooOperator 1 points 1 day ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:44:30.153982Z"
}