{
  "id": "1ARK57qrRd",
  "url": "https://patriots.win/p/1ARK57qrRd/i-am-recommending-to-senate-repu/c",
  "content": "341 🔴\"I am recommending to Senate Republicans that the Hundreds of Billions of Dollars currently being sent to money sucking Insurance Companies in order to save the bad Healthcare provided by ObamaCare, BE SENT DIRECTLY TO THE PEOPLE SO THAT THEY CAN PURCHASE THEIR OWN, MUCH BETTER, HEALTHCARE\" TRUMP  TRUTH posted 4 days ago by DeusVult1096 12 comments award share download report block\n12 comments Sort by Top Top New Worst Old Save ahamrbond 11 points 4 days ago This will come to $3k per person from the government if all the money is evenly spread around the entire population. Not bad. This would make HMOs much more competitive. A lot of them will instantly go out of business. Business practices will improve. Healthcare costs will go down. I don't need the $3k. I don't care. I just think we need to stop giving money to insurance companies to the tune of $1 Trillion per year. permalink award report block reply YaharaRiver 10 points 4 days ago Words like this are considered Foreplay among MAGA women 😆 permalink award report block reply Awakened 7 points 4 days ago This would be a game changer. The media will report that he wants to take everyone's health care away and send them a small check that won't cover their costs. No one in the GOP will help pass it. At least that's been the last 10 months. Not Trump's fault. The swamp is just too deep. They fortified over the last four years. Him not getting ahead of election fraud in 2020 cost him dearly. I still don't see any real movements on the front. permalink award report block reply NotYourMan 7 points 4 days ago Its odd but the latest changes in the cost of my personal health insurance are four times more expensive then just going to the doctor and paying out of pocket.  I plan to cancel my health insurance and just go to see my doctor if the doctor agrees to this.  Its also possible that without health insurance if I have an emergency then the emergency room will not take me.  The entire thing seems like a scheme to take away my money. permalink award report block reply QSWO1 5 points 4 days ago Emergency room takes Ilegals by law. You will be fine, and charged less. permalink parent award report block reply semsem 2 points 4 days ago This. From experience, depending on the hospital, they may give invoices for the full billing initially, but there are almost always ways to get that reduced if you don't have active coverage. They'll end up invoicing less than they would invoice the insurance company- just a question of whether they'll do that themselves, or if you need to file in an additional process with their billing department to get it. permalink parent award report block reply Danofdestiny 4 points 4 days ago Bring back private practice doctors and medical facilities. permalink award report block reply 711WasAPartTimeJob 2 points 4 days ago Can’t wait for shitlibs to do a 180 and try to explain why taking money from insurance companies is illegal and bad. permalink award report block reply DeportThemAllForever 2 points 4 days ago Replace all FSA with HSA and you’ll see costs go down and savings increase. Drop all subsidies, it’s just free money to big business middlemen, and it only spikes costs. permalink award report block reply 2016TrumpMAGA 1 points 4 days ago And it will get spent on useless consumer goods. permalink award report block reply I_Love_45-70_Gov 1 points 4 days ago They will never allow it, as there will be no kickbacks and massive campaign \"donations.\" permalink award report block reply Marat1792 1 points 4 days ago Costs will not go down until the insurance companies are outlawed. All insurance is a ponzi scheme. Its already illegal. Just enforce the law as written. permalink award report block reply SJWsHateUs 1 points 4 days ago Fuck yeah. Finally he says it permalink award report block reply\nahamrbond 11 points 4 days ago This will come to $3k per person from the government if all the money is evenly spread around the entire population. Not bad. This would make HMOs much more competitive. A lot of them will instantly go out of business. Business practices will improve. Healthcare costs will go down. I don't need the $3k. I don't care. I just think we need to stop giving money to insurance companies to the tune of $1 Trillion per year. permalink award report block reply\nYaharaRiver 10 points 4 days ago Words like this are considered Foreplay among MAGA women 😆 permalink award report block reply\nAwakened 7 points 4 days ago This would be a game changer. The media will report that he wants to take everyone's health care away and send them a small check that won't cover their costs. No one in the GOP will help pass it. At least that's been the last 10 months. Not Trump's fault. The swamp is just too deep. They fortified over the last four years. Him not getting ahead of election fraud in 2020 cost him dearly. I still don't see any real movements on the front. permalink award report block reply\nNotYourMan 7 points 4 days ago Its odd but the latest changes in the cost of my personal health insurance are four times more expensive then just going to the doctor and paying out of pocket.  I plan to cancel my health insurance and just go to see my doctor if the doctor agrees to this.  Its also possible that without health insurance if I have an emergency then the emergency room will not take me.  The entire thing seems like a scheme to take away my money. permalink award report block reply QSWO1 5 points 4 days ago Emergency room takes Ilegals by law. You will be fine, and charged less. permalink parent award report block reply semsem 2 points 4 days ago This. From experience, depending on the hospital, they may give invoices for the full billing initially, but there are almost always ways to get that reduced if you don't have active coverage. They'll end up invoicing less than they would invoice the insurance company- just a question of whether they'll do that themselves, or if you need to file in an additional process with their billing department to get it. permalink parent award report block reply\nQSWO1 5 points 4 days ago Emergency room takes Ilegals by law. You will be fine, and charged less. permalink parent award report block reply semsem 2 points 4 days ago This. From experience, depending on the hospital, they may give invoices for the full billing initially, but there are almost always ways to get that reduced if you don't have active coverage. They'll end up invoicing less than they would invoice the insurance company- just a question of whether they'll do that themselves, or if you need to file in an additional process with their billing department to get it. permalink parent award report block reply\nsemsem 2 points 4 days ago This. From experience, depending on the hospital, they may give invoices for the full billing initially, but there are almost always ways to get that reduced if you don't have active coverage. They'll end up invoicing less than they would invoice the insurance company- just a question of whether they'll do that themselves, or if you need to file in an additional process with their billing department to get it. permalink parent award report block reply\nDanofdestiny 4 points 4 days ago Bring back private practice doctors and medical facilities. permalink award report block reply\n711WasAPartTimeJob 2 points 4 days ago Can’t wait for shitlibs to do a 180 and try to explain why taking money from insurance companies is illegal and bad. permalink award report block reply\nDeportThemAllForever 2 points 4 days ago Replace all FSA with HSA and you’ll see costs go down and savings increase. Drop all subsidies, it’s just free money to big business middlemen, and it only spikes costs. permalink award report block reply\n2016TrumpMAGA 1 points 4 days ago And it will get spent on useless consumer goods. permalink award report block reply\nI_Love_45-70_Gov 1 points 4 days ago They will never allow it, as there will be no kickbacks and massive campaign \"donations.\" permalink award report block reply\nMarat1792 1 points 4 days ago Costs will not go down until the insurance companies are outlawed. All insurance is a ponzi scheme. Its already illegal. Just enforce the law as written. permalink award report block reply\nSJWsHateUs 1 points 4 days ago Fuck yeah. Finally he says it permalink award report block reply",
  "fetched_at": "2025-11-12T20:52:51.047730Z"
}