{
  "id": "8184783",
  "title": "938If a company can’t survive without foreign labor, it should fail.\n\nIf a farm can’t survive withou",
  "url": "https://patriots.win/p/1ARK9mHEwN/if-a-company-cant-survive-withou/c",
  "content": "938 If a company can’t survive without foreign labor, it should fail.\n\nIf a farm can’t survive without foreign labor, it should fail.\n\nIf a school can’t survive without foreign students, it should fail. posted 10 hours ago by PiratePatriotParrot 49 comments award share report block Bad Hombre @joma_gc • 1d If a company can’t survive without foreign labor, it should fail. If a farm can’t survive without foreign labor, it should fail. If a school can’t survive without foreign students, it should fail.\n49 comments Sort by Top Top New Worst Old Save -Evspra 43 points 9 hours ago Telling Americans that they're not talented enough to work at a CAR PLANT is probably the most out of touch and insulting thing he's recently said. This is America. We voted for America FIRST. Americans FIRST. I don't believe that importing third worlders to replace Americans is MAGA. I know I didn't vote to get replaced by some Indian or Mexican, or Venezuelan, or Chinaman. I don't believe Americans should be second to foreigners. I don't believe that Americans can't be taught how to do an industrial job. I don't believe that we're \"lacking talent\", nor should we be able to justify importing half a million Chinese for any reason, when OUR UNEMPLOYMENT RATE IS NOW AT THE HIGHEST POINT SINCE OCTOBER, 2021. permalink award report block reply Dwoj 18 points 6 hours ago Yeah, I don’t know what’s going on with President Trump. I was really offended by that too. I don’t know why he would say shit like that. permalink parent award report block reply mohel 5 points 3 hours ago Vivek Ramswamy runs the party? permalink parent award report block reply HoodooOperator 1 points 6 hours ago Comment removed by community moderators. permalink parent award report block reply Aquamine-Amarine 12 points 7 hours ago I love shitting on schools and it's true that most people that go in come out stupider. Yet even despite that we have some smart people that went to a trade school instead and have the skills. The problem is companies discriminate against them and refuse to hire them because they're talented White men. So we have two problems: Schools are keeping students stupid and not actually teaching them anything except communism. The ones that do make it out with good skills and degrees in fields that are actually useful aren't being hired because companies refuse to hire talented White men. permalink parent award report block reply taxesaretheft 7 points 5 hours ago If a company can't survive without paying their workers a living wage, it should fail Looking at you Walmart permalink parent award report block reply AVeryNakedMan 0 points 54 minutes ago Wages should be determined by free market forces. Not by what some person thinks is a \"living\" wage whether that person is a worker or a politician. But naturally, if you fix dumb government policies, wages would rise anyways. permalink parent award report block reply taxesaretheft 1 points 1 minute ago Race to the bottom mentality! Why is it ok for a company to be profitable by paying their employees jack and shit? Congrats, I could run any company in the world with insane margins if I paid my employees basically nothing! permalink parent award report block reply captflerbus -4 points 4 hours ago walmart is not a career you dope it is a stepping stone on your way to self improvement if you are working at walmart long term to support yourself you failed at life you are lucky to have any job at all permalink parent award report block reply penguinjay1212 2 points 1 hour ago Ur a faggot, if only high schoolers and seniors and stepping stoners worked at walmart, it would eat shit and die. Glad you found your niche or w.e homo permalink parent award report block reply captflerbus 1 points 20 minutes ago Go back to your job stocking shelves loser permalink parent award report block reply taxesaretheft 1 points 4 minutes ago Bro more people work at Walmart in this country than any other company If you can't pay your employees enough to live on then your company only exists because it is a step up from slave labor and shouldn't exist permalink parent award report block reply Watermelons 5 points 6 hours ago It goes against the ethos of most Automotive Plants: that you train people up.  i.e. Deming/Juran permalink parent award report block reply aaafirefly123 1 points 1 hour ago He said America First, not AMERICANS first. His biggest goal is to bring businesses back to America, and he’s willing to do anything, even screwing over American workers, to make that happen. So he doesn’t mind if corporations staff all of their businesses with foreigners as long as those foreigners are working in America legally where they can be taxed. permalink parent award report block reply load 11 more comments... HostlyMarmless 18 points 7 hours ago If a representative can't be elected without foreign money, THEY should fail. permalink award report block reply Grindelwald 14 points 9 hours ago Or government grants or government subsidies. permalink award report block reply DeportThemAllForever 2 points 5 hours ago That’s the main trick, government spend is to subsidize prices.  Doesn’t work great if they replace all with foreigners.  You just get poor people and high prices nationally.  Works for the few, screws everyone else. permalink parent award report block reply Throwingway22 10 points 6 hours ago There was no concern from Washington when slave labor and off-shoring where destroying American farms and factories and other small businesses. There is an entire wasteland in CA where the once thriving flower industry, employing thousands, once thrived--we now get our flowers from Argentina. Everyone's grandparents had their house stocked with furniture built by (American) hand in NC--now it's all flatpack assembly slop from China. Small ranchers can't graze their cows because of Climate Commie regulations and they can't process their meat without paying their international conglomerate competitors who own the government authorized meat processing plants. I give zero shits for the short-term pain that it would take to save America from the parasitic globalism that is killing it. permalink award report block reply GnuYow 10 points 6 hours ago If a country can't survive without constant aid from the U.S., it should fail. permalink award report block reply pococurante 1 points 2 hours ago I'm not against some level of foreign aid if it keeps a failing country from being conquered by the evil forces of Islam. But that aid should be also require that we accept no immigrants, because that country needs its people to rebuild itself rather than flee their homeland. And if the people are leaving, it's counterproductive to enrich a country that's being taken over by child rapists. permalink parent award report block reply covok48 9 points 7 hours ago I’m done with this sellout admin. permalink award report block reply SupFrens 7 points 9 hours ago If a country has too much foreign labor, it will fail. permalink award report block reply DeportThemAllForever 4 points 5 hours ago If it can’t survive without government bailout… should fail permalink parent award report block reply Mulletgunning 4 points 5 hours ago Abso-fucking-lutely! Trumps advisors are an enemy to America First. MAGA AF permalink award report block reply Counterwhat 3 points 8 hours ago This should be on everybody's goto speech card  America first! permalink award report block reply RedFoxOnFire 3 points 8 hours ago If a country can't survive without foreign labor... permalink award report block reply QSWO1 2 points 2 hours ago It will fail. permalink parent award report block reply BirthHole 2 points 5 hours ago If a country can’t survive without foreign aid, it should fail. permalink award report block reply Parhelion12 2 points 4 hours ago If a country can't hold elections without foreign voters, it WILL fail. permalink award report block reply C0drus 2 points 5 hours ago According to this post and all the foreigners in the the US, leaching our tax dollars, taking our jobs and destroying our country, America has failed 😭 Would someone please kick that Hadron Collider again so we can go back to our normal timeline because this 🤡🌎 bullshit sucks permalink award report block reply Wildwind 1 points 2 hours ago One can say that if a company, or a school cant survive without tax payers money it should fail. permalink award report block reply AyChiXuaxua 1 points 5 hours ago People bitch about critical jobs not being filled, but don't mention that those positions require degrees which are increasingly unattainable for most Americans. Trump needs to address the predatory student loan system OR propose a system of apprenticeships as an alternative to school.  I bet you could follow a doctor around for a year and be just as capable as him of doing the job! permalink award report block reply Wallllllllllllllllll 1 points 2 hours ago I agree with all of these statements. permalink award report block reply sleepinggiant 1 points 2 minutes ago All foreign labor is, is a way to avoid modernization. permalink award report block reply CyanScales 1 points 5 hours ago I dunno, the seasonal farm hands seems like a good thing. Should still offer the jobs to Americans first. permalink award report block reply pococurante 1 points 2 hours ago But without our servant class, who will clean our toilets? permalink award report block reply futuregodemperor2 1 points 5 hours ago just a reminder, foreign labor also includes remote work from foreign countries. Alot of people forget this, but it destroys American jobs as well as creates security risks giving data from American companies to foreign nationals. We HAVE to get this done. permalink award report block reply Trajano 1 points 4 hours ago Yes. permalink award report block reply SanityGumby -3 points 8 hours ago Maybe, just maybe, it’s smarter to not cause them all to fail simultaneously because that will destroy the economy and guarantee democrats win the midterms and next presidency. permalink award report block reply\n-Evspra 43 points 9 hours ago Telling Americans that they're not talented enough to work at a CAR PLANT is probably the most out of touch and insulting thing he's recently said. This is America. We voted for America FIRST. Americans FIRST. I don't believe that importing third worlders to replace Americans is MAGA. I know I didn't vote to get replaced by some Indian or Mexican, or Venezuelan, or Chinaman. I don't believe Americans should be second to foreigners. I don't believe that Americans can't be taught how to do an industrial job. I don't believe that we're \"lacking talent\", nor should we be able to justify importing half a million Chinese for any reason, when OUR UNEMPLOYMENT RATE IS NOW AT THE HIGHEST POINT SINCE OCTOBER, 2021. permalink award report block reply Dwoj 18 points 6 hours ago Yeah, I don’t know what’s going on with President Trump. I was really offended by that too. I don’t know why he would say shit like that. permalink parent award report block reply mohel 5 points 3 hours ago Vivek Ramswamy runs the party? permalink parent award report block reply HoodooOperator 1 points 6 hours ago Comment removed by community moderators. permalink parent award report block reply Aquamine-Amarine 12 points 7 hours ago I love shitting on schools and it's true that most people that go in come out stupider. Yet even despite that we have some smart people that went to a trade school instead and have the skills. The problem is companies discriminate against them and refuse to hire them because they're talented White men. So we have two problems: Schools are keeping students stupid and not actually teaching them anything except communism. The ones that do make it out with good skills and degrees in fields that are actually useful aren't being hired because companies refuse to hire talented White men. permalink parent award report block reply taxesaretheft 7 points 5 hours ago If a company can't survive without paying their workers a living wage, it should fail Looking at you Walmart permalink parent award report block reply AVeryNakedMan 0 points 54 minutes ago Wages should be determined by free market forces. Not by what some person thinks is a \"living\" wage whether that person is a worker or a politician. But naturally, if you fix dumb government policies, wages would rise anyways. permalink parent award report block reply taxesaretheft 1 points 1 minute ago Race to the bottom mentality! Why is it ok for a company to be profitable by paying their employees jack and shit? Congrats, I could run any company in the world with insane margins if I paid my employees basically nothing! permalink parent award report block reply captflerbus -4 points 4 hours ago walmart is not a career you dope it is a stepping stone on your way to self improvement if you are working at walmart long term to support yourself you failed at life you are lucky to have any job at all permalink parent award report block reply penguinjay1212 2 points 1 hour ago Ur a faggot, if only high schoolers and seniors and stepping stoners worked at walmart, it would eat shit and die. Glad you found your niche or w.e homo permalink parent award report block reply captflerbus 1 points 20 minutes ago Go back to your job stocking shelves loser permalink parent award report block reply taxesaretheft 1 points 4 minutes ago Bro more people work at Walmart in this country than any other company If you can't pay your employees enough to live on then your company only exists because it is a step up from slave labor and shouldn't exist permalink parent award report block reply Watermelons 5 points 6 hours ago It goes against the ethos of most Automotive Plants: that you train people up.  i.e. Deming/Juran permalink parent award report block reply aaafirefly123 1 points 1 hour ago He said America First, not AMERICANS first. His biggest goal is to bring businesses back to America, and he’s willing to do anything, even screwing over American workers, to make that happen. So he doesn’t mind if corporations staff all of their businesses with foreigners as long as those foreigners are working in America legally where they can be taxed. permalink parent award report block reply load 11 more comments...\nDwoj 18 points 6 hours ago Yeah, I don’t know what’s going on with President Trump. I was really offended by that too. I don’t know why he would say shit like that. permalink parent award report block reply mohel 5 points 3 hours ago Vivek Ramswamy runs the party? permalink parent award report block reply HoodooOperator 1 points 6 hours ago Comment removed by community moderators. permalink parent award report block reply\nmohel 5 points 3 hours ago Vivek Ramswamy runs the party? permalink parent award report block reply\nHoodooOperator 1 points 6 hours ago Comment removed by community moderators. permalink parent award report block reply\nAquamine-Amarine 12 points 7 hours ago I love shitting on schools and it's true that most people that go in come out stupider. Yet even despite that we have some smart people that went to a trade school instead and have the skills. The problem is companies discriminate against them and refuse to hire them because they're talented White men. So we have two problems: Schools are keeping students stupid and not actually teaching them anything except communism. The ones that do make it out with good skills and degrees in fields that are actually useful aren't being hired because companies refuse to hire talented White men. permalink parent award report block reply\ntaxesaretheft 7 points 5 hours ago If a company can't survive without paying their workers a living wage, it should fail Looking at you Walmart permalink parent award report block reply AVeryNakedMan 0 points 54 minutes ago Wages should be determined by free market forces. Not by what some person thinks is a \"living\" wage whether that person is a worker or a politician. But naturally, if you fix dumb government policies, wages would rise anyways. permalink parent award report block reply taxesaretheft 1 points 1 minute ago Race to the bottom mentality! Why is it ok for a company to be profitable by paying their employees jack and shit? Congrats, I could run any company in the world with insane margins if I paid my employees basically nothing! permalink parent award report block reply captflerbus -4 points 4 hours ago walmart is not a career you dope it is a stepping stone on your way to self improvement if you are working at walmart long term to support yourself you failed at life you are lucky to have any job at all permalink parent award report block reply penguinjay1212 2 points 1 hour ago Ur a faggot, if only high schoolers and seniors and stepping stoners worked at walmart, it would eat shit and die. Glad you found your niche or w.e homo permalink parent award report block reply captflerbus 1 points 20 minutes ago Go back to your job stocking shelves loser permalink parent award report block reply taxesaretheft 1 points 4 minutes ago Bro more people work at Walmart in this country than any other company If you can't pay your employees enough to live on then your company only exists because it is a step up from slave labor and shouldn't exist permalink parent award report block reply\nAVeryNakedMan 0 points 54 minutes ago Wages should be determined by free market forces. Not by what some person thinks is a \"living\" wage whether that person is a worker or a politician. But naturally, if you fix dumb government policies, wages would rise anyways. permalink parent award report block reply taxesaretheft 1 points 1 minute ago Race to the bottom mentality! Why is it ok for a company to be profitable by paying their employees jack and shit? Congrats, I could run any company in the world with insane margins if I paid my employees basically nothing! permalink parent award report block reply\ntaxesaretheft 1 points 1 minute ago Race to the bottom mentality! Why is it ok for a company to be profitable by paying their employees jack and shit? Congrats, I could run any company in the world with insane margins if I paid my employees basically nothing! permalink parent award report block reply\ncaptflerbus -4 points 4 hours ago walmart is not a career you dope it is a stepping stone on your way to self improvement if you are working at walmart long term to support yourself you failed at life you are lucky to have any job at all permalink parent award report block reply penguinjay1212 2 points 1 hour ago Ur a faggot, if only high schoolers and seniors and stepping stoners worked at walmart, it would eat shit and die. Glad you found your niche or w.e homo permalink parent award report block reply captflerbus 1 points 20 minutes ago Go back to your job stocking shelves loser permalink parent award report block reply taxesaretheft 1 points 4 minutes ago Bro more people work at Walmart in this country than any other company If you can't pay your employees enough to live on then your company only exists because it is a step up from slave labor and shouldn't exist permalink parent award report block reply\npenguinjay1212 2 points 1 hour ago Ur a faggot, if only high schoolers and seniors and stepping stoners worked at walmart, it would eat shit and die. Glad you found your niche or w.e homo permalink parent award report block reply captflerbus 1 points 20 minutes ago Go back to your job stocking shelves loser permalink parent award report block reply\ncaptflerbus 1 points 20 minutes ago Go back to your job stocking shelves loser permalink parent award report block reply\ntaxesaretheft 1 points 4 minutes ago Bro more people work at Walmart in this country than any other company If you can't pay your employees enough to live on then your company only exists because it is a step up from slave labor and shouldn't exist permalink parent award report block reply\nWatermelons 5 points 6 hours ago It goes against the ethos of most Automotive Plants: that you train people up.  i.e. Deming/Juran permalink parent award report block reply\naaafirefly123 1 points 1 hour ago He said America First, not AMERICANS first. His biggest goal is to bring businesses back to America, and he’s willing to do anything, even screwing over American workers, to make that happen. So he doesn’t mind if corporations staff all of their businesses with foreigners as long as those foreigners are working in America legally where they can be taxed. permalink parent award report block reply\nHostlyMarmless 18 points 7 hours ago If a representative can't be elected without foreign money, THEY should fail. permalink award report block reply\nGrindelwald 14 points 9 hours ago Or government grants or government subsidies. permalink award report block reply DeportThemAllForever 2 points 5 hours ago That’s the main trick, government spend is to subsidize prices.  Doesn’t work great if they replace all with foreigners.  You just get poor people and high prices nationally.  Works for the few, screws everyone else. permalink parent award report block reply\nDeportThemAllForever 2 points 5 hours ago That’s the main trick, government spend is to subsidize prices.  Doesn’t work great if they replace all with foreigners.  You just get poor people and high prices nationally.  Works for the few, screws everyone else. permalink parent award report block reply\nThrowingway22 10 points 6 hours ago There was no concern from Washington when slave labor and off-shoring where destroying American farms and factories and other small businesses. There is an entire wasteland in CA where the once thriving flower industry, employing thousands, once thrived--we now get our flowers from Argentina. Everyone's grandparents had their house stocked with furniture built by (American) hand in NC--now it's all flatpack assembly slop from China. Small ranchers can't graze their cows because of Climate Commie regulations and they can't process their meat without paying their international conglomerate competitors who own the government authorized meat processing plants. I give zero shits for the short-term pain that it would take to save America from the parasitic globalism that is killing it. permalink award report block reply\nGnuYow 10 points 6 hours ago If a country can't survive without constant aid from the U.S., it should fail. permalink award report block reply pococurante 1 points 2 hours ago I'm not against some level of foreign aid if it keeps a failing country from being conquered by the evil forces of Islam. But that aid should be also require that we accept no immigrants, because that country needs its people to rebuild itself rather than flee their homeland. And if the people are leaving, it's counterproductive to enrich a country that's being taken over by child rapists. permalink parent award report block reply\npococurante 1 points 2 hours ago I'm not against some level of foreign aid if it keeps a failing country from being conquered by the evil forces of Islam. But that aid should be also require that we accept no immigrants, because that country needs its people to rebuild itself rather than flee their homeland. And if the people are leaving, it's counterproductive to enrich a country that's being taken over by child rapists. permalink parent award report block reply\ncovok48 9 points 7 hours ago I’m done with this sellout admin. permalink award report block reply\nSupFrens 7 points 9 hours ago If a country has too much foreign labor, it will fail. permalink award report block reply DeportThemAllForever 4 points 5 hours ago If it can’t survive without government bailout… should fail permalink parent award report block reply\nDeportThemAllForever 4 points 5 hours ago If it can’t survive without government bailout… should fail permalink parent award report block reply\nMulletgunning 4 points 5 hours ago Abso-fucking-lutely! Trumps advisors are an enemy to America First. MAGA AF permalink award report block reply\nCounterwhat 3 points 8 hours ago This should be on everybody's goto speech card  America first! permalink award report block reply\nRedFoxOnFire 3 points 8 hours ago If a country can't survive without foreign labor... permalink award report block reply QSWO1 2 points 2 hours ago It will fail. permalink parent award report block reply\nQSWO1 2 points 2 hours ago It will fail. permalink parent award report block reply\nBirthHole 2 points 5 hours ago If a country can’t survive without foreign aid, it should fail. permalink award report block reply\nParhelion12 2 points 4 hours ago If a country can't hold elections without foreign voters, it WILL fail. permalink award report block reply\nC0drus 2 points 5 hours ago According to this post and all the foreigners in the the US, leaching our tax dollars, taking our jobs and destroying our country, America has failed 😭 Would someone please kick that Hadron Collider again so we can go back to our normal timeline because this 🤡🌎 bullshit sucks permalink award report block reply\nWildwind 1 points 2 hours ago One can say that if a company, or a school cant survive without tax payers money it should fail. permalink award report block reply\nAyChiXuaxua 1 points 5 hours ago People bitch about critical jobs not being filled, but don't mention that those positions require degrees which are increasingly unattainable for most Americans. Trump needs to address the predatory student loan system OR propose a system of apprenticeships as an alternative to school.  I bet you could follow a doctor around for a year and be just as capable as him of doing the job! permalink award report block reply\nWallllllllllllllllll 1 points 2 hours ago I agree with all of these statements. permalink award report block reply\nsleepinggiant 1 points 2 minutes ago All foreign labor is, is a way to avoid modernization. permalink award report block reply\nCyanScales 1 points 5 hours ago I dunno, the seasonal farm hands seems like a good thing. Should still offer the jobs to Americans first. permalink award report block reply\npococurante 1 points 2 hours ago But without our servant class, who will clean our toilets? permalink award report block reply\nfuturegodemperor2 1 points 5 hours ago just a reminder, foreign labor also includes remote work from foreign countries. Alot of people forget this, but it destroys American jobs as well as creates security risks giving data from American companies to foreign nationals. We HAVE to get this done. permalink award report block reply\nTrajano 1 points 4 hours ago Yes. permalink award report block reply\nSanityGumby -3 points 8 hours ago Maybe, just maybe, it’s smarter to not cause them all to fail simultaneously because that will destroy the economy and guarantee democrats win the midterms and next presidency. permalink award report block reply"
}