{
  "id": "1ARK54U97g",
  "url": "https://patriots.win/p/1ARK54U97g/this-alone-justifies-nuking-the-/c",
  "content": "980 This, alone, justifies nuking the filibuster - posted 5 days ago by KuzoKevin 37 comments award share report block ThePersistence @ScottPresler • 5d Unless Senate Republicans nuke the filibuster & pass election integrity legislation, you’re stuck with mail-in ballots. So, either learn to use them OR prepare to lose the 2026 midterm elections. Bookmark this.\n37 comments Sort by Top Top New Worst Old Save KuzoKevin OP 52 points 5 days ago Everything depends on secure voting.  Everything. permalink award report block reply NadlersNads 18 points 5 days ago Everything seems pointless and fake without real elections. I knew they were rigged since i was a child.. cast my first vote against Hilary in 2016. 2020 vote was stolen in oregon. 2022 vote was stolen for Lake in AZ. permalink parent award report block reply EyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply I_Love_45-70_Gov 2 points 5 days ago Don't forget cheap ammo, K. permalink parent award report block reply henri_derelicte 14 points 5 days ago But do we have the votes for election integrity in the first place? It feels like we almost always have 2-3 holdouts on major legislation. And if we wait too long, there’s no way it could be implemented in time for the 2026 election. Regardless, it should still be done. Pass election reform. GOP expands lead in 2026 midterms. Pass even more sweeping legislation. Dems lose even worse in 2028 permalink award report block reply Angryhotdog 15 points 5 days ago I think democrats can get 5 Rinos to vote against it permalink parent award report block reply Goozmania 7 points 5 days ago I think they can get 25 republicans to vote against it. permalink parent award report block reply Keiichi81 7 points 5 days ago They can get exactly as many Republicans to vote against it as needed, because it's all one big party and we ain't in it. permalink parent award report block reply mojorisen 10 points 5 days ago LOL what makes you think that the GOP wants to expand their lead?  For the last 20 years they have been frozen, captured in place by the special interest lobbies. There are certainly two things they want to do.  Hide their real loyalties from their voters and NOT expand their leads in Congress.  Being in charge means they have to walk the fine line between showing their hands to their constituents and sitting on their hands when it comes to passing true Conservative/Populist legislation. EDIT:  They don't have problems passing dem legislation when they are in the minority....Strange Huh? permalink parent award report block reply DatTrumpDoh 2 points 5 days ago I'm just waiting for the day when these RINO dipshits learn that the old times of uniparty gladhanding are over because their opponents care more about wanting them dead than they do about power balance. permalink parent award report block reply Tacitus1963 2 points 5 days ago The RINOs want to do zip.\nThey want to lose the midterms for their Demtard buds.\nBetween their doing jack schitt to help Trump during the Pedo Joe cabal; slow walking his agenda in his first term; and now walking like sloths to advance his agenda in term two, it's patently obvious what they are doing.\nWe don't have two parties.\nWe have a uniparty that doesn't care about our country.\nThey only care about lining their own pockets with our laundered tax dollars. permalink parent award report block reply Deplorable_in_PA 11 points 5 days ago I grew up in a majority Woke area.  One thing about the political left is they are very high propensity voters.  They vote in every single election, blue no matter who.  Do you know who your town's register of deeds is?  Your local comptroller or ombudsman?  The left does and votes accordingly. That's why the left, despite being a minority, is able to get what they want.  They are engaged, unified, motivated, and involved.  No BS purity tests or sitting at home because they don't like this guy or whatever, they vote.  We need to start doing the same. permalink award report block reply Bubbahax 9 points 5 days ago Its because they have no integrity.  They're just good little soldiers doing what they're told.  People on the right are attempting to do the right thing.  Mostly.  Which involves doing research and trying not to vote for an asshole. permalink parent award report block reply Roadpower 1 points 5 days ago Yep, it is goose steppers versus people who aren't exactly sure what the right thing to do is so they end up non committal. permalink parent award report block reply goldkeyboardwarrior 0 points 5 days ago You can either lose with dignity and complain about how the left is destroying the country on websites like this until they get enough power to ban this place or you can vote for someone who is the lesser of two evils and have a chance at eventually fixing the country. Dems love purity tests so much they pose as MAGA online, telling people they're staying home, so real MAGA follows suit. permalink parent award report block reply squash1324 3 points 5 days ago The lesser of two evils is still evil. Until we have GOOD to vote for, we will continue to fall into oblivion. permalink parent award report block reply goldkeyboardwarrior 1 points 5 days ago And if you stay home because neither person running passes your purity test, it's going to send us into oblivion that much faster. Although I realize some people do that on purpose because they hope accelerationism is what will fix the country, even if blood has to be spilled on the way there. I disagree with it, but I know that's what they want. permalink parent award report block reply Roadpower 1 points 5 days ago This is exactly why the First Past The Post election process is so terrible. permalink parent award report block reply I_Am_John_Galt 9 points 5 days ago If they could manage to end the filibuster,  we would likely see Murkowski, Collins etc.  They can vote safely now with the party, if the filibuster is gone, they'll do what they're told by their masters permalink award report block reply GreatestAmericanHero 2 points 5 days ago Someone will draw the short straw and cross lines, that's for certain. permalink parent award report block reply PubliusRex 6 points 5 days ago They'll never do it because this one dirty little secret: Republican candidates make more money and they can do less work when they're in the minority. permalink award report block reply corporateshizer 1 points 5 days ago They make all their money from their overlord puppet masters, and they make the same amount whether they're in the majority or minority. The politics is all a show for us. It's not part of their business operations. permalink parent award report block reply Keiichi81 6 points 5 days ago Jokes on all of us. Even if Republicans DO nuke the filibuster, they still won't vote to end mail-in voting. permalink award report block reply corporateshizer 4 points 5 days ago My best guess for how the election rigging works: Send out millions of mail-in ballots so that there will be lots of ambiguity as to how many people voted in various regions. Collect the blank ballots and/or print extra. Fill out the blanks with new votes Substitute legitimate ballots for the phony ones There's no way to get around this type of scheme by mailing in our own ballots, since they will just substitute them out. Even in-person voting doesn't work in states that collect the ballots and then drive them to central locations to count. We either return to normal voting laws that everywhere else uses, or America ceases to exist. It's that dire. permalink award report block reply LostElf 4 points 5 days ago We can easily use mail-in ballots, but it doesn't address Democrats having long established them as the perfect funnel for fraud. It's the election integrity that's the issue, not a voting method that could be used legally if people were trustworthy. Scott is right: nuke now. permalink award report block reply Goozmania 4 points 5 days ago Every single one of Scott's predictions, going back a couple years, has been right. And every time he dooms, people chastise him... but he's been correct. permalink award report block reply corntortilla 3 points 5 days ago Republicans don’t have enough votes to kill the filibuster, even if they wanted to which they don’t. Also, states control elections not congress. Better find another way to win the midterms. permalink award report block reply MAGARondonmonson 2 points 5 days ago The Filibuster was started to PROMOTE Bipartisanship but has actually done just the opposite. If you only needed 51 votes to pass anything, GUESS WHAT, you would have Dems working with Republicans trying tom shape a bill that suited them as best they could. Here is the Dirty little secret. This 60 vote rule has been used by the UNI PARTY to not have to answer to the will of the voters. Can't get a Balanced Budget Amendment passed ? Its not our fault, no one can blame us we can't get the 60 votes, Thune (McConnell) high fives Schumer and Pelosi and they all laugh at us. The exact same PLAYBOOK is used on everything, they thus do what they want to do ad say we had to give the Dems this, this and this (more spending) and you can not blame us we need 60 votes. Likewise, the Dems when they are in power say the same thing to their constituents. permalink award report block reply ACActual 2 points 5 days ago The \"Just leave me alone\", \"Sportsball\" and Bread & Circuses crowds are going to lose us the country Wake the fuck up If anything this is your final warning to move because in a few years it'll be too late permalink award report block reply red_holiday2 2 points 5 days ago We can nuke the fillibuster then reinstate it. permalink award report block reply bluewhiteandred 2 points 5 days ago This really is it, the fake blue wave was entirely driven by the mailin ballot fraud scheme We're probably forced to pass the Rubicon, apparently Trump is willing permalink award report block reply MythArcana 2 points 5 days ago What about all the RINOs in the Senate? They will make sure we don't pass anything, one way or another. permalink award report block reply GreatestAmericanHero 1 points 5 days ago Republicans prefer being the minority. Less excuses required for how absolutely useless they are. More time for Fox News, stern letters and sound bites. permalink award report block reply Notverycreative 1 points 4 days ago They are going to lose the midterms either way. permalink award report block reply bloodstainedpatriot 1 points 5 days ago Give them the subsidies for all the things Trump wants permalink award report block reply AlmostFullyDilated -4 points 5 days ago I do the opposite of whatever a cocksucker says about anything permalink award report block reply NowTheyAllLose 1 points 4 days ago Is that why you’re almost fully dilated? permalink parent award report block reply EyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nKuzoKevin OP 52 points 5 days ago Everything depends on secure voting.  Everything. permalink award report block reply NadlersNads 18 points 5 days ago Everything seems pointless and fake without real elections. I knew they were rigged since i was a child.. cast my first vote against Hilary in 2016. 2020 vote was stolen in oregon. 2022 vote was stolen for Lake in AZ. permalink parent award report block reply EyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply I_Love_45-70_Gov 2 points 5 days ago Don't forget cheap ammo, K. permalink parent award report block reply\nNadlersNads 18 points 5 days ago Everything seems pointless and fake without real elections. I knew they were rigged since i was a child.. cast my first vote against Hilary in 2016. 2020 vote was stolen in oregon. 2022 vote was stolen for Lake in AZ. permalink parent award report block reply EyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nEyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nI_Love_45-70_Gov 2 points 5 days ago Don't forget cheap ammo, K. permalink parent award report block reply\nhenri_derelicte 14 points 5 days ago But do we have the votes for election integrity in the first place? It feels like we almost always have 2-3 holdouts on major legislation. And if we wait too long, there’s no way it could be implemented in time for the 2026 election. Regardless, it should still be done. Pass election reform. GOP expands lead in 2026 midterms. Pass even more sweeping legislation. Dems lose even worse in 2028 permalink award report block reply Angryhotdog 15 points 5 days ago I think democrats can get 5 Rinos to vote against it permalink parent award report block reply Goozmania 7 points 5 days ago I think they can get 25 republicans to vote against it. permalink parent award report block reply Keiichi81 7 points 5 days ago They can get exactly as many Republicans to vote against it as needed, because it's all one big party and we ain't in it. permalink parent award report block reply mojorisen 10 points 5 days ago LOL what makes you think that the GOP wants to expand their lead?  For the last 20 years they have been frozen, captured in place by the special interest lobbies. There are certainly two things they want to do.  Hide their real loyalties from their voters and NOT expand their leads in Congress.  Being in charge means they have to walk the fine line between showing their hands to their constituents and sitting on their hands when it comes to passing true Conservative/Populist legislation. EDIT:  They don't have problems passing dem legislation when they are in the minority....Strange Huh? permalink parent award report block reply DatTrumpDoh 2 points 5 days ago I'm just waiting for the day when these RINO dipshits learn that the old times of uniparty gladhanding are over because their opponents care more about wanting them dead than they do about power balance. permalink parent award report block reply Tacitus1963 2 points 5 days ago The RINOs want to do zip.\nThey want to lose the midterms for their Demtard buds.\nBetween their doing jack schitt to help Trump during the Pedo Joe cabal; slow walking his agenda in his first term; and now walking like sloths to advance his agenda in term two, it's patently obvious what they are doing.\nWe don't have two parties.\nWe have a uniparty that doesn't care about our country.\nThey only care about lining their own pockets with our laundered tax dollars. permalink parent award report block reply\nAngryhotdog 15 points 5 days ago I think democrats can get 5 Rinos to vote against it permalink parent award report block reply Goozmania 7 points 5 days ago I think they can get 25 republicans to vote against it. permalink parent award report block reply Keiichi81 7 points 5 days ago They can get exactly as many Republicans to vote against it as needed, because it's all one big party and we ain't in it. permalink parent award report block reply\nGoozmania 7 points 5 days ago I think they can get 25 republicans to vote against it. permalink parent award report block reply Keiichi81 7 points 5 days ago They can get exactly as many Republicans to vote against it as needed, because it's all one big party and we ain't in it. permalink parent award report block reply\nKeiichi81 7 points 5 days ago They can get exactly as many Republicans to vote against it as needed, because it's all one big party and we ain't in it. permalink parent award report block reply\nmojorisen 10 points 5 days ago LOL what makes you think that the GOP wants to expand their lead?  For the last 20 years they have been frozen, captured in place by the special interest lobbies. There are certainly two things they want to do.  Hide their real loyalties from their voters and NOT expand their leads in Congress.  Being in charge means they have to walk the fine line between showing their hands to their constituents and sitting on their hands when it comes to passing true Conservative/Populist legislation. EDIT:  They don't have problems passing dem legislation when they are in the minority....Strange Huh? permalink parent award report block reply DatTrumpDoh 2 points 5 days ago I'm just waiting for the day when these RINO dipshits learn that the old times of uniparty gladhanding are over because their opponents care more about wanting them dead than they do about power balance. permalink parent award report block reply\nDatTrumpDoh 2 points 5 days ago I'm just waiting for the day when these RINO dipshits learn that the old times of uniparty gladhanding are over because their opponents care more about wanting them dead than they do about power balance. permalink parent award report block reply\nTacitus1963 2 points 5 days ago The RINOs want to do zip.\nThey want to lose the midterms for their Demtard buds.\nBetween their doing jack schitt to help Trump during the Pedo Joe cabal; slow walking his agenda in his first term; and now walking like sloths to advance his agenda in term two, it's patently obvious what they are doing.\nWe don't have two parties.\nWe have a uniparty that doesn't care about our country.\nThey only care about lining their own pockets with our laundered tax dollars. permalink parent award report block reply\nDeplorable_in_PA 11 points 5 days ago I grew up in a majority Woke area.  One thing about the political left is they are very high propensity voters.  They vote in every single election, blue no matter who.  Do you know who your town's register of deeds is?  Your local comptroller or ombudsman?  The left does and votes accordingly. That's why the left, despite being a minority, is able to get what they want.  They are engaged, unified, motivated, and involved.  No BS purity tests or sitting at home because they don't like this guy or whatever, they vote.  We need to start doing the same. permalink award report block reply Bubbahax 9 points 5 days ago Its because they have no integrity.  They're just good little soldiers doing what they're told.  People on the right are attempting to do the right thing.  Mostly.  Which involves doing research and trying not to vote for an asshole. permalink parent award report block reply Roadpower 1 points 5 days ago Yep, it is goose steppers versus people who aren't exactly sure what the right thing to do is so they end up non committal. permalink parent award report block reply goldkeyboardwarrior 0 points 5 days ago You can either lose with dignity and complain about how the left is destroying the country on websites like this until they get enough power to ban this place or you can vote for someone who is the lesser of two evils and have a chance at eventually fixing the country. Dems love purity tests so much they pose as MAGA online, telling people they're staying home, so real MAGA follows suit. permalink parent award report block reply squash1324 3 points 5 days ago The lesser of two evils is still evil. Until we have GOOD to vote for, we will continue to fall into oblivion. permalink parent award report block reply goldkeyboardwarrior 1 points 5 days ago And if you stay home because neither person running passes your purity test, it's going to send us into oblivion that much faster. Although I realize some people do that on purpose because they hope accelerationism is what will fix the country, even if blood has to be spilled on the way there. I disagree with it, but I know that's what they want. permalink parent award report block reply Roadpower 1 points 5 days ago This is exactly why the First Past The Post election process is so terrible. permalink parent award report block reply\nBubbahax 9 points 5 days ago Its because they have no integrity.  They're just good little soldiers doing what they're told.  People on the right are attempting to do the right thing.  Mostly.  Which involves doing research and trying not to vote for an asshole. permalink parent award report block reply Roadpower 1 points 5 days ago Yep, it is goose steppers versus people who aren't exactly sure what the right thing to do is so they end up non committal. permalink parent award report block reply goldkeyboardwarrior 0 points 5 days ago You can either lose with dignity and complain about how the left is destroying the country on websites like this until they get enough power to ban this place or you can vote for someone who is the lesser of two evils and have a chance at eventually fixing the country. Dems love purity tests so much they pose as MAGA online, telling people they're staying home, so real MAGA follows suit. permalink parent award report block reply squash1324 3 points 5 days ago The lesser of two evils is still evil. Until we have GOOD to vote for, we will continue to fall into oblivion. permalink parent award report block reply goldkeyboardwarrior 1 points 5 days ago And if you stay home because neither person running passes your purity test, it's going to send us into oblivion that much faster. Although I realize some people do that on purpose because they hope accelerationism is what will fix the country, even if blood has to be spilled on the way there. I disagree with it, but I know that's what they want. permalink parent award report block reply Roadpower 1 points 5 days ago This is exactly why the First Past The Post election process is so terrible. permalink parent award report block reply\nRoadpower 1 points 5 days ago Yep, it is goose steppers versus people who aren't exactly sure what the right thing to do is so they end up non committal. permalink parent award report block reply\ngoldkeyboardwarrior 0 points 5 days ago You can either lose with dignity and complain about how the left is destroying the country on websites like this until they get enough power to ban this place or you can vote for someone who is the lesser of two evils and have a chance at eventually fixing the country. Dems love purity tests so much they pose as MAGA online, telling people they're staying home, so real MAGA follows suit. permalink parent award report block reply squash1324 3 points 5 days ago The lesser of two evils is still evil. Until we have GOOD to vote for, we will continue to fall into oblivion. permalink parent award report block reply goldkeyboardwarrior 1 points 5 days ago And if you stay home because neither person running passes your purity test, it's going to send us into oblivion that much faster. Although I realize some people do that on purpose because they hope accelerationism is what will fix the country, even if blood has to be spilled on the way there. I disagree with it, but I know that's what they want. permalink parent award report block reply Roadpower 1 points 5 days ago This is exactly why the First Past The Post election process is so terrible. permalink parent award report block reply\nsquash1324 3 points 5 days ago The lesser of two evils is still evil. Until we have GOOD to vote for, we will continue to fall into oblivion. permalink parent award report block reply goldkeyboardwarrior 1 points 5 days ago And if you stay home because neither person running passes your purity test, it's going to send us into oblivion that much faster. Although I realize some people do that on purpose because they hope accelerationism is what will fix the country, even if blood has to be spilled on the way there. I disagree with it, but I know that's what they want. permalink parent award report block reply Roadpower 1 points 5 days ago This is exactly why the First Past The Post election process is so terrible. permalink parent award report block reply\ngoldkeyboardwarrior 1 points 5 days ago And if you stay home because neither person running passes your purity test, it's going to send us into oblivion that much faster. Although I realize some people do that on purpose because they hope accelerationism is what will fix the country, even if blood has to be spilled on the way there. I disagree with it, but I know that's what they want. permalink parent award report block reply\nRoadpower 1 points 5 days ago This is exactly why the First Past The Post election process is so terrible. permalink parent award report block reply\nI_Am_John_Galt 9 points 5 days ago If they could manage to end the filibuster,  we would likely see Murkowski, Collins etc.  They can vote safely now with the party, if the filibuster is gone, they'll do what they're told by their masters permalink award report block reply GreatestAmericanHero 2 points 5 days ago Someone will draw the short straw and cross lines, that's for certain. permalink parent award report block reply\nGreatestAmericanHero 2 points 5 days ago Someone will draw the short straw and cross lines, that's for certain. permalink parent award report block reply\nPubliusRex 6 points 5 days ago They'll never do it because this one dirty little secret: Republican candidates make more money and they can do less work when they're in the minority. permalink award report block reply corporateshizer 1 points 5 days ago They make all their money from their overlord puppet masters, and they make the same amount whether they're in the majority or minority. The politics is all a show for us. It's not part of their business operations. permalink parent award report block reply\ncorporateshizer 1 points 5 days ago They make all their money from their overlord puppet masters, and they make the same amount whether they're in the majority or minority. The politics is all a show for us. It's not part of their business operations. permalink parent award report block reply\nKeiichi81 6 points 5 days ago Jokes on all of us. Even if Republicans DO nuke the filibuster, they still won't vote to end mail-in voting. permalink award report block reply\ncorporateshizer 4 points 5 days ago My best guess for how the election rigging works: Send out millions of mail-in ballots so that there will be lots of ambiguity as to how many people voted in various regions. Collect the blank ballots and/or print extra. Fill out the blanks with new votes Substitute legitimate ballots for the phony ones There's no way to get around this type of scheme by mailing in our own ballots, since they will just substitute them out. Even in-person voting doesn't work in states that collect the ballots and then drive them to central locations to count. We either return to normal voting laws that everywhere else uses, or America ceases to exist. It's that dire. permalink award report block reply\nLostElf 4 points 5 days ago We can easily use mail-in ballots, but it doesn't address Democrats having long established them as the perfect funnel for fraud. It's the election integrity that's the issue, not a voting method that could be used legally if people were trustworthy. Scott is right: nuke now. permalink award report block reply\nGoozmania 4 points 5 days ago Every single one of Scott's predictions, going back a couple years, has been right. And every time he dooms, people chastise him... but he's been correct. permalink award report block reply\ncorntortilla 3 points 5 days ago Republicans don’t have enough votes to kill the filibuster, even if they wanted to which they don’t. Also, states control elections not congress. Better find another way to win the midterms. permalink award report block reply\nMAGARondonmonson 2 points 5 days ago The Filibuster was started to PROMOTE Bipartisanship but has actually done just the opposite. If you only needed 51 votes to pass anything, GUESS WHAT, you would have Dems working with Republicans trying tom shape a bill that suited them as best they could. Here is the Dirty little secret. This 60 vote rule has been used by the UNI PARTY to not have to answer to the will of the voters. Can't get a Balanced Budget Amendment passed ? Its not our fault, no one can blame us we can't get the 60 votes, Thune (McConnell) high fives Schumer and Pelosi and they all laugh at us. The exact same PLAYBOOK is used on everything, they thus do what they want to do ad say we had to give the Dems this, this and this (more spending) and you can not blame us we need 60 votes. Likewise, the Dems when they are in power say the same thing to their constituents. permalink award report block reply\nACActual 2 points 5 days ago The \"Just leave me alone\", \"Sportsball\" and Bread & Circuses crowds are going to lose us the country Wake the fuck up If anything this is your final warning to move because in a few years it'll be too late permalink award report block reply\nred_holiday2 2 points 5 days ago We can nuke the fillibuster then reinstate it. permalink award report block reply\nbluewhiteandred 2 points 5 days ago This really is it, the fake blue wave was entirely driven by the mailin ballot fraud scheme We're probably forced to pass the Rubicon, apparently Trump is willing permalink award report block reply\nMythArcana 2 points 5 days ago What about all the RINOs in the Senate? They will make sure we don't pass anything, one way or another. permalink award report block reply\nGreatestAmericanHero 1 points 5 days ago Republicans prefer being the minority. Less excuses required for how absolutely useless they are. More time for Fox News, stern letters and sound bites. permalink award report block reply\nNotverycreative 1 points 4 days ago They are going to lose the midterms either way. permalink award report block reply\nbloodstainedpatriot 1 points 5 days ago Give them the subsidies for all the things Trump wants permalink award report block reply\nAlmostFullyDilated -4 points 5 days ago I do the opposite of whatever a cocksucker says about anything permalink award report block reply NowTheyAllLose 1 points 4 days ago Is that why you’re almost fully dilated? permalink parent award report block reply\nNowTheyAllLose 1 points 4 days ago Is that why you’re almost fully dilated? permalink parent award report block reply\nEyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T21:07:40.395314Z"
}