{
  "id": "1ARK9nQBQS",
  "url": "https://patriots.win/p/1ARK9nQBQS/piers-morgan-apologizes-to-novak/c",
  "content": "51 Piers Morgan APOLOGIZES to Novak Djokovic for condemning him for not taking the vaccine in 2022. 💉  GET  BOOSTED  💉 posted 3 hours ago by PatriotSam 4 comments award share report block Collin Rugg @CollinRugg • 24h NEW: Piers Morgan apologizes to tennis star Novak Djokovic for previously criticizing him for not getting the COVID-19 vaccination. \"I’m going to start by making an apology.\" \"And it’s for this. I was very censorious about you over the COVID scandal that you got caught\n4 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget NeverNotTrump 4 points 2 hours ago IMO, the only appropriate response to that is \"Piers, you're still a giant sack of shit.  GFY.\" permalink award report block reply _Sully_ 2 points 2 hours ago Piers should instead ask everyone to demand apologies and punishment from the people who knew this fact and intentionally lied. They all want to play \"This is what I believed at the time. Now I know\" bullshit when they knew they were being told by those greatly incentivized to lie. It doesn't take a medical degree to glean that fact. permalink award report block reply 0care 2 points 2 hours ago still a no guns cuck permalink award report block reply PatriotSam OP 1 points 2 hours ago The British Way permalink parent award report block reply\nNeverNotTrump 4 points 2 hours ago IMO, the only appropriate response to that is \"Piers, you're still a giant sack of shit.  GFY.\" permalink award report block reply\n_Sully_ 2 points 2 hours ago Piers should instead ask everyone to demand apologies and punishment from the people who knew this fact and intentionally lied. They all want to play \"This is what I believed at the time. Now I know\" bullshit when they knew they were being told by those greatly incentivized to lie. It doesn't take a medical degree to glean that fact. permalink award report block reply\n0care 2 points 2 hours ago still a no guns cuck permalink award report block reply PatriotSam OP 1 points 2 hours ago The British Way permalink parent award report block reply\nPatriotSam OP 1 points 2 hours ago The British Way permalink parent award report block reply",
  "fetched_at": "2025-11-12T22:59:40.576929Z"
}