{
  "id": "1ARK9mFJOp",
  "url": "https://patriots.win/p/1ARK9mFJOp/trump-pardons-65-year-old-wyomin/c",
  "content": "352 Trump pardons 65 year old Wyoming auto shop owner that spent 7 MONTHS IN FEDERAL PRISON for tweaking and removing some emissions systems in failing engines. (cowboystatedaily.com) posted 22 hours ago by flp999 8 comments award share report block Trump Pardons Cheyenne Diesel Delete Mechanic Troy Lake President Donald Trump pardoned Troy Lake on Friday. The 65-year-old Wyoming diesel mechanic spent seven months in federal prison for tweaking and… cowboystatedaily.com\n8 comments Sort by Top Top New Worst Old Save flp999 OP 18 points 22 hours ago To say that we’ve lost our way as a country is to not even really get close to the position we find ourselves in. permalink award report block reply Duce30 12 points 22 hours ago Now Trump needs to do away with all DEF systems. Nothing but a money grab, this guy knew it. permalink award report block reply TonyTreehouse 7 points 21 hours ago He actually did a ton of modifications.   It was on diesel engines.  Works be better if they removed all the regulations on diesel that lead to this.  The US has way stricter diesel tegs than the rest of the world. When VW got caught with the rigged system that was designed to turn off so that the vehicles would read five when tested, I believe those vehicles could have passed in every other country in the world even with the system fully functional. permalink award report block reply MAGALADON9 4 points 20 hours ago Your title made me think he got in trouble for doing meth getting spun out and randomly modifying engines. permalink award report block reply Drewniverse 2 points 20 hours ago #metoo permalink parent award report block reply Retardloserimsogay 2 points 20 hours ago Lmao, I like it. permalink parent award report block reply Trumpy_Bear 2 points 20 hours ago Though relieved to be free of the dismal prison in which he spent his 40th wedding anniversary and his 65th birthday, Lake said that he believed he’d spend the rest of his life as a convicted felon, unable to vote, hold public office, or possess or hunt with firearms. Uhhhh.... what? One federal crime means they get to take away all your rights for your whole life? permalink award report block reply Shih_Tabed 2 points 17 hours ago Well, you have to re-apply for them.  Felons can get their pew pew rights and voting rights restored if they want to vote for republicans, or just go to NYC or California if they want to vote for someone else without the hassle and get access to untraceable weapons. permalink parent award report block reply\nflp999 OP 18 points 22 hours ago To say that we’ve lost our way as a country is to not even really get close to the position we find ourselves in. permalink award report block reply\nDuce30 12 points 22 hours ago Now Trump needs to do away with all DEF systems. Nothing but a money grab, this guy knew it. permalink award report block reply\nTonyTreehouse 7 points 21 hours ago He actually did a ton of modifications.   It was on diesel engines.  Works be better if they removed all the regulations on diesel that lead to this.  The US has way stricter diesel tegs than the rest of the world. When VW got caught with the rigged system that was designed to turn off so that the vehicles would read five when tested, I believe those vehicles could have passed in every other country in the world even with the system fully functional. permalink award report block reply\nMAGALADON9 4 points 20 hours ago Your title made me think he got in trouble for doing meth getting spun out and randomly modifying engines. permalink award report block reply Drewniverse 2 points 20 hours ago #metoo permalink parent award report block reply Retardloserimsogay 2 points 20 hours ago Lmao, I like it. permalink parent award report block reply\nDrewniverse 2 points 20 hours ago #metoo permalink parent award report block reply\nRetardloserimsogay 2 points 20 hours ago Lmao, I like it. permalink parent award report block reply\nTrumpy_Bear 2 points 20 hours ago Though relieved to be free of the dismal prison in which he spent his 40th wedding anniversary and his 65th birthday, Lake said that he believed he’d spend the rest of his life as a convicted felon, unable to vote, hold public office, or possess or hunt with firearms. Uhhhh.... what? One federal crime means they get to take away all your rights for your whole life? permalink award report block reply Shih_Tabed 2 points 17 hours ago Well, you have to re-apply for them.  Felons can get their pew pew rights and voting rights restored if they want to vote for republicans, or just go to NYC or California if they want to vote for someone else without the hassle and get access to untraceable weapons. permalink parent award report block reply\nShih_Tabed 2 points 17 hours ago Well, you have to re-apply for them.  Felons can get their pew pew rights and voting rights restored if they want to vote for republicans, or just go to NYC or California if they want to vote for someone else without the hassle and get access to untraceable weapons. permalink parent award report block reply",
  "fetched_at": "2025-11-12T22:53:29.104228Z"
}