{
  "id": "8184390",
  "title": "428Reposting this until it gets the updoots it deserves...posted16 hours agobyHappyFunBall16 comment",
  "url": "https://patriots.win/p/1ARK9mG8oK/reposting-this-until-it-gets-the/c",
  "content": "428 Reposting this until it gets the updoots it deserves... posted 16 hours ago by HappyFunBall 16 comments award share download report block\n16 comments Sort by Top Top New Worst Old Save Covidrrhea 10 points 15 hours ago ngl just makes me wanna watch lotr again, it's been a couple years permalink award report block reply NoticesBugleOWO 6 points 13 hours ago I've been listening to the books for the first time during my commute to and from work. Currently most of the way though Return of the King. The second and third books are voiced by Andy Circus (the actor who played Golem) and it's absolutely great. Definitely helps to have the visuals from the movies, even if there's a lot they had to leave out for time. permalink parent award report block reply SicSemperTyrannis2 1 points 13 hours ago Is the author ever going to finish it? Whole lotta threads left dangling, just to have a dragon burn everything. permalink parent award report block reply NoticesBugleOWO 2 points 12 hours ago lol you are confused my dear... permalink parent award report block reply I_Love_45-70_Gov 2 points 9 hours ago It would have been an easier fight had they used their phasers rather than their swords. Anyway, may the Schwartz be with you. permalink parent award report block reply view 2 more comments... GuerillaYourDreams 4 points 15 hours ago It’s pretty lame and I really liked LOTR. permalink award report block reply SERP-SERP 3 points 15 hours ago Excellent meme good sir 👏 👍 permalink award report block reply IAmTsunade 2 points 8 hours ago People always assume War is kinetic. If they continue to believe that, in 20 years we will be a Caliphate, not a country. Bet. permalink award report block reply SimaYi 2 points 7 hours ago We already have an merchant run economic zone. permalink parent award report block reply RolandDelacroix 1 points 4 hours ago It's just gonna be scaled up terrorist attacks like the 60s/70s.  That's how the left fights. permalink parent award report block reply RolandDelacroix 1 points 4 hours ago It's gonna take the Boomers dying off and the Zoomers rising up to change things. Zoomers and Alphas at least can admit some of the problems.  I'm hopeful for 2028 because Boomers are gonna fall off a cliff, but Zoomers need to get in the game to offset the retarded Millenials. permalink award report block reply Megaboom2025 1 points 12 hours ago Israel marches permalink award report block reply KOMMISSARofMAGA -1 points 8 hours ago Not a great meme, respectfully. permalink award report block reply Washingpede -4 points 15 hours ago Fuck outta here with this bullshit permalink award report block reply\nCovidrrhea 10 points 15 hours ago ngl just makes me wanna watch lotr again, it's been a couple years permalink award report block reply NoticesBugleOWO 6 points 13 hours ago I've been listening to the books for the first time during my commute to and from work. Currently most of the way though Return of the King. The second and third books are voiced by Andy Circus (the actor who played Golem) and it's absolutely great. Definitely helps to have the visuals from the movies, even if there's a lot they had to leave out for time. permalink parent award report block reply SicSemperTyrannis2 1 points 13 hours ago Is the author ever going to finish it? Whole lotta threads left dangling, just to have a dragon burn everything. permalink parent award report block reply NoticesBugleOWO 2 points 12 hours ago lol you are confused my dear... permalink parent award report block reply I_Love_45-70_Gov 2 points 9 hours ago It would have been an easier fight had they used their phasers rather than their swords. Anyway, may the Schwartz be with you. permalink parent award report block reply view 2 more comments...\nNoticesBugleOWO 6 points 13 hours ago I've been listening to the books for the first time during my commute to and from work. Currently most of the way though Return of the King. The second and third books are voiced by Andy Circus (the actor who played Golem) and it's absolutely great. Definitely helps to have the visuals from the movies, even if there's a lot they had to leave out for time. permalink parent award report block reply SicSemperTyrannis2 1 points 13 hours ago Is the author ever going to finish it? Whole lotta threads left dangling, just to have a dragon burn everything. permalink parent award report block reply NoticesBugleOWO 2 points 12 hours ago lol you are confused my dear... permalink parent award report block reply I_Love_45-70_Gov 2 points 9 hours ago It would have been an easier fight had they used their phasers rather than their swords. Anyway, may the Schwartz be with you. permalink parent award report block reply view 2 more comments...\nSicSemperTyrannis2 1 points 13 hours ago Is the author ever going to finish it? Whole lotta threads left dangling, just to have a dragon burn everything. permalink parent award report block reply NoticesBugleOWO 2 points 12 hours ago lol you are confused my dear... permalink parent award report block reply I_Love_45-70_Gov 2 points 9 hours ago It would have been an easier fight had they used their phasers rather than their swords. Anyway, may the Schwartz be with you. permalink parent award report block reply view 2 more comments...\nNoticesBugleOWO 2 points 12 hours ago lol you are confused my dear... permalink parent award report block reply I_Love_45-70_Gov 2 points 9 hours ago It would have been an easier fight had they used their phasers rather than their swords. Anyway, may the Schwartz be with you. permalink parent award report block reply view 2 more comments...\nI_Love_45-70_Gov 2 points 9 hours ago It would have been an easier fight had they used their phasers rather than their swords. Anyway, may the Schwartz be with you. permalink parent award report block reply view 2 more comments...\nGuerillaYourDreams 4 points 15 hours ago It’s pretty lame and I really liked LOTR. permalink award report block reply\nSERP-SERP 3 points 15 hours ago Excellent meme good sir 👏 👍 permalink award report block reply\nIAmTsunade 2 points 8 hours ago People always assume War is kinetic. If they continue to believe that, in 20 years we will be a Caliphate, not a country. Bet. permalink award report block reply SimaYi 2 points 7 hours ago We already have an merchant run economic zone. permalink parent award report block reply RolandDelacroix 1 points 4 hours ago It's just gonna be scaled up terrorist attacks like the 60s/70s.  That's how the left fights. permalink parent award report block reply\nSimaYi 2 points 7 hours ago We already have an merchant run economic zone. permalink parent award report block reply\nRolandDelacroix 1 points 4 hours ago It's just gonna be scaled up terrorist attacks like the 60s/70s.  That's how the left fights. permalink parent award report block reply\nRolandDelacroix 1 points 4 hours ago It's gonna take the Boomers dying off and the Zoomers rising up to change things. Zoomers and Alphas at least can admit some of the problems.  I'm hopeful for 2028 because Boomers are gonna fall off a cliff, but Zoomers need to get in the game to offset the retarded Millenials. permalink award report block reply\nMegaboom2025 1 points 12 hours ago Israel marches permalink award report block reply\nKOMMISSARofMAGA -1 points 8 hours ago Not a great meme, respectfully. permalink award report block reply\nWashingpede -4 points 15 hours ago Fuck outta here with this bullshit permalink award report block reply",
  "fetched_at": "2025-11-12T19:52:49.274253Z"
}