{
  "id": "1ARK9hkCtM",
  "url": "https://patriots.win/p/1ARK9hkCtM/nevada-agrees-to-ice-cooperation/c",
  "content": "1075 Nevada Agrees To ICE Cooperation After Pressure From Trump Admin (dailycaller.com) posted 2 days ago by Sea_Still 32 comments award share report block Nevada Agrees To ICE Cooperation After Pressure From Trump Admin The Trump administration pressed Nevada into working more closely with Immigration and Customs Enforcement (ICE) and other federal immigration authorities. dailycaller.com\n32 comments Sort by Top Top New Worst Old Save Around the Web 5 Parasite Causing Foods You Should Stop Eating Right Now Paratoxil realPhantomFuck 32 points 2 days ago As a Nevadan, good permalink award report block reply JamalPaintTheFence 13 points 2 days ago Same. Be nice to see prices fall. permalink parent award report block reply PoorMansPsychiatrist 8 points 2 days ago Be nice to be able to drive without worrying about getting creamed by an illegal without insurance. permalink parent award report block reply knittinkittens 4 points 2 days ago Preach, sister! permalink parent award report block reply Steve56775 4 points 2 days ago Sisolini and the Democrats gave them all licenses and registered them to vote. Good luck! permalink parent award report block reply view 1 more comments... DagneyTaggart 2 points 2 days ago Remember that POS Sandoval backed illegals getting drivers licenses? Said they would all then run out and get auto insurance. Contribute. Pay their share. Which would help lower the cost for everyone. Such lying sack of …. permalink parent award report block reply PoorMansPsychiatrist 1 points 2 days ago Yeah. Such a swarmy jagoff permalink parent award report block reply MidnightGhost 3 points 2 days ago Same!!\nNorthern nevada here...and we are looking like the damn Bay Area!  Lots of jeets and Chinese here too!! permalink parent award report block reply LibertarianXian 1 points 2 days ago Just tell them \"You have to go BACK\" permalink parent award report block reply RedCapNation 3 points 2 days ago Joe Lombardo sucks ass permalink parent award report block reply GTHAYS 4 points 2 days ago He damn sure wasn't saying this or doing it when he was Sheriff.  Clark and Washoe were the two sanctuary counties that wouldn't honor ICE detainers.  FORD is a POS, but as sheriff, LOMBARDO went along with it and didn't bat an eye.  He's about as honest as a three dollar bill. permalink parent award report block reply FUCK_TYLER 2 points 2 days ago same permalink parent award report block reply Grindelwald 13 points 2 days ago A lot of opportunity for ICE. permalink award report block reply Ladybug87 5 points 2 days ago That's an understatement permalink parent award report block reply VirTW 10 points 2 days ago They're terrified of what Trump would do to Las Vegas permalink award report block reply Jimmyprawns 8 points 2 days ago Yes and no.  Vegas isnt really part of Nevada anymore. Clark county has been effectively colonized by LA.  It's not part of Nevada any more it's SoCal now.   Its been solid blue and dragging down the rest of the state for years. To be fair.  Vegas has already been wrecked by the left and is only riding what remains of a now popped tourism bubble. Products of the post war baby boom(45-65) boomers and generation Jones.  Are what built Vegas.  Gambling the kids college funds away, chasing the false hope of something for nothing. All the cheap rooms and free or at least cheap entertainment was being subsidized by boomers who seemed to enjoy loosing big at the tables.  They've been ageing out and are no longer footing the bill. The currently emerging clientele is younger and primarily of a sensation seeking motive.  Flashing lights and feels.  Sensory overload is thier high.  They aren't as interested in gambling as they are in night clubs, 'hangover' style buffoonery and 'cool story bro' shenanigans. Those things are getting more and more expensive as the subsidies previously provided by boomers eager to loose at the tables dry up. The other issue is all of the transplants living there as part of some bucket list, \"wouldn't it be cool to live there,\" side quest.  The population there has exploded, and not because of any tangible or real economic opportunity. The place got crowded up because of all the people who just want to say they've lived there.  People who show up willing to pay anything for the privilege, but still haven't lined up a job to pay for the adventure and the bragging rights they crave.  Most of those folks only last 3yrs before returning to where they came from.  Like so many destitute and broken prodigal sons.  But that revolving door of suckers and wild eyed dreamers has wildly inflated the housing market and driven down wages. Vegas has never been a secure or predictable thing.  It's always wobbled between boom and bust.  But the last 20yrs has seen the place arrive at its least stable and most likely to catastrophically collapse condition yet. Trump doesn't need to do anything.  Nevada's cash cow has already been teetering on the brink.  For a while.  It's actually very likely to fall over all on its own. permalink parent award report block reply BoomShtick 5 points 2 days ago Same can be said with Washoe county permalink parent award report block reply Steve56775 3 points 2 days ago Have to agree, the California libtards moved here to escape Commiefornia and turned the population centers into California. Liberalism is a mental disorder. permalink parent award report block reply FUCK_TYLER 3 points 2 days ago I can see that and traffic got really bad because of all of the California transplants in Vegas too permalink parent award report block reply KekistanPM 7 points 2 days ago They should be doing this because it's the law and because we are a sovereign country with borders; not because they're worried about losing money or their jobs. permalink award report block reply TheSonOfGadsden 4 points 2 days ago Good! permalink award report block reply shadypollster 4 points 2 days ago Good. permalink award report block reply cyberwar 3 points 2 days ago Vegas will be empty permalink award report block reply MemphisMontoya71 4 points 2 days ago It already mostly is permalink parent award report block reply roadrunner0 3 points 2 days ago Nevada and the vast amount of service and tourist industry in that State got a huge boost from no tax on tips which put a lot more money in the hands of employees to spend and invest.. They damn well better agree to push the illegals out.. permalink award report block reply GodIsPerfect 3 points 2 days ago They were the hardest hit in the pandemic. They need to wise up and allow this wise move. permalink award report block reply LibertarianXian 2 points 2 days ago Las Vegas is already screwed for the next decade any way. Removing their slave labor pool just hastens its downfall. permalink award report block reply King_Dorgan 2 points 2 days ago Just like we did to Russia… Freeze all of their assets. permalink award report block reply\nrealPhantomFuck 32 points 2 days ago As a Nevadan, good permalink award report block reply JamalPaintTheFence 13 points 2 days ago Same. Be nice to see prices fall. permalink parent award report block reply PoorMansPsychiatrist 8 points 2 days ago Be nice to be able to drive without worrying about getting creamed by an illegal without insurance. permalink parent award report block reply knittinkittens 4 points 2 days ago Preach, sister! permalink parent award report block reply Steve56775 4 points 2 days ago Sisolini and the Democrats gave them all licenses and registered them to vote. Good luck! permalink parent award report block reply view 1 more comments... DagneyTaggart 2 points 2 days ago Remember that POS Sandoval backed illegals getting drivers licenses? Said they would all then run out and get auto insurance. Contribute. Pay their share. Which would help lower the cost for everyone. Such lying sack of …. permalink parent award report block reply PoorMansPsychiatrist 1 points 2 days ago Yeah. Such a swarmy jagoff permalink parent award report block reply MidnightGhost 3 points 2 days ago Same!!\nNorthern nevada here...and we are looking like the damn Bay Area!  Lots of jeets and Chinese here too!! permalink parent award report block reply LibertarianXian 1 points 2 days ago Just tell them \"You have to go BACK\" permalink parent award report block reply RedCapNation 3 points 2 days ago Joe Lombardo sucks ass permalink parent award report block reply GTHAYS 4 points 2 days ago He damn sure wasn't saying this or doing it when he was Sheriff.  Clark and Washoe were the two sanctuary counties that wouldn't honor ICE detainers.  FORD is a POS, but as sheriff, LOMBARDO went along with it and didn't bat an eye.  He's about as honest as a three dollar bill. permalink parent award report block reply FUCK_TYLER 2 points 2 days ago same permalink parent award report block reply\nJamalPaintTheFence 13 points 2 days ago Same. Be nice to see prices fall. permalink parent award report block reply PoorMansPsychiatrist 8 points 2 days ago Be nice to be able to drive without worrying about getting creamed by an illegal without insurance. permalink parent award report block reply knittinkittens 4 points 2 days ago Preach, sister! permalink parent award report block reply Steve56775 4 points 2 days ago Sisolini and the Democrats gave them all licenses and registered them to vote. Good luck! permalink parent award report block reply view 1 more comments... DagneyTaggart 2 points 2 days ago Remember that POS Sandoval backed illegals getting drivers licenses? Said they would all then run out and get auto insurance. Contribute. Pay their share. Which would help lower the cost for everyone. Such lying sack of …. permalink parent award report block reply PoorMansPsychiatrist 1 points 2 days ago Yeah. Such a swarmy jagoff permalink parent award report block reply\nPoorMansPsychiatrist 8 points 2 days ago Be nice to be able to drive without worrying about getting creamed by an illegal without insurance. permalink parent award report block reply knittinkittens 4 points 2 days ago Preach, sister! permalink parent award report block reply Steve56775 4 points 2 days ago Sisolini and the Democrats gave them all licenses and registered them to vote. Good luck! permalink parent award report block reply view 1 more comments... DagneyTaggart 2 points 2 days ago Remember that POS Sandoval backed illegals getting drivers licenses? Said they would all then run out and get auto insurance. Contribute. Pay their share. Which would help lower the cost for everyone. Such lying sack of …. permalink parent award report block reply PoorMansPsychiatrist 1 points 2 days ago Yeah. Such a swarmy jagoff permalink parent award report block reply\nknittinkittens 4 points 2 days ago Preach, sister! permalink parent award report block reply Steve56775 4 points 2 days ago Sisolini and the Democrats gave them all licenses and registered them to vote. Good luck! permalink parent award report block reply view 1 more comments...\nSteve56775 4 points 2 days ago Sisolini and the Democrats gave them all licenses and registered them to vote. Good luck! permalink parent award report block reply view 1 more comments...\nDagneyTaggart 2 points 2 days ago Remember that POS Sandoval backed illegals getting drivers licenses? Said they would all then run out and get auto insurance. Contribute. Pay their share. Which would help lower the cost for everyone. Such lying sack of …. permalink parent award report block reply PoorMansPsychiatrist 1 points 2 days ago Yeah. Such a swarmy jagoff permalink parent award report block reply\nPoorMansPsychiatrist 1 points 2 days ago Yeah. Such a swarmy jagoff permalink parent award report block reply\nMidnightGhost 3 points 2 days ago Same!!\nNorthern nevada here...and we are looking like the damn Bay Area!  Lots of jeets and Chinese here too!! permalink parent award report block reply LibertarianXian 1 points 2 days ago Just tell them \"You have to go BACK\" permalink parent award report block reply\nLibertarianXian 1 points 2 days ago Just tell them \"You have to go BACK\" permalink parent award report block reply\nRedCapNation 3 points 2 days ago Joe Lombardo sucks ass permalink parent award report block reply GTHAYS 4 points 2 days ago He damn sure wasn't saying this or doing it when he was Sheriff.  Clark and Washoe were the two sanctuary counties that wouldn't honor ICE detainers.  FORD is a POS, but as sheriff, LOMBARDO went along with it and didn't bat an eye.  He's about as honest as a three dollar bill. permalink parent award report block reply\nGTHAYS 4 points 2 days ago He damn sure wasn't saying this or doing it when he was Sheriff.  Clark and Washoe were the two sanctuary counties that wouldn't honor ICE detainers.  FORD is a POS, but as sheriff, LOMBARDO went along with it and didn't bat an eye.  He's about as honest as a three dollar bill. permalink parent award report block reply\nFUCK_TYLER 2 points 2 days ago same permalink parent award report block reply\nGrindelwald 13 points 2 days ago A lot of opportunity for ICE. permalink award report block reply Ladybug87 5 points 2 days ago That's an understatement permalink parent award report block reply\nLadybug87 5 points 2 days ago That's an understatement permalink parent award report block reply\nVirTW 10 points 2 days ago They're terrified of what Trump would do to Las Vegas permalink award report block reply Jimmyprawns 8 points 2 days ago Yes and no.  Vegas isnt really part of Nevada anymore. Clark county has been effectively colonized by LA.  It's not part of Nevada any more it's SoCal now.   Its been solid blue and dragging down the rest of the state for years. To be fair.  Vegas has already been wrecked by the left and is only riding what remains of a now popped tourism bubble. Products of the post war baby boom(45-65) boomers and generation Jones.  Are what built Vegas.  Gambling the kids college funds away, chasing the false hope of something for nothing. All the cheap rooms and free or at least cheap entertainment was being subsidized by boomers who seemed to enjoy loosing big at the tables.  They've been ageing out and are no longer footing the bill. The currently emerging clientele is younger and primarily of a sensation seeking motive.  Flashing lights and feels.  Sensory overload is thier high.  They aren't as interested in gambling as they are in night clubs, 'hangover' style buffoonery and 'cool story bro' shenanigans. Those things are getting more and more expensive as the subsidies previously provided by boomers eager to loose at the tables dry up. The other issue is all of the transplants living there as part of some bucket list, \"wouldn't it be cool to live there,\" side quest.  The population there has exploded, and not because of any tangible or real economic opportunity. The place got crowded up because of all the people who just want to say they've lived there.  People who show up willing to pay anything for the privilege, but still haven't lined up a job to pay for the adventure and the bragging rights they crave.  Most of those folks only last 3yrs before returning to where they came from.  Like so many destitute and broken prodigal sons.  But that revolving door of suckers and wild eyed dreamers has wildly inflated the housing market and driven down wages. Vegas has never been a secure or predictable thing.  It's always wobbled between boom and bust.  But the last 20yrs has seen the place arrive at its least stable and most likely to catastrophically collapse condition yet. Trump doesn't need to do anything.  Nevada's cash cow has already been teetering on the brink.  For a while.  It's actually very likely to fall over all on its own. permalink parent award report block reply BoomShtick 5 points 2 days ago Same can be said with Washoe county permalink parent award report block reply Steve56775 3 points 2 days ago Have to agree, the California libtards moved here to escape Commiefornia and turned the population centers into California. Liberalism is a mental disorder. permalink parent award report block reply FUCK_TYLER 3 points 2 days ago I can see that and traffic got really bad because of all of the California transplants in Vegas too permalink parent award report block reply\nJimmyprawns 8 points 2 days ago Yes and no.  Vegas isnt really part of Nevada anymore. Clark county has been effectively colonized by LA.  It's not part of Nevada any more it's SoCal now.   Its been solid blue and dragging down the rest of the state for years. To be fair.  Vegas has already been wrecked by the left and is only riding what remains of a now popped tourism bubble. Products of the post war baby boom(45-65) boomers and generation Jones.  Are what built Vegas.  Gambling the kids college funds away, chasing the false hope of something for nothing. All the cheap rooms and free or at least cheap entertainment was being subsidized by boomers who seemed to enjoy loosing big at the tables.  They've been ageing out and are no longer footing the bill. The currently emerging clientele is younger and primarily of a sensation seeking motive.  Flashing lights and feels.  Sensory overload is thier high.  They aren't as interested in gambling as they are in night clubs, 'hangover' style buffoonery and 'cool story bro' shenanigans. Those things are getting more and more expensive as the subsidies previously provided by boomers eager to loose at the tables dry up. The other issue is all of the transplants living there as part of some bucket list, \"wouldn't it be cool to live there,\" side quest.  The population there has exploded, and not because of any tangible or real economic opportunity. The place got crowded up because of all the people who just want to say they've lived there.  People who show up willing to pay anything for the privilege, but still haven't lined up a job to pay for the adventure and the bragging rights they crave.  Most of those folks only last 3yrs before returning to where they came from.  Like so many destitute and broken prodigal sons.  But that revolving door of suckers and wild eyed dreamers has wildly inflated the housing market and driven down wages. Vegas has never been a secure or predictable thing.  It's always wobbled between boom and bust.  But the last 20yrs has seen the place arrive at its least stable and most likely to catastrophically collapse condition yet. Trump doesn't need to do anything.  Nevada's cash cow has already been teetering on the brink.  For a while.  It's actually very likely to fall over all on its own. permalink parent award report block reply BoomShtick 5 points 2 days ago Same can be said with Washoe county permalink parent award report block reply Steve56775 3 points 2 days ago Have to agree, the California libtards moved here to escape Commiefornia and turned the population centers into California. Liberalism is a mental disorder. permalink parent award report block reply FUCK_TYLER 3 points 2 days ago I can see that and traffic got really bad because of all of the California transplants in Vegas too permalink parent award report block reply\nBoomShtick 5 points 2 days ago Same can be said with Washoe county permalink parent award report block reply Steve56775 3 points 2 days ago Have to agree, the California libtards moved here to escape Commiefornia and turned the population centers into California. Liberalism is a mental disorder. permalink parent award report block reply\nSteve56775 3 points 2 days ago Have to agree, the California libtards moved here to escape Commiefornia and turned the population centers into California. Liberalism is a mental disorder. permalink parent award report block reply\nFUCK_TYLER 3 points 2 days ago I can see that and traffic got really bad because of all of the California transplants in Vegas too permalink parent award report block reply\nKekistanPM 7 points 2 days ago They should be doing this because it's the law and because we are a sovereign country with borders; not because they're worried about losing money or their jobs. permalink award report block reply\nTheSonOfGadsden 4 points 2 days ago Good! permalink award report block reply\nshadypollster 4 points 2 days ago Good. permalink award report block reply\ncyberwar 3 points 2 days ago Vegas will be empty permalink award report block reply MemphisMontoya71 4 points 2 days ago It already mostly is permalink parent award report block reply\nMemphisMontoya71 4 points 2 days ago It already mostly is permalink parent award report block reply\nroadrunner0 3 points 2 days ago Nevada and the vast amount of service and tourist industry in that State got a huge boost from no tax on tips which put a lot more money in the hands of employees to spend and invest.. They damn well better agree to push the illegals out.. permalink award report block reply\nGodIsPerfect 3 points 2 days ago They were the hardest hit in the pandemic. They need to wise up and allow this wise move. permalink award report block reply\nLibertarianXian 2 points 2 days ago Las Vegas is already screwed for the next decade any way. Removing their slave labor pool just hastens its downfall. permalink award report block reply\nKing_Dorgan 2 points 2 days ago Just like we did to Russia… Freeze all of their assets. permalink award report block reply",
  "fetched_at": "2025-11-12T21:23:55.718431Z"
}