{
  "id": "1ARK9l7SmG",
  "url": "https://patriots.win/p/1ARK9l7SmG/in-1995-the-nyc-veterans-day-par/c",
  "content": "1289 In 1995, the NYC Veterans Day Parade was in dire financial straits.\n\nPresident Trump personally donated $200,000 and raised another $300,000 to save the parade.\n\nGod bless our Veterans and our great \nPOTUS! 🇺🇸 ⚠️ HIGH ENERGY ⚠️ posted 1 day ago by YodaBannon 16 comments award share report block Christian Collins @CollinsforTX • 1d In 1995, the NYC Veterans Day Parade was in dire financial straits. President Trump personally donated $200,000 and raised another $300,000 to save the parade. God bless our Veterans and our great @POTUS! 🇺🇸\n16 comments Sort by Top Top New Worst Old Save GA_Logic 19 points 1 day ago President Trump is always taking care of business with what matters the most. permalink award report block reply BillyBobJimmyJoe 0 points 5 hours ago Those scumbags did nothing to stop the immigrant invasion, and they want a parade for it? permalink parent award report block reply YodaBannon OP 10 points 1 day ago so stickie, some say the stickiest permalink award report block reply YaharaRiver 1 points 1 day ago Heard the band playing “Onward Christian Soldiers” 🫡👍 permalink parent award report block reply DCYR66 6 points 1 day ago Now they’re gonna have prayer mats up and down the streets and those speakers spewing that annoying howl they do. permalink award report block reply YaharaRiver 2 points 1 day ago God forbid. permalink parent award report block reply ParmesanCartel 6 points 1 day ago Only to end up hosting an Al Qaeda leader at the White House on the marine corps birthday lol what a retard permalink award report block reply 0111000001100101 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply Covfefebrulee 5 points 1 day ago I remember, we took the train in to see the parade! permalink award report block reply Stanwyk74 2 points 1 day ago But somehow freakshow pervert parades are always well funded permalink award report block reply SavingPrivateGrace 1 points 1 day ago He was the Grand Marshal of this parade.  God bless the Vets.  Hope they have a wonderful day today. ❤️🇺🇸 permalink award report block reply DEPORT50M 1 points 5 hours ago I'm surprised he didn't bring in 100,000 Indians to carry the flags because we're too fucking stupid and unskilled to do it ourselves. Did he take it a 50 year loan instead of paying cash? permalink award report block reply 0111000001100101 1 points 1 day ago My meme losses are being used well. permalink award report block reply Shitnooo 1 points 1 day ago When Mandami gets in, it’ll be bye bye to Veteran parades and gay parades, as well as Thanksgiving Day parades. permalink award report block reply YodaBannon OP 1 points 24 hours ago he would not win again if that happened, the hooker parade might happen permalink parent award report block reply\nGA_Logic 19 points 1 day ago President Trump is always taking care of business with what matters the most. permalink award report block reply BillyBobJimmyJoe 0 points 5 hours ago Those scumbags did nothing to stop the immigrant invasion, and they want a parade for it? permalink parent award report block reply\nBillyBobJimmyJoe 0 points 5 hours ago Those scumbags did nothing to stop the immigrant invasion, and they want a parade for it? permalink parent award report block reply\nYodaBannon OP 10 points 1 day ago so stickie, some say the stickiest permalink award report block reply YaharaRiver 1 points 1 day ago Heard the band playing “Onward Christian Soldiers” 🫡👍 permalink parent award report block reply\nYaharaRiver 1 points 1 day ago Heard the band playing “Onward Christian Soldiers” 🫡👍 permalink parent award report block reply\nDCYR66 6 points 1 day ago Now they’re gonna have prayer mats up and down the streets and those speakers spewing that annoying howl they do. permalink award report block reply YaharaRiver 2 points 1 day ago God forbid. permalink parent award report block reply\nYaharaRiver 2 points 1 day ago God forbid. permalink parent award report block reply\nParmesanCartel 6 points 1 day ago Only to end up hosting an Al Qaeda leader at the White House on the marine corps birthday lol what a retard permalink award report block reply 0111000001100101 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply\n0111000001100101 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply\nCovfefebrulee 5 points 1 day ago I remember, we took the train in to see the parade! permalink award report block reply\nStanwyk74 2 points 1 day ago But somehow freakshow pervert parades are always well funded permalink award report block reply\nSavingPrivateGrace 1 points 1 day ago He was the Grand Marshal of this parade.  God bless the Vets.  Hope they have a wonderful day today. ❤️🇺🇸 permalink award report block reply\nDEPORT50M 1 points 5 hours ago I'm surprised he didn't bring in 100,000 Indians to carry the flags because we're too fucking stupid and unskilled to do it ourselves. Did he take it a 50 year loan instead of paying cash? permalink award report block reply\n0111000001100101 1 points 1 day ago My meme losses are being used well. permalink award report block reply\nShitnooo 1 points 1 day ago When Mandami gets in, it’ll be bye bye to Veteran parades and gay parades, as well as Thanksgiving Day parades. permalink award report block reply YodaBannon OP 1 points 24 hours ago he would not win again if that happened, the hooker parade might happen permalink parent award report block reply\nYodaBannon OP 1 points 24 hours ago he would not win again if that happened, the hooker parade might happen permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:57:27.251217Z"
}