{
  "id": "1ARK9oW6di",
  "url": "https://patriots.win/p/1ARK9oW6di/ban-pro-drumpf-content-on-the-do/c",
  "content": "9 “bAn pRo dRuMpF cOnTeNt”… on The Donald.\n🤡🤡😂😂 posted 3 hours ago by couranto 5 comments award share download report block\n5 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno julianReyes 2 points 2 hours ago lol, looks like PDW is realizing why I make comments like \"PDW is leftist.\" permalink award report block reply DangerousAmerican76 1 points 2 hours ago You know that’s fake right, trump being nice to people he shouldn’t be nice too, Hard to understand but diplomacy is an art of kissing terrible peoples asses for the benefit of peace. Now do I agree, no, kill him and take Syria give it back to the Syrian people, put alwati back in power he favored none permalink award report block reply Thatunknownguy 1 points 3 hours ago Fuck you I want my country back permalink award report block reply RINO_fatigue -2 points 2 hours ago go back to reddit, sir permalink parent award report block reply Thatunknownguy 4 points 2 hours ago Go back to india permalink parent award report block reply\njulianReyes 2 points 2 hours ago lol, looks like PDW is realizing why I make comments like \"PDW is leftist.\" permalink award report block reply\nDangerousAmerican76 1 points 2 hours ago You know that’s fake right, trump being nice to people he shouldn’t be nice too, Hard to understand but diplomacy is an art of kissing terrible peoples asses for the benefit of peace. Now do I agree, no, kill him and take Syria give it back to the Syrian people, put alwati back in power he favored none permalink award report block reply\nThatunknownguy 1 points 3 hours ago Fuck you I want my country back permalink award report block reply RINO_fatigue -2 points 2 hours ago go back to reddit, sir permalink parent award report block reply Thatunknownguy 4 points 2 hours ago Go back to india permalink parent award report block reply\nRINO_fatigue -2 points 2 hours ago go back to reddit, sir permalink parent award report block reply Thatunknownguy 4 points 2 hours ago Go back to india permalink parent award report block reply\nThatunknownguy 4 points 2 hours ago Go back to india permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:30:06.370295Z"
}