{
  "id": "1ARK9l80wT",
  "url": "https://patriots.win/p/1ARK9l80wT/deport-30-million-illegal-aliens/c",
  "content": "873 Deport 30 million illegal aliens. \n\nSend the H-1B visa and their H-4 visa family members back to their home countries.\n\nHousing prices and apartment rental prices will become affordable instantly.\n\nAnd American wages will increase. posted 1 day ago by PiratePatriotParrot 31 comments award share report block Wall Street Mav @WallStreetMav • 1d Deport 30 million illegal aliens. Send the H-1B visa and their H-4 visa family members back to their home countries. Housing prices and apartment rental prices will become affordable instantly. And American wages will increase. William Wolfe 🇺🇸 @William_E_Wolfe • 2d The first political party that makes it possible to buy a house and raise a family on *one income* will rule America for the next 50 years.\n31 comments Sort by Top Top New Worst Old Save keeptherepublic1776 37 points 1 day ago It won't happen because we are peasants and our overlords want cheap obedient labor. This don't end peacefully permalink award report block reply Hunter77 13 points 1 day ago Honestly, I'm not sure good wages will happen even if H1Bs are ended... collusion happens informally a lot more than it should. But still, the H1Bs are a start. permalink parent award report block reply keeptherepublic1776 7 points 1 day ago I honestly think off shore is a bigger problem permalink parent award report block reply Hunter77 2 points 19 hours ago Could be. Definitely will be if H1B visas are attacked. Hell, some companies will shut down before hiring americans. permalink parent award report block reply keeptherepublic1776 3 points 10 hours ago My company. Posted a full time job. Maybe a week later they hire 2 BAs . Now that ft position is expired. The post claim noone wanted it. Then off shore. I think all companies are doing this. permalink parent award report block reply FusionBlack 2 points 21 hours ago I believe you are not wrong. If we get a radical in the oval and both houses we may not have to even worry about it as we will be eating out of trash cans. permalink parent award report block reply someguy7738 27 points 1 day ago Also ban these huge financial interests like blackrock from buying up the entire housing stock. Not sure the best way to go about it, but banning corporate firms from buying out of state properties is probably a good start. This is especially important for \"poorer\" or lower cost of living states, when rich out of state corps can buy up everything for basically pennies (from their POV, what were reasonable/affordable prices from the people of that state's POV) and jacking them up to the ridiculous norms back in their super high COL states. There's a reason most countries ban foreign interests from buying up real estate. Yes, I am mad about carpet bagger yankee fucks and cali fags skyrocketing housing prices in my area. permalink award report block reply The_Bloofy_Bullshark 12 points 1 day ago Pretty sure it was a corpo that bought one of the houses I was looking at years ago. $150k asking price. Ended up selling for over $500k 4 months later. There is absolutely no fucking way that place was worth $500k. Not even $250k-$300k. Dodged a bullet there since that neighborhood went from quiet to overrun by crime/junkies. permalink parent award report block reply MAGASquatch 5 points 23 hours ago This!  👆 permalink parent award report block reply Foreign_Aid_is_Theft 2 points 21 hours ago When we make single family rentals as joyful as owning subsidized multifamily housing, without the subsidies it will correct itself. permalink parent award report block reply alfredbester 20 points 1 day ago Sorry. Best we can do is a 50 year mortgage and a 30 year car loan with subscription fees for connecting to the cloud. Pay your taxes. permalink award report block reply NC_patriot 20 points 1 day ago While letting in 600k Chicom students permalink parent award report block reply The_Bloofy_Bullshark 11 points 1 day ago I love how the argument is that they are just students . Just like that kid who was taking those tactical courses since he was an “enthusiast” only for it to later come out that he was an instructor for a PRC SOF unit when photos of him in a full rebreather setup as well as pictures of him in free fall equipment popped up online. permalink parent award report block reply YouEssAye 10 points 1 day ago \"We're gonna win so much, you may even get tired of winning. And you'll say 'Please please, it's too much winning. We can't take it anymore. Mr. President it's too much\" permalink parent award report block reply Jmricht 11 points 1 day ago Why can’t we be just our own country? permalink parent award report block reply KEK_1776_KEK 5 points 1 day ago The price of gold and silver is an indicator that the dollar is losing.  It's not going to recover - so, prepare for the worst. That 50 year mortgage bullshit is a hint of the economic loss ahead.  We will own nothing, remember? permalink parent award report block reply LongerThanTheNile 2 points 17 hours ago Trump was controlled opposition all along. permalink parent award report block reply MR__K 5 points 22 hours ago And a loan program for ordering pizza permalink parent award report block reply d003 1 points 9 hours ago a pizza that tastes like cardboard and likely causes one to lose a few days of overall life for having consumed it. permalink parent award report block reply Lamal 18 points 1 day ago this is the way. Also collect the daily fine on illegal immigrants, even if it means forced asset sales. Also track down fraud on loan applications -- you can find this in abundance wherever illegals own homes -- they know if there is ever an investigation they can flee the country permalink award report block reply Greenhills 9 points 1 day ago And steeply tax American companies a percentage of their offshore professional services costs. Steeply. Like 15% making it financially less beneficially to ship jobs overseas. permalink award report block reply ConfusedAngryArmed 6 points 1 day ago There's probably a solid 50-80 million \"legals\" you could denaturalize and deport, too. permalink award report block reply MAGASquatch 4 points 23 hours ago Also need to stop foreigners and corporate entities like Blackrock from purchasing residential housing. permalink award report block reply Awakened 4 points 1 day ago That's a start and the only hope of preserving a large and healthy middle class so they won't do that. Instead we will get 600k Chinese spies in our colleges. And if we complain too much they will send our kids to WWIII. permalink award report block reply perma-maga 3 points 1 day ago It Must Be Done!!! permalink award report block reply Jmricht 3 points 1 day ago L-1 permalink award report block reply Krat 2 points 1 day ago 30? Try 150 mil + permalink award report block reply FrensInLowPlaces 2 points 21 hours ago Sue to employers that gave them an income permalink award report block reply LongerThanTheNile 1 points 17 hours ago I'm done with Trump after his comments to Ingraham on H-1Bs. If y'all still support him after that, you're America Last, pure and simple. Fuck you, Donald J Trump. Americans are the hardest, best workers in the world. The idea that these tech companies can lay off hundreds of thousands of people (under Trump's watch, btw), then literally replace them with H-1Bs, and PIECE OF SHIT Trump's response is: \"You need talent, you don't have talent here!\" Yeah fuck him and fuck every last one of you that still supports his American-hating ass. Ban me all you want, just shows this site is about Trump, not America. Just like Trump's second term. Maybe he'll make another memecoin on the way out, and hawk another vaccine while he's at it. permalink award report block reply Skyes 1 points 11 hours ago No matter where I go, I’m surrounded by immigrants, illegals or otherwise, being loud and pushy speaking their language. Not even trying to assimilate. Our roads, housing, schools, stores are crowded. All must go home. Go home and create America in your country and culture permalink award report block reply mohel 1 points 17 hours ago Best I can do is 50 year mortgage permalink award report block reply expertnoticer 1 points 22 hours ago Comment removed by community filter, pending further review. permalink award report block reply\nkeeptherepublic1776 37 points 1 day ago It won't happen because we are peasants and our overlords want cheap obedient labor. This don't end peacefully permalink award report block reply Hunter77 13 points 1 day ago Honestly, I'm not sure good wages will happen even if H1Bs are ended... collusion happens informally a lot more than it should. But still, the H1Bs are a start. permalink parent award report block reply keeptherepublic1776 7 points 1 day ago I honestly think off shore is a bigger problem permalink parent award report block reply Hunter77 2 points 19 hours ago Could be. Definitely will be if H1B visas are attacked. Hell, some companies will shut down before hiring americans. permalink parent award report block reply keeptherepublic1776 3 points 10 hours ago My company. Posted a full time job. Maybe a week later they hire 2 BAs . Now that ft position is expired. The post claim noone wanted it. Then off shore. I think all companies are doing this. permalink parent award report block reply FusionBlack 2 points 21 hours ago I believe you are not wrong. If we get a radical in the oval and both houses we may not have to even worry about it as we will be eating out of trash cans. permalink parent award report block reply\nHunter77 13 points 1 day ago Honestly, I'm not sure good wages will happen even if H1Bs are ended... collusion happens informally a lot more than it should. But still, the H1Bs are a start. permalink parent award report block reply keeptherepublic1776 7 points 1 day ago I honestly think off shore is a bigger problem permalink parent award report block reply Hunter77 2 points 19 hours ago Could be. Definitely will be if H1B visas are attacked. Hell, some companies will shut down before hiring americans. permalink parent award report block reply keeptherepublic1776 3 points 10 hours ago My company. Posted a full time job. Maybe a week later they hire 2 BAs . Now that ft position is expired. The post claim noone wanted it. Then off shore. I think all companies are doing this. permalink parent award report block reply\nkeeptherepublic1776 7 points 1 day ago I honestly think off shore is a bigger problem permalink parent award report block reply Hunter77 2 points 19 hours ago Could be. Definitely will be if H1B visas are attacked. Hell, some companies will shut down before hiring americans. permalink parent award report block reply keeptherepublic1776 3 points 10 hours ago My company. Posted a full time job. Maybe a week later they hire 2 BAs . Now that ft position is expired. The post claim noone wanted it. Then off shore. I think all companies are doing this. permalink parent award report block reply\nHunter77 2 points 19 hours ago Could be. Definitely will be if H1B visas are attacked. Hell, some companies will shut down before hiring americans. permalink parent award report block reply keeptherepublic1776 3 points 10 hours ago My company. Posted a full time job. Maybe a week later they hire 2 BAs . Now that ft position is expired. The post claim noone wanted it. Then off shore. I think all companies are doing this. permalink parent award report block reply\nkeeptherepublic1776 3 points 10 hours ago My company. Posted a full time job. Maybe a week later they hire 2 BAs . Now that ft position is expired. The post claim noone wanted it. Then off shore. I think all companies are doing this. permalink parent award report block reply\nFusionBlack 2 points 21 hours ago I believe you are not wrong. If we get a radical in the oval and both houses we may not have to even worry about it as we will be eating out of trash cans. permalink parent award report block reply\nsomeguy7738 27 points 1 day ago Also ban these huge financial interests like blackrock from buying up the entire housing stock. Not sure the best way to go about it, but banning corporate firms from buying out of state properties is probably a good start. This is especially important for \"poorer\" or lower cost of living states, when rich out of state corps can buy up everything for basically pennies (from their POV, what were reasonable/affordable prices from the people of that state's POV) and jacking them up to the ridiculous norms back in their super high COL states. There's a reason most countries ban foreign interests from buying up real estate. Yes, I am mad about carpet bagger yankee fucks and cali fags skyrocketing housing prices in my area. permalink award report block reply The_Bloofy_Bullshark 12 points 1 day ago Pretty sure it was a corpo that bought one of the houses I was looking at years ago. $150k asking price. Ended up selling for over $500k 4 months later. There is absolutely no fucking way that place was worth $500k. Not even $250k-$300k. Dodged a bullet there since that neighborhood went from quiet to overrun by crime/junkies. permalink parent award report block reply MAGASquatch 5 points 23 hours ago This!  👆 permalink parent award report block reply Foreign_Aid_is_Theft 2 points 21 hours ago When we make single family rentals as joyful as owning subsidized multifamily housing, without the subsidies it will correct itself. permalink parent award report block reply\nThe_Bloofy_Bullshark 12 points 1 day ago Pretty sure it was a corpo that bought one of the houses I was looking at years ago. $150k asking price. Ended up selling for over $500k 4 months later. There is absolutely no fucking way that place was worth $500k. Not even $250k-$300k. Dodged a bullet there since that neighborhood went from quiet to overrun by crime/junkies. permalink parent award report block reply\nMAGASquatch 5 points 23 hours ago This!  👆 permalink parent award report block reply\nForeign_Aid_is_Theft 2 points 21 hours ago When we make single family rentals as joyful as owning subsidized multifamily housing, without the subsidies it will correct itself. permalink parent award report block reply\nalfredbester 20 points 1 day ago Sorry. Best we can do is a 50 year mortgage and a 30 year car loan with subscription fees for connecting to the cloud. Pay your taxes. permalink award report block reply NC_patriot 20 points 1 day ago While letting in 600k Chicom students permalink parent award report block reply The_Bloofy_Bullshark 11 points 1 day ago I love how the argument is that they are just students . Just like that kid who was taking those tactical courses since he was an “enthusiast” only for it to later come out that he was an instructor for a PRC SOF unit when photos of him in a full rebreather setup as well as pictures of him in free fall equipment popped up online. permalink parent award report block reply YouEssAye 10 points 1 day ago \"We're gonna win so much, you may even get tired of winning. And you'll say 'Please please, it's too much winning. We can't take it anymore. Mr. President it's too much\" permalink parent award report block reply Jmricht 11 points 1 day ago Why can’t we be just our own country? permalink parent award report block reply KEK_1776_KEK 5 points 1 day ago The price of gold and silver is an indicator that the dollar is losing.  It's not going to recover - so, prepare for the worst. That 50 year mortgage bullshit is a hint of the economic loss ahead.  We will own nothing, remember? permalink parent award report block reply LongerThanTheNile 2 points 17 hours ago Trump was controlled opposition all along. permalink parent award report block reply MR__K 5 points 22 hours ago And a loan program for ordering pizza permalink parent award report block reply d003 1 points 9 hours ago a pizza that tastes like cardboard and likely causes one to lose a few days of overall life for having consumed it. permalink parent award report block reply\nNC_patriot 20 points 1 day ago While letting in 600k Chicom students permalink parent award report block reply The_Bloofy_Bullshark 11 points 1 day ago I love how the argument is that they are just students . Just like that kid who was taking those tactical courses since he was an “enthusiast” only for it to later come out that he was an instructor for a PRC SOF unit when photos of him in a full rebreather setup as well as pictures of him in free fall equipment popped up online. permalink parent award report block reply YouEssAye 10 points 1 day ago \"We're gonna win so much, you may even get tired of winning. And you'll say 'Please please, it's too much winning. We can't take it anymore. Mr. President it's too much\" permalink parent award report block reply\nThe_Bloofy_Bullshark 11 points 1 day ago I love how the argument is that they are just students . Just like that kid who was taking those tactical courses since he was an “enthusiast” only for it to later come out that he was an instructor for a PRC SOF unit when photos of him in a full rebreather setup as well as pictures of him in free fall equipment popped up online. permalink parent award report block reply\nYouEssAye 10 points 1 day ago \"We're gonna win so much, you may even get tired of winning. And you'll say 'Please please, it's too much winning. We can't take it anymore. Mr. President it's too much\" permalink parent award report block reply\nJmricht 11 points 1 day ago Why can’t we be just our own country? permalink parent award report block reply\nKEK_1776_KEK 5 points 1 day ago The price of gold and silver is an indicator that the dollar is losing.  It's not going to recover - so, prepare for the worst. That 50 year mortgage bullshit is a hint of the economic loss ahead.  We will own nothing, remember? permalink parent award report block reply LongerThanTheNile 2 points 17 hours ago Trump was controlled opposition all along. permalink parent award report block reply\nLongerThanTheNile 2 points 17 hours ago Trump was controlled opposition all along. permalink parent award report block reply\nMR__K 5 points 22 hours ago And a loan program for ordering pizza permalink parent award report block reply d003 1 points 9 hours ago a pizza that tastes like cardboard and likely causes one to lose a few days of overall life for having consumed it. permalink parent award report block reply\nd003 1 points 9 hours ago a pizza that tastes like cardboard and likely causes one to lose a few days of overall life for having consumed it. permalink parent award report block reply\nLamal 18 points 1 day ago this is the way. Also collect the daily fine on illegal immigrants, even if it means forced asset sales. Also track down fraud on loan applications -- you can find this in abundance wherever illegals own homes -- they know if there is ever an investigation they can flee the country permalink award report block reply\nGreenhills 9 points 1 day ago And steeply tax American companies a percentage of their offshore professional services costs. Steeply. Like 15% making it financially less beneficially to ship jobs overseas. permalink award report block reply\nConfusedAngryArmed 6 points 1 day ago There's probably a solid 50-80 million \"legals\" you could denaturalize and deport, too. permalink award report block reply\nMAGASquatch 4 points 23 hours ago Also need to stop foreigners and corporate entities like Blackrock from purchasing residential housing. permalink award report block reply\nAwakened 4 points 1 day ago That's a start and the only hope of preserving a large and healthy middle class so they won't do that. Instead we will get 600k Chinese spies in our colleges. And if we complain too much they will send our kids to WWIII. permalink award report block reply\nperma-maga 3 points 1 day ago It Must Be Done!!! permalink award report block reply\nJmricht 3 points 1 day ago L-1 permalink award report block reply\nKrat 2 points 1 day ago 30? Try 150 mil + permalink award report block reply\nFrensInLowPlaces 2 points 21 hours ago Sue to employers that gave them an income permalink award report block reply\nLongerThanTheNile 1 points 17 hours ago I'm done with Trump after his comments to Ingraham on H-1Bs. If y'all still support him after that, you're America Last, pure and simple. Fuck you, Donald J Trump. Americans are the hardest, best workers in the world. The idea that these tech companies can lay off hundreds of thousands of people (under Trump's watch, btw), then literally replace them with H-1Bs, and PIECE OF SHIT Trump's response is: \"You need talent, you don't have talent here!\" Yeah fuck him and fuck every last one of you that still supports his American-hating ass. Ban me all you want, just shows this site is about Trump, not America. Just like Trump's second term. Maybe he'll make another memecoin on the way out, and hawk another vaccine while he's at it. permalink award report block reply\nSkyes 1 points 11 hours ago No matter where I go, I’m surrounded by immigrants, illegals or otherwise, being loud and pushy speaking their language. Not even trying to assimilate. Our roads, housing, schools, stores are crowded. All must go home. Go home and create America in your country and culture permalink award report block reply\nmohel 1 points 17 hours ago Best I can do is 50 year mortgage permalink award report block reply\nexpertnoticer 1 points 22 hours ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T23:15:53.691809Z"
}