{
  "id": "8184757",
  "title": "411Fluorideposted10 hours agobyCole_Burns32 commentsawardsharedownloadreportblock",
  "url": "https://patriots.win/p/1ARK9mHEk3/fluoride/c",
  "content": "436 Fluoride posted 15 hours ago by Cole_Burns 33 comments award share download report block\n33 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style Strike08 31 points 13 hours ago You do know that a lot of products that are safe for consumption have that symbol in its concentrated form. Ethanol is in its pure form toxic but is consumed en-masse. NO for instance is part of your biochemistry but having exposure to 100 ppm is highly toxic. It is all about dosage. permalink award report block reply UncleSlayton 24 points 12 hours ago It's way easier to be irrational and hysterical. permalink parent award report block reply Standingoak -2 points 6 hours ago That's what they have been saying to the anti-vaccine crowd. permalink parent award report block reply HostlyMarmless -5 points 11 hours ago And presenting a PHOTO, and allowing you to draw your own conclusions, is now \"irrational and hysterical\". Have another glass of water.  I mixed this one up MYSELF. permalink parent award report block reply UncleSlayton 11 points 11 hours ago Presenting a photo meant to intentionally mislead people too ignorant to know better into false conclusions is worse, you're right.  It's deceptive and causes great harm to the causes trying to stop treating water for legitimate reasons. Everything is toxic in a high enough dose or concentration.  Everything.  Water is toxic. permalink parent award report block reply Quixotic 1 points 9 hours ago It’s not a false conclusion though, you fucking idiot. Fluoride is toxic. permalink parent award report block reply view 3 more comments... Strike08 5 points 11 hours ago Salt is deadly when you take enough of it. The reason for the toxicity symbol is that in high enough dosis it has toxic elements. Just like chlorine being highly toxic as well but is used to make water drinkable. Just because the symbol is on a product doesn't mean that it cannot be used for anything that gets consumed. You get more fluoride from eating veggies or potatoes than the small amount you get from drinking water. Fucking shellfish is a fluoride source and people love eating that permalink parent award report block reply roadrunner0 5 points 11 hours ago Eating 4 ounces of table salt can certainly be fatal.. permalink parent award report block reply view 4 more comments... Quixotic 3 points 9 hours ago Salt doesn’t have that label permalink parent award report block reply view 2 more comments... glow-operator-2-0 1 points 10 hours ago You should imbibe and consume sodium and iodine in their separate forms; their combine form is a real killer, especially for diabetics. permalink parent award report block reply Pede45 3 points 8 hours ago I think you are missing the point here. There is no reason to put fluoride in the water. permalink parent award report block reply Rydanovich 2 points 9 hours ago Salt, water, vitamin A, all toxic with high amounts. Only difference between poison and cure is dosage. permalink parent award report block reply someguy7738 1 points 6 hours ago Sure sure but it's also true that ethanol is not being put into the water supply in order to force people to consume it whether they want to or not. If you want fluoride in your water, add it your damn self. permalink parent award report block reply Dev404 1 points 8 hours ago Yes. Now do you trust your government who's handling it? permalink parent award report block reply pedespeed 9 points 12 hours ago Now do coke and pepsi kegs being delivered to the bottling plant. permalink award report block reply TGNX 3 points 10 hours ago That's not true. They look like $$$$$. permalink award report block reply Pdotwinner 3 points 10 hours ago Just grab a reverse osmosis unit off of Amazon for a couple hundred bucks and filter that shit out. permalink award report block reply mathteach314159 2 points 9 hours ago I did that a couple months ago. Whats your take on adding minerals back in? Really not sure what to think of it. Not really concerned about mineral deficiency as I am sure we get plenty of our mineral intake from our diet, but might want to do something just for flavor. At first it was great, like drinking straight from an iceberg. But after awhile I started noticing what I could only describe as a baking soda flavor, and I read thats due to the PH balance of the pure h2o being a little off from what I am used to. permalink parent award report block reply Watermelons 3 points 10 hours ago Yep.  Looks good to me. This is what NaF salt bags look like. permalink award report block reply FrensInLowPlaces 1 points 8 hours ago Sodium Hypochlorite is often used, toxic.  Chlorine is a nasty chemical used too.\nThe clarification process can use chemicals like calcium carbonate and calcium oxide, I wouldnt recommend consuming either. Plus a whole bunch of sulfuric acid is used depending on the plant. I dont think that's safe either. permalink award report block reply catinmylapone 1 points 9 hours ago The dangerous goods label reads like it's nuclear waste for the handling. permalink award report block reply Mungo 1 points 10 hours ago Nothing but well water here for the last 40 years! permalink award report block reply Hantif -1 points 10 hours ago Now do dihydrogen monoxide. https://dhmo.org/ permalink award report block reply\nStrike08 31 points 13 hours ago You do know that a lot of products that are safe for consumption have that symbol in its concentrated form. Ethanol is in its pure form toxic but is consumed en-masse. NO for instance is part of your biochemistry but having exposure to 100 ppm is highly toxic. It is all about dosage. permalink award report block reply UncleSlayton 24 points 12 hours ago It's way easier to be irrational and hysterical. permalink parent award report block reply Standingoak -2 points 6 hours ago That's what they have been saying to the anti-vaccine crowd. permalink parent award report block reply HostlyMarmless -5 points 11 hours ago And presenting a PHOTO, and allowing you to draw your own conclusions, is now \"irrational and hysterical\". Have another glass of water.  I mixed this one up MYSELF. permalink parent award report block reply UncleSlayton 11 points 11 hours ago Presenting a photo meant to intentionally mislead people too ignorant to know better into false conclusions is worse, you're right.  It's deceptive and causes great harm to the causes trying to stop treating water for legitimate reasons. Everything is toxic in a high enough dose or concentration.  Everything.  Water is toxic. permalink parent award report block reply Quixotic 1 points 9 hours ago It’s not a false conclusion though, you fucking idiot. Fluoride is toxic. permalink parent award report block reply view 3 more comments... Strike08 5 points 11 hours ago Salt is deadly when you take enough of it. The reason for the toxicity symbol is that in high enough dosis it has toxic elements. Just like chlorine being highly toxic as well but is used to make water drinkable. Just because the symbol is on a product doesn't mean that it cannot be used for anything that gets consumed. You get more fluoride from eating veggies or potatoes than the small amount you get from drinking water. Fucking shellfish is a fluoride source and people love eating that permalink parent award report block reply roadrunner0 5 points 11 hours ago Eating 4 ounces of table salt can certainly be fatal.. permalink parent award report block reply view 4 more comments... Quixotic 3 points 9 hours ago Salt doesn’t have that label permalink parent award report block reply view 2 more comments... glow-operator-2-0 1 points 10 hours ago You should imbibe and consume sodium and iodine in their separate forms; their combine form is a real killer, especially for diabetics. permalink parent award report block reply Pede45 3 points 8 hours ago I think you are missing the point here. There is no reason to put fluoride in the water. permalink parent award report block reply Rydanovich 2 points 9 hours ago Salt, water, vitamin A, all toxic with high amounts. Only difference between poison and cure is dosage. permalink parent award report block reply someguy7738 1 points 6 hours ago Sure sure but it's also true that ethanol is not being put into the water supply in order to force people to consume it whether they want to or not. If you want fluoride in your water, add it your damn self. permalink parent award report block reply Dev404 1 points 8 hours ago Yes. Now do you trust your government who's handling it? permalink parent award report block reply\nUncleSlayton 24 points 12 hours ago It's way easier to be irrational and hysterical. permalink parent award report block reply Standingoak -2 points 6 hours ago That's what they have been saying to the anti-vaccine crowd. permalink parent award report block reply HostlyMarmless -5 points 11 hours ago And presenting a PHOTO, and allowing you to draw your own conclusions, is now \"irrational and hysterical\". Have another glass of water.  I mixed this one up MYSELF. permalink parent award report block reply UncleSlayton 11 points 11 hours ago Presenting a photo meant to intentionally mislead people too ignorant to know better into false conclusions is worse, you're right.  It's deceptive and causes great harm to the causes trying to stop treating water for legitimate reasons. Everything is toxic in a high enough dose or concentration.  Everything.  Water is toxic. permalink parent award report block reply Quixotic 1 points 9 hours ago It’s not a false conclusion though, you fucking idiot. Fluoride is toxic. permalink parent award report block reply view 3 more comments... Strike08 5 points 11 hours ago Salt is deadly when you take enough of it. The reason for the toxicity symbol is that in high enough dosis it has toxic elements. Just like chlorine being highly toxic as well but is used to make water drinkable. Just because the symbol is on a product doesn't mean that it cannot be used for anything that gets consumed. You get more fluoride from eating veggies or potatoes than the small amount you get from drinking water. Fucking shellfish is a fluoride source and people love eating that permalink parent award report block reply roadrunner0 5 points 11 hours ago Eating 4 ounces of table salt can certainly be fatal.. permalink parent award report block reply view 4 more comments... Quixotic 3 points 9 hours ago Salt doesn’t have that label permalink parent award report block reply view 2 more comments... glow-operator-2-0 1 points 10 hours ago You should imbibe and consume sodium and iodine in their separate forms; their combine form is a real killer, especially for diabetics. permalink parent award report block reply\nStandingoak -2 points 6 hours ago That's what they have been saying to the anti-vaccine crowd. permalink parent award report block reply\nHostlyMarmless -5 points 11 hours ago And presenting a PHOTO, and allowing you to draw your own conclusions, is now \"irrational and hysterical\". Have another glass of water.  I mixed this one up MYSELF. permalink parent award report block reply UncleSlayton 11 points 11 hours ago Presenting a photo meant to intentionally mislead people too ignorant to know better into false conclusions is worse, you're right.  It's deceptive and causes great harm to the causes trying to stop treating water for legitimate reasons. Everything is toxic in a high enough dose or concentration.  Everything.  Water is toxic. permalink parent award report block reply Quixotic 1 points 9 hours ago It’s not a false conclusion though, you fucking idiot. Fluoride is toxic. permalink parent award report block reply view 3 more comments... Strike08 5 points 11 hours ago Salt is deadly when you take enough of it. The reason for the toxicity symbol is that in high enough dosis it has toxic elements. Just like chlorine being highly toxic as well but is used to make water drinkable. Just because the symbol is on a product doesn't mean that it cannot be used for anything that gets consumed. You get more fluoride from eating veggies or potatoes than the small amount you get from drinking water. Fucking shellfish is a fluoride source and people love eating that permalink parent award report block reply roadrunner0 5 points 11 hours ago Eating 4 ounces of table salt can certainly be fatal.. permalink parent award report block reply view 4 more comments... Quixotic 3 points 9 hours ago Salt doesn’t have that label permalink parent award report block reply view 2 more comments... glow-operator-2-0 1 points 10 hours ago You should imbibe and consume sodium and iodine in their separate forms; their combine form is a real killer, especially for diabetics. permalink parent award report block reply\nUncleSlayton 11 points 11 hours ago Presenting a photo meant to intentionally mislead people too ignorant to know better into false conclusions is worse, you're right.  It's deceptive and causes great harm to the causes trying to stop treating water for legitimate reasons. Everything is toxic in a high enough dose or concentration.  Everything.  Water is toxic. permalink parent award report block reply Quixotic 1 points 9 hours ago It’s not a false conclusion though, you fucking idiot. Fluoride is toxic. permalink parent award report block reply view 3 more comments...\nQuixotic 1 points 9 hours ago It’s not a false conclusion though, you fucking idiot. Fluoride is toxic. permalink parent award report block reply view 3 more comments...\nStrike08 5 points 11 hours ago Salt is deadly when you take enough of it. The reason for the toxicity symbol is that in high enough dosis it has toxic elements. Just like chlorine being highly toxic as well but is used to make water drinkable. Just because the symbol is on a product doesn't mean that it cannot be used for anything that gets consumed. You get more fluoride from eating veggies or potatoes than the small amount you get from drinking water. Fucking shellfish is a fluoride source and people love eating that permalink parent award report block reply roadrunner0 5 points 11 hours ago Eating 4 ounces of table salt can certainly be fatal.. permalink parent award report block reply view 4 more comments... Quixotic 3 points 9 hours ago Salt doesn’t have that label permalink parent award report block reply view 2 more comments...\nroadrunner0 5 points 11 hours ago Eating 4 ounces of table salt can certainly be fatal.. permalink parent award report block reply view 4 more comments...\nQuixotic 3 points 9 hours ago Salt doesn’t have that label permalink parent award report block reply view 2 more comments...\nglow-operator-2-0 1 points 10 hours ago You should imbibe and consume sodium and iodine in their separate forms; their combine form is a real killer, especially for diabetics. permalink parent award report block reply\nPede45 3 points 8 hours ago I think you are missing the point here. There is no reason to put fluoride in the water. permalink parent award report block reply\nRydanovich 2 points 9 hours ago Salt, water, vitamin A, all toxic with high amounts. Only difference between poison and cure is dosage. permalink parent award report block reply\nsomeguy7738 1 points 6 hours ago Sure sure but it's also true that ethanol is not being put into the water supply in order to force people to consume it whether they want to or not. If you want fluoride in your water, add it your damn self. permalink parent award report block reply\nDev404 1 points 8 hours ago Yes. Now do you trust your government who's handling it? permalink parent award report block reply\npedespeed 9 points 12 hours ago Now do coke and pepsi kegs being delivered to the bottling plant. permalink award report block reply\nTGNX 3 points 10 hours ago That's not true. They look like $$$$$. permalink award report block reply\nPdotwinner 3 points 10 hours ago Just grab a reverse osmosis unit off of Amazon for a couple hundred bucks and filter that shit out. permalink award report block reply mathteach314159 2 points 9 hours ago I did that a couple months ago. Whats your take on adding minerals back in? Really not sure what to think of it. Not really concerned about mineral deficiency as I am sure we get plenty of our mineral intake from our diet, but might want to do something just for flavor. At first it was great, like drinking straight from an iceberg. But after awhile I started noticing what I could only describe as a baking soda flavor, and I read thats due to the PH balance of the pure h2o being a little off from what I am used to. permalink parent award report block reply\nmathteach314159 2 points 9 hours ago I did that a couple months ago. Whats your take on adding minerals back in? Really not sure what to think of it. Not really concerned about mineral deficiency as I am sure we get plenty of our mineral intake from our diet, but might want to do something just for flavor. At first it was great, like drinking straight from an iceberg. But after awhile I started noticing what I could only describe as a baking soda flavor, and I read thats due to the PH balance of the pure h2o being a little off from what I am used to. permalink parent award report block reply\nWatermelons 3 points 10 hours ago Yep.  Looks good to me. This is what NaF salt bags look like. permalink award report block reply\nFrensInLowPlaces 1 points 8 hours ago Sodium Hypochlorite is often used, toxic.  Chlorine is a nasty chemical used too.\nThe clarification process can use chemicals like calcium carbonate and calcium oxide, I wouldnt recommend consuming either. Plus a whole bunch of sulfuric acid is used depending on the plant. I dont think that's safe either. permalink award report block reply\ncatinmylapone 1 points 9 hours ago The dangerous goods label reads like it's nuclear waste for the handling. permalink award report block reply\nMungo 1 points 10 hours ago Nothing but well water here for the last 40 years! permalink award report block reply\nHantif -1 points 10 hours ago Now do dihydrogen monoxide. https://dhmo.org/ permalink award report block reply",
  "fetched_at": "2025-11-12T23:44:10.807763Z"
}