{
  "id": "8185357",
  "title": "102This is Dearborn, Michigan. Nearly all of the Muslims in this video have visas or legalized citiz",
  "url": "https://patriots.win/p/1ARK9nOX4B/this-is-dearborn-michigan-nearly/c",
  "content": "102 This is Dearborn, Michigan. Nearly all of the Muslims in this video have visas or legalized citizenship. It’s an invasion. posted 4 hours ago by O__Q 7 comments award share report block End Wokeness @EndWokeness • 4h This is Dearborn, Michigan. Nearly all of the people in this video have visas or legalized citizenship.\n7 comments Sort by Top Top New Worst Old Save newestofnew 5 points 3 hours ago who opened the gates of Toledo? permalink award report block reply FKH2 1 points 2 hours ago Who knows permalink parent award report block reply O__Q OP 4 points 4 hours ago u/-f-b-i- permalink award report block reply JtBlaze 4 points 3 hours ago Send them all back. NOT welcomed here.\nGod bless 🇺🇸 the U.S.A. permalink award report block reply Flowers-By-Irene 2 points 3 hours ago Gretchen Whitmer invited them all. She's a traitor that should hang. permalink award report block reply CommieCrats 1 points 2 hours ago Obama permalink parent award report block reply NotYourMan 1 points 3 hours ago Replacement theory isn't a theory anymore. permalink award report block reply\nnewestofnew 5 points 3 hours ago who opened the gates of Toledo? permalink award report block reply FKH2 1 points 2 hours ago Who knows permalink parent award report block reply\nFKH2 1 points 2 hours ago Who knows permalink parent award report block reply\nO__Q OP 4 points 4 hours ago u/-f-b-i- permalink award report block reply\nJtBlaze 4 points 3 hours ago Send them all back. NOT welcomed here.\nGod bless 🇺🇸 the U.S.A. permalink award report block reply\nFlowers-By-Irene 2 points 3 hours ago Gretchen Whitmer invited them all. She's a traitor that should hang. permalink award report block reply CommieCrats 1 points 2 hours ago Obama permalink parent award report block reply\nCommieCrats 1 points 2 hours ago Obama permalink parent award report block reply\nNotYourMan 1 points 3 hours ago Replacement theory isn't a theory anymore. permalink award report block reply"
}