{
  "id": "1ARK53JHAB",
  "url": "https://patriots.win/p/1ARK53JHAB/exactly-we-need-to-doge-the-snap/c",
  "content": "553 Exactly! We need to DOGE the snap benefits program! posted 6 days ago by TedWLieu 8 comments award share download report block\n8 comments Sort by Top Top New Worst Old Save billybaldwin2 7 points 6 days ago Rasmussen pointed out that once DOGE stopped getting talked about or Elon stopped being part of DOGE, Trump's approval took a dive. permalink award report block reply HeavyMetalPatriot 8 points 6 days ago The GOP in Congress not 1000% backing DOGE was a redpill for many Trump voters too permalink parent award report block reply altaG12 1 points 6 days ago Source? permalink parent award report block reply bratt 5 points 6 days ago That could be said for quite a few things. The reason health care is so expensive is because 42 million people get it for \"free\". Insurance Housing . . . . permalink award report block reply Zennbrown 3 points 6 days ago Mark should stick to polling and forget the commentary. Elon had a temporary appointment. DOGE still exists. permalink award report block reply bratt 4 points 6 days ago They should still be hyping it. Elon attracted attention to it and it seemed they were at a much faster pace. permalink parent award report block reply sordfysh PRO 2 points 6 days ago That's not quite how this system works. The margins on food aren't high. permalink award report block reply Neo2025 4 points 6 days ago People don't seem to realize that assholes like this aren't on our side, and are actually looking to destroy MAGA by making it a philosophy that people won't vote for. The goal is for MAGA to appear uncaring about the problems people have. permalink parent award report block reply Another_rando 1 points 6 days ago Oh no that's not actually the reason why. Your taxes pay for the free food. Food is expensive because Americans don't know the power of a boycott permalink award report block reply\nbillybaldwin2 7 points 6 days ago Rasmussen pointed out that once DOGE stopped getting talked about or Elon stopped being part of DOGE, Trump's approval took a dive. permalink award report block reply HeavyMetalPatriot 8 points 6 days ago The GOP in Congress not 1000% backing DOGE was a redpill for many Trump voters too permalink parent award report block reply altaG12 1 points 6 days ago Source? permalink parent award report block reply\nHeavyMetalPatriot 8 points 6 days ago The GOP in Congress not 1000% backing DOGE was a redpill for many Trump voters too permalink parent award report block reply\naltaG12 1 points 6 days ago Source? permalink parent award report block reply\nbratt 5 points 6 days ago That could be said for quite a few things. The reason health care is so expensive is because 42 million people get it for \"free\". Insurance Housing . . . . permalink award report block reply\nZennbrown 3 points 6 days ago Mark should stick to polling and forget the commentary. Elon had a temporary appointment. DOGE still exists. permalink award report block reply bratt 4 points 6 days ago They should still be hyping it. Elon attracted attention to it and it seemed they were at a much faster pace. permalink parent award report block reply\nbratt 4 points 6 days ago They should still be hyping it. Elon attracted attention to it and it seemed they were at a much faster pace. permalink parent award report block reply\nsordfysh PRO 2 points 6 days ago That's not quite how this system works. The margins on food aren't high. permalink award report block reply Neo2025 4 points 6 days ago People don't seem to realize that assholes like this aren't on our side, and are actually looking to destroy MAGA by making it a philosophy that people won't vote for. The goal is for MAGA to appear uncaring about the problems people have. permalink parent award report block reply\nNeo2025 4 points 6 days ago People don't seem to realize that assholes like this aren't on our side, and are actually looking to destroy MAGA by making it a philosophy that people won't vote for. The goal is for MAGA to appear uncaring about the problems people have. permalink parent award report block reply\nAnother_rando 1 points 6 days ago Oh no that's not actually the reason why. Your taxes pay for the free food. Food is expensive because Americans don't know the power of a boycott permalink award report block reply"
}