{
  "id": "1ARK9mFaRq",
  "url": "https://patriots.win/p/1ARK9mFaRq/trump-will-is-right-there-are-pe/c",
  "content": "179 Trump. Will is right. There are people in your orbit that want to convince you that housing for the next generation should only be affordable by longer term debt. Just imagine how hard your grandkid’s friends are going to have trying to have paying back a house over 50 years. It’s crazy! God bless!! SAVE AMERICA posted 22 hours ago by GodIsPerfect 6 comments award share report block Wall Street Mav @WallStreetMav • 1d Deport 30 million illegal aliens. Send the H-1B visa and their H-4 visa family members back to their home countries. Housing prices and apartment rental prices will become affordable instantly. And American wages will increase. William Wolfe 🇺🇸 @William_E_Wolfe • 2d The first political party that makes it possible to buy a house and raise a family on *one income* will rule America for the next 50 years.\n6 comments Sort by Top Top New Worst Old Save C0drus 4 points 21 hours ago 50?…..remember what LBJ was reported to have said about a certain group of people voting democrat for the next 200 years? permalink award report block reply LaptopDied 3 points 21 hours ago Nobody has to pay just the minimum mortgage payment. A fifty year mortgage is just an on-ramp. How you drive it after that is on you. Even if you never build equity you just rented with extra steps. You were going to rent anyway. And you were given a chance. Go in with another family. Or two. Pool resources. permalink award report block reply NADSAQ 3 points 20 hours ago Plus, you can just get out of a mortgage at literally any time. mUh sLaVeRy permalink parent award report block reply newestofnew 3 points 22 hours ago trump just repeated the ownership class claim that Americans Americans aren't smart enough as justification basically bill Clinton at this point permalink award report block reply Shih_Tabed 1 points 15 hours ago Locking in a fixed payment for 50 years isn't exactly horrible.  Especially facing inflation.  Its not like you have to go the distance as well.  You can add more to pay down principal if you want.  You might be able to pay it off in 10 years managing extra payments around a low minimum payment.  Just don't lock up insurance and property taxes into escrow or it will erode your principal payments.  You will have to keep bumping up your payments to keep up and that can get out of hand.  Pay for those on the side and your mortgage stays the same.  You can always restore escrow later if you want the mortgage to absorb the costs again. permalink award report block reply BusterHyman99 0 points 19 hours ago Nobody pays in a mortgage for 50 years retard. Learn to leverage your debt. He's trying to do something about affordability. Since none of these cocksuckers are going to eliminate property taxes or cut government spending this is the best he can do permalink award report block reply\nC0drus 4 points 21 hours ago 50?…..remember what LBJ was reported to have said about a certain group of people voting democrat for the next 200 years? permalink award report block reply\nLaptopDied 3 points 21 hours ago Nobody has to pay just the minimum mortgage payment. A fifty year mortgage is just an on-ramp. How you drive it after that is on you. Even if you never build equity you just rented with extra steps. You were going to rent anyway. And you were given a chance. Go in with another family. Or two. Pool resources. permalink award report block reply NADSAQ 3 points 20 hours ago Plus, you can just get out of a mortgage at literally any time. mUh sLaVeRy permalink parent award report block reply\nNADSAQ 3 points 20 hours ago Plus, you can just get out of a mortgage at literally any time. mUh sLaVeRy permalink parent award report block reply\nnewestofnew 3 points 22 hours ago trump just repeated the ownership class claim that Americans Americans aren't smart enough as justification basically bill Clinton at this point permalink award report block reply\nShih_Tabed 1 points 15 hours ago Locking in a fixed payment for 50 years isn't exactly horrible.  Especially facing inflation.  Its not like you have to go the distance as well.  You can add more to pay down principal if you want.  You might be able to pay it off in 10 years managing extra payments around a low minimum payment.  Just don't lock up insurance and property taxes into escrow or it will erode your principal payments.  You will have to keep bumping up your payments to keep up and that can get out of hand.  Pay for those on the side and your mortgage stays the same.  You can always restore escrow later if you want the mortgage to absorb the costs again. permalink award report block reply\nBusterHyman99 0 points 19 hours ago Nobody pays in a mortgage for 50 years retard. Learn to leverage your debt. He's trying to do something about affordability. Since none of these cocksuckers are going to eliminate property taxes or cut government spending this is the best he can do permalink award report block reply",
  "fetched_at": "2025-11-12T23:25:14.811728Z"
}