{
  "id": "1ARK5A9IFJ",
  "url": "https://patriots.win/p/1ARK5A9IFJ/aint-playing/c",
  "content": "894 Ain’t Playing posted 3 days ago by rdvs34283 249 comments award share report block BLACK FLAG 💨🏴🇺🇸 @FlagBlack007 • 4d BE CAREFUL OUT THERE . 🤔\n249 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style jsphere256 160 points 3 days ago If someone approaches you with one hand in their pocket like that. It's a gun. permalink award report block reply Tellman125 32 points 3 days ago or a candy bar, like the one Charlie Sheen's character used in the 1994  action comedy film The Chase . permalink parent award report block reply Retardloserimsogay 10 points 3 days ago Wasn't that also in a Tim Robbins/Martin Lawrence movie? permalink parent award report block reply myke 4 points 3 days ago No, but he did pay for a sour fruity twist. Took the shotty. It was a pretty one, pistol grip pump, chromed out nickle finish. Anywho. permalink parent award report block reply Parhelion12 6 points 3 days ago That movie is relapse city. permalink parent award report block reply NomadicKrow2 3 points 3 days ago Or a water pistol, like the hero used in Michael Douglas's 1993 Documentary Falling Down. permalink parent award report block reply myke 4 points 3 days ago \"You think I'm the bad guy?\" permalink parent award report block reply Bigstick7 11 points 3 days ago Cop was a douche bag not letting him merge with an upcoming lane closure though couldn't tell if his blinker was on. Stupid to turn his back on him. Then the black guy was an idiot for punching him. White cop is lucky he's a quick draw and black guy did one handed gangsta aim (very little gun control). Honestly both these dudes suck. permalink parent award report block reply Backslash2099 15 points 3 days ago Is that a cop? Doesn't look like a cop. permalink parent award report block reply Bigstick7 31 points 3 days ago Other comments I read were this was an off duty cop. Math checks out with how fat he is. permalink parent award report block reply mydogma8yourkarma 29 points 3 days ago Quick clean draw, super composed, fat or not our boy was on his game. permalink parent award report block reply view 4 more comments... Backslash2099 2 points 3 days ago Heh yea maybe permalink parent award report block reply deleted 0 points 3 days ago view 1 more comments... SkepticAF 6 points 3 days ago This video was posted here before a while ago. Was an off duty police officer. permalink parent award report block reply 95Rockytoby95 14 points 3 days ago Don't defend an arrogant shithead expecting to be let in. Fuck em. Nobody owns the road. Wait your fucking turn.\nAs far as turning your back. You are absolutely correct. I've been driving over 50 years. People are actually becoming more and more aggressive. Thinking they have a right to any situation. Fuck em. They don't. permalink parent award report block reply Bigstick7 -1 points 2 days ago All the dude had to do was let the guy in, let off the gas and let him merge his car was already 3/4 of his car length in front of him. Instead he sped up to keep the guy from merging when approaching a construction zone. The black guy would have had to brake hard then merge them speed up which would have probably impacted the traffic behind the cop. Cop was a douche bag just let the guy over. lol \"nobody owns the road\" the cop sure acted like it by doing everything in his power even to the point of hitting the guy to keep him from merging. This post has informed my there are a bunch of fags on this site that drive like assholes. permalink parent award report block reply 95Rockytoby95 1 points 2 days ago That doesn't give you the right to wait till the very last moment like some assholes do to merge. Im positive there were signs prior to that. So if you do wait till the very last minute.. fuck you and wait. permalink parent award report block reply katsumi27 9 points 3 days ago Car emerging could’ve slowed down and planned to head to get behind.  Plus, the guy didn’t use his turn signal. permalink parent award report block reply IPMang 7 points 3 days ago I don't think that was a punch, looked like he pistol whipped him in the face... Fair to say you're safe to start blasting at that point permalink parent award report block reply Bigstick7 7 points 3 days ago 100% got what he was asking for, no sympathy for the black guy. Cop is still a douchebag driver. permalink parent award report block reply AwShitHereWeGoAgain 3 points 3 days ago Joggers should RARELY ever be afforded any sympathy. permalink parent award report block reply ArtLife 0 points 3 days ago Exactly, the guy had his blinker on, should have let him merge, there may have been no room to fall back. permalink parent award report block reply corporateshizer 2 points 3 days ago Nailed it, champ. permalink parent award report block reply load 6 more comments... m0r1arty 1 points 3 days ago Or a stapler like Bruce Wayne used in Batman Begins. permalink parent award report block reply NeoDragoon -17 points 3 days ago or a knife like this case permalink parent award report block reply deleted 31 points 3 days ago Doritalos 8 points 3 days ago Earlier than that, he actually pistol whipped him at 0:42 permalink parent award report block reply deleted 1 points 3 days ago view 4 more comments... NeoDragoon -18 points 3 days ago After he reached back into the hoodie, faggot\n00:42 - not a gun permalink parent award report block reply Konsaki 12 points 3 days ago So, he had a gun. Got it. permalink parent award report block reply Doritalos 10 points 3 days ago That's a gun, he pistol whipped him permalink parent award report block reply TGNX 3 points 3 days ago I watched the whole video. Guy pulled a gun. permalink parent award report block reply Tellman125 -1 points 3 days ago Comment removed by community filter. permalink parent award report block reply Ten20111 4 points 3 days ago Old video, 'teen' pistol whips an off duty cop, then gets turned off permalink parent award report block reply Ol_Gravy_Leg 12 points 3 days ago \"Old video\"= happened last month and it was recently released. permalink parent award report block reply Wizard_Glick 118 points 3 days ago Cop on his way to work in his personal car, killed the jogger... permalink award report block reply SteveRogers42 37 points 3 days ago Bravo Zulu. permalink parent award report block reply AwShitHereWeGoAgain 5 points 3 days ago Abso-fucking-lutely. permalink parent award report block reply Joseyep 24 points 3 days ago Killed armed assailant** permalink parent award report block reply ThisTrainHasNoBrakes 4 points 3 days ago He didn’t relax. permalink parent award report block reply SickOfNeoPolitics 2 points 3 days ago Did he get overtime pay for working off the clock? permalink parent award report block reply Wizard_Glick 1 points 2 days ago No, but he collected the bounty... permalink parent award report block reply wilburh09 -30 points 3 days ago He should have let the guy merge in front of him there was construction in the other lane.  2 idiots imo. permalink parent award report block reply LineInTheSand 48 points 3 days ago Right of way belongs to the person in the lane of travel, not the person who is changing lanes. permalink parent award report block reply BillGall2 -4 points 3 days ago No.  It belongs to the person in front.  Once he enters the lane he has the right of way.  He does not have to occupy the entire lane.  The cop moved way left so he could pull along side and bump the rear right side of the car in front.  He knew what he was doing. The cop initiated the altercation.  The car in front was driving agressively, but a good judge would likely nail the cop for failing to yield. permalink parent award report block reply LineInTheSand 2 points 2 days ago You should probably read up on your state laws and take a driver's education course.  The driver changing lanes must wait for a safe opening before changing lanes.  The key words are highlighted.  Any opening is not sufficient.  Changing lanes without sufficient room for the other vehicles to maintain a safe following distance is not safe or legal. Edit: Here is a video with the first incident being similar to the one posted by OP .  The police ruled the driver changing lanes was completely at fault. permalink parent award report block reply wilburh09 -43 points 3 days ago Ok that’s what an asshole does.  He caused the entire thing by being an asshole driver. I fucking hate fat idiot asshole drivers in their oversized trucks that they don’t even need, but buy to prove how tough they are.  Fuck that guy . There was plenty of room to let him merge without hitting him.  Total idiots both of them . permalink parent award report block reply Doritalos 23 points 3 days ago And I hate punks that think they can just cut someone off. If he isn't going to let you pass, then you need to slow and change lanes behind him. What I hate are people who speed up after you hit the indicator knowing you are going to change lanes. That wasn't the case here but it happens in the US, I don't see this behavior in other countries. permalink parent award report block reply view 2 more comments... SaltiTaralli 21 points 3 days ago So you're one of the countless assholes who tries to muscle their way into a lane instead of SAFELY MERGING AND WAITING YOUR TURN. LEARN TO DRIVE. If you think the cop was the asshole in this scenario you're retarded. permalink parent award report block reply view 2 more comments... DeaduponArousal 11 points 3 days ago Get back in line faggot. If I’m nice enough and there’s plenty of room I might let you over. Otherwise retake your driving test and take a number. Joggers think they can just do whatever they like on the road. permalink parent award report block reply BlackJack1776 9 points 3 days ago Take the bus then. permalink parent award report block reply SirPokeSmottington 6 points 3 days ago I mean, I guess you could know the goddamn fuckin law of the road and not be a stupid ni66er with poor impulse control. Or we can go with your retarded idea. permalink parent award report block reply load 20 more comments... bumpman 15 points 3 days ago Wasn’t very considerate, but if you do find yourself unable to get over, don’t veer into someone, just slow down/ stop until there’s an opening. permalink parent award report block reply wilburh09 -18 points 3 days ago The guy had plenty of clearance to merge.  The driver of the truck intentionally cut him off and HIT the merging driver.  If you have 10 car lengths in front of you and a car in the other lane is moving ahead of you and needs to merge because of construction blocking the lane..  and if you accelerate and block that car merging by hitting their rear panel..  then you are a fucking asshole. permalink parent award report block reply SirPokeSmottington 13 points 3 days ago You're the fucking asshole. YOU PULL IN BEHIND OTHER VEHICLES, YOU STUPID CUNT. permalink parent award report block reply yummy_yumm_yumms 5 points 3 days ago He should have left the house earlier, moron. Just because your lane is ending/obstructed, doesn't make it my problem. Maybe you need to go back to drivers ed to learn how to drive, cause you clearly don't understand. permalink parent award report block reply view 8 more comments... TGNX 2 points 3 days ago An asshole who is in the right. permalink parent award report block reply NotInFormation 8 points 3 days ago 102% of the time I approach a lane closure people like the jogger attempt to use every last inch of the lane being closed to pass everyone who has merged properly and then shove their nose in like this. permalink parent award report block reply TRexScrotum 3 points 3 days ago Here in Chicago people do that and it’s infuriating because there’s a truck with or a trailered GIANT FLASHING ARROW that you can see ALLLLL the way down the street. But no, lemme wait until I almost hit the thing and then try to get over. Absolute idiots, can’t wait to get out of here. permalink parent award report block reply NotInFormation 2 points 2 days ago To where? In the meantime sometimes people arrange themselves in a staggered pattern to occupy two lanes, and then traffic flows smoothly -- and usually the aggro people relax a bit before everything opens up or maybe they realize they didn't 'lose' that much time anyway.  I neither affirm nor deny participating in such erratic behavior :p permalink parent award report block reply view 1 more comments... ConfusedAngryArmed 5 points 3 days ago This tells me you can't fucking drive. Joggers do this shit constantly. They see the lane closure then try to speed to cut someone else off instead of doing what every other human with above room temperature IQ does. permalink parent award report block reply doodaddy 3 points 3 days ago fag permalink parent award report block reply dirtysanchez69 52 points 3 days ago Oh no! Anyway. permalink award report block reply RuleoVicus 19 points 3 days ago Too bad so sad permalink parent award report block reply lixa -5 points 3 days ago What's going on w these stickies permalink parent award report block reply FlgPole 49 points 3 days ago GTA 6 looks amazing. permalink award report block reply Tellman125 19 points 3 days ago It'll be out sometime in the later part of President Vance's second term. permalink parent award report block reply BlackJack1776 7 points 3 days ago Funny thing. Studio is Union. Union that uses Antifa (3 down arrows) as its iconography. That game is going to be a disaster. permalink parent award report block reply papa_newguineapig 45 points 3 days ago No fucking way. I'm putting holes in that fucker the second he steps out of the car and approaches me hand in his hoodie like that. NO FUCKING CHANCE. permalink award report block reply BoatingAccident 44 points 3 days ago Agreed, the off duty police officer showed incredible restraint permalink parent award report block reply stellamonkey 45 points 3 days ago Also turned his back on the thug at one point - let's face it, these hood rats love to attack in packs or at least, from a sucker punch..  The cop is lucky, and also a VERY quick draw!  This was an immensely satisfying video to watch!!! permalink parent award report block reply wilburh09 -21 points 3 days ago No he didnt.  The guy was trying to merge over to avoid construction and the “off duty cop” would not let him.  Thats asshole driving on his part which caused this. permalink parent award report block reply DeepStateParasite 21 points 3 days ago No, the guy who had to merge because of the construction needed to brake and merge safely even if he wanted to cut in there.  You don't actually get to run into the car next to you to 'force merge'.  Then the at-fault  fucker sucker-punched the guy from behind and was clearly going to shoot him, so fortunately the pickup driver was able to discourage him with the use of hastily punched holes. Fuck that goat-turd-haired thug. permalink parent award report block reply redinmn -9 points 3 days ago Nope, depending on the state, you are required to yield to those whose lane is ending. permalink parent award report block reply wilburh09 -14 points 3 days ago You must be blind.  There was like 10 car lengths between this stupid asshole and the Car in Front of him.  Instead of letting the guy merge there he cut him off and hit him.  That’s asshole behavior.  I wish they shot each other would be a good outcome. permalink parent award report block reply view 1 more comments... makersmarx 11 points 3 days ago Agree, but the nog should have slowed down and got behind him since the truck driver had the right of way. permalink parent award report block reply wilburh09 -5 points 3 days ago But the truck driver accelerated and intentionally rammed the back of the merging driver.  I don’t care about the guy who got shot because fuck him for pulling a gun in Road rage.  But the driver here is a fucking asshole.  And if he’s driving like like this then I’m not surprised he got a gun pulled on him and sooner than later he’ll probably get his cap peeled. permalink parent award report block reply view 1 more comments... IAmNotAnAutist 11 points 3 days ago Wrong.  Jogger tried to bully his way in the way, fat cop said nope wait your turn, jogger. Then jogger got got. Jogger. permalink parent award report block reply neomt 7 points 3 days ago Fun fact, he doesn't have to let him Funner fact, the fault of the accident is 100% on the merging car, because it's 100% on him to not drive into an occupied lane. permalink parent award report block reply redinmn -3 points 3 days ago Most states require drivers to do a zipper merge taking turns in construction zones.  Both were guilty of being dicks and either one could have prevented this with nothing more than letting off the gas. permalink parent award report block reply view 1 more comments... Lars_Lindemann 35 points 3 days ago He needs immediate CPR. That way, he can push more blood out of the holes... permalink award report block reply Simon_Jester 29 points 3 days ago HE NEEDS SOME MILK permalink parent award report block reply C0drus 8 points 3 days ago ☝️came here to say this 🤣 permalink parent award report block reply monkadelic 34 points 3 days ago Luckily the Olympic hopeful doesn't know how to use his weapon.  He had the draw on the guy already.  This could have ended the other way very easily. permalink award report block reply zooty 16 points 3 days ago He was just making sure the grips were correctly horizontally aligned with the ground. permalink parent award report block reply Rock9Head 8 points 3 days ago Just like it sits in the box permalink parent award report block reply Hanrahan 14 points 3 days ago Pulls the gun, uses it for a slap, then tries to put it away, and then points it and doesn't fire. Good thing he's a total moron. permalink parent award report block reply stellamonkey 10 points 3 days ago Yup - the thug was probably stoned, like usual. permalink parent award report block reply uxername27 0 points 3 days ago Ever seen the video of the gangsta at the shooting range? He emptied his clip quickly, but missed all his shots. permalink parent award report block reply I_Love_45-70_Gov 3 points 3 days ago TBF - those Mauser C96 \"Broomhandles\" can be kinda tricky. permalink parent award report block reply MakingArrowsOrange 31 points 3 days ago A happy ending. permalink award report block reply deleted 26 points 3 days ago 67Vert 12 points 3 days ago I think he hit his truck and that’s what he went to go look at permalink parent award report block reply DeepStateParasite 12 points 3 days ago He did, he decided that since he wanted to merge that it would be OK to actually run into the truck, then sucker-punch and shoot the other driver.  Happy ending in this case, hopefully he didn't end up with us paying for a jail cell. permalink parent award report block reply The_Emperor 0 points 3 days ago When I drive, I give ass holes space, and let them in.  Two dick measurements = one is a dead one. permalink parent award report block reply BoomShtick -1 points 3 days ago They are/were both dipshits in my opinion, the dindu pulled the guys card and got lit up. If your average citizen was in place of fat the cop, I think there is a chance we would be prosecuted for the incident. But since it was a off duty cop, he get a pass. permalink parent award report block reply MR__K 18 points 3 days ago N is for natural selection. permalink award report block reply NeoDragoon 14 points 3 days ago I is for ignorant behavior permalink parent award report block reply Mike_Hoxbigg 15 points 3 days ago G is for get what you deserve permalink parent award report block reply DeepStateParasite 11 points 3 days ago G is for good god, think this through. permalink parent award report block reply IAmNotAnAutist 11 points 3 days ago E is for Ending justified. permalink parent award report block reply view 2 more comments... makersmarx 2 points 3 days ago G is for go back to Africa permalink parent award report block reply Geocav 2 points 3 days ago I is ignorant. permalink parent award report block reply Nomad899 -1 points 3 days ago G is for goon permalink parent award report block reply pterodactyl_balls 3 points 3 days ago Way to ruin it permalink parent award report block reply Hanging_Chad 2 points 3 days ago kek permalink parent award report block reply KennyKetchem 17 points 3 days ago The only mistake is never turn your back on an aggressor. permalink award report block reply Filo76 15 points 3 days ago I just looked up the term FAFO, and this video was the definition. permalink award report block reply makersmarx 1 points 3 days ago https://youtu.be/mH9NzJwldok?si=H6upnE3ypBXOxGBn permalink parent award report block reply zooty 13 points 3 days ago \"Why do you need high capacity magazines?\" permalink award report block reply SirPokeSmottington 4 points 3 days ago \"Why do you need high capacity magazines?\" Lol, did you say 'time to reload' when I did also? permalink parent award report block reply zooty 1 points 3 days ago I was hoping he had one. I'm sometimes not as prepared as I should be. permalink parent award report block reply Senaleb 12 points 3 days ago This was a few weeks ago. This kids parents even said the off duty cop was justified. (yeah I was shocked too) permalink award report block reply Get-The-Rope 4 points 3 days ago Parents, extended family, and lawyer all said \"Ya, he fucked up\" permalink parent award report block reply MakeAmericaVapeAgain 12 points 3 days ago the family tried to say he was a good boy doing no harm…until the video came out. then they shut their mouths. permalink award report block reply 67Vert 9 points 3 days ago 90% of the time I just let them merge.  The other 10% is when I forgot to pray for patience before I drive anywhere. permalink award report block reply SirBuzzKillingtonVI 8 points 3 days ago Love seeing this. permalink award report block reply MythArcana 8 points 3 days ago They all have to go back.   🚢👪🏿 permalink award report block reply conservatarian 7 points 3 days ago NEVER RELAX permalink award report block reply cptkloss5 7 points 3 days ago yeah... when you deliberately don't slow down to avoid a collision with a reckless driver like the jogger - you must be ready for a \"confrontation\" - I'd just let the jogger in. and most likely 99% of others well, except other joggers. permalink award report block reply Nomad899 7 points 3 days ago The best fight is the one avoided…. Agree, if they are willing to force way in they probably stole it and/or have no insurance so don’t care permalink parent award report block reply 2016TrumpMAGA 6 points 3 days ago Never relax. permalink award report block reply BillyBobBrewer 6 points 3 days ago Comment removed by a Hebrew. permalink award report block reply 123breadman 6 points 3 days ago I enjoy seeing criminals get killed. permalink award report block reply KuzoKevin 5 points 3 days ago He really doesn't like that car. permalink award report block reply JDVance4President28 5 points 3 days ago Just remember, if that guy wasn't a cop, he'd be arrested, have his life ruined and have to defend his freedom. Police have a monopoly on self defense. Unlike regular civilians. permalink award report block reply Ligersrule1 5 points 3 days ago I love a happy ending permalink award report block reply GhostOfMyFormerSelf 4 points 3 days ago Incoherent ghetto gibberish... foh. permalink award report block reply AngeredKabar 3 points 3 days ago N permalink award report block reply Geocav 3 points 3 days ago I permalink parent award report block reply Evansh 3 points 3 days ago G permalink parent award report block reply JuicyfearsMAGA 1 points 3 days ago G permalink parent award report block reply PearlyGaits57 1 points 3 days ago E permalink parent award report block reply view 1 more comments... Bilabrin 2 points 3 days ago Sounds ike he would have had to load a second magazine? permalink award report block reply Owmyballz 2 points 3 days ago He never should have turned his back on him, he is damn lucky to be alive now. permalink award report block reply 45ichooseu 2 points 3 days ago Both dudes were in the wrong, this was completely avoidable. Both looking for confrontation. Not illegal to be rude/unaware /dumb on the road. Dude in the truck appears to have intentionally hit the car at worse, or intentionally not allow the merge. Truck havd right off way, but is pride worth the crash? Nope. I always give people space, even the jerks, because it avoids collisions and escalation. Black dude was dumb to attempt assault/murder. If truck dude is a cop, he shouldn't be. permalink award report block reply CanadianLad 2 points 3 days ago Where is the news article on this permalink award report block reply Your-personal-FBI 2 points 3 days ago Typical cop. He could have been civil and let the guy in. Instead he shoots him. permalink award report block reply NoMaskNoMaster 2 points 3 days ago In a perfect world, they'd toss the carcass into a ditch, and guy goes home without ever being pestered as if nothing happened. permalink award report block reply GuerillaYourDreams 2 points 3 days ago I would hope that I never have to but I will prepare in case. permalink award report block reply Induceddrag 2 points 3 days ago If I have a choice between not letting a guy in and having body work done on my vehicle, I always choose to let the guy in.  Keeps the insurance rates down. permalink award report block reply BoomShtick 1 points 3 days ago The fat fuck that got punched was a cop off duty. Now if that was one of us that had to shoot; chances are we would be prosecuted. permalink award report block reply JuicyfearsMAGA 1 points 3 days ago No zipper merging allowed permalink award report block reply SoldierOnFire 1 points 3 days ago Cop was wrong not letting him merge. Cop was right for killling him. permalink award report block reply Pepe_longcockings 4 points 3 days ago Why is he obligated to compensate for someine else’s poor driving choices?  If someone was about to drive off a cliff if i didnt let them in, i still wouldnt let them in.  They have the option of safely braking and merging behind me permalink parent award report block reply Justlooking250 1 points 3 days ago You also have the option of just being one car length behind so someone doesn't plummet to thier death, i'm not saying you have to let everyone in (especially if they don't signal) but thats obscenely cunty to let someone drop off a cliff instead of just let them in lol permalink parent award report block reply Pofus_Poopants 3 points 3 days ago You don't have to let anyone merge. It is not my responsibility to make sure you have a pleasant driving experience. permalink parent award report block reply IAmNotAnAutist 3 points 3 days ago Nope.  If you want to merge, signal.  If the person wants to let you in, merge in.  If not, wait your turn. permalink parent award report block reply grantking2256 2 points 3 days ago Whats wrong with what this person said? Shit was doenvoted. Is it frustrating when folks won't let you in? Sure. That doesnt mean you just go. Fucking retarded behavior. \"Let me merge with this blind fold on!\" Don't be an idiot. All of this could have been avoided if you just let go. So what you waited 1 more car length. permalink parent award report block reply Justlooking250 1 points 3 days ago FAFO Moron 🤤 Darwin Award 🏅 permalink award report block reply TheLesserBambino 1 points 3 days ago The thing about this is that in the beginning (at least in my state) in a merging situation like this, the person if front has right of way to come over. The truck would be expected to make room as long as it wasn't dangerous to do so. So if asshat had kept his head and not pistol whipped an off duty cop over some bullshit, he probably would have gotten a nice payout. permalink award report block reply MudDog 1 points 3 days ago N permalink award report block reply Trump454748 1 points 3 days ago New York Times headline: “Innocent person of color ambushed by white supremacist” permalink award report block reply Gildoom 1 points 3 days ago Dindu! permalink award report block reply cryptoapebot 0 points 3 days ago Yeah, I prob would have gotten out and apologized for cuttign him off and point out that maybe he didn't see the road construction up ahead.  In California, that collision is the guy's fault behind.  Dude pulling a gun over a fender bender is insane. permalink award report block reply JDVance4President28 1 points 3 days ago It wouldn't have been his fault simply because he was a cop. permalink parent award report block reply cryptoapebot 1 points 21 hours ago I guess I didn't see the context.  If he was a cop and didn't want him to merge, he should have put his lights on.   Either way, driver pulling a gun over a stupid fender bender is a stupid fucking move.   What a freakin idiot. permalink parent award report block reply Your-personal-FBI 0 points 3 days ago Stay on the ground! Walk this way! Stay on the ground! This cop is a psychopath. permalink award report block reply redinmn -1 points 3 days ago Either could have let up on the gas for a moment and none of this would have happened.  Both are assholes. permalink award report block reply LadyGrahamsminge 4 points 3 days ago No, spooks are in the habit of driving like they own the fucking road, and love nothing more than to play chicken with white drivers. Tyrone lost this game of chicken. That is a good thing. Imagine that is your wife, daughter, or other loved one instead of a cop. Quantrell could have merged way back when the signs told him to ( if he were able to read) or he could have waited. The other driver did nothing wrong or illegal, and did the world a service by taking that piece of shit off of the road for good. permalink parent award report block reply lixa -3 points 3 days ago Why the hell is this pinned permalink award report block reply seattlerunner 1 points 3 days ago Mods have been stickying garbage all day permalink parent award report block reply lixa 2 points 3 days ago Years now permalink parent award report block reply seattlerunner 3 points 3 days ago I think I’m gonna apply for mod. I’ve been in here since the very beginning, thedonald days. permalink parent award report block reply lixa 1 points 3 days ago Go for it! permalink parent award report block reply Moose_Antlers -3 points 3 days ago White guy's an a-hole. Dude sees the right lane has a work crew in it, and sees the cones to merge. He sees the black guy trying to merge in and never gives space to let the guy in. He literally tries to run the black guy into the work crew. Black guys tries to make space and gently nose in. White guy still won't accommodate. When there's no space left, he finally pulls in and white guy is so freaking close because he's being a prick that they play bumper cars. I have no problem with pulling over and having words at that point. Black guy then chimps out, whips out a weapon, and makes his bad day into his last day by playing FAFO games. Neither man is the \"good guy\" in this. The white guy provoked the fight by driving like a total as..hat. The black guy is a murdering sonofa..tch who got exactly what he deserved for producing that pistol. At least one of these idiots was removed from society. permalink award report block reply IAmNotAnAutist 6 points 3 days ago Nope.  Jogger didn't even signal.  Fuck him. permalink parent award report block reply neomt 4 points 3 days ago Not his fucking problem.  It's on the merging car to change lanes safely. See #1 about it not being his fucking problem. See 1 and 2.  The black guy should be apologizing for going into an occupied lane, making contact. Hey, 1 out of 4 ain't bad in today's education system. permalink parent award report block reply JBlaze056 4 points 3 days ago 2 fat fucks both acting like assholes and they both have guns.   Be careful out there in our atomized and balkanized society. permalink parent award report block reply Hanging_Chad -8 points 3 days ago why didn’t the victim let the perp merge? permalink award report block reply monkadelic 23 points 3 days ago If experience is any indicator, his lane was backup up, Bob Marley passed everyone and then tried to force his way in the front.  Otherwise, yeah, just let them merge and bitch about it. permalink parent award report block reply DrJosephWarren 6 points 3 days ago If he was planning on using it, Marley should have emerged from the car with his gun drawn. Fumbling around in your picket for your piece is lacking. permalink parent award report block reply MAGA_NRG 22 points 3 days ago Don't have to by law. Why didn't the guy just slow down and get in behind him. permalink parent award report block reply zooty 8 points 3 days ago There was plenty of room to merge in at first. Looks like a skill issue. Regardless, it's the responsibility of the merger to merge safely. permalink parent award report block reply Hanging_Chad 4 points 3 days ago looks like he went for it but then the front car braked so he had to brake. either way, he was likely high on weed permalink parent award report block reply MAGA_mantis 5 points 3 days ago Why didn't the victim learn how to not take cuts ? permalink parent award report block reply IAmNotAnAutist 2 points 3 days ago Because fuck you, that's why. permalink parent award report block reply M1kes_Cock 5 points 3 days ago Comment removed by community moderators. permalink award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply view 4 more comments... Cowpill 2 points 3 days ago Comment removed by community filter. permalink parent award report block reply entwickelnden 1 points 3 days ago Comment removed by community filter. permalink award report block reply moscowjade 1 points 3 days ago Comment removed by community moderators. permalink award report block reply JimRaynor 1 points 3 days ago Comment removed by community filter. permalink award report block reply\njsphere256 160 points 3 days ago If someone approaches you with one hand in their pocket like that. It's a gun. permalink award report block reply Tellman125 32 points 3 days ago or a candy bar, like the one Charlie Sheen's character used in the 1994  action comedy film The Chase . permalink parent award report block reply Retardloserimsogay 10 points 3 days ago Wasn't that also in a Tim Robbins/Martin Lawrence movie? permalink parent award report block reply myke 4 points 3 days ago No, but he did pay for a sour fruity twist. Took the shotty. It was a pretty one, pistol grip pump, chromed out nickle finish. Anywho. permalink parent award report block reply Parhelion12 6 points 3 days ago That movie is relapse city. permalink parent award report block reply NomadicKrow2 3 points 3 days ago Or a water pistol, like the hero used in Michael Douglas's 1993 Documentary Falling Down. permalink parent award report block reply myke 4 points 3 days ago \"You think I'm the bad guy?\" permalink parent award report block reply Bigstick7 11 points 3 days ago Cop was a douche bag not letting him merge with an upcoming lane closure though couldn't tell if his blinker was on. Stupid to turn his back on him. Then the black guy was an idiot for punching him. White cop is lucky he's a quick draw and black guy did one handed gangsta aim (very little gun control). Honestly both these dudes suck. permalink parent award report block reply Backslash2099 15 points 3 days ago Is that a cop? Doesn't look like a cop. permalink parent award report block reply Bigstick7 31 points 3 days ago Other comments I read were this was an off duty cop. Math checks out with how fat he is. permalink parent award report block reply mydogma8yourkarma 29 points 3 days ago Quick clean draw, super composed, fat or not our boy was on his game. permalink parent award report block reply view 4 more comments... Backslash2099 2 points 3 days ago Heh yea maybe permalink parent award report block reply deleted 0 points 3 days ago view 1 more comments... SkepticAF 6 points 3 days ago This video was posted here before a while ago. Was an off duty police officer. permalink parent award report block reply 95Rockytoby95 14 points 3 days ago Don't defend an arrogant shithead expecting to be let in. Fuck em. Nobody owns the road. Wait your fucking turn.\nAs far as turning your back. You are absolutely correct. I've been driving over 50 years. People are actually becoming more and more aggressive. Thinking they have a right to any situation. Fuck em. They don't. permalink parent award report block reply Bigstick7 -1 points 2 days ago All the dude had to do was let the guy in, let off the gas and let him merge his car was already 3/4 of his car length in front of him. Instead he sped up to keep the guy from merging when approaching a construction zone. The black guy would have had to brake hard then merge them speed up which would have probably impacted the traffic behind the cop. Cop was a douche bag just let the guy over. lol \"nobody owns the road\" the cop sure acted like it by doing everything in his power even to the point of hitting the guy to keep him from merging. This post has informed my there are a bunch of fags on this site that drive like assholes. permalink parent award report block reply 95Rockytoby95 1 points 2 days ago That doesn't give you the right to wait till the very last moment like some assholes do to merge. Im positive there were signs prior to that. So if you do wait till the very last minute.. fuck you and wait. permalink parent award report block reply katsumi27 9 points 3 days ago Car emerging could’ve slowed down and planned to head to get behind.  Plus, the guy didn’t use his turn signal. permalink parent award report block reply IPMang 7 points 3 days ago I don't think that was a punch, looked like he pistol whipped him in the face... Fair to say you're safe to start blasting at that point permalink parent award report block reply Bigstick7 7 points 3 days ago 100% got what he was asking for, no sympathy for the black guy. Cop is still a douchebag driver. permalink parent award report block reply AwShitHereWeGoAgain 3 points 3 days ago Joggers should RARELY ever be afforded any sympathy. permalink parent award report block reply ArtLife 0 points 3 days ago Exactly, the guy had his blinker on, should have let him merge, there may have been no room to fall back. permalink parent award report block reply corporateshizer 2 points 3 days ago Nailed it, champ. permalink parent award report block reply load 6 more comments... m0r1arty 1 points 3 days ago Or a stapler like Bruce Wayne used in Batman Begins. permalink parent award report block reply NeoDragoon -17 points 3 days ago or a knife like this case permalink parent award report block reply deleted 31 points 3 days ago Doritalos 8 points 3 days ago Earlier than that, he actually pistol whipped him at 0:42 permalink parent award report block reply deleted 1 points 3 days ago view 4 more comments... NeoDragoon -18 points 3 days ago After he reached back into the hoodie, faggot\n00:42 - not a gun permalink parent award report block reply Konsaki 12 points 3 days ago So, he had a gun. Got it. permalink parent award report block reply Doritalos 10 points 3 days ago That's a gun, he pistol whipped him permalink parent award report block reply TGNX 3 points 3 days ago I watched the whole video. Guy pulled a gun. permalink parent award report block reply Tellman125 -1 points 3 days ago Comment removed by community filter. permalink parent award report block reply Ten20111 4 points 3 days ago Old video, 'teen' pistol whips an off duty cop, then gets turned off permalink parent award report block reply Ol_Gravy_Leg 12 points 3 days ago \"Old video\"= happened last month and it was recently released. permalink parent award report block reply\nTellman125 32 points 3 days ago or a candy bar, like the one Charlie Sheen's character used in the 1994  action comedy film The Chase . permalink parent award report block reply Retardloserimsogay 10 points 3 days ago Wasn't that also in a Tim Robbins/Martin Lawrence movie? permalink parent award report block reply myke 4 points 3 days ago No, but he did pay for a sour fruity twist. Took the shotty. It was a pretty one, pistol grip pump, chromed out nickle finish. Anywho. permalink parent award report block reply Parhelion12 6 points 3 days ago That movie is relapse city. permalink parent award report block reply NomadicKrow2 3 points 3 days ago Or a water pistol, like the hero used in Michael Douglas's 1993 Documentary Falling Down. permalink parent award report block reply myke 4 points 3 days ago \"You think I'm the bad guy?\" permalink parent award report block reply\nRetardloserimsogay 10 points 3 days ago Wasn't that also in a Tim Robbins/Martin Lawrence movie? permalink parent award report block reply myke 4 points 3 days ago No, but he did pay for a sour fruity twist. Took the shotty. It was a pretty one, pistol grip pump, chromed out nickle finish. Anywho. permalink parent award report block reply\nmyke 4 points 3 days ago No, but he did pay for a sour fruity twist. Took the shotty. It was a pretty one, pistol grip pump, chromed out nickle finish. Anywho. permalink parent award report block reply\nParhelion12 6 points 3 days ago That movie is relapse city. permalink parent award report block reply\nNomadicKrow2 3 points 3 days ago Or a water pistol, like the hero used in Michael Douglas's 1993 Documentary Falling Down. permalink parent award report block reply myke 4 points 3 days ago \"You think I'm the bad guy?\" permalink parent award report block reply\nmyke 4 points 3 days ago \"You think I'm the bad guy?\" permalink parent award report block reply\nBigstick7 11 points 3 days ago Cop was a douche bag not letting him merge with an upcoming lane closure though couldn't tell if his blinker was on. Stupid to turn his back on him. Then the black guy was an idiot for punching him. White cop is lucky he's a quick draw and black guy did one handed gangsta aim (very little gun control). Honestly both these dudes suck. permalink parent award report block reply Backslash2099 15 points 3 days ago Is that a cop? Doesn't look like a cop. permalink parent award report block reply Bigstick7 31 points 3 days ago Other comments I read were this was an off duty cop. Math checks out with how fat he is. permalink parent award report block reply mydogma8yourkarma 29 points 3 days ago Quick clean draw, super composed, fat or not our boy was on his game. permalink parent award report block reply view 4 more comments... Backslash2099 2 points 3 days ago Heh yea maybe permalink parent award report block reply deleted 0 points 3 days ago view 1 more comments... SkepticAF 6 points 3 days ago This video was posted here before a while ago. Was an off duty police officer. permalink parent award report block reply 95Rockytoby95 14 points 3 days ago Don't defend an arrogant shithead expecting to be let in. Fuck em. Nobody owns the road. Wait your fucking turn.\nAs far as turning your back. You are absolutely correct. I've been driving over 50 years. People are actually becoming more and more aggressive. Thinking they have a right to any situation. Fuck em. They don't. permalink parent award report block reply Bigstick7 -1 points 2 days ago All the dude had to do was let the guy in, let off the gas and let him merge his car was already 3/4 of his car length in front of him. Instead he sped up to keep the guy from merging when approaching a construction zone. The black guy would have had to brake hard then merge them speed up which would have probably impacted the traffic behind the cop. Cop was a douche bag just let the guy over. lol \"nobody owns the road\" the cop sure acted like it by doing everything in his power even to the point of hitting the guy to keep him from merging. This post has informed my there are a bunch of fags on this site that drive like assholes. permalink parent award report block reply 95Rockytoby95 1 points 2 days ago That doesn't give you the right to wait till the very last moment like some assholes do to merge. Im positive there were signs prior to that. So if you do wait till the very last minute.. fuck you and wait. permalink parent award report block reply katsumi27 9 points 3 days ago Car emerging could’ve slowed down and planned to head to get behind.  Plus, the guy didn’t use his turn signal. permalink parent award report block reply IPMang 7 points 3 days ago I don't think that was a punch, looked like he pistol whipped him in the face... Fair to say you're safe to start blasting at that point permalink parent award report block reply Bigstick7 7 points 3 days ago 100% got what he was asking for, no sympathy for the black guy. Cop is still a douchebag driver. permalink parent award report block reply AwShitHereWeGoAgain 3 points 3 days ago Joggers should RARELY ever be afforded any sympathy. permalink parent award report block reply ArtLife 0 points 3 days ago Exactly, the guy had his blinker on, should have let him merge, there may have been no room to fall back. permalink parent award report block reply corporateshizer 2 points 3 days ago Nailed it, champ. permalink parent award report block reply load 6 more comments...\nBackslash2099 15 points 3 days ago Is that a cop? Doesn't look like a cop. permalink parent award report block reply Bigstick7 31 points 3 days ago Other comments I read were this was an off duty cop. Math checks out with how fat he is. permalink parent award report block reply mydogma8yourkarma 29 points 3 days ago Quick clean draw, super composed, fat or not our boy was on his game. permalink parent award report block reply view 4 more comments... Backslash2099 2 points 3 days ago Heh yea maybe permalink parent award report block reply deleted 0 points 3 days ago view 1 more comments... SkepticAF 6 points 3 days ago This video was posted here before a while ago. Was an off duty police officer. permalink parent award report block reply\nBigstick7 31 points 3 days ago Other comments I read were this was an off duty cop. Math checks out with how fat he is. permalink parent award report block reply mydogma8yourkarma 29 points 3 days ago Quick clean draw, super composed, fat or not our boy was on his game. permalink parent award report block reply view 4 more comments... Backslash2099 2 points 3 days ago Heh yea maybe permalink parent award report block reply deleted 0 points 3 days ago view 1 more comments...\nmydogma8yourkarma 29 points 3 days ago Quick clean draw, super composed, fat or not our boy was on his game. permalink parent award report block reply view 4 more comments...\nBackslash2099 2 points 3 days ago Heh yea maybe permalink parent award report block reply\ndeleted 0 points 3 days ago view 1 more comments...\nSkepticAF 6 points 3 days ago This video was posted here before a while ago. Was an off duty police officer. permalink parent award report block reply\n95Rockytoby95 14 points 3 days ago Don't defend an arrogant shithead expecting to be let in. Fuck em. Nobody owns the road. Wait your fucking turn.\nAs far as turning your back. You are absolutely correct. I've been driving over 50 years. People are actually becoming more and more aggressive. Thinking they have a right to any situation. Fuck em. They don't. permalink parent award report block reply Bigstick7 -1 points 2 days ago All the dude had to do was let the guy in, let off the gas and let him merge his car was already 3/4 of his car length in front of him. Instead he sped up to keep the guy from merging when approaching a construction zone. The black guy would have had to brake hard then merge them speed up which would have probably impacted the traffic behind the cop. Cop was a douche bag just let the guy over. lol \"nobody owns the road\" the cop sure acted like it by doing everything in his power even to the point of hitting the guy to keep him from merging. This post has informed my there are a bunch of fags on this site that drive like assholes. permalink parent award report block reply 95Rockytoby95 1 points 2 days ago That doesn't give you the right to wait till the very last moment like some assholes do to merge. Im positive there were signs prior to that. So if you do wait till the very last minute.. fuck you and wait. permalink parent award report block reply\nBigstick7 -1 points 2 days ago All the dude had to do was let the guy in, let off the gas and let him merge his car was already 3/4 of his car length in front of him. Instead he sped up to keep the guy from merging when approaching a construction zone. The black guy would have had to brake hard then merge them speed up which would have probably impacted the traffic behind the cop. Cop was a douche bag just let the guy over. lol \"nobody owns the road\" the cop sure acted like it by doing everything in his power even to the point of hitting the guy to keep him from merging. This post has informed my there are a bunch of fags on this site that drive like assholes. permalink parent award report block reply 95Rockytoby95 1 points 2 days ago That doesn't give you the right to wait till the very last moment like some assholes do to merge. Im positive there were signs prior to that. So if you do wait till the very last minute.. fuck you and wait. permalink parent award report block reply\n95Rockytoby95 1 points 2 days ago That doesn't give you the right to wait till the very last moment like some assholes do to merge. Im positive there were signs prior to that. So if you do wait till the very last minute.. fuck you and wait. permalink parent award report block reply\nkatsumi27 9 points 3 days ago Car emerging could’ve slowed down and planned to head to get behind.  Plus, the guy didn’t use his turn signal. permalink parent award report block reply\nIPMang 7 points 3 days ago I don't think that was a punch, looked like he pistol whipped him in the face... Fair to say you're safe to start blasting at that point permalink parent award report block reply Bigstick7 7 points 3 days ago 100% got what he was asking for, no sympathy for the black guy. Cop is still a douchebag driver. permalink parent award report block reply AwShitHereWeGoAgain 3 points 3 days ago Joggers should RARELY ever be afforded any sympathy. permalink parent award report block reply ArtLife 0 points 3 days ago Exactly, the guy had his blinker on, should have let him merge, there may have been no room to fall back. permalink parent award report block reply\nBigstick7 7 points 3 days ago 100% got what he was asking for, no sympathy for the black guy. Cop is still a douchebag driver. permalink parent award report block reply AwShitHereWeGoAgain 3 points 3 days ago Joggers should RARELY ever be afforded any sympathy. permalink parent award report block reply ArtLife 0 points 3 days ago Exactly, the guy had his blinker on, should have let him merge, there may have been no room to fall back. permalink parent award report block reply\nAwShitHereWeGoAgain 3 points 3 days ago Joggers should RARELY ever be afforded any sympathy. permalink parent award report block reply\nArtLife 0 points 3 days ago Exactly, the guy had his blinker on, should have let him merge, there may have been no room to fall back. permalink parent award report block reply\ncorporateshizer 2 points 3 days ago Nailed it, champ. permalink parent award report block reply\nm0r1arty 1 points 3 days ago Or a stapler like Bruce Wayne used in Batman Begins. permalink parent award report block reply\nNeoDragoon -17 points 3 days ago or a knife like this case permalink parent award report block reply deleted 31 points 3 days ago Doritalos 8 points 3 days ago Earlier than that, he actually pistol whipped him at 0:42 permalink parent award report block reply deleted 1 points 3 days ago view 4 more comments... NeoDragoon -18 points 3 days ago After he reached back into the hoodie, faggot\n00:42 - not a gun permalink parent award report block reply Konsaki 12 points 3 days ago So, he had a gun. Got it. permalink parent award report block reply Doritalos 10 points 3 days ago That's a gun, he pistol whipped him permalink parent award report block reply TGNX 3 points 3 days ago I watched the whole video. Guy pulled a gun. permalink parent award report block reply Tellman125 -1 points 3 days ago Comment removed by community filter. permalink parent award report block reply Ten20111 4 points 3 days ago Old video, 'teen' pistol whips an off duty cop, then gets turned off permalink parent award report block reply Ol_Gravy_Leg 12 points 3 days ago \"Old video\"= happened last month and it was recently released. permalink parent award report block reply\ndeleted 31 points 3 days ago Doritalos 8 points 3 days ago Earlier than that, he actually pistol whipped him at 0:42 permalink parent award report block reply deleted 1 points 3 days ago view 4 more comments... NeoDragoon -18 points 3 days ago After he reached back into the hoodie, faggot\n00:42 - not a gun permalink parent award report block reply Konsaki 12 points 3 days ago So, he had a gun. Got it. permalink parent award report block reply Doritalos 10 points 3 days ago That's a gun, he pistol whipped him permalink parent award report block reply TGNX 3 points 3 days ago I watched the whole video. Guy pulled a gun. permalink parent award report block reply Tellman125 -1 points 3 days ago Comment removed by community filter. permalink parent award report block reply\nDoritalos 8 points 3 days ago Earlier than that, he actually pistol whipped him at 0:42 permalink parent award report block reply deleted 1 points 3 days ago view 4 more comments...\ndeleted 1 points 3 days ago view 4 more comments...\nNeoDragoon -18 points 3 days ago After he reached back into the hoodie, faggot\n00:42 - not a gun permalink parent award report block reply Konsaki 12 points 3 days ago So, he had a gun. Got it. permalink parent award report block reply Doritalos 10 points 3 days ago That's a gun, he pistol whipped him permalink parent award report block reply TGNX 3 points 3 days ago I watched the whole video. Guy pulled a gun. permalink parent award report block reply Tellman125 -1 points 3 days ago Comment removed by community filter. permalink parent award report block reply\nKonsaki 12 points 3 days ago So, he had a gun. Got it. permalink parent award report block reply\nDoritalos 10 points 3 days ago That's a gun, he pistol whipped him permalink parent award report block reply\nTGNX 3 points 3 days ago I watched the whole video. Guy pulled a gun. permalink parent award report block reply\nTellman125 -1 points 3 days ago Comment removed by community filter. permalink parent award report block reply\nTen20111 4 points 3 days ago Old video, 'teen' pistol whips an off duty cop, then gets turned off permalink parent award report block reply Ol_Gravy_Leg 12 points 3 days ago \"Old video\"= happened last month and it was recently released. permalink parent award report block reply\nOl_Gravy_Leg 12 points 3 days ago \"Old video\"= happened last month and it was recently released. permalink parent award report block reply\nWizard_Glick 118 points 3 days ago Cop on his way to work in his personal car, killed the jogger... permalink award report block reply SteveRogers42 37 points 3 days ago Bravo Zulu. permalink parent award report block reply AwShitHereWeGoAgain 5 points 3 days ago Abso-fucking-lutely. permalink parent award report block reply Joseyep 24 points 3 days ago Killed armed assailant** permalink parent award report block reply ThisTrainHasNoBrakes 4 points 3 days ago He didn’t relax. permalink parent award report block reply SickOfNeoPolitics 2 points 3 days ago Did he get overtime pay for working off the clock? permalink parent award report block reply Wizard_Glick 1 points 2 days ago No, but he collected the bounty... permalink parent award report block reply wilburh09 -30 points 3 days ago He should have let the guy merge in front of him there was construction in the other lane.  2 idiots imo. permalink parent award report block reply LineInTheSand 48 points 3 days ago Right of way belongs to the person in the lane of travel, not the person who is changing lanes. permalink parent award report block reply BillGall2 -4 points 3 days ago No.  It belongs to the person in front.  Once he enters the lane he has the right of way.  He does not have to occupy the entire lane.  The cop moved way left so he could pull along side and bump the rear right side of the car in front.  He knew what he was doing. The cop initiated the altercation.  The car in front was driving agressively, but a good judge would likely nail the cop for failing to yield. permalink parent award report block reply LineInTheSand 2 points 2 days ago You should probably read up on your state laws and take a driver's education course.  The driver changing lanes must wait for a safe opening before changing lanes.  The key words are highlighted.  Any opening is not sufficient.  Changing lanes without sufficient room for the other vehicles to maintain a safe following distance is not safe or legal. Edit: Here is a video with the first incident being similar to the one posted by OP .  The police ruled the driver changing lanes was completely at fault. permalink parent award report block reply wilburh09 -43 points 3 days ago Ok that’s what an asshole does.  He caused the entire thing by being an asshole driver. I fucking hate fat idiot asshole drivers in their oversized trucks that they don’t even need, but buy to prove how tough they are.  Fuck that guy . There was plenty of room to let him merge without hitting him.  Total idiots both of them . permalink parent award report block reply Doritalos 23 points 3 days ago And I hate punks that think they can just cut someone off. If he isn't going to let you pass, then you need to slow and change lanes behind him. What I hate are people who speed up after you hit the indicator knowing you are going to change lanes. That wasn't the case here but it happens in the US, I don't see this behavior in other countries. permalink parent award report block reply view 2 more comments... SaltiTaralli 21 points 3 days ago So you're one of the countless assholes who tries to muscle their way into a lane instead of SAFELY MERGING AND WAITING YOUR TURN. LEARN TO DRIVE. If you think the cop was the asshole in this scenario you're retarded. permalink parent award report block reply view 2 more comments... DeaduponArousal 11 points 3 days ago Get back in line faggot. If I’m nice enough and there’s plenty of room I might let you over. Otherwise retake your driving test and take a number. Joggers think they can just do whatever they like on the road. permalink parent award report block reply BlackJack1776 9 points 3 days ago Take the bus then. permalink parent award report block reply SirPokeSmottington 6 points 3 days ago I mean, I guess you could know the goddamn fuckin law of the road and not be a stupid ni66er with poor impulse control. Or we can go with your retarded idea. permalink parent award report block reply load 20 more comments... bumpman 15 points 3 days ago Wasn’t very considerate, but if you do find yourself unable to get over, don’t veer into someone, just slow down/ stop until there’s an opening. permalink parent award report block reply wilburh09 -18 points 3 days ago The guy had plenty of clearance to merge.  The driver of the truck intentionally cut him off and HIT the merging driver.  If you have 10 car lengths in front of you and a car in the other lane is moving ahead of you and needs to merge because of construction blocking the lane..  and if you accelerate and block that car merging by hitting their rear panel..  then you are a fucking asshole. permalink parent award report block reply SirPokeSmottington 13 points 3 days ago You're the fucking asshole. YOU PULL IN BEHIND OTHER VEHICLES, YOU STUPID CUNT. permalink parent award report block reply yummy_yumm_yumms 5 points 3 days ago He should have left the house earlier, moron. Just because your lane is ending/obstructed, doesn't make it my problem. Maybe you need to go back to drivers ed to learn how to drive, cause you clearly don't understand. permalink parent award report block reply view 8 more comments... TGNX 2 points 3 days ago An asshole who is in the right. permalink parent award report block reply NotInFormation 8 points 3 days ago 102% of the time I approach a lane closure people like the jogger attempt to use every last inch of the lane being closed to pass everyone who has merged properly and then shove their nose in like this. permalink parent award report block reply TRexScrotum 3 points 3 days ago Here in Chicago people do that and it’s infuriating because there’s a truck with or a trailered GIANT FLASHING ARROW that you can see ALLLLL the way down the street. But no, lemme wait until I almost hit the thing and then try to get over. Absolute idiots, can’t wait to get out of here. permalink parent award report block reply NotInFormation 2 points 2 days ago To where? In the meantime sometimes people arrange themselves in a staggered pattern to occupy two lanes, and then traffic flows smoothly -- and usually the aggro people relax a bit before everything opens up or maybe they realize they didn't 'lose' that much time anyway.  I neither affirm nor deny participating in such erratic behavior :p permalink parent award report block reply view 1 more comments... ConfusedAngryArmed 5 points 3 days ago This tells me you can't fucking drive. Joggers do this shit constantly. They see the lane closure then try to speed to cut someone else off instead of doing what every other human with above room temperature IQ does. permalink parent award report block reply doodaddy 3 points 3 days ago fag permalink parent award report block reply\nSteveRogers42 37 points 3 days ago Bravo Zulu. permalink parent award report block reply AwShitHereWeGoAgain 5 points 3 days ago Abso-fucking-lutely. permalink parent award report block reply\nAwShitHereWeGoAgain 5 points 3 days ago Abso-fucking-lutely. permalink parent award report block reply\nJoseyep 24 points 3 days ago Killed armed assailant** permalink parent award report block reply\nThisTrainHasNoBrakes 4 points 3 days ago He didn’t relax. permalink parent award report block reply\nSickOfNeoPolitics 2 points 3 days ago Did he get overtime pay for working off the clock? permalink parent award report block reply Wizard_Glick 1 points 2 days ago No, but he collected the bounty... permalink parent award report block reply\nWizard_Glick 1 points 2 days ago No, but he collected the bounty... permalink parent award report block reply\nwilburh09 -30 points 3 days ago He should have let the guy merge in front of him there was construction in the other lane.  2 idiots imo. permalink parent award report block reply LineInTheSand 48 points 3 days ago Right of way belongs to the person in the lane of travel, not the person who is changing lanes. permalink parent award report block reply BillGall2 -4 points 3 days ago No.  It belongs to the person in front.  Once he enters the lane he has the right of way.  He does not have to occupy the entire lane.  The cop moved way left so he could pull along side and bump the rear right side of the car in front.  He knew what he was doing. The cop initiated the altercation.  The car in front was driving agressively, but a good judge would likely nail the cop for failing to yield. permalink parent award report block reply LineInTheSand 2 points 2 days ago You should probably read up on your state laws and take a driver's education course.  The driver changing lanes must wait for a safe opening before changing lanes.  The key words are highlighted.  Any opening is not sufficient.  Changing lanes without sufficient room for the other vehicles to maintain a safe following distance is not safe or legal. Edit: Here is a video with the first incident being similar to the one posted by OP .  The police ruled the driver changing lanes was completely at fault. permalink parent award report block reply wilburh09 -43 points 3 days ago Ok that’s what an asshole does.  He caused the entire thing by being an asshole driver. I fucking hate fat idiot asshole drivers in their oversized trucks that they don’t even need, but buy to prove how tough they are.  Fuck that guy . There was plenty of room to let him merge without hitting him.  Total idiots both of them . permalink parent award report block reply Doritalos 23 points 3 days ago And I hate punks that think they can just cut someone off. If he isn't going to let you pass, then you need to slow and change lanes behind him. What I hate are people who speed up after you hit the indicator knowing you are going to change lanes. That wasn't the case here but it happens in the US, I don't see this behavior in other countries. permalink parent award report block reply view 2 more comments... SaltiTaralli 21 points 3 days ago So you're one of the countless assholes who tries to muscle their way into a lane instead of SAFELY MERGING AND WAITING YOUR TURN. LEARN TO DRIVE. If you think the cop was the asshole in this scenario you're retarded. permalink parent award report block reply view 2 more comments... DeaduponArousal 11 points 3 days ago Get back in line faggot. If I’m nice enough and there’s plenty of room I might let you over. Otherwise retake your driving test and take a number. Joggers think they can just do whatever they like on the road. permalink parent award report block reply BlackJack1776 9 points 3 days ago Take the bus then. permalink parent award report block reply SirPokeSmottington 6 points 3 days ago I mean, I guess you could know the goddamn fuckin law of the road and not be a stupid ni66er with poor impulse control. Or we can go with your retarded idea. permalink parent award report block reply load 20 more comments... bumpman 15 points 3 days ago Wasn’t very considerate, but if you do find yourself unable to get over, don’t veer into someone, just slow down/ stop until there’s an opening. permalink parent award report block reply wilburh09 -18 points 3 days ago The guy had plenty of clearance to merge.  The driver of the truck intentionally cut him off and HIT the merging driver.  If you have 10 car lengths in front of you and a car in the other lane is moving ahead of you and needs to merge because of construction blocking the lane..  and if you accelerate and block that car merging by hitting their rear panel..  then you are a fucking asshole. permalink parent award report block reply SirPokeSmottington 13 points 3 days ago You're the fucking asshole. YOU PULL IN BEHIND OTHER VEHICLES, YOU STUPID CUNT. permalink parent award report block reply yummy_yumm_yumms 5 points 3 days ago He should have left the house earlier, moron. Just because your lane is ending/obstructed, doesn't make it my problem. Maybe you need to go back to drivers ed to learn how to drive, cause you clearly don't understand. permalink parent award report block reply view 8 more comments... TGNX 2 points 3 days ago An asshole who is in the right. permalink parent award report block reply NotInFormation 8 points 3 days ago 102% of the time I approach a lane closure people like the jogger attempt to use every last inch of the lane being closed to pass everyone who has merged properly and then shove their nose in like this. permalink parent award report block reply TRexScrotum 3 points 3 days ago Here in Chicago people do that and it’s infuriating because there’s a truck with or a trailered GIANT FLASHING ARROW that you can see ALLLLL the way down the street. But no, lemme wait until I almost hit the thing and then try to get over. Absolute idiots, can’t wait to get out of here. permalink parent award report block reply NotInFormation 2 points 2 days ago To where? In the meantime sometimes people arrange themselves in a staggered pattern to occupy two lanes, and then traffic flows smoothly -- and usually the aggro people relax a bit before everything opens up or maybe they realize they didn't 'lose' that much time anyway.  I neither affirm nor deny participating in such erratic behavior :p permalink parent award report block reply view 1 more comments... ConfusedAngryArmed 5 points 3 days ago This tells me you can't fucking drive. Joggers do this shit constantly. They see the lane closure then try to speed to cut someone else off instead of doing what every other human with above room temperature IQ does. permalink parent award report block reply doodaddy 3 points 3 days ago fag permalink parent award report block reply\nLineInTheSand 48 points 3 days ago Right of way belongs to the person in the lane of travel, not the person who is changing lanes. permalink parent award report block reply BillGall2 -4 points 3 days ago No.  It belongs to the person in front.  Once he enters the lane he has the right of way.  He does not have to occupy the entire lane.  The cop moved way left so he could pull along side and bump the rear right side of the car in front.  He knew what he was doing. The cop initiated the altercation.  The car in front was driving agressively, but a good judge would likely nail the cop for failing to yield. permalink parent award report block reply LineInTheSand 2 points 2 days ago You should probably read up on your state laws and take a driver's education course.  The driver changing lanes must wait for a safe opening before changing lanes.  The key words are highlighted.  Any opening is not sufficient.  Changing lanes without sufficient room for the other vehicles to maintain a safe following distance is not safe or legal. Edit: Here is a video with the first incident being similar to the one posted by OP .  The police ruled the driver changing lanes was completely at fault. permalink parent award report block reply wilburh09 -43 points 3 days ago Ok that’s what an asshole does.  He caused the entire thing by being an asshole driver. I fucking hate fat idiot asshole drivers in their oversized trucks that they don’t even need, but buy to prove how tough they are.  Fuck that guy . There was plenty of room to let him merge without hitting him.  Total idiots both of them . permalink parent award report block reply Doritalos 23 points 3 days ago And I hate punks that think they can just cut someone off. If he isn't going to let you pass, then you need to slow and change lanes behind him. What I hate are people who speed up after you hit the indicator knowing you are going to change lanes. That wasn't the case here but it happens in the US, I don't see this behavior in other countries. permalink parent award report block reply view 2 more comments... SaltiTaralli 21 points 3 days ago So you're one of the countless assholes who tries to muscle their way into a lane instead of SAFELY MERGING AND WAITING YOUR TURN. LEARN TO DRIVE. If you think the cop was the asshole in this scenario you're retarded. permalink parent award report block reply view 2 more comments... DeaduponArousal 11 points 3 days ago Get back in line faggot. If I’m nice enough and there’s plenty of room I might let you over. Otherwise retake your driving test and take a number. Joggers think they can just do whatever they like on the road. permalink parent award report block reply BlackJack1776 9 points 3 days ago Take the bus then. permalink parent award report block reply SirPokeSmottington 6 points 3 days ago I mean, I guess you could know the goddamn fuckin law of the road and not be a stupid ni66er with poor impulse control. Or we can go with your retarded idea. permalink parent award report block reply load 20 more comments...\nBillGall2 -4 points 3 days ago No.  It belongs to the person in front.  Once he enters the lane he has the right of way.  He does not have to occupy the entire lane.  The cop moved way left so he could pull along side and bump the rear right side of the car in front.  He knew what he was doing. The cop initiated the altercation.  The car in front was driving agressively, but a good judge would likely nail the cop for failing to yield. permalink parent award report block reply LineInTheSand 2 points 2 days ago You should probably read up on your state laws and take a driver's education course.  The driver changing lanes must wait for a safe opening before changing lanes.  The key words are highlighted.  Any opening is not sufficient.  Changing lanes without sufficient room for the other vehicles to maintain a safe following distance is not safe or legal. Edit: Here is a video with the first incident being similar to the one posted by OP .  The police ruled the driver changing lanes was completely at fault. permalink parent award report block reply\nLineInTheSand 2 points 2 days ago You should probably read up on your state laws and take a driver's education course.  The driver changing lanes must wait for a safe opening before changing lanes.  The key words are highlighted.  Any opening is not sufficient.  Changing lanes without sufficient room for the other vehicles to maintain a safe following distance is not safe or legal. Edit: Here is a video with the first incident being similar to the one posted by OP .  The police ruled the driver changing lanes was completely at fault. permalink parent award report block reply\nwilburh09 -43 points 3 days ago Ok that’s what an asshole does.  He caused the entire thing by being an asshole driver. I fucking hate fat idiot asshole drivers in their oversized trucks that they don’t even need, but buy to prove how tough they are.  Fuck that guy . There was plenty of room to let him merge without hitting him.  Total idiots both of them . permalink parent award report block reply Doritalos 23 points 3 days ago And I hate punks that think they can just cut someone off. If he isn't going to let you pass, then you need to slow and change lanes behind him. What I hate are people who speed up after you hit the indicator knowing you are going to change lanes. That wasn't the case here but it happens in the US, I don't see this behavior in other countries. permalink parent award report block reply view 2 more comments... SaltiTaralli 21 points 3 days ago So you're one of the countless assholes who tries to muscle their way into a lane instead of SAFELY MERGING AND WAITING YOUR TURN. LEARN TO DRIVE. If you think the cop was the asshole in this scenario you're retarded. permalink parent award report block reply view 2 more comments... DeaduponArousal 11 points 3 days ago Get back in line faggot. If I’m nice enough and there’s plenty of room I might let you over. Otherwise retake your driving test and take a number. Joggers think they can just do whatever they like on the road. permalink parent award report block reply BlackJack1776 9 points 3 days ago Take the bus then. permalink parent award report block reply SirPokeSmottington 6 points 3 days ago I mean, I guess you could know the goddamn fuckin law of the road and not be a stupid ni66er with poor impulse control. Or we can go with your retarded idea. permalink parent award report block reply load 20 more comments...\nDoritalos 23 points 3 days ago And I hate punks that think they can just cut someone off. If he isn't going to let you pass, then you need to slow and change lanes behind him. What I hate are people who speed up after you hit the indicator knowing you are going to change lanes. That wasn't the case here but it happens in the US, I don't see this behavior in other countries. permalink parent award report block reply view 2 more comments...\nSaltiTaralli 21 points 3 days ago So you're one of the countless assholes who tries to muscle their way into a lane instead of SAFELY MERGING AND WAITING YOUR TURN. LEARN TO DRIVE. If you think the cop was the asshole in this scenario you're retarded. permalink parent award report block reply view 2 more comments...\nDeaduponArousal 11 points 3 days ago Get back in line faggot. If I’m nice enough and there’s plenty of room I might let you over. Otherwise retake your driving test and take a number. Joggers think they can just do whatever they like on the road. permalink parent award report block reply\nBlackJack1776 9 points 3 days ago Take the bus then. permalink parent award report block reply\nSirPokeSmottington 6 points 3 days ago I mean, I guess you could know the goddamn fuckin law of the road and not be a stupid ni66er with poor impulse control. Or we can go with your retarded idea. permalink parent award report block reply\nbumpman 15 points 3 days ago Wasn’t very considerate, but if you do find yourself unable to get over, don’t veer into someone, just slow down/ stop until there’s an opening. permalink parent award report block reply wilburh09 -18 points 3 days ago The guy had plenty of clearance to merge.  The driver of the truck intentionally cut him off and HIT the merging driver.  If you have 10 car lengths in front of you and a car in the other lane is moving ahead of you and needs to merge because of construction blocking the lane..  and if you accelerate and block that car merging by hitting their rear panel..  then you are a fucking asshole. permalink parent award report block reply SirPokeSmottington 13 points 3 days ago You're the fucking asshole. YOU PULL IN BEHIND OTHER VEHICLES, YOU STUPID CUNT. permalink parent award report block reply yummy_yumm_yumms 5 points 3 days ago He should have left the house earlier, moron. Just because your lane is ending/obstructed, doesn't make it my problem. Maybe you need to go back to drivers ed to learn how to drive, cause you clearly don't understand. permalink parent award report block reply view 8 more comments... TGNX 2 points 3 days ago An asshole who is in the right. permalink parent award report block reply\nwilburh09 -18 points 3 days ago The guy had plenty of clearance to merge.  The driver of the truck intentionally cut him off and HIT the merging driver.  If you have 10 car lengths in front of you and a car in the other lane is moving ahead of you and needs to merge because of construction blocking the lane..  and if you accelerate and block that car merging by hitting their rear panel..  then you are a fucking asshole. permalink parent award report block reply SirPokeSmottington 13 points 3 days ago You're the fucking asshole. YOU PULL IN BEHIND OTHER VEHICLES, YOU STUPID CUNT. permalink parent award report block reply yummy_yumm_yumms 5 points 3 days ago He should have left the house earlier, moron. Just because your lane is ending/obstructed, doesn't make it my problem. Maybe you need to go back to drivers ed to learn how to drive, cause you clearly don't understand. permalink parent award report block reply view 8 more comments... TGNX 2 points 3 days ago An asshole who is in the right. permalink parent award report block reply\nSirPokeSmottington 13 points 3 days ago You're the fucking asshole. YOU PULL IN BEHIND OTHER VEHICLES, YOU STUPID CUNT. permalink parent award report block reply\nyummy_yumm_yumms 5 points 3 days ago He should have left the house earlier, moron. Just because your lane is ending/obstructed, doesn't make it my problem. Maybe you need to go back to drivers ed to learn how to drive, cause you clearly don't understand. permalink parent award report block reply view 8 more comments...\nTGNX 2 points 3 days ago An asshole who is in the right. permalink parent award report block reply\nNotInFormation 8 points 3 days ago 102% of the time I approach a lane closure people like the jogger attempt to use every last inch of the lane being closed to pass everyone who has merged properly and then shove their nose in like this. permalink parent award report block reply TRexScrotum 3 points 3 days ago Here in Chicago people do that and it’s infuriating because there’s a truck with or a trailered GIANT FLASHING ARROW that you can see ALLLLL the way down the street. But no, lemme wait until I almost hit the thing and then try to get over. Absolute idiots, can’t wait to get out of here. permalink parent award report block reply NotInFormation 2 points 2 days ago To where? In the meantime sometimes people arrange themselves in a staggered pattern to occupy two lanes, and then traffic flows smoothly -- and usually the aggro people relax a bit before everything opens up or maybe they realize they didn't 'lose' that much time anyway.  I neither affirm nor deny participating in such erratic behavior :p permalink parent award report block reply view 1 more comments...\nTRexScrotum 3 points 3 days ago Here in Chicago people do that and it’s infuriating because there’s a truck with or a trailered GIANT FLASHING ARROW that you can see ALLLLL the way down the street. But no, lemme wait until I almost hit the thing and then try to get over. Absolute idiots, can’t wait to get out of here. permalink parent award report block reply NotInFormation 2 points 2 days ago To where? In the meantime sometimes people arrange themselves in a staggered pattern to occupy two lanes, and then traffic flows smoothly -- and usually the aggro people relax a bit before everything opens up or maybe they realize they didn't 'lose' that much time anyway.  I neither affirm nor deny participating in such erratic behavior :p permalink parent award report block reply view 1 more comments...\nNotInFormation 2 points 2 days ago To where? In the meantime sometimes people arrange themselves in a staggered pattern to occupy two lanes, and then traffic flows smoothly -- and usually the aggro people relax a bit before everything opens up or maybe they realize they didn't 'lose' that much time anyway.  I neither affirm nor deny participating in such erratic behavior :p permalink parent award report block reply view 1 more comments...\nConfusedAngryArmed 5 points 3 days ago This tells me you can't fucking drive. Joggers do this shit constantly. They see the lane closure then try to speed to cut someone else off instead of doing what every other human with above room temperature IQ does. permalink parent award report block reply\ndoodaddy 3 points 3 days ago fag permalink parent award report block reply\ndirtysanchez69 52 points 3 days ago Oh no! Anyway. permalink award report block reply RuleoVicus 19 points 3 days ago Too bad so sad permalink parent award report block reply lixa -5 points 3 days ago What's going on w these stickies permalink parent award report block reply\nRuleoVicus 19 points 3 days ago Too bad so sad permalink parent award report block reply\nlixa -5 points 3 days ago What's going on w these stickies permalink parent award report block reply\nFlgPole 49 points 3 days ago GTA 6 looks amazing. permalink award report block reply Tellman125 19 points 3 days ago It'll be out sometime in the later part of President Vance's second term. permalink parent award report block reply BlackJack1776 7 points 3 days ago Funny thing. Studio is Union. Union that uses Antifa (3 down arrows) as its iconography. That game is going to be a disaster. permalink parent award report block reply\nTellman125 19 points 3 days ago It'll be out sometime in the later part of President Vance's second term. permalink parent award report block reply BlackJack1776 7 points 3 days ago Funny thing. Studio is Union. Union that uses Antifa (3 down arrows) as its iconography. That game is going to be a disaster. permalink parent award report block reply\nBlackJack1776 7 points 3 days ago Funny thing. Studio is Union. Union that uses Antifa (3 down arrows) as its iconography. That game is going to be a disaster. permalink parent award report block reply\npapa_newguineapig 45 points 3 days ago No fucking way. I'm putting holes in that fucker the second he steps out of the car and approaches me hand in his hoodie like that. NO FUCKING CHANCE. permalink award report block reply BoatingAccident 44 points 3 days ago Agreed, the off duty police officer showed incredible restraint permalink parent award report block reply stellamonkey 45 points 3 days ago Also turned his back on the thug at one point - let's face it, these hood rats love to attack in packs or at least, from a sucker punch..  The cop is lucky, and also a VERY quick draw!  This was an immensely satisfying video to watch!!! permalink parent award report block reply wilburh09 -21 points 3 days ago No he didnt.  The guy was trying to merge over to avoid construction and the “off duty cop” would not let him.  Thats asshole driving on his part which caused this. permalink parent award report block reply DeepStateParasite 21 points 3 days ago No, the guy who had to merge because of the construction needed to brake and merge safely even if he wanted to cut in there.  You don't actually get to run into the car next to you to 'force merge'.  Then the at-fault  fucker sucker-punched the guy from behind and was clearly going to shoot him, so fortunately the pickup driver was able to discourage him with the use of hastily punched holes. Fuck that goat-turd-haired thug. permalink parent award report block reply redinmn -9 points 3 days ago Nope, depending on the state, you are required to yield to those whose lane is ending. permalink parent award report block reply wilburh09 -14 points 3 days ago You must be blind.  There was like 10 car lengths between this stupid asshole and the Car in Front of him.  Instead of letting the guy merge there he cut him off and hit him.  That’s asshole behavior.  I wish they shot each other would be a good outcome. permalink parent award report block reply view 1 more comments... makersmarx 11 points 3 days ago Agree, but the nog should have slowed down and got behind him since the truck driver had the right of way. permalink parent award report block reply wilburh09 -5 points 3 days ago But the truck driver accelerated and intentionally rammed the back of the merging driver.  I don’t care about the guy who got shot because fuck him for pulling a gun in Road rage.  But the driver here is a fucking asshole.  And if he’s driving like like this then I’m not surprised he got a gun pulled on him and sooner than later he’ll probably get his cap peeled. permalink parent award report block reply view 1 more comments... IAmNotAnAutist 11 points 3 days ago Wrong.  Jogger tried to bully his way in the way, fat cop said nope wait your turn, jogger. Then jogger got got. Jogger. permalink parent award report block reply neomt 7 points 3 days ago Fun fact, he doesn't have to let him Funner fact, the fault of the accident is 100% on the merging car, because it's 100% on him to not drive into an occupied lane. permalink parent award report block reply redinmn -3 points 3 days ago Most states require drivers to do a zipper merge taking turns in construction zones.  Both were guilty of being dicks and either one could have prevented this with nothing more than letting off the gas. permalink parent award report block reply view 1 more comments...\nBoatingAccident 44 points 3 days ago Agreed, the off duty police officer showed incredible restraint permalink parent award report block reply stellamonkey 45 points 3 days ago Also turned his back on the thug at one point - let's face it, these hood rats love to attack in packs or at least, from a sucker punch..  The cop is lucky, and also a VERY quick draw!  This was an immensely satisfying video to watch!!! permalink parent award report block reply wilburh09 -21 points 3 days ago No he didnt.  The guy was trying to merge over to avoid construction and the “off duty cop” would not let him.  Thats asshole driving on his part which caused this. permalink parent award report block reply DeepStateParasite 21 points 3 days ago No, the guy who had to merge because of the construction needed to brake and merge safely even if he wanted to cut in there.  You don't actually get to run into the car next to you to 'force merge'.  Then the at-fault  fucker sucker-punched the guy from behind and was clearly going to shoot him, so fortunately the pickup driver was able to discourage him with the use of hastily punched holes. Fuck that goat-turd-haired thug. permalink parent award report block reply redinmn -9 points 3 days ago Nope, depending on the state, you are required to yield to those whose lane is ending. permalink parent award report block reply wilburh09 -14 points 3 days ago You must be blind.  There was like 10 car lengths between this stupid asshole and the Car in Front of him.  Instead of letting the guy merge there he cut him off and hit him.  That’s asshole behavior.  I wish they shot each other would be a good outcome. permalink parent award report block reply view 1 more comments... makersmarx 11 points 3 days ago Agree, but the nog should have slowed down and got behind him since the truck driver had the right of way. permalink parent award report block reply wilburh09 -5 points 3 days ago But the truck driver accelerated and intentionally rammed the back of the merging driver.  I don’t care about the guy who got shot because fuck him for pulling a gun in Road rage.  But the driver here is a fucking asshole.  And if he’s driving like like this then I’m not surprised he got a gun pulled on him and sooner than later he’ll probably get his cap peeled. permalink parent award report block reply view 1 more comments... IAmNotAnAutist 11 points 3 days ago Wrong.  Jogger tried to bully his way in the way, fat cop said nope wait your turn, jogger. Then jogger got got. Jogger. permalink parent award report block reply neomt 7 points 3 days ago Fun fact, he doesn't have to let him Funner fact, the fault of the accident is 100% on the merging car, because it's 100% on him to not drive into an occupied lane. permalink parent award report block reply redinmn -3 points 3 days ago Most states require drivers to do a zipper merge taking turns in construction zones.  Both were guilty of being dicks and either one could have prevented this with nothing more than letting off the gas. permalink parent award report block reply view 1 more comments...\nstellamonkey 45 points 3 days ago Also turned his back on the thug at one point - let's face it, these hood rats love to attack in packs or at least, from a sucker punch..  The cop is lucky, and also a VERY quick draw!  This was an immensely satisfying video to watch!!! permalink parent award report block reply\nwilburh09 -21 points 3 days ago No he didnt.  The guy was trying to merge over to avoid construction and the “off duty cop” would not let him.  Thats asshole driving on his part which caused this. permalink parent award report block reply DeepStateParasite 21 points 3 days ago No, the guy who had to merge because of the construction needed to brake and merge safely even if he wanted to cut in there.  You don't actually get to run into the car next to you to 'force merge'.  Then the at-fault  fucker sucker-punched the guy from behind and was clearly going to shoot him, so fortunately the pickup driver was able to discourage him with the use of hastily punched holes. Fuck that goat-turd-haired thug. permalink parent award report block reply redinmn -9 points 3 days ago Nope, depending on the state, you are required to yield to those whose lane is ending. permalink parent award report block reply wilburh09 -14 points 3 days ago You must be blind.  There was like 10 car lengths between this stupid asshole and the Car in Front of him.  Instead of letting the guy merge there he cut him off and hit him.  That’s asshole behavior.  I wish they shot each other would be a good outcome. permalink parent award report block reply view 1 more comments... makersmarx 11 points 3 days ago Agree, but the nog should have slowed down and got behind him since the truck driver had the right of way. permalink parent award report block reply wilburh09 -5 points 3 days ago But the truck driver accelerated and intentionally rammed the back of the merging driver.  I don’t care about the guy who got shot because fuck him for pulling a gun in Road rage.  But the driver here is a fucking asshole.  And if he’s driving like like this then I’m not surprised he got a gun pulled on him and sooner than later he’ll probably get his cap peeled. permalink parent award report block reply view 1 more comments... IAmNotAnAutist 11 points 3 days ago Wrong.  Jogger tried to bully his way in the way, fat cop said nope wait your turn, jogger. Then jogger got got. Jogger. permalink parent award report block reply neomt 7 points 3 days ago Fun fact, he doesn't have to let him Funner fact, the fault of the accident is 100% on the merging car, because it's 100% on him to not drive into an occupied lane. permalink parent award report block reply redinmn -3 points 3 days ago Most states require drivers to do a zipper merge taking turns in construction zones.  Both were guilty of being dicks and either one could have prevented this with nothing more than letting off the gas. permalink parent award report block reply view 1 more comments...\nDeepStateParasite 21 points 3 days ago No, the guy who had to merge because of the construction needed to brake and merge safely even if he wanted to cut in there.  You don't actually get to run into the car next to you to 'force merge'.  Then the at-fault  fucker sucker-punched the guy from behind and was clearly going to shoot him, so fortunately the pickup driver was able to discourage him with the use of hastily punched holes. Fuck that goat-turd-haired thug. permalink parent award report block reply redinmn -9 points 3 days ago Nope, depending on the state, you are required to yield to those whose lane is ending. permalink parent award report block reply wilburh09 -14 points 3 days ago You must be blind.  There was like 10 car lengths between this stupid asshole and the Car in Front of him.  Instead of letting the guy merge there he cut him off and hit him.  That’s asshole behavior.  I wish they shot each other would be a good outcome. permalink parent award report block reply view 1 more comments...\nredinmn -9 points 3 days ago Nope, depending on the state, you are required to yield to those whose lane is ending. permalink parent award report block reply\nwilburh09 -14 points 3 days ago You must be blind.  There was like 10 car lengths between this stupid asshole and the Car in Front of him.  Instead of letting the guy merge there he cut him off and hit him.  That’s asshole behavior.  I wish they shot each other would be a good outcome. permalink parent award report block reply view 1 more comments...\nmakersmarx 11 points 3 days ago Agree, but the nog should have slowed down and got behind him since the truck driver had the right of way. permalink parent award report block reply wilburh09 -5 points 3 days ago But the truck driver accelerated and intentionally rammed the back of the merging driver.  I don’t care about the guy who got shot because fuck him for pulling a gun in Road rage.  But the driver here is a fucking asshole.  And if he’s driving like like this then I’m not surprised he got a gun pulled on him and sooner than later he’ll probably get his cap peeled. permalink parent award report block reply view 1 more comments...\nwilburh09 -5 points 3 days ago But the truck driver accelerated and intentionally rammed the back of the merging driver.  I don’t care about the guy who got shot because fuck him for pulling a gun in Road rage.  But the driver here is a fucking asshole.  And if he’s driving like like this then I’m not surprised he got a gun pulled on him and sooner than later he’ll probably get his cap peeled. permalink parent award report block reply view 1 more comments...\nIAmNotAnAutist 11 points 3 days ago Wrong.  Jogger tried to bully his way in the way, fat cop said nope wait your turn, jogger. Then jogger got got. Jogger. permalink parent award report block reply\nneomt 7 points 3 days ago Fun fact, he doesn't have to let him Funner fact, the fault of the accident is 100% on the merging car, because it's 100% on him to not drive into an occupied lane. permalink parent award report block reply redinmn -3 points 3 days ago Most states require drivers to do a zipper merge taking turns in construction zones.  Both were guilty of being dicks and either one could have prevented this with nothing more than letting off the gas. permalink parent award report block reply view 1 more comments...\nredinmn -3 points 3 days ago Most states require drivers to do a zipper merge taking turns in construction zones.  Both were guilty of being dicks and either one could have prevented this with nothing more than letting off the gas. permalink parent award report block reply view 1 more comments...\nLars_Lindemann 35 points 3 days ago He needs immediate CPR. That way, he can push more blood out of the holes... permalink award report block reply Simon_Jester 29 points 3 days ago HE NEEDS SOME MILK permalink parent award report block reply C0drus 8 points 3 days ago ☝️came here to say this 🤣 permalink parent award report block reply\nSimon_Jester 29 points 3 days ago HE NEEDS SOME MILK permalink parent award report block reply C0drus 8 points 3 days ago ☝️came here to say this 🤣 permalink parent award report block reply\nC0drus 8 points 3 days ago ☝️came here to say this 🤣 permalink parent award report block reply\nmonkadelic 34 points 3 days ago Luckily the Olympic hopeful doesn't know how to use his weapon.  He had the draw on the guy already.  This could have ended the other way very easily. permalink award report block reply zooty 16 points 3 days ago He was just making sure the grips were correctly horizontally aligned with the ground. permalink parent award report block reply Rock9Head 8 points 3 days ago Just like it sits in the box permalink parent award report block reply Hanrahan 14 points 3 days ago Pulls the gun, uses it for a slap, then tries to put it away, and then points it and doesn't fire. Good thing he's a total moron. permalink parent award report block reply stellamonkey 10 points 3 days ago Yup - the thug was probably stoned, like usual. permalink parent award report block reply uxername27 0 points 3 days ago Ever seen the video of the gangsta at the shooting range? He emptied his clip quickly, but missed all his shots. permalink parent award report block reply I_Love_45-70_Gov 3 points 3 days ago TBF - those Mauser C96 \"Broomhandles\" can be kinda tricky. permalink parent award report block reply\nzooty 16 points 3 days ago He was just making sure the grips were correctly horizontally aligned with the ground. permalink parent award report block reply Rock9Head 8 points 3 days ago Just like it sits in the box permalink parent award report block reply\nRock9Head 8 points 3 days ago Just like it sits in the box permalink parent award report block reply\nHanrahan 14 points 3 days ago Pulls the gun, uses it for a slap, then tries to put it away, and then points it and doesn't fire. Good thing he's a total moron. permalink parent award report block reply\nstellamonkey 10 points 3 days ago Yup - the thug was probably stoned, like usual. permalink parent award report block reply\nuxername27 0 points 3 days ago Ever seen the video of the gangsta at the shooting range? He emptied his clip quickly, but missed all his shots. permalink parent award report block reply I_Love_45-70_Gov 3 points 3 days ago TBF - those Mauser C96 \"Broomhandles\" can be kinda tricky. permalink parent award report block reply\nI_Love_45-70_Gov 3 points 3 days ago TBF - those Mauser C96 \"Broomhandles\" can be kinda tricky. permalink parent award report block reply\nMakingArrowsOrange 31 points 3 days ago A happy ending. permalink award report block reply\ndeleted 26 points 3 days ago 67Vert 12 points 3 days ago I think he hit his truck and that’s what he went to go look at permalink parent award report block reply DeepStateParasite 12 points 3 days ago He did, he decided that since he wanted to merge that it would be OK to actually run into the truck, then sucker-punch and shoot the other driver.  Happy ending in this case, hopefully he didn't end up with us paying for a jail cell. permalink parent award report block reply The_Emperor 0 points 3 days ago When I drive, I give ass holes space, and let them in.  Two dick measurements = one is a dead one. permalink parent award report block reply BoomShtick -1 points 3 days ago They are/were both dipshits in my opinion, the dindu pulled the guys card and got lit up. If your average citizen was in place of fat the cop, I think there is a chance we would be prosecuted for the incident. But since it was a off duty cop, he get a pass. permalink parent award report block reply\n67Vert 12 points 3 days ago I think he hit his truck and that’s what he went to go look at permalink parent award report block reply DeepStateParasite 12 points 3 days ago He did, he decided that since he wanted to merge that it would be OK to actually run into the truck, then sucker-punch and shoot the other driver.  Happy ending in this case, hopefully he didn't end up with us paying for a jail cell. permalink parent award report block reply The_Emperor 0 points 3 days ago When I drive, I give ass holes space, and let them in.  Two dick measurements = one is a dead one. permalink parent award report block reply\nDeepStateParasite 12 points 3 days ago He did, he decided that since he wanted to merge that it would be OK to actually run into the truck, then sucker-punch and shoot the other driver.  Happy ending in this case, hopefully he didn't end up with us paying for a jail cell. permalink parent award report block reply The_Emperor 0 points 3 days ago When I drive, I give ass holes space, and let them in.  Two dick measurements = one is a dead one. permalink parent award report block reply\nThe_Emperor 0 points 3 days ago When I drive, I give ass holes space, and let them in.  Two dick measurements = one is a dead one. permalink parent award report block reply\nBoomShtick -1 points 3 days ago They are/were both dipshits in my opinion, the dindu pulled the guys card and got lit up. If your average citizen was in place of fat the cop, I think there is a chance we would be prosecuted for the incident. But since it was a off duty cop, he get a pass. permalink parent award report block reply\nMR__K 18 points 3 days ago N is for natural selection. permalink award report block reply NeoDragoon 14 points 3 days ago I is for ignorant behavior permalink parent award report block reply Mike_Hoxbigg 15 points 3 days ago G is for get what you deserve permalink parent award report block reply DeepStateParasite 11 points 3 days ago G is for good god, think this through. permalink parent award report block reply IAmNotAnAutist 11 points 3 days ago E is for Ending justified. permalink parent award report block reply view 2 more comments... makersmarx 2 points 3 days ago G is for go back to Africa permalink parent award report block reply Geocav 2 points 3 days ago I is ignorant. permalink parent award report block reply Nomad899 -1 points 3 days ago G is for goon permalink parent award report block reply pterodactyl_balls 3 points 3 days ago Way to ruin it permalink parent award report block reply Hanging_Chad 2 points 3 days ago kek permalink parent award report block reply\nNeoDragoon 14 points 3 days ago I is for ignorant behavior permalink parent award report block reply Mike_Hoxbigg 15 points 3 days ago G is for get what you deserve permalink parent award report block reply DeepStateParasite 11 points 3 days ago G is for good god, think this through. permalink parent award report block reply IAmNotAnAutist 11 points 3 days ago E is for Ending justified. permalink parent award report block reply view 2 more comments... makersmarx 2 points 3 days ago G is for go back to Africa permalink parent award report block reply\nMike_Hoxbigg 15 points 3 days ago G is for get what you deserve permalink parent award report block reply DeepStateParasite 11 points 3 days ago G is for good god, think this through. permalink parent award report block reply IAmNotAnAutist 11 points 3 days ago E is for Ending justified. permalink parent award report block reply view 2 more comments... makersmarx 2 points 3 days ago G is for go back to Africa permalink parent award report block reply\nDeepStateParasite 11 points 3 days ago G is for good god, think this through. permalink parent award report block reply IAmNotAnAutist 11 points 3 days ago E is for Ending justified. permalink parent award report block reply view 2 more comments...\nIAmNotAnAutist 11 points 3 days ago E is for Ending justified. permalink parent award report block reply view 2 more comments...\nmakersmarx 2 points 3 days ago G is for go back to Africa permalink parent award report block reply\nGeocav 2 points 3 days ago I is ignorant. permalink parent award report block reply\nNomad899 -1 points 3 days ago G is for goon permalink parent award report block reply pterodactyl_balls 3 points 3 days ago Way to ruin it permalink parent award report block reply Hanging_Chad 2 points 3 days ago kek permalink parent award report block reply\npterodactyl_balls 3 points 3 days ago Way to ruin it permalink parent award report block reply Hanging_Chad 2 points 3 days ago kek permalink parent award report block reply\nHanging_Chad 2 points 3 days ago kek permalink parent award report block reply\nKennyKetchem 17 points 3 days ago The only mistake is never turn your back on an aggressor. permalink award report block reply\nFilo76 15 points 3 days ago I just looked up the term FAFO, and this video was the definition. permalink award report block reply makersmarx 1 points 3 days ago https://youtu.be/mH9NzJwldok?si=H6upnE3ypBXOxGBn permalink parent award report block reply\nmakersmarx 1 points 3 days ago https://youtu.be/mH9NzJwldok?si=H6upnE3ypBXOxGBn permalink parent award report block reply\nzooty 13 points 3 days ago \"Why do you need high capacity magazines?\" permalink award report block reply SirPokeSmottington 4 points 3 days ago \"Why do you need high capacity magazines?\" Lol, did you say 'time to reload' when I did also? permalink parent award report block reply zooty 1 points 3 days ago I was hoping he had one. I'm sometimes not as prepared as I should be. permalink parent award report block reply\nSirPokeSmottington 4 points 3 days ago \"Why do you need high capacity magazines?\" Lol, did you say 'time to reload' when I did also? permalink parent award report block reply zooty 1 points 3 days ago I was hoping he had one. I'm sometimes not as prepared as I should be. permalink parent award report block reply\nzooty 1 points 3 days ago I was hoping he had one. I'm sometimes not as prepared as I should be. permalink parent award report block reply\nSenaleb 12 points 3 days ago This was a few weeks ago. This kids parents even said the off duty cop was justified. (yeah I was shocked too) permalink award report block reply Get-The-Rope 4 points 3 days ago Parents, extended family, and lawyer all said \"Ya, he fucked up\" permalink parent award report block reply\nGet-The-Rope 4 points 3 days ago Parents, extended family, and lawyer all said \"Ya, he fucked up\" permalink parent award report block reply\nMakeAmericaVapeAgain 12 points 3 days ago the family tried to say he was a good boy doing no harm…until the video came out. then they shut their mouths. permalink award report block reply\n67Vert 9 points 3 days ago 90% of the time I just let them merge.  The other 10% is when I forgot to pray for patience before I drive anywhere. permalink award report block reply\nSirBuzzKillingtonVI 8 points 3 days ago Love seeing this. permalink award report block reply\nMythArcana 8 points 3 days ago They all have to go back.   🚢👪🏿 permalink award report block reply\nconservatarian 7 points 3 days ago NEVER RELAX permalink award report block reply\ncptkloss5 7 points 3 days ago yeah... when you deliberately don't slow down to avoid a collision with a reckless driver like the jogger - you must be ready for a \"confrontation\" - I'd just let the jogger in. and most likely 99% of others well, except other joggers. permalink award report block reply Nomad899 7 points 3 days ago The best fight is the one avoided…. Agree, if they are willing to force way in they probably stole it and/or have no insurance so don’t care permalink parent award report block reply\nNomad899 7 points 3 days ago The best fight is the one avoided…. Agree, if they are willing to force way in they probably stole it and/or have no insurance so don’t care permalink parent award report block reply\n2016TrumpMAGA 6 points 3 days ago Never relax. permalink award report block reply\nBillyBobBrewer 6 points 3 days ago Comment removed by a Hebrew. permalink award report block reply\n123breadman 6 points 3 days ago I enjoy seeing criminals get killed. permalink award report block reply\nKuzoKevin 5 points 3 days ago He really doesn't like that car. permalink award report block reply\nJDVance4President28 5 points 3 days ago Just remember, if that guy wasn't a cop, he'd be arrested, have his life ruined and have to defend his freedom. Police have a monopoly on self defense. Unlike regular civilians. permalink award report block reply\nLigersrule1 5 points 3 days ago I love a happy ending permalink award report block reply\nGhostOfMyFormerSelf 4 points 3 days ago Incoherent ghetto gibberish... foh. permalink award report block reply\nAngeredKabar 3 points 3 days ago N permalink award report block reply Geocav 3 points 3 days ago I permalink parent award report block reply Evansh 3 points 3 days ago G permalink parent award report block reply JuicyfearsMAGA 1 points 3 days ago G permalink parent award report block reply PearlyGaits57 1 points 3 days ago E permalink parent award report block reply view 1 more comments...\nGeocav 3 points 3 days ago I permalink parent award report block reply Evansh 3 points 3 days ago G permalink parent award report block reply JuicyfearsMAGA 1 points 3 days ago G permalink parent award report block reply PearlyGaits57 1 points 3 days ago E permalink parent award report block reply view 1 more comments...\nEvansh 3 points 3 days ago G permalink parent award report block reply JuicyfearsMAGA 1 points 3 days ago G permalink parent award report block reply PearlyGaits57 1 points 3 days ago E permalink parent award report block reply view 1 more comments...\nJuicyfearsMAGA 1 points 3 days ago G permalink parent award report block reply PearlyGaits57 1 points 3 days ago E permalink parent award report block reply view 1 more comments...\nPearlyGaits57 1 points 3 days ago E permalink parent award report block reply view 1 more comments...\nBilabrin 2 points 3 days ago Sounds ike he would have had to load a second magazine? permalink award report block reply\nOwmyballz 2 points 3 days ago He never should have turned his back on him, he is damn lucky to be alive now. permalink award report block reply\n45ichooseu 2 points 3 days ago Both dudes were in the wrong, this was completely avoidable. Both looking for confrontation. Not illegal to be rude/unaware /dumb on the road. Dude in the truck appears to have intentionally hit the car at worse, or intentionally not allow the merge. Truck havd right off way, but is pride worth the crash? Nope. I always give people space, even the jerks, because it avoids collisions and escalation. Black dude was dumb to attempt assault/murder. If truck dude is a cop, he shouldn't be. permalink award report block reply\nCanadianLad 2 points 3 days ago Where is the news article on this permalink award report block reply\nYour-personal-FBI 2 points 3 days ago Typical cop. He could have been civil and let the guy in. Instead he shoots him. permalink award report block reply\nNoMaskNoMaster 2 points 3 days ago In a perfect world, they'd toss the carcass into a ditch, and guy goes home without ever being pestered as if nothing happened. permalink award report block reply\nGuerillaYourDreams 2 points 3 days ago I would hope that I never have to but I will prepare in case. permalink award report block reply\nInduceddrag 2 points 3 days ago If I have a choice between not letting a guy in and having body work done on my vehicle, I always choose to let the guy in.  Keeps the insurance rates down. permalink award report block reply\nBoomShtick 1 points 3 days ago The fat fuck that got punched was a cop off duty. Now if that was one of us that had to shoot; chances are we would be prosecuted. permalink award report block reply\nJuicyfearsMAGA 1 points 3 days ago No zipper merging allowed permalink award report block reply\nSoldierOnFire 1 points 3 days ago Cop was wrong not letting him merge. Cop was right for killling him. permalink award report block reply Pepe_longcockings 4 points 3 days ago Why is he obligated to compensate for someine else’s poor driving choices?  If someone was about to drive off a cliff if i didnt let them in, i still wouldnt let them in.  They have the option of safely braking and merging behind me permalink parent award report block reply Justlooking250 1 points 3 days ago You also have the option of just being one car length behind so someone doesn't plummet to thier death, i'm not saying you have to let everyone in (especially if they don't signal) but thats obscenely cunty to let someone drop off a cliff instead of just let them in lol permalink parent award report block reply Pofus_Poopants 3 points 3 days ago You don't have to let anyone merge. It is not my responsibility to make sure you have a pleasant driving experience. permalink parent award report block reply IAmNotAnAutist 3 points 3 days ago Nope.  If you want to merge, signal.  If the person wants to let you in, merge in.  If not, wait your turn. permalink parent award report block reply grantking2256 2 points 3 days ago Whats wrong with what this person said? Shit was doenvoted. Is it frustrating when folks won't let you in? Sure. That doesnt mean you just go. Fucking retarded behavior. \"Let me merge with this blind fold on!\" Don't be an idiot. All of this could have been avoided if you just let go. So what you waited 1 more car length. permalink parent award report block reply\nPepe_longcockings 4 points 3 days ago Why is he obligated to compensate for someine else’s poor driving choices?  If someone was about to drive off a cliff if i didnt let them in, i still wouldnt let them in.  They have the option of safely braking and merging behind me permalink parent award report block reply Justlooking250 1 points 3 days ago You also have the option of just being one car length behind so someone doesn't plummet to thier death, i'm not saying you have to let everyone in (especially if they don't signal) but thats obscenely cunty to let someone drop off a cliff instead of just let them in lol permalink parent award report block reply\nJustlooking250 1 points 3 days ago You also have the option of just being one car length behind so someone doesn't plummet to thier death, i'm not saying you have to let everyone in (especially if they don't signal) but thats obscenely cunty to let someone drop off a cliff instead of just let them in lol permalink parent award report block reply\nPofus_Poopants 3 points 3 days ago You don't have to let anyone merge. It is not my responsibility to make sure you have a pleasant driving experience. permalink parent award report block reply\nIAmNotAnAutist 3 points 3 days ago Nope.  If you want to merge, signal.  If the person wants to let you in, merge in.  If not, wait your turn. permalink parent award report block reply grantking2256 2 points 3 days ago Whats wrong with what this person said? Shit was doenvoted. Is it frustrating when folks won't let you in? Sure. That doesnt mean you just go. Fucking retarded behavior. \"Let me merge with this blind fold on!\" Don't be an idiot. All of this could have been avoided if you just let go. So what you waited 1 more car length. permalink parent award report block reply\ngrantking2256 2 points 3 days ago Whats wrong with what this person said? Shit was doenvoted. Is it frustrating when folks won't let you in? Sure. That doesnt mean you just go. Fucking retarded behavior. \"Let me merge with this blind fold on!\" Don't be an idiot. All of this could have been avoided if you just let go. So what you waited 1 more car length. permalink parent award report block reply\nJustlooking250 1 points 3 days ago FAFO Moron 🤤 Darwin Award 🏅 permalink award report block reply\nTheLesserBambino 1 points 3 days ago The thing about this is that in the beginning (at least in my state) in a merging situation like this, the person if front has right of way to come over. The truck would be expected to make room as long as it wasn't dangerous to do so. So if asshat had kept his head and not pistol whipped an off duty cop over some bullshit, he probably would have gotten a nice payout. permalink award report block reply\nMudDog 1 points 3 days ago N permalink award report block reply\nTrump454748 1 points 3 days ago New York Times headline: “Innocent person of color ambushed by white supremacist” permalink award report block reply\nGildoom 1 points 3 days ago Dindu! permalink award report block reply\ncryptoapebot 0 points 3 days ago Yeah, I prob would have gotten out and apologized for cuttign him off and point out that maybe he didn't see the road construction up ahead.  In California, that collision is the guy's fault behind.  Dude pulling a gun over a fender bender is insane. permalink award report block reply JDVance4President28 1 points 3 days ago It wouldn't have been his fault simply because he was a cop. permalink parent award report block reply cryptoapebot 1 points 21 hours ago I guess I didn't see the context.  If he was a cop and didn't want him to merge, he should have put his lights on.   Either way, driver pulling a gun over a stupid fender bender is a stupid fucking move.   What a freakin idiot. permalink parent award report block reply\nJDVance4President28 1 points 3 days ago It wouldn't have been his fault simply because he was a cop. permalink parent award report block reply cryptoapebot 1 points 21 hours ago I guess I didn't see the context.  If he was a cop and didn't want him to merge, he should have put his lights on.   Either way, driver pulling a gun over a stupid fender bender is a stupid fucking move.   What a freakin idiot. permalink parent award report block reply\ncryptoapebot 1 points 21 hours ago I guess I didn't see the context.  If he was a cop and didn't want him to merge, he should have put his lights on.   Either way, driver pulling a gun over a stupid fender bender is a stupid fucking move.   What a freakin idiot. permalink parent award report block reply\nYour-personal-FBI 0 points 3 days ago Stay on the ground! Walk this way! Stay on the ground! This cop is a psychopath. permalink award report block reply\nredinmn -1 points 3 days ago Either could have let up on the gas for a moment and none of this would have happened.  Both are assholes. permalink award report block reply LadyGrahamsminge 4 points 3 days ago No, spooks are in the habit of driving like they own the fucking road, and love nothing more than to play chicken with white drivers. Tyrone lost this game of chicken. That is a good thing. Imagine that is your wife, daughter, or other loved one instead of a cop. Quantrell could have merged way back when the signs told him to ( if he were able to read) or he could have waited. The other driver did nothing wrong or illegal, and did the world a service by taking that piece of shit off of the road for good. permalink parent award report block reply\nLadyGrahamsminge 4 points 3 days ago No, spooks are in the habit of driving like they own the fucking road, and love nothing more than to play chicken with white drivers. Tyrone lost this game of chicken. That is a good thing. Imagine that is your wife, daughter, or other loved one instead of a cop. Quantrell could have merged way back when the signs told him to ( if he were able to read) or he could have waited. The other driver did nothing wrong or illegal, and did the world a service by taking that piece of shit off of the road for good. permalink parent award report block reply\nlixa -3 points 3 days ago Why the hell is this pinned permalink award report block reply seattlerunner 1 points 3 days ago Mods have been stickying garbage all day permalink parent award report block reply lixa 2 points 3 days ago Years now permalink parent award report block reply seattlerunner 3 points 3 days ago I think I’m gonna apply for mod. I’ve been in here since the very beginning, thedonald days. permalink parent award report block reply lixa 1 points 3 days ago Go for it! permalink parent award report block reply\nseattlerunner 1 points 3 days ago Mods have been stickying garbage all day permalink parent award report block reply lixa 2 points 3 days ago Years now permalink parent award report block reply seattlerunner 3 points 3 days ago I think I’m gonna apply for mod. I’ve been in here since the very beginning, thedonald days. permalink parent award report block reply lixa 1 points 3 days ago Go for it! permalink parent award report block reply\nlixa 2 points 3 days ago Years now permalink parent award report block reply seattlerunner 3 points 3 days ago I think I’m gonna apply for mod. I’ve been in here since the very beginning, thedonald days. permalink parent award report block reply\nseattlerunner 3 points 3 days ago I think I’m gonna apply for mod. I’ve been in here since the very beginning, thedonald days. permalink parent award report block reply\nlixa 1 points 3 days ago Go for it! permalink parent award report block reply\nMoose_Antlers -3 points 3 days ago White guy's an a-hole. Dude sees the right lane has a work crew in it, and sees the cones to merge. He sees the black guy trying to merge in and never gives space to let the guy in. He literally tries to run the black guy into the work crew. Black guys tries to make space and gently nose in. White guy still won't accommodate. When there's no space left, he finally pulls in and white guy is so freaking close because he's being a prick that they play bumper cars. I have no problem with pulling over and having words at that point. Black guy then chimps out, whips out a weapon, and makes his bad day into his last day by playing FAFO games. Neither man is the \"good guy\" in this. The white guy provoked the fight by driving like a total as..hat. The black guy is a murdering sonofa..tch who got exactly what he deserved for producing that pistol. At least one of these idiots was removed from society. permalink award report block reply IAmNotAnAutist 6 points 3 days ago Nope.  Jogger didn't even signal.  Fuck him. permalink parent award report block reply neomt 4 points 3 days ago Not his fucking problem.  It's on the merging car to change lanes safely. See #1 about it not being his fucking problem. See 1 and 2.  The black guy should be apologizing for going into an occupied lane, making contact. Hey, 1 out of 4 ain't bad in today's education system. permalink parent award report block reply JBlaze056 4 points 3 days ago 2 fat fucks both acting like assholes and they both have guns.   Be careful out there in our atomized and balkanized society. permalink parent award report block reply\nIAmNotAnAutist 6 points 3 days ago Nope.  Jogger didn't even signal.  Fuck him. permalink parent award report block reply\nneomt 4 points 3 days ago Not his fucking problem.  It's on the merging car to change lanes safely. See #1 about it not being his fucking problem. See 1 and 2.  The black guy should be apologizing for going into an occupied lane, making contact. Hey, 1 out of 4 ain't bad in today's education system. permalink parent award report block reply\nJBlaze056 4 points 3 days ago 2 fat fucks both acting like assholes and they both have guns.   Be careful out there in our atomized and balkanized society. permalink parent award report block reply\nHanging_Chad -8 points 3 days ago why didn’t the victim let the perp merge? permalink award report block reply monkadelic 23 points 3 days ago If experience is any indicator, his lane was backup up, Bob Marley passed everyone and then tried to force his way in the front.  Otherwise, yeah, just let them merge and bitch about it. permalink parent award report block reply DrJosephWarren 6 points 3 days ago If he was planning on using it, Marley should have emerged from the car with his gun drawn. Fumbling around in your picket for your piece is lacking. permalink parent award report block reply MAGA_NRG 22 points 3 days ago Don't have to by law. Why didn't the guy just slow down and get in behind him. permalink parent award report block reply zooty 8 points 3 days ago There was plenty of room to merge in at first. Looks like a skill issue. Regardless, it's the responsibility of the merger to merge safely. permalink parent award report block reply Hanging_Chad 4 points 3 days ago looks like he went for it but then the front car braked so he had to brake. either way, he was likely high on weed permalink parent award report block reply MAGA_mantis 5 points 3 days ago Why didn't the victim learn how to not take cuts ? permalink parent award report block reply IAmNotAnAutist 2 points 3 days ago Because fuck you, that's why. permalink parent award report block reply\nmonkadelic 23 points 3 days ago If experience is any indicator, his lane was backup up, Bob Marley passed everyone and then tried to force his way in the front.  Otherwise, yeah, just let them merge and bitch about it. permalink parent award report block reply DrJosephWarren 6 points 3 days ago If he was planning on using it, Marley should have emerged from the car with his gun drawn. Fumbling around in your picket for your piece is lacking. permalink parent award report block reply\nDrJosephWarren 6 points 3 days ago If he was planning on using it, Marley should have emerged from the car with his gun drawn. Fumbling around in your picket for your piece is lacking. permalink parent award report block reply\nMAGA_NRG 22 points 3 days ago Don't have to by law. Why didn't the guy just slow down and get in behind him. permalink parent award report block reply\nzooty 8 points 3 days ago There was plenty of room to merge in at first. Looks like a skill issue. Regardless, it's the responsibility of the merger to merge safely. permalink parent award report block reply Hanging_Chad 4 points 3 days ago looks like he went for it but then the front car braked so he had to brake. either way, he was likely high on weed permalink parent award report block reply\nHanging_Chad 4 points 3 days ago looks like he went for it but then the front car braked so he had to brake. either way, he was likely high on weed permalink parent award report block reply\nMAGA_mantis 5 points 3 days ago Why didn't the victim learn how to not take cuts ? permalink parent award report block reply\nIAmNotAnAutist 2 points 3 days ago Because fuck you, that's why. permalink parent award report block reply\nM1kes_Cock 5 points 3 days ago Comment removed by community moderators. permalink award report block reply\nRuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply view 4 more comments... Cowpill 2 points 3 days ago Comment removed by community filter. permalink parent award report block reply\nRuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply view 4 more comments...\nRuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply view 4 more comments...\nRuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply RuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply view 4 more comments...\nRuleoVicus 4 points 3 days ago Comment removed by community moderators. permalink parent award report block reply view 4 more comments...\nCowpill 2 points 3 days ago Comment removed by community filter. permalink parent award report block reply\nentwickelnden 1 points 3 days ago Comment removed by community filter. permalink award report block reply\nmoscowjade 1 points 3 days ago Comment removed by community moderators. permalink award report block reply\nJimRaynor 1 points 3 days ago Comment removed by community filter. permalink award report block reply",
  "fetched_at": "2025-11-12T22:58:35.085922Z"
}