{
  "id": "1ARK57tKPx",
  "url": "https://patriots.win/p/1ARK57tKPx/buh-bye-bitch/c",
  "content": "1220 Buh bye bitch posted 4 days ago by wst4 74 comments award share download report block\n74 comments Sort by Top Top New Worst Old Save MakeAmericaGreat9 72 points 4 days ago Homan and Trump do not have the balls to do this. She'll be sworn in. Edit: she's an anchor baby trying to bait trump into arresting her. permalink award report block reply Comanche_Moon 46 points 4 days ago If they don't do it, then what good is having laws if invaders can do whatever they want? permalink parent award report block reply BlackPilledMAGA 13 points 4 days ago What good are laws when we not only allow people to break them but we allow the ones committing the crimes to hold office and give them power? But is this bitch really illegal or was she just saying that as rage bait? permalink parent award report block reply SimaYi 7 points 4 days ago Apparently, we're only getting rid of the illegals who don't have connections. Such corruption. permalink parent award report block reply Shitsbrokeyo 3 points 4 days ago We cannot allow that kind of messaging. Everyone has seen her flaunting it. She needs to go this week. permalink parent award report block reply groomofthestool 1 points 4 days ago This here. permalink parent award report block reply hansgruber7 21 points 4 days ago She is baiting them.  She is an anchor baby with citizenship claiming to be illegal to bait them to arrest her so she can sue and win and make a scene. permalink parent award report block reply MegoThor 6 points 4 days ago Revoke her citizenship and deport her. permalink parent award report block reply AlmostFullyDilated 5 points 4 days ago we need to do away with this anchor baby nonsense. just because your massive ass vagina dumps out a food stamp monster on American soil shouldn't make you American by default permalink parent award report block reply hansgruber7 1 points 3 days ago That's what Trump is trying to do. permalink parent award report block reply Albo22 10 points 4 days ago That's because she is not an illegal she lied permalink parent award report block reply yodayoda 2 points 4 days ago 100% this permalink parent award report block reply Dem_slayer 2 points 3 days ago We need to strip all anchors babies of citizenship permalink parent award report block reply load 14 more comments... jdemarco2014 29 points 4 days ago She actually not an illegal permalink award report block reply Shakakka99 35 points 4 days ago Exactly.  Her parents were illegal, making her an anchor baby, she said it for shock value. This post should be no stickier than Hillary’s dried up cooze. permalink parent award report block reply monkadelic 19 points 4 days ago Thanks, I was debating eating lunch.  Im good for a bit now. permalink parent award report block reply bill_in_texas 14 points 4 days ago Deport the parents. permalink parent award report block reply Reefay 3 points 4 days ago The kid can go with them permalink parent award report block reply Standingoak 5 points 4 days ago Who says and incorrect/illegal application of a law can't be reversed ? permalink parent award report block reply EvJohn 2 points 4 days ago Wow.  The imagery.  Both poetic and nauseating. permalink parent award report block reply Rob_Belmonte 2 points 4 days ago Like peeling open a week old grilled cheese.... permalink parent award report block reply load 1 more comments... SimaYi 2 points 4 days ago And yet you have some foreigner standing up saying she's \"illegal\", which means she's \"not American.\" These people will one day need to be driven out of our land at gunpoint, if we would even have the will for it. permalink parent award report block reply corporateshizer -1 points 4 days ago Should deport the parents and confiscate their property if they're still here. We know ICE wouldn't though. The uniparty is not serious about deportations. permalink parent award report block reply RedStoneDeepState 3 points 4 days ago What reason is there to confiscate property? permalink parent award report block reply Nomad899 1 points 4 days ago To give to a homeless veteran permalink parent award report block reply RedStoneDeepState -4 points 4 days ago Fuck no, the homeless should be shot permalink parent award report block reply monkadelic 14 points 4 days ago She's a stupid bitch who lied about being illegal. She's an anchor baby.  Like all politicians, its theater. permalink award report block reply mohel 2 points 4 days ago She will represent American values very well permalink parent award report block reply 3stepsahead 5 points 4 days ago Stickied with zero comments? permalink award report block reply -f-b-i- 17 points 4 days ago Should I wait for comments before I sticky? permalink parent award report block reply HunterBidensPC 15 points 4 days ago You can do whatever you want you’re the FBI permalink parent award report block reply Lady_MaGa 1 points 4 days ago I'm glad you stickied this.  It brings up another example of how the left lies to brainwash their supporters and to bait people to act before looking in to things.  Sometimes everyone needs that reminder for the days that are coming when even worse lying is going to happen because they all try to outdo themselves to the point of beyond crazy. permalink parent award report block reply 3stepsahead 1 points 4 days ago You should wait to see if people give a shit about it, yes!  What, you decide what's stickied, not the reaction or upvote of it? permalink parent award report block reply -f-b-i- 1 points 3 days ago Nah permalink parent award report block reply Bogey 3 points 4 days ago Is she getting deported or is this just wishing? permalink award report block reply Deplora 8 points 4 days ago She's not illegal.  She was lying.  Seriously. permalink parent award report block reply UCantStumpTheTrump 2 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. he's a reddit liberal permalink parent award report block reply maverick202 0 points 4 days ago She's not. It's just a low effort meme. permalink parent award report block reply UCantStumpTheTrump 2 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. he's a reddit liberal permalink parent award report block reply patrioticwinning3 2 points 4 days ago Tom Homan is all talk, prove me wrong... permalink award report block reply Nomad899 2 points 4 days ago If only she wasn’t an anchor bitch born here … her parents should be dug up and yeeted out to sea permalink award report block reply yodayoda 1 points 4 days ago ain't gonna happen permalink award report block reply JanOctSept 1 points 4 days ago Well I mean there she is, right? Do I really need to drop ICE a tip here? permalink award report block reply Choppermagic 1 points 4 days ago Homan hasn't arrested a single democrat in office.  Too weak permalink award report block reply corporateshizer 1 points 4 days ago Homan is a bureaucrat who became a pseudo-politician because he's in front of the cameras so often. He talks tough and makes good sound bites, but he's not doing anything special in terms of numbers. We need to deport about 10 million a year, minimum, and he's bragging about 500,000 - 1,000,000 per year and 1,000,000 supposed \"self-deportations\" that we have to trust them on. Same as it ever was for the bureaucrats. permalink award report block reply MocksFordComma 1 points 4 days ago If it’s not a crime to run for office as an illegal, it needs to be permalink award report block reply AwShitHereWeGoAgain 1 points 4 days ago Hang her! permalink award report block reply C0drus 1 points 4 days ago Reverse uno bait and switch …deport her parents 🤣 permalink award report block reply Cuttinmuffins 1 points 4 days ago Does anyone wonder why folks like this, like Illhan, like the new mayor of one of our most important cities, are left to continue the erosion of the USA? They remain not only untouched, but completely unafraid of any consequence or action. Almost like they know the script. Almost like they are being funded, backed by endless and expensive propaganda, and protected from any backlash their actions, statements, and votes should elicit. Why? permalink award report block reply BitterRoots 1 points 4 days ago Homan is a blowhard. He's done nothing short of TV appearances where he continues the cycle of empty promises permalink award report block reply UCantStumpTheTrump 2 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. he's a reddit liberal permalink parent award report block reply maverick202 1 points 4 days ago Yep. I don't know how anyone takes him seriously. I watched him talking a few months ago on fox and immediately knew he's a do nothing blowhard. permalink parent award report block reply UCantStumpTheTrump 2 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. he's a reddit liberal permalink parent award report block reply keeman 1 points 4 days ago Yes. permalink award report block reply DiamondDroid 1 points 4 days ago DO IT! F anchor babies. It's a misrepresentation of the law and should apply to the kids of free loaders and invaders. permalink award report block reply Smurfection 1 points 4 days ago Arrest and deport her.  Why is our government ignoring illegal aliens that get elected to office?  Do our laws mean anything?!?!?!!? permalink award report block reply 67Vert 1 points 4 days ago She’s a liar. Neither her or parents are illegal permalink award report block reply SimaYi 1 points 4 days ago If she stays in our country after being so blatant, this is all a joke. permalink award report block reply orange_kek_great 0 points 4 days ago The faggots in charge will not stop this. We are being led by clowns. permalink award report block reply MAGAMight 2 points 4 days ago Tom Homan is a hero. permalink parent award report block reply\nMakeAmericaGreat9 72 points 4 days ago Homan and Trump do not have the balls to do this. She'll be sworn in. Edit: she's an anchor baby trying to bait trump into arresting her. permalink award report block reply Comanche_Moon 46 points 4 days ago If they don't do it, then what good is having laws if invaders can do whatever they want? permalink parent award report block reply BlackPilledMAGA 13 points 4 days ago What good are laws when we not only allow people to break them but we allow the ones committing the crimes to hold office and give them power? But is this bitch really illegal or was she just saying that as rage bait? permalink parent award report block reply SimaYi 7 points 4 days ago Apparently, we're only getting rid of the illegals who don't have connections. Such corruption. permalink parent award report block reply Shitsbrokeyo 3 points 4 days ago We cannot allow that kind of messaging. Everyone has seen her flaunting it. She needs to go this week. permalink parent award report block reply groomofthestool 1 points 4 days ago This here. permalink parent award report block reply hansgruber7 21 points 4 days ago She is baiting them.  She is an anchor baby with citizenship claiming to be illegal to bait them to arrest her so she can sue and win and make a scene. permalink parent award report block reply MegoThor 6 points 4 days ago Revoke her citizenship and deport her. permalink parent award report block reply AlmostFullyDilated 5 points 4 days ago we need to do away with this anchor baby nonsense. just because your massive ass vagina dumps out a food stamp monster on American soil shouldn't make you American by default permalink parent award report block reply hansgruber7 1 points 3 days ago That's what Trump is trying to do. permalink parent award report block reply Albo22 10 points 4 days ago That's because she is not an illegal she lied permalink parent award report block reply yodayoda 2 points 4 days ago 100% this permalink parent award report block reply Dem_slayer 2 points 3 days ago We need to strip all anchors babies of citizenship permalink parent award report block reply load 14 more comments...\nComanche_Moon 46 points 4 days ago If they don't do it, then what good is having laws if invaders can do whatever they want? permalink parent award report block reply BlackPilledMAGA 13 points 4 days ago What good are laws when we not only allow people to break them but we allow the ones committing the crimes to hold office and give them power? But is this bitch really illegal or was she just saying that as rage bait? permalink parent award report block reply SimaYi 7 points 4 days ago Apparently, we're only getting rid of the illegals who don't have connections. Such corruption. permalink parent award report block reply Shitsbrokeyo 3 points 4 days ago We cannot allow that kind of messaging. Everyone has seen her flaunting it. She needs to go this week. permalink parent award report block reply groomofthestool 1 points 4 days ago This here. permalink parent award report block reply\nBlackPilledMAGA 13 points 4 days ago What good are laws when we not only allow people to break them but we allow the ones committing the crimes to hold office and give them power? But is this bitch really illegal or was she just saying that as rage bait? permalink parent award report block reply\nSimaYi 7 points 4 days ago Apparently, we're only getting rid of the illegals who don't have connections. Such corruption. permalink parent award report block reply Shitsbrokeyo 3 points 4 days ago We cannot allow that kind of messaging. Everyone has seen her flaunting it. She needs to go this week. permalink parent award report block reply\nShitsbrokeyo 3 points 4 days ago We cannot allow that kind of messaging. Everyone has seen her flaunting it. She needs to go this week. permalink parent award report block reply\ngroomofthestool 1 points 4 days ago This here. permalink parent award report block reply\nhansgruber7 21 points 4 days ago She is baiting them.  She is an anchor baby with citizenship claiming to be illegal to bait them to arrest her so she can sue and win and make a scene. permalink parent award report block reply MegoThor 6 points 4 days ago Revoke her citizenship and deport her. permalink parent award report block reply AlmostFullyDilated 5 points 4 days ago we need to do away with this anchor baby nonsense. just because your massive ass vagina dumps out a food stamp monster on American soil shouldn't make you American by default permalink parent award report block reply hansgruber7 1 points 3 days ago That's what Trump is trying to do. permalink parent award report block reply\nMegoThor 6 points 4 days ago Revoke her citizenship and deport her. permalink parent award report block reply\nAlmostFullyDilated 5 points 4 days ago we need to do away with this anchor baby nonsense. just because your massive ass vagina dumps out a food stamp monster on American soil shouldn't make you American by default permalink parent award report block reply hansgruber7 1 points 3 days ago That's what Trump is trying to do. permalink parent award report block reply\nhansgruber7 1 points 3 days ago That's what Trump is trying to do. permalink parent award report block reply\nAlbo22 10 points 4 days ago That's because she is not an illegal she lied permalink parent award report block reply\nyodayoda 2 points 4 days ago 100% this permalink parent award report block reply\nDem_slayer 2 points 3 days ago We need to strip all anchors babies of citizenship permalink parent award report block reply\njdemarco2014 29 points 4 days ago She actually not an illegal permalink award report block reply Shakakka99 35 points 4 days ago Exactly.  Her parents were illegal, making her an anchor baby, she said it for shock value. This post should be no stickier than Hillary’s dried up cooze. permalink parent award report block reply monkadelic 19 points 4 days ago Thanks, I was debating eating lunch.  Im good for a bit now. permalink parent award report block reply bill_in_texas 14 points 4 days ago Deport the parents. permalink parent award report block reply Reefay 3 points 4 days ago The kid can go with them permalink parent award report block reply Standingoak 5 points 4 days ago Who says and incorrect/illegal application of a law can't be reversed ? permalink parent award report block reply EvJohn 2 points 4 days ago Wow.  The imagery.  Both poetic and nauseating. permalink parent award report block reply Rob_Belmonte 2 points 4 days ago Like peeling open a week old grilled cheese.... permalink parent award report block reply load 1 more comments... SimaYi 2 points 4 days ago And yet you have some foreigner standing up saying she's \"illegal\", which means she's \"not American.\" These people will one day need to be driven out of our land at gunpoint, if we would even have the will for it. permalink parent award report block reply corporateshizer -1 points 4 days ago Should deport the parents and confiscate their property if they're still here. We know ICE wouldn't though. The uniparty is not serious about deportations. permalink parent award report block reply RedStoneDeepState 3 points 4 days ago What reason is there to confiscate property? permalink parent award report block reply Nomad899 1 points 4 days ago To give to a homeless veteran permalink parent award report block reply RedStoneDeepState -4 points 4 days ago Fuck no, the homeless should be shot permalink parent award report block reply\nShakakka99 35 points 4 days ago Exactly.  Her parents were illegal, making her an anchor baby, she said it for shock value. This post should be no stickier than Hillary’s dried up cooze. permalink parent award report block reply monkadelic 19 points 4 days ago Thanks, I was debating eating lunch.  Im good for a bit now. permalink parent award report block reply bill_in_texas 14 points 4 days ago Deport the parents. permalink parent award report block reply Reefay 3 points 4 days ago The kid can go with them permalink parent award report block reply Standingoak 5 points 4 days ago Who says and incorrect/illegal application of a law can't be reversed ? permalink parent award report block reply EvJohn 2 points 4 days ago Wow.  The imagery.  Both poetic and nauseating. permalink parent award report block reply Rob_Belmonte 2 points 4 days ago Like peeling open a week old grilled cheese.... permalink parent award report block reply load 1 more comments...\nmonkadelic 19 points 4 days ago Thanks, I was debating eating lunch.  Im good for a bit now. permalink parent award report block reply\nbill_in_texas 14 points 4 days ago Deport the parents. permalink parent award report block reply Reefay 3 points 4 days ago The kid can go with them permalink parent award report block reply\nReefay 3 points 4 days ago The kid can go with them permalink parent award report block reply\nStandingoak 5 points 4 days ago Who says and incorrect/illegal application of a law can't be reversed ? permalink parent award report block reply\nEvJohn 2 points 4 days ago Wow.  The imagery.  Both poetic and nauseating. permalink parent award report block reply\nRob_Belmonte 2 points 4 days ago Like peeling open a week old grilled cheese.... permalink parent award report block reply\nSimaYi 2 points 4 days ago And yet you have some foreigner standing up saying she's \"illegal\", which means she's \"not American.\" These people will one day need to be driven out of our land at gunpoint, if we would even have the will for it. permalink parent award report block reply\ncorporateshizer -1 points 4 days ago Should deport the parents and confiscate their property if they're still here. We know ICE wouldn't though. The uniparty is not serious about deportations. permalink parent award report block reply RedStoneDeepState 3 points 4 days ago What reason is there to confiscate property? permalink parent award report block reply Nomad899 1 points 4 days ago To give to a homeless veteran permalink parent award report block reply RedStoneDeepState -4 points 4 days ago Fuck no, the homeless should be shot permalink parent award report block reply\nRedStoneDeepState 3 points 4 days ago What reason is there to confiscate property? permalink parent award report block reply Nomad899 1 points 4 days ago To give to a homeless veteran permalink parent award report block reply RedStoneDeepState -4 points 4 days ago Fuck no, the homeless should be shot permalink parent award report block reply\nNomad899 1 points 4 days ago To give to a homeless veteran permalink parent award report block reply RedStoneDeepState -4 points 4 days ago Fuck no, the homeless should be shot permalink parent award report block reply\nRedStoneDeepState -4 points 4 days ago Fuck no, the homeless should be shot permalink parent award report block reply\nmonkadelic 14 points 4 days ago She's a stupid bitch who lied about being illegal. She's an anchor baby.  Like all politicians, its theater. permalink award report block reply mohel 2 points 4 days ago She will represent American values very well permalink parent award report block reply\nmohel 2 points 4 days ago She will represent American values very well permalink parent award report block reply\n3stepsahead 5 points 4 days ago Stickied with zero comments? permalink award report block reply -f-b-i- 17 points 4 days ago Should I wait for comments before I sticky? permalink parent award report block reply HunterBidensPC 15 points 4 days ago You can do whatever you want you’re the FBI permalink parent award report block reply Lady_MaGa 1 points 4 days ago I'm glad you stickied this.  It brings up another example of how the left lies to brainwash their supporters and to bait people to act before looking in to things.  Sometimes everyone needs that reminder for the days that are coming when even worse lying is going to happen because they all try to outdo themselves to the point of beyond crazy. permalink parent award report block reply 3stepsahead 1 points 4 days ago You should wait to see if people give a shit about it, yes!  What, you decide what's stickied, not the reaction or upvote of it? permalink parent award report block reply -f-b-i- 1 points 3 days ago Nah permalink parent award report block reply\n-f-b-i- 17 points 4 days ago Should I wait for comments before I sticky? permalink parent award report block reply HunterBidensPC 15 points 4 days ago You can do whatever you want you’re the FBI permalink parent award report block reply Lady_MaGa 1 points 4 days ago I'm glad you stickied this.  It brings up another example of how the left lies to brainwash their supporters and to bait people to act before looking in to things.  Sometimes everyone needs that reminder for the days that are coming when even worse lying is going to happen because they all try to outdo themselves to the point of beyond crazy. permalink parent award report block reply 3stepsahead 1 points 4 days ago You should wait to see if people give a shit about it, yes!  What, you decide what's stickied, not the reaction or upvote of it? permalink parent award report block reply -f-b-i- 1 points 3 days ago Nah permalink parent award report block reply\nHunterBidensPC 15 points 4 days ago You can do whatever you want you’re the FBI permalink parent award report block reply\nLady_MaGa 1 points 4 days ago I'm glad you stickied this.  It brings up another example of how the left lies to brainwash their supporters and to bait people to act before looking in to things.  Sometimes everyone needs that reminder for the days that are coming when even worse lying is going to happen because they all try to outdo themselves to the point of beyond crazy. permalink parent award report block reply\n3stepsahead 1 points 4 days ago You should wait to see if people give a shit about it, yes!  What, you decide what's stickied, not the reaction or upvote of it? permalink parent award report block reply -f-b-i- 1 points 3 days ago Nah permalink parent award report block reply\n-f-b-i- 1 points 3 days ago Nah permalink parent award report block reply\nBogey 3 points 4 days ago Is she getting deported or is this just wishing? permalink award report block reply Deplora 8 points 4 days ago She's not illegal.  She was lying.  Seriously. permalink parent award report block reply UCantStumpTheTrump 2 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. he's a reddit liberal permalink parent award report block reply maverick202 0 points 4 days ago She's not. It's just a low effort meme. permalink parent award report block reply UCantStumpTheTrump 2 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. he's a reddit liberal permalink parent award report block reply\nDeplora 8 points 4 days ago She's not illegal.  She was lying.  Seriously. permalink parent award report block reply\nUCantStumpTheTrump 2 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. he's a reddit liberal permalink parent award report block reply\nmaverick202 0 points 4 days ago She's not. It's just a low effort meme. permalink parent award report block reply UCantStumpTheTrump 2 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. he's a reddit liberal permalink parent award report block reply\nUCantStumpTheTrump 2 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. he's a reddit liberal permalink parent award report block reply\npatrioticwinning3 2 points 4 days ago Tom Homan is all talk, prove me wrong... permalink award report block reply\nNomad899 2 points 4 days ago If only she wasn’t an anchor bitch born here … her parents should be dug up and yeeted out to sea permalink award report block reply\nyodayoda 1 points 4 days ago ain't gonna happen permalink award report block reply\nJanOctSept 1 points 4 days ago Well I mean there she is, right? Do I really need to drop ICE a tip here? permalink award report block reply\nChoppermagic 1 points 4 days ago Homan hasn't arrested a single democrat in office.  Too weak permalink award report block reply\ncorporateshizer 1 points 4 days ago Homan is a bureaucrat who became a pseudo-politician because he's in front of the cameras so often. He talks tough and makes good sound bites, but he's not doing anything special in terms of numbers. We need to deport about 10 million a year, minimum, and he's bragging about 500,000 - 1,000,000 per year and 1,000,000 supposed \"self-deportations\" that we have to trust them on. Same as it ever was for the bureaucrats. permalink award report block reply\nMocksFordComma 1 points 4 days ago If it’s not a crime to run for office as an illegal, it needs to be permalink award report block reply\nAwShitHereWeGoAgain 1 points 4 days ago Hang her! permalink award report block reply\nC0drus 1 points 4 days ago Reverse uno bait and switch …deport her parents 🤣 permalink award report block reply\nCuttinmuffins 1 points 4 days ago Does anyone wonder why folks like this, like Illhan, like the new mayor of one of our most important cities, are left to continue the erosion of the USA? They remain not only untouched, but completely unafraid of any consequence or action. Almost like they know the script. Almost like they are being funded, backed by endless and expensive propaganda, and protected from any backlash their actions, statements, and votes should elicit. Why? permalink award report block reply\nBitterRoots 1 points 4 days ago Homan is a blowhard. He's done nothing short of TV appearances where he continues the cycle of empty promises permalink award report block reply UCantStumpTheTrump 2 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. he's a reddit liberal permalink parent award report block reply maverick202 1 points 4 days ago Yep. I don't know how anyone takes him seriously. I watched him talking a few months ago on fox and immediately knew he's a do nothing blowhard. permalink parent award report block reply UCantStumpTheTrump 2 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. he's a reddit liberal permalink parent award report block reply\nUCantStumpTheTrump 2 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. he's a reddit liberal permalink parent award report block reply\nmaverick202 1 points 4 days ago Yep. I don't know how anyone takes him seriously. I watched him talking a few months ago on fox and immediately knew he's a do nothing blowhard. permalink parent award report block reply UCantStumpTheTrump 2 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. he's a reddit liberal permalink parent award report block reply\nUCantStumpTheTrump 2 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. he's a reddit liberal permalink parent award report block reply\nkeeman 1 points 4 days ago Yes. permalink award report block reply\nDiamondDroid 1 points 4 days ago DO IT! F anchor babies. It's a misrepresentation of the law and should apply to the kids of free loaders and invaders. permalink award report block reply\nSmurfection 1 points 4 days ago Arrest and deport her.  Why is our government ignoring illegal aliens that get elected to office?  Do our laws mean anything?!?!?!!? permalink award report block reply\n67Vert 1 points 4 days ago She’s a liar. Neither her or parents are illegal permalink award report block reply\nSimaYi 1 points 4 days ago If she stays in our country after being so blatant, this is all a joke. permalink award report block reply\norange_kek_great 0 points 4 days ago The faggots in charge will not stop this. We are being led by clowns. permalink award report block reply MAGAMight 2 points 4 days ago Tom Homan is a hero. permalink parent award report block reply\nMAGAMight 2 points 4 days ago Tom Homan is a hero. permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:45:22.249310Z"
}