{
  "id": "1ARK9hiHDS",
  "url": "https://patriots.win/p/1ARK9hiHDS/sorry-you-can-never-go-back/c",
  "content": "492 Sorry, you can never go back... posted 2 days ago by SBOJ_JOBS 12 comments award share download report block\n12 comments Sort by Top Top New Worst Old Save Counterwhat 8 points 2 days ago You vote for socialism but you shoot your way out of communism. permalink award report block reply SBOJ_JOBS OP 6 points 2 days ago I believe one is simply a euphemism for the other. permalink parent award report block reply Oldman1234 5 points 2 days ago The old saying \"You can vote your way into communism but you have to shoot your way out of it!\" permalink award report block reply Easzq8 5 points 2 days ago “You’re going to Greece.” You mean to do a movie? “No.” permalink award report block reply LiteraIIyHitIer 2 points 2 days ago Pedo is as pedo does. permalink parent award report block reply Granny 2 points 2 days ago Stupid Kuffars. permalink award report block reply Formerlurker92 2 points 2 days ago Just like communism, you're gonna have to shoot your way out permalink award report block reply DudeNoOne 2 points 2 days ago Oh, come on. you couldn’t have AI change the marquee to “Zohran Speaks”? permalink award report block reply SBOJ_JOBS OP 1 points 2 days ago Didn't use AI permalink parent award report block reply DudeNoOne 1 points 2 days ago Why not. permalink parent award report block reply SBOJ_JOBS OP 1 points 2 days ago personal preference permalink parent award report block reply DudeNoOne 1 points 2 days ago OK, it just would’ve been the cherry on top permalink parent award report block reply\nCounterwhat 8 points 2 days ago You vote for socialism but you shoot your way out of communism. permalink award report block reply SBOJ_JOBS OP 6 points 2 days ago I believe one is simply a euphemism for the other. permalink parent award report block reply\nSBOJ_JOBS OP 6 points 2 days ago I believe one is simply a euphemism for the other. permalink parent award report block reply\nOldman1234 5 points 2 days ago The old saying \"You can vote your way into communism but you have to shoot your way out of it!\" permalink award report block reply\nEaszq8 5 points 2 days ago “You’re going to Greece.” You mean to do a movie? “No.” permalink award report block reply LiteraIIyHitIer 2 points 2 days ago Pedo is as pedo does. permalink parent award report block reply\nLiteraIIyHitIer 2 points 2 days ago Pedo is as pedo does. permalink parent award report block reply\nGranny 2 points 2 days ago Stupid Kuffars. permalink award report block reply\nFormerlurker92 2 points 2 days ago Just like communism, you're gonna have to shoot your way out permalink award report block reply\nDudeNoOne 2 points 2 days ago Oh, come on. you couldn’t have AI change the marquee to “Zohran Speaks”? permalink award report block reply SBOJ_JOBS OP 1 points 2 days ago Didn't use AI permalink parent award report block reply DudeNoOne 1 points 2 days ago Why not. permalink parent award report block reply SBOJ_JOBS OP 1 points 2 days ago personal preference permalink parent award report block reply DudeNoOne 1 points 2 days ago OK, it just would’ve been the cherry on top permalink parent award report block reply\nSBOJ_JOBS OP 1 points 2 days ago Didn't use AI permalink parent award report block reply DudeNoOne 1 points 2 days ago Why not. permalink parent award report block reply SBOJ_JOBS OP 1 points 2 days ago personal preference permalink parent award report block reply DudeNoOne 1 points 2 days ago OK, it just would’ve been the cherry on top permalink parent award report block reply\nDudeNoOne 1 points 2 days ago Why not. permalink parent award report block reply SBOJ_JOBS OP 1 points 2 days ago personal preference permalink parent award report block reply DudeNoOne 1 points 2 days ago OK, it just would’ve been the cherry on top permalink parent award report block reply\nSBOJ_JOBS OP 1 points 2 days ago personal preference permalink parent award report block reply DudeNoOne 1 points 2 days ago OK, it just would’ve been the cherry on top permalink parent award report block reply\nDudeNoOne 1 points 2 days ago OK, it just would’ve been the cherry on top permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:53:57.501264Z"
}