{
  "id": "1ARK5148Y5",
  "url": "https://patriots.win/p/1ARK5148Y5/democrats-shutdown-is-about-to-m/c",
  "content": "1110 Democrats' shutdown is about to make catching a flight a lot harder (www.theblaze.com) posted 6 days ago by ThePopCan 97 comments award share report block Democrats' shutdown is about to make catching a flight a lot harder | Blaze Media The FAA is set to slash airline capacity to maintain safety amid overworked and understaffed air traffic controller burnout. www.theblaze.com\n97 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Hanging_Chad 107 points 6 days ago airports should employ their own air traffic controllers and TSA shouldn’t exist permalink award report block reply Agenda47 42 points 6 days ago Whether they are technically employees of the federal government, contractors, or the airports, I don't know why they need to be federally funded like this. Couldn't it just be a line item on tickets like all the other airport fees? permalink parent award report block reply MySidesGoUp 31 points 6 days ago Unions that’s why. Commie govt loves its unions. permalink parent award report block reply Freeth3usa 1 points 6 days ago The union wanted to go to a nonprofit. The Trump administration stopped it soon after taking office 1st term. permalink parent award report block reply Kraken_V_Algorithm 11 points 6 days ago Federal funding is usually about compliance.  When the Feds want uniformity nationwide this is how they accomplish it.  The usual example is back in the 80s trying to establish standard highway speed limits across the country.  They withheld highway funding from Wyoming(?) Montanta(?) maybe both because those states didn't want to set speed limits on some of the long cross-state stretches with little traffic. I get the need for standardizing some things, ATC is one of those things.  But not allowing states to control speed limits because it screws up some DC central planning egghead scheme is over the line. permalink parent award report block reply keeman 7 points 6 days ago And the reason this works is that the fedgov suddenly discovered in the 1930s that the \"general welfare\" clause (which the founding generation intended as a limit on taxing power) was actually a grant of the power to spend money on anything they like.  The game is to raise taxes to drain money out of the states only to give it back to the state governments with strings attached.  You wanna get those highway funds, then better set you speed limit the way we desire.  You want those school funds, then better teach your kids about female penis.  We the people need to enforce the original meaning of the constitution and end this crap. permalink parent award report block reply Aoikaze2000 1 points 6 days ago We need a standard of operation and an oversight to make sure everyone across the US is working the same way so we don't have issues from regions working differently... like how we all use the same road markings because it's the federal level standatdizing everything. permalink parent award report block reply Eatinglue 24 points 6 days ago This is the correct answer permalink parent award report block reply Spindle-spin 13 points 6 days ago And the FAA. Give authority back to the states. We don't need an authoritarian body stalling progress. permalink parent award report block reply Induceddrag 3 points 6 days ago Yes let’s have 50 different standards for aviation permalink parent award report block reply armyofpedes4usa 9 points 6 days ago You can have uniform standards in private industry. Other nations have privatized ATC and it hasn't resulted in disaster. permalink parent award report block reply view 1 more comments... Mashiki 7 points 6 days ago No need for that. Set the aviation standard federally, leave \"how\" those places will be filled by the states. permalink parent award report block reply keeman 2 points 6 days ago Weird how somehow it works between different countries.  Clearly we require a world government of nothing would work at all. permalink parent award report block reply RockFlagAndEagle2020 11 points 6 days ago 100% permalink parent award report block reply armyofpedes4usa 9 points 6 days ago Stop coming up with logical solutions! /s permalink parent award report block reply Aquamine-Amarine 7 points 6 days ago Yes. permalink parent award report block reply load 5 more comments... Grindelwald 31 points 6 days ago Good. permalink award report block reply Side_o_beef_curtains 26 points 6 days ago Fuck em. No free shit for invaders permalink parent award report block reply TooTrue-translation 16 points 6 days ago I feel bad for the controllers though. It's like being forced to play a video game for hours on end and never die. Day after day month after month and year after year. permalink parent award report block reply Side_o_beef_curtains 20 points 6 days ago Every corporate job, ever permalink parent award report block reply BeauHD 5 points 6 days ago It's a government job...even worse than Office Space. permalink parent award report block reply RedStoneDeepState 3 points 6 days ago No. If I fall asleep at work, 60% chance no one notices. If a aircraft controller looks away for a few seconds, people can die. permalink parent award report block reply view 1 more comments... Battle_Pheasant 4 points 6 days ago I hear you.  Glad I live overseas now. Shit is getting bad back in the states. Even the peeps here ask me \"WTF is going on?\" The air traffic controllers never asked to be put off.  They are, in fact, needed to maintain safety of flight. The Senate sucks and contrary to people shitting on Trump, the US Congress holds the power of the purse.  Not the Executive. permalink parent award report block reply SimaYi 6 points 6 days ago Then the airlines go out of business. Fuck 'em. I literally do not a give a fuck what happens to anyone else but me or my family. I do not care what happens to people who fly, or illegals, or blacks, or faggots, or corporations, or Cracker Barrel, or the \"U.S.\" or Israel or Ukraine, or anything else. Let it all burn. permalink parent award report block reply FrmrAmericanRepublic 2 points 6 days ago You'll love it even more when the Euro shits itself, their digital ID gets rolled out, and the continued flood of invaders visits < insert country > near or where you are. Enjoy. permalink parent award report block reply btntx 3 points 6 days ago ATCs will eventually be replaced by AI systems. Im sure it’s already in development. permalink parent award report block reply OTher55 -1 points 6 days ago Even worse, clocking out from the tower means you're now on the clock for your UberEats side gig to make some actual money to pay your bills. permalink parent award report block reply henri_derelicte 8 points 6 days ago And you’re competing against illegals for business in that side hustle permalink parent award report block reply view 1 more comments... HoganT 4 points 6 days ago The median income for an air traffic controller is $140,000… If you need to drive uber eats after that you’re extremely irresponsible with money. permalink parent award report block reply view 5 more comments... RedStoneDeepState 1 points 6 days ago Most major banks will give government employees a loan or line of credit to cover their bills. permalink parent award report block reply view 4 more comments... minttea2 1 points 6 days ago The US could hire some free shit invaders... https://www.bbc.com/travel/article/20110314-pilots-in-india-flying-drunk-with-fake-licenses https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/air-india-faces-fresh-turbulence-pilots-grounded-for-flying-with-expired-licences-unchecked-training/articleshow/125030876.cms?from=mdr https://www.quora.com/How-surprising-is-it-that-one-third-of-pilots-at-Pakistan-International-Airlines-had-fake-licenses permalink parent award report block reply RockFlagAndEagle2020 22 points 6 days ago The real question Why the fuck are airports and air liners not responsible to hire and maintain proper staffing for air traffic controllers? The government shouldn't be involved in this at all. This is a major problem and completely retarded. Regulating the air space - fine good that's the role of government. Staffing airports with ATC staff - well outside the scope of government. permalink award report block reply Agenda47 11 points 6 days ago The ATC was federalized in 1941 after a few high profile fatal crashes including one where a Senator was killed. Non-standardized weather reporting and competition between airlines was blamed. But following standards doesn't mean they had to be literally run by the government. The USA was all for implementing grand centralized psuedo-commie bullshit back in the 30s-50s, peaking with FDR. (iirc that is when the idea of agency \"czars\" arose) The FCC is another one where they said they needed to control the airwaves to avoid frequency interference but it was centralized primarily to control propaganda. permalink parent award report block reply USDMaga 10 points 6 days ago So you are telling me nothing was done by fed govt until a Senator was harmed. This seems to be a repeating pattern.  I think the solution to all our problems is make sure a senator is inconvienced by whatever causes us problem, it appears to be only way to make them act. permalink parent award report block reply WhatTheActualFuckS 5 points 6 days ago That’s unfortunately how the majority of the country works. Even around here. Until it personally affects them they don’t care. permalink parent award report block reply RockFlagAndEagle2020 4 points 6 days ago Government - NEVER LET A GOOD DIASTER STOP YOU FROM EXPANDING GOVERMENT. Seriously fuck these people. permalink parent award report block reply henri_derelicte 3 points 6 days ago The federal government is involved in subsidizing virtually every form of transportation infrastructure. Federal dollars go towards building/operating airports. Federal money is spent building and maintaining roads and highways. Taxpayer dollars are spent improving railroads. And taxpayers are on the hook for port authorities. Taxpayer money for internal improvements was such a contentious issue that during the Civil War, the Confederate Constitution had language restricting money towards infrastructure projects permalink parent award report block reply thisisatestof2 2 points 6 days ago Exactly. The government can create some regulations to make sure all the aircraft controllers follow the same rules and procedures. However, each airport would be required to actually staff it. Problems solved. permalink parent award report block reply Hanrahan 13 points 6 days ago Get ready for the next wave of Tik Tok videos of stupid young women complaining about how difficult air travel has become. permalink award report block reply TheMostUselessFeeder 8 points 6 days ago And you have the MSM spewing 24/7 that THIS IS TRUMPS FAULT!!! too. Mark my words, democrats are legit hoping to take this shutdown past Christmas. They want to cause hardship and unrest, hopefully riots, and especially hopefully more would-be tranny assassins going after Trump. permalink award report block reply btntx 5 points 6 days ago I’ve been saying exactly this. They need another cat-5 chimp out to sway public opinion. permalink parent award report block reply dukeofdoorcounty 6 points 6 days ago There are hundreds of white AT controllers that didn't get hired because they were white.  Maybe allow them to work. permalink award report block reply gorilla_grip 5 points 6 days ago I got family coming in for thanksgiving from 4 different states and bought several of them airline tickets. I’m going to be really pissed if their flights get cancelled.  I was ok with driving past some national parks I wanted to go to last month that were closed, but not being able to spend thanksgiving with my kids is going to hurt. If this means the death of the democrat party and the abolishment of the TSA and giving the responsibilities of ATC and others to private companies and local municipalities then it will be worth it though. The feds have their hands deep in this stuff and we still had airports using floppy disks and other outdated tech. We need to keep shrinking the federal government permalink award report block reply MisterMAGA 5 points 6 days ago 10 percent reduction permalink award report block reply Badfinz_FL 4 points 6 days ago That's not much in the grand scheme permalink parent award report block reply Bullet3250 5 points 6 days ago \"planes will fall out of the Sky - before we vote to re-open government.\" -- Some Dem, probably. permalink award report block reply armyofpedes4usa 5 points 6 days ago Privatize Air Traffic Control. Even freaking Canada has done this. permalink award report block reply Freeth3usa 1 points 6 days ago Canada went to a nonprofit. The FAA was In the process of doing this between 2016-2018 when his administration squashed it. permalink parent award report block reply Lol_Garrus 4 points 6 days ago Why are air traffic controllers and security (TSA) not hired by the airport itself instead of the federal govt? permalink award report block reply geckogreen 4 points 6 days ago That's a really good question considering an airline pays the airport like $3000 a flight. Even more for international flights and bigger airplanes permalink parent award report block reply Freeth3usa 1 points 6 days ago Because the majority of controllers do not work for an airport. Most controllers don’t work in towers that you are thinking of. permalink parent award report block reply Lol_Garrus 0 points 6 days ago Not my point. The apparatus for commercial air traffic control and security should be privatized. permalink parent award report block reply billybaldwin2 4 points 6 days ago Okay. Cool. Private jets too right? permalink award report block reply FuckU/Spez 4 points 6 days ago I'm flying out for a wedding next week. I'm really contemplating driving the 1400 miles back home if this keeps up. Pass a clean CR! Democrats want to keep the grift going and money laundering through illegal immigrations welfare/healthcare permalink award report block reply tomdumont 4 points 6 days ago I'm surprised they haven't cut 75% of the flights already. permalink award report block reply Mobmando 3 points 6 days ago Republicans have the votes. They just don't have the will. permalink award report block reply RogueLeaderX 3 points 6 days ago GOP BETTER NOT CAPITULATE!!! Don’t give them an inch. permalink award report block reply KernalMustard 2 points 6 days ago Are you new? They will capitulate. Watching reruns. The GOP will lose a winning hand permalink parent award report block reply alucard13mmfmj 3 points 6 days ago I wonder if there is a mass casualty accident with aircraft, who would be blamed? permalink award report block reply Bythrfruitsyknow 5 points 6 days ago Democrat media wasted no time trying to hang the UPS flight crash on President Trump the other day, and insinuated the shutdown. Kind of an odd narrative to try and push for an obvious mechanical failure where the engine burned off the wing -- but their voters are low-IQ, low information anyway. permalink parent award report block reply chinigga 3 points 6 days ago AI will replace the ATC in 10 years. permalink award report block reply RusherOfDin 3 points 6 days ago Flying is a miserable fucking experience these days so it's a shame for people who have to be somewhere but if you're just flying for pleasure you are punishing yourself for no reason. permalink award report block reply godgoldnguns 3 points 6 days ago Fine - dock back pay by 10% when the shut down ends. permalink award report block reply Ryunnsun 3 points 6 days ago Sounds like time to privatize the airlines again. permalink award report block reply ThePatriotGames2016 2 points 6 days ago yeah, fuck the government airlines. 9/11. the government takeover of the airlines. permalink award report block reply RizzlieDoodad 2 points 6 days ago Nah man this isn't the Dems anymore. The Republicans have the power to open the government and they're keeping it closed because it's hurting Trump and they know it. permalink award report block reply MAGA_APN 2 points 6 days ago Shut down private flights of congress permalink award report block reply f_bastiat 2 points 6 days ago I haven't been on a plane in 20 years, I am grateful my family hates the idea of traveling anywhere, we are happy in our home and in our community. permalink award report block reply keeman 2 points 6 days ago Maybe putting the fedgov in charge of this wasn't just unconstitutional but also a bad practical idea? permalink award report block reply Mcrumples 1 points 6 days ago Please just keep it closed til December. Pleade just long enough for the mass firings permalink award report block reply Snowdone 1 points 6 days ago It’s quite simple. The money they want is to fund voter fraud illegals so they can vote and Brown Shirts. Since they know they can’t win without those they ar paying you back for not siding with them. In 1776 the discussions were over with a hostile entity. It needs to happen again. permalink award report block reply Papabravo12 1 points 6 days ago Good permalink award report block reply Somebody157 1 points 6 days ago Escape from New York is Real! permalink award report block reply SimaYi 1 points 6 days ago Doesn't affect me at all, and therefore I do not give a fuck. permalink award report block reply Lib_Women_Have_HSV 1 points 6 days ago I thought the shut down was going to end yesterday according to this site permalink award report block reply BadBrainsBuzzcocks 1 points 6 days ago Don't live in a fantasy land. We'll get blamed for this shutdown because Republicans suck. MTG is a fraud. Whining for Obamacare....we hardly mention the fact this is the same funding the Dems approved 2 yrs ago and they voted for the end to the subsidies. The republitards will fuck this up count on it. permalink award report block reply Eruditio 1 points 6 days ago Good! It's past the time that the voters feel the PAIN for voting for Democrats! permalink award report block reply stealthboy 4 points 6 days ago They will never in a hundred years actually make the connection that it is the fault of the Democrats. permalink parent award report block reply Dev404 1 points 6 days ago That's fine by me, people want to pay more attention to fagball and planning vacations more than what's going on across the country. Let them delay or lose their flights, they deserve it. It's not the time to keep fucking around. permalink award report block reply yodayoda 1 points 6 days ago 😅🍿 permalink award report block reply TrumpYouMagaFrenner 1 points 6 days ago Its making my dick harder permalink award report block reply Cuetardian 1 points 6 days ago At first, just cancelling ten percent of the flights didn't sound like much. But apparently that's going to cause such a ripple effect that it's going to cause a much greater cancellation rate. Fine with me. permalink award report block reply dumbcomputerguy 0 points 6 days ago Good.  Less carbon emissions.  nobody really needs to move that fast anyways.  i have not been on a plane in 20 years.  ive seen what goes on in those public spaces these days.  i see no need to fly ever again.  its a shitty industry propped up by government. fuck em permalink award report block reply\nHanging_Chad 107 points 6 days ago airports should employ their own air traffic controllers and TSA shouldn’t exist permalink award report block reply Agenda47 42 points 6 days ago Whether they are technically employees of the federal government, contractors, or the airports, I don't know why they need to be federally funded like this. Couldn't it just be a line item on tickets like all the other airport fees? permalink parent award report block reply MySidesGoUp 31 points 6 days ago Unions that’s why. Commie govt loves its unions. permalink parent award report block reply Freeth3usa 1 points 6 days ago The union wanted to go to a nonprofit. The Trump administration stopped it soon after taking office 1st term. permalink parent award report block reply Kraken_V_Algorithm 11 points 6 days ago Federal funding is usually about compliance.  When the Feds want uniformity nationwide this is how they accomplish it.  The usual example is back in the 80s trying to establish standard highway speed limits across the country.  They withheld highway funding from Wyoming(?) Montanta(?) maybe both because those states didn't want to set speed limits on some of the long cross-state stretches with little traffic. I get the need for standardizing some things, ATC is one of those things.  But not allowing states to control speed limits because it screws up some DC central planning egghead scheme is over the line. permalink parent award report block reply keeman 7 points 6 days ago And the reason this works is that the fedgov suddenly discovered in the 1930s that the \"general welfare\" clause (which the founding generation intended as a limit on taxing power) was actually a grant of the power to spend money on anything they like.  The game is to raise taxes to drain money out of the states only to give it back to the state governments with strings attached.  You wanna get those highway funds, then better set you speed limit the way we desire.  You want those school funds, then better teach your kids about female penis.  We the people need to enforce the original meaning of the constitution and end this crap. permalink parent award report block reply Aoikaze2000 1 points 6 days ago We need a standard of operation and an oversight to make sure everyone across the US is working the same way so we don't have issues from regions working differently... like how we all use the same road markings because it's the federal level standatdizing everything. permalink parent award report block reply Eatinglue 24 points 6 days ago This is the correct answer permalink parent award report block reply Spindle-spin 13 points 6 days ago And the FAA. Give authority back to the states. We don't need an authoritarian body stalling progress. permalink parent award report block reply Induceddrag 3 points 6 days ago Yes let’s have 50 different standards for aviation permalink parent award report block reply armyofpedes4usa 9 points 6 days ago You can have uniform standards in private industry. Other nations have privatized ATC and it hasn't resulted in disaster. permalink parent award report block reply view 1 more comments... Mashiki 7 points 6 days ago No need for that. Set the aviation standard federally, leave \"how\" those places will be filled by the states. permalink parent award report block reply keeman 2 points 6 days ago Weird how somehow it works between different countries.  Clearly we require a world government of nothing would work at all. permalink parent award report block reply RockFlagAndEagle2020 11 points 6 days ago 100% permalink parent award report block reply armyofpedes4usa 9 points 6 days ago Stop coming up with logical solutions! /s permalink parent award report block reply Aquamine-Amarine 7 points 6 days ago Yes. permalink parent award report block reply load 5 more comments...\nAgenda47 42 points 6 days ago Whether they are technically employees of the federal government, contractors, or the airports, I don't know why they need to be federally funded like this. Couldn't it just be a line item on tickets like all the other airport fees? permalink parent award report block reply MySidesGoUp 31 points 6 days ago Unions that’s why. Commie govt loves its unions. permalink parent award report block reply Freeth3usa 1 points 6 days ago The union wanted to go to a nonprofit. The Trump administration stopped it soon after taking office 1st term. permalink parent award report block reply Kraken_V_Algorithm 11 points 6 days ago Federal funding is usually about compliance.  When the Feds want uniformity nationwide this is how they accomplish it.  The usual example is back in the 80s trying to establish standard highway speed limits across the country.  They withheld highway funding from Wyoming(?) Montanta(?) maybe both because those states didn't want to set speed limits on some of the long cross-state stretches with little traffic. I get the need for standardizing some things, ATC is one of those things.  But not allowing states to control speed limits because it screws up some DC central planning egghead scheme is over the line. permalink parent award report block reply keeman 7 points 6 days ago And the reason this works is that the fedgov suddenly discovered in the 1930s that the \"general welfare\" clause (which the founding generation intended as a limit on taxing power) was actually a grant of the power to spend money on anything they like.  The game is to raise taxes to drain money out of the states only to give it back to the state governments with strings attached.  You wanna get those highway funds, then better set you speed limit the way we desire.  You want those school funds, then better teach your kids about female penis.  We the people need to enforce the original meaning of the constitution and end this crap. permalink parent award report block reply Aoikaze2000 1 points 6 days ago We need a standard of operation and an oversight to make sure everyone across the US is working the same way so we don't have issues from regions working differently... like how we all use the same road markings because it's the federal level standatdizing everything. permalink parent award report block reply\nMySidesGoUp 31 points 6 days ago Unions that’s why. Commie govt loves its unions. permalink parent award report block reply Freeth3usa 1 points 6 days ago The union wanted to go to a nonprofit. The Trump administration stopped it soon after taking office 1st term. permalink parent award report block reply\nFreeth3usa 1 points 6 days ago The union wanted to go to a nonprofit. The Trump administration stopped it soon after taking office 1st term. permalink parent award report block reply\nKraken_V_Algorithm 11 points 6 days ago Federal funding is usually about compliance.  When the Feds want uniformity nationwide this is how they accomplish it.  The usual example is back in the 80s trying to establish standard highway speed limits across the country.  They withheld highway funding from Wyoming(?) Montanta(?) maybe both because those states didn't want to set speed limits on some of the long cross-state stretches with little traffic. I get the need for standardizing some things, ATC is one of those things.  But not allowing states to control speed limits because it screws up some DC central planning egghead scheme is over the line. permalink parent award report block reply keeman 7 points 6 days ago And the reason this works is that the fedgov suddenly discovered in the 1930s that the \"general welfare\" clause (which the founding generation intended as a limit on taxing power) was actually a grant of the power to spend money on anything they like.  The game is to raise taxes to drain money out of the states only to give it back to the state governments with strings attached.  You wanna get those highway funds, then better set you speed limit the way we desire.  You want those school funds, then better teach your kids about female penis.  We the people need to enforce the original meaning of the constitution and end this crap. permalink parent award report block reply\nkeeman 7 points 6 days ago And the reason this works is that the fedgov suddenly discovered in the 1930s that the \"general welfare\" clause (which the founding generation intended as a limit on taxing power) was actually a grant of the power to spend money on anything they like.  The game is to raise taxes to drain money out of the states only to give it back to the state governments with strings attached.  You wanna get those highway funds, then better set you speed limit the way we desire.  You want those school funds, then better teach your kids about female penis.  We the people need to enforce the original meaning of the constitution and end this crap. permalink parent award report block reply\nAoikaze2000 1 points 6 days ago We need a standard of operation and an oversight to make sure everyone across the US is working the same way so we don't have issues from regions working differently... like how we all use the same road markings because it's the federal level standatdizing everything. permalink parent award report block reply\nEatinglue 24 points 6 days ago This is the correct answer permalink parent award report block reply Spindle-spin 13 points 6 days ago And the FAA. Give authority back to the states. We don't need an authoritarian body stalling progress. permalink parent award report block reply Induceddrag 3 points 6 days ago Yes let’s have 50 different standards for aviation permalink parent award report block reply armyofpedes4usa 9 points 6 days ago You can have uniform standards in private industry. Other nations have privatized ATC and it hasn't resulted in disaster. permalink parent award report block reply view 1 more comments... Mashiki 7 points 6 days ago No need for that. Set the aviation standard federally, leave \"how\" those places will be filled by the states. permalink parent award report block reply keeman 2 points 6 days ago Weird how somehow it works between different countries.  Clearly we require a world government of nothing would work at all. permalink parent award report block reply\nSpindle-spin 13 points 6 days ago And the FAA. Give authority back to the states. We don't need an authoritarian body stalling progress. permalink parent award report block reply Induceddrag 3 points 6 days ago Yes let’s have 50 different standards for aviation permalink parent award report block reply armyofpedes4usa 9 points 6 days ago You can have uniform standards in private industry. Other nations have privatized ATC and it hasn't resulted in disaster. permalink parent award report block reply view 1 more comments... Mashiki 7 points 6 days ago No need for that. Set the aviation standard federally, leave \"how\" those places will be filled by the states. permalink parent award report block reply keeman 2 points 6 days ago Weird how somehow it works between different countries.  Clearly we require a world government of nothing would work at all. permalink parent award report block reply\nInduceddrag 3 points 6 days ago Yes let’s have 50 different standards for aviation permalink parent award report block reply armyofpedes4usa 9 points 6 days ago You can have uniform standards in private industry. Other nations have privatized ATC and it hasn't resulted in disaster. permalink parent award report block reply view 1 more comments... Mashiki 7 points 6 days ago No need for that. Set the aviation standard federally, leave \"how\" those places will be filled by the states. permalink parent award report block reply keeman 2 points 6 days ago Weird how somehow it works between different countries.  Clearly we require a world government of nothing would work at all. permalink parent award report block reply\narmyofpedes4usa 9 points 6 days ago You can have uniform standards in private industry. Other nations have privatized ATC and it hasn't resulted in disaster. permalink parent award report block reply view 1 more comments...\nMashiki 7 points 6 days ago No need for that. Set the aviation standard federally, leave \"how\" those places will be filled by the states. permalink parent award report block reply\nkeeman 2 points 6 days ago Weird how somehow it works between different countries.  Clearly we require a world government of nothing would work at all. permalink parent award report block reply\nRockFlagAndEagle2020 11 points 6 days ago 100% permalink parent award report block reply\narmyofpedes4usa 9 points 6 days ago Stop coming up with logical solutions! /s permalink parent award report block reply\nAquamine-Amarine 7 points 6 days ago Yes. permalink parent award report block reply\nGrindelwald 31 points 6 days ago Good. permalink award report block reply Side_o_beef_curtains 26 points 6 days ago Fuck em. No free shit for invaders permalink parent award report block reply TooTrue-translation 16 points 6 days ago I feel bad for the controllers though. It's like being forced to play a video game for hours on end and never die. Day after day month after month and year after year. permalink parent award report block reply Side_o_beef_curtains 20 points 6 days ago Every corporate job, ever permalink parent award report block reply BeauHD 5 points 6 days ago It's a government job...even worse than Office Space. permalink parent award report block reply RedStoneDeepState 3 points 6 days ago No. If I fall asleep at work, 60% chance no one notices. If a aircraft controller looks away for a few seconds, people can die. permalink parent award report block reply view 1 more comments... Battle_Pheasant 4 points 6 days ago I hear you.  Glad I live overseas now. Shit is getting bad back in the states. Even the peeps here ask me \"WTF is going on?\" The air traffic controllers never asked to be put off.  They are, in fact, needed to maintain safety of flight. The Senate sucks and contrary to people shitting on Trump, the US Congress holds the power of the purse.  Not the Executive. permalink parent award report block reply SimaYi 6 points 6 days ago Then the airlines go out of business. Fuck 'em. I literally do not a give a fuck what happens to anyone else but me or my family. I do not care what happens to people who fly, or illegals, or blacks, or faggots, or corporations, or Cracker Barrel, or the \"U.S.\" or Israel or Ukraine, or anything else. Let it all burn. permalink parent award report block reply FrmrAmericanRepublic 2 points 6 days ago You'll love it even more when the Euro shits itself, their digital ID gets rolled out, and the continued flood of invaders visits < insert country > near or where you are. Enjoy. permalink parent award report block reply btntx 3 points 6 days ago ATCs will eventually be replaced by AI systems. Im sure it’s already in development. permalink parent award report block reply OTher55 -1 points 6 days ago Even worse, clocking out from the tower means you're now on the clock for your UberEats side gig to make some actual money to pay your bills. permalink parent award report block reply henri_derelicte 8 points 6 days ago And you’re competing against illegals for business in that side hustle permalink parent award report block reply view 1 more comments... HoganT 4 points 6 days ago The median income for an air traffic controller is $140,000… If you need to drive uber eats after that you’re extremely irresponsible with money. permalink parent award report block reply view 5 more comments... RedStoneDeepState 1 points 6 days ago Most major banks will give government employees a loan or line of credit to cover their bills. permalink parent award report block reply view 4 more comments... minttea2 1 points 6 days ago The US could hire some free shit invaders... https://www.bbc.com/travel/article/20110314-pilots-in-india-flying-drunk-with-fake-licenses https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/air-india-faces-fresh-turbulence-pilots-grounded-for-flying-with-expired-licences-unchecked-training/articleshow/125030876.cms?from=mdr https://www.quora.com/How-surprising-is-it-that-one-third-of-pilots-at-Pakistan-International-Airlines-had-fake-licenses permalink parent award report block reply\nSide_o_beef_curtains 26 points 6 days ago Fuck em. No free shit for invaders permalink parent award report block reply TooTrue-translation 16 points 6 days ago I feel bad for the controllers though. It's like being forced to play a video game for hours on end and never die. Day after day month after month and year after year. permalink parent award report block reply Side_o_beef_curtains 20 points 6 days ago Every corporate job, ever permalink parent award report block reply BeauHD 5 points 6 days ago It's a government job...even worse than Office Space. permalink parent award report block reply RedStoneDeepState 3 points 6 days ago No. If I fall asleep at work, 60% chance no one notices. If a aircraft controller looks away for a few seconds, people can die. permalink parent award report block reply view 1 more comments... Battle_Pheasant 4 points 6 days ago I hear you.  Glad I live overseas now. Shit is getting bad back in the states. Even the peeps here ask me \"WTF is going on?\" The air traffic controllers never asked to be put off.  They are, in fact, needed to maintain safety of flight. The Senate sucks and contrary to people shitting on Trump, the US Congress holds the power of the purse.  Not the Executive. permalink parent award report block reply SimaYi 6 points 6 days ago Then the airlines go out of business. Fuck 'em. I literally do not a give a fuck what happens to anyone else but me or my family. I do not care what happens to people who fly, or illegals, or blacks, or faggots, or corporations, or Cracker Barrel, or the \"U.S.\" or Israel or Ukraine, or anything else. Let it all burn. permalink parent award report block reply FrmrAmericanRepublic 2 points 6 days ago You'll love it even more when the Euro shits itself, their digital ID gets rolled out, and the continued flood of invaders visits < insert country > near or where you are. Enjoy. permalink parent award report block reply btntx 3 points 6 days ago ATCs will eventually be replaced by AI systems. Im sure it’s already in development. permalink parent award report block reply OTher55 -1 points 6 days ago Even worse, clocking out from the tower means you're now on the clock for your UberEats side gig to make some actual money to pay your bills. permalink parent award report block reply henri_derelicte 8 points 6 days ago And you’re competing against illegals for business in that side hustle permalink parent award report block reply view 1 more comments... HoganT 4 points 6 days ago The median income for an air traffic controller is $140,000… If you need to drive uber eats after that you’re extremely irresponsible with money. permalink parent award report block reply view 5 more comments... RedStoneDeepState 1 points 6 days ago Most major banks will give government employees a loan or line of credit to cover their bills. permalink parent award report block reply view 4 more comments... minttea2 1 points 6 days ago The US could hire some free shit invaders... https://www.bbc.com/travel/article/20110314-pilots-in-india-flying-drunk-with-fake-licenses https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/air-india-faces-fresh-turbulence-pilots-grounded-for-flying-with-expired-licences-unchecked-training/articleshow/125030876.cms?from=mdr https://www.quora.com/How-surprising-is-it-that-one-third-of-pilots-at-Pakistan-International-Airlines-had-fake-licenses permalink parent award report block reply\nTooTrue-translation 16 points 6 days ago I feel bad for the controllers though. It's like being forced to play a video game for hours on end and never die. Day after day month after month and year after year. permalink parent award report block reply Side_o_beef_curtains 20 points 6 days ago Every corporate job, ever permalink parent award report block reply BeauHD 5 points 6 days ago It's a government job...even worse than Office Space. permalink parent award report block reply RedStoneDeepState 3 points 6 days ago No. If I fall asleep at work, 60% chance no one notices. If a aircraft controller looks away for a few seconds, people can die. permalink parent award report block reply view 1 more comments... Battle_Pheasant 4 points 6 days ago I hear you.  Glad I live overseas now. Shit is getting bad back in the states. Even the peeps here ask me \"WTF is going on?\" The air traffic controllers never asked to be put off.  They are, in fact, needed to maintain safety of flight. The Senate sucks and contrary to people shitting on Trump, the US Congress holds the power of the purse.  Not the Executive. permalink parent award report block reply SimaYi 6 points 6 days ago Then the airlines go out of business. Fuck 'em. I literally do not a give a fuck what happens to anyone else but me or my family. I do not care what happens to people who fly, or illegals, or blacks, or faggots, or corporations, or Cracker Barrel, or the \"U.S.\" or Israel or Ukraine, or anything else. Let it all burn. permalink parent award report block reply FrmrAmericanRepublic 2 points 6 days ago You'll love it even more when the Euro shits itself, their digital ID gets rolled out, and the continued flood of invaders visits < insert country > near or where you are. Enjoy. permalink parent award report block reply btntx 3 points 6 days ago ATCs will eventually be replaced by AI systems. Im sure it’s already in development. permalink parent award report block reply OTher55 -1 points 6 days ago Even worse, clocking out from the tower means you're now on the clock for your UberEats side gig to make some actual money to pay your bills. permalink parent award report block reply henri_derelicte 8 points 6 days ago And you’re competing against illegals for business in that side hustle permalink parent award report block reply view 1 more comments... HoganT 4 points 6 days ago The median income for an air traffic controller is $140,000… If you need to drive uber eats after that you’re extremely irresponsible with money. permalink parent award report block reply view 5 more comments... RedStoneDeepState 1 points 6 days ago Most major banks will give government employees a loan or line of credit to cover their bills. permalink parent award report block reply view 4 more comments...\nSide_o_beef_curtains 20 points 6 days ago Every corporate job, ever permalink parent award report block reply BeauHD 5 points 6 days ago It's a government job...even worse than Office Space. permalink parent award report block reply RedStoneDeepState 3 points 6 days ago No. If I fall asleep at work, 60% chance no one notices. If a aircraft controller looks away for a few seconds, people can die. permalink parent award report block reply view 1 more comments...\nBeauHD 5 points 6 days ago It's a government job...even worse than Office Space. permalink parent award report block reply\nRedStoneDeepState 3 points 6 days ago No. If I fall asleep at work, 60% chance no one notices. If a aircraft controller looks away for a few seconds, people can die. permalink parent award report block reply view 1 more comments...\nBattle_Pheasant 4 points 6 days ago I hear you.  Glad I live overseas now. Shit is getting bad back in the states. Even the peeps here ask me \"WTF is going on?\" The air traffic controllers never asked to be put off.  They are, in fact, needed to maintain safety of flight. The Senate sucks and contrary to people shitting on Trump, the US Congress holds the power of the purse.  Not the Executive. permalink parent award report block reply SimaYi 6 points 6 days ago Then the airlines go out of business. Fuck 'em. I literally do not a give a fuck what happens to anyone else but me or my family. I do not care what happens to people who fly, or illegals, or blacks, or faggots, or corporations, or Cracker Barrel, or the \"U.S.\" or Israel or Ukraine, or anything else. Let it all burn. permalink parent award report block reply FrmrAmericanRepublic 2 points 6 days ago You'll love it even more when the Euro shits itself, their digital ID gets rolled out, and the continued flood of invaders visits < insert country > near or where you are. Enjoy. permalink parent award report block reply\nSimaYi 6 points 6 days ago Then the airlines go out of business. Fuck 'em. I literally do not a give a fuck what happens to anyone else but me or my family. I do not care what happens to people who fly, or illegals, or blacks, or faggots, or corporations, or Cracker Barrel, or the \"U.S.\" or Israel or Ukraine, or anything else. Let it all burn. permalink parent award report block reply\nFrmrAmericanRepublic 2 points 6 days ago You'll love it even more when the Euro shits itself, their digital ID gets rolled out, and the continued flood of invaders visits < insert country > near or where you are. Enjoy. permalink parent award report block reply\nbtntx 3 points 6 days ago ATCs will eventually be replaced by AI systems. Im sure it’s already in development. permalink parent award report block reply\nOTher55 -1 points 6 days ago Even worse, clocking out from the tower means you're now on the clock for your UberEats side gig to make some actual money to pay your bills. permalink parent award report block reply henri_derelicte 8 points 6 days ago And you’re competing against illegals for business in that side hustle permalink parent award report block reply view 1 more comments... HoganT 4 points 6 days ago The median income for an air traffic controller is $140,000… If you need to drive uber eats after that you’re extremely irresponsible with money. permalink parent award report block reply view 5 more comments... RedStoneDeepState 1 points 6 days ago Most major banks will give government employees a loan or line of credit to cover their bills. permalink parent award report block reply view 4 more comments...\nhenri_derelicte 8 points 6 days ago And you’re competing against illegals for business in that side hustle permalink parent award report block reply view 1 more comments...\nHoganT 4 points 6 days ago The median income for an air traffic controller is $140,000… If you need to drive uber eats after that you’re extremely irresponsible with money. permalink parent award report block reply view 5 more comments...\nRedStoneDeepState 1 points 6 days ago Most major banks will give government employees a loan or line of credit to cover their bills. permalink parent award report block reply view 4 more comments...\nminttea2 1 points 6 days ago The US could hire some free shit invaders... https://www.bbc.com/travel/article/20110314-pilots-in-india-flying-drunk-with-fake-licenses https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/air-india-faces-fresh-turbulence-pilots-grounded-for-flying-with-expired-licences-unchecked-training/articleshow/125030876.cms?from=mdr https://www.quora.com/How-surprising-is-it-that-one-third-of-pilots-at-Pakistan-International-Airlines-had-fake-licenses permalink parent award report block reply\nRockFlagAndEagle2020 22 points 6 days ago The real question Why the fuck are airports and air liners not responsible to hire and maintain proper staffing for air traffic controllers? The government shouldn't be involved in this at all. This is a major problem and completely retarded. Regulating the air space - fine good that's the role of government. Staffing airports with ATC staff - well outside the scope of government. permalink award report block reply Agenda47 11 points 6 days ago The ATC was federalized in 1941 after a few high profile fatal crashes including one where a Senator was killed. Non-standardized weather reporting and competition between airlines was blamed. But following standards doesn't mean they had to be literally run by the government. The USA was all for implementing grand centralized psuedo-commie bullshit back in the 30s-50s, peaking with FDR. (iirc that is when the idea of agency \"czars\" arose) The FCC is another one where they said they needed to control the airwaves to avoid frequency interference but it was centralized primarily to control propaganda. permalink parent award report block reply USDMaga 10 points 6 days ago So you are telling me nothing was done by fed govt until a Senator was harmed. This seems to be a repeating pattern.  I think the solution to all our problems is make sure a senator is inconvienced by whatever causes us problem, it appears to be only way to make them act. permalink parent award report block reply WhatTheActualFuckS 5 points 6 days ago That’s unfortunately how the majority of the country works. Even around here. Until it personally affects them they don’t care. permalink parent award report block reply RockFlagAndEagle2020 4 points 6 days ago Government - NEVER LET A GOOD DIASTER STOP YOU FROM EXPANDING GOVERMENT. Seriously fuck these people. permalink parent award report block reply henri_derelicte 3 points 6 days ago The federal government is involved in subsidizing virtually every form of transportation infrastructure. Federal dollars go towards building/operating airports. Federal money is spent building and maintaining roads and highways. Taxpayer dollars are spent improving railroads. And taxpayers are on the hook for port authorities. Taxpayer money for internal improvements was such a contentious issue that during the Civil War, the Confederate Constitution had language restricting money towards infrastructure projects permalink parent award report block reply thisisatestof2 2 points 6 days ago Exactly. The government can create some regulations to make sure all the aircraft controllers follow the same rules and procedures. However, each airport would be required to actually staff it. Problems solved. permalink parent award report block reply\nAgenda47 11 points 6 days ago The ATC was federalized in 1941 after a few high profile fatal crashes including one where a Senator was killed. Non-standardized weather reporting and competition between airlines was blamed. But following standards doesn't mean they had to be literally run by the government. The USA was all for implementing grand centralized psuedo-commie bullshit back in the 30s-50s, peaking with FDR. (iirc that is when the idea of agency \"czars\" arose) The FCC is another one where they said they needed to control the airwaves to avoid frequency interference but it was centralized primarily to control propaganda. permalink parent award report block reply USDMaga 10 points 6 days ago So you are telling me nothing was done by fed govt until a Senator was harmed. This seems to be a repeating pattern.  I think the solution to all our problems is make sure a senator is inconvienced by whatever causes us problem, it appears to be only way to make them act. permalink parent award report block reply WhatTheActualFuckS 5 points 6 days ago That’s unfortunately how the majority of the country works. Even around here. Until it personally affects them they don’t care. permalink parent award report block reply RockFlagAndEagle2020 4 points 6 days ago Government - NEVER LET A GOOD DIASTER STOP YOU FROM EXPANDING GOVERMENT. Seriously fuck these people. permalink parent award report block reply henri_derelicte 3 points 6 days ago The federal government is involved in subsidizing virtually every form of transportation infrastructure. Federal dollars go towards building/operating airports. Federal money is spent building and maintaining roads and highways. Taxpayer dollars are spent improving railroads. And taxpayers are on the hook for port authorities. Taxpayer money for internal improvements was such a contentious issue that during the Civil War, the Confederate Constitution had language restricting money towards infrastructure projects permalink parent award report block reply\nUSDMaga 10 points 6 days ago So you are telling me nothing was done by fed govt until a Senator was harmed. This seems to be a repeating pattern.  I think the solution to all our problems is make sure a senator is inconvienced by whatever causes us problem, it appears to be only way to make them act. permalink parent award report block reply WhatTheActualFuckS 5 points 6 days ago That’s unfortunately how the majority of the country works. Even around here. Until it personally affects them they don’t care. permalink parent award report block reply\nWhatTheActualFuckS 5 points 6 days ago That’s unfortunately how the majority of the country works. Even around here. Until it personally affects them they don’t care. permalink parent award report block reply\nRockFlagAndEagle2020 4 points 6 days ago Government - NEVER LET A GOOD DIASTER STOP YOU FROM EXPANDING GOVERMENT. Seriously fuck these people. permalink parent award report block reply\nhenri_derelicte 3 points 6 days ago The federal government is involved in subsidizing virtually every form of transportation infrastructure. Federal dollars go towards building/operating airports. Federal money is spent building and maintaining roads and highways. Taxpayer dollars are spent improving railroads. And taxpayers are on the hook for port authorities. Taxpayer money for internal improvements was such a contentious issue that during the Civil War, the Confederate Constitution had language restricting money towards infrastructure projects permalink parent award report block reply\nthisisatestof2 2 points 6 days ago Exactly. The government can create some regulations to make sure all the aircraft controllers follow the same rules and procedures. However, each airport would be required to actually staff it. Problems solved. permalink parent award report block reply\nHanrahan 13 points 6 days ago Get ready for the next wave of Tik Tok videos of stupid young women complaining about how difficult air travel has become. permalink award report block reply\nTheMostUselessFeeder 8 points 6 days ago And you have the MSM spewing 24/7 that THIS IS TRUMPS FAULT!!! too. Mark my words, democrats are legit hoping to take this shutdown past Christmas. They want to cause hardship and unrest, hopefully riots, and especially hopefully more would-be tranny assassins going after Trump. permalink award report block reply btntx 5 points 6 days ago I’ve been saying exactly this. They need another cat-5 chimp out to sway public opinion. permalink parent award report block reply\nbtntx 5 points 6 days ago I’ve been saying exactly this. They need another cat-5 chimp out to sway public opinion. permalink parent award report block reply\ndukeofdoorcounty 6 points 6 days ago There are hundreds of white AT controllers that didn't get hired because they were white.  Maybe allow them to work. permalink award report block reply\ngorilla_grip 5 points 6 days ago I got family coming in for thanksgiving from 4 different states and bought several of them airline tickets. I’m going to be really pissed if their flights get cancelled.  I was ok with driving past some national parks I wanted to go to last month that were closed, but not being able to spend thanksgiving with my kids is going to hurt. If this means the death of the democrat party and the abolishment of the TSA and giving the responsibilities of ATC and others to private companies and local municipalities then it will be worth it though. The feds have their hands deep in this stuff and we still had airports using floppy disks and other outdated tech. We need to keep shrinking the federal government permalink award report block reply\nMisterMAGA 5 points 6 days ago 10 percent reduction permalink award report block reply Badfinz_FL 4 points 6 days ago That's not much in the grand scheme permalink parent award report block reply\nBadfinz_FL 4 points 6 days ago That's not much in the grand scheme permalink parent award report block reply\nBullet3250 5 points 6 days ago \"planes will fall out of the Sky - before we vote to re-open government.\" -- Some Dem, probably. permalink award report block reply\narmyofpedes4usa 5 points 6 days ago Privatize Air Traffic Control. Even freaking Canada has done this. permalink award report block reply Freeth3usa 1 points 6 days ago Canada went to a nonprofit. The FAA was In the process of doing this between 2016-2018 when his administration squashed it. permalink parent award report block reply\nFreeth3usa 1 points 6 days ago Canada went to a nonprofit. The FAA was In the process of doing this between 2016-2018 when his administration squashed it. permalink parent award report block reply\nLol_Garrus 4 points 6 days ago Why are air traffic controllers and security (TSA) not hired by the airport itself instead of the federal govt? permalink award report block reply geckogreen 4 points 6 days ago That's a really good question considering an airline pays the airport like $3000 a flight. Even more for international flights and bigger airplanes permalink parent award report block reply Freeth3usa 1 points 6 days ago Because the majority of controllers do not work for an airport. Most controllers don’t work in towers that you are thinking of. permalink parent award report block reply Lol_Garrus 0 points 6 days ago Not my point. The apparatus for commercial air traffic control and security should be privatized. permalink parent award report block reply\ngeckogreen 4 points 6 days ago That's a really good question considering an airline pays the airport like $3000 a flight. Even more for international flights and bigger airplanes permalink parent award report block reply\nFreeth3usa 1 points 6 days ago Because the majority of controllers do not work for an airport. Most controllers don’t work in towers that you are thinking of. permalink parent award report block reply Lol_Garrus 0 points 6 days ago Not my point. The apparatus for commercial air traffic control and security should be privatized. permalink parent award report block reply\nLol_Garrus 0 points 6 days ago Not my point. The apparatus for commercial air traffic control and security should be privatized. permalink parent award report block reply\nbillybaldwin2 4 points 6 days ago Okay. Cool. Private jets too right? permalink award report block reply\nFuckU/Spez 4 points 6 days ago I'm flying out for a wedding next week. I'm really contemplating driving the 1400 miles back home if this keeps up. Pass a clean CR! Democrats want to keep the grift going and money laundering through illegal immigrations welfare/healthcare permalink award report block reply\ntomdumont 4 points 6 days ago I'm surprised they haven't cut 75% of the flights already. permalink award report block reply\nMobmando 3 points 6 days ago Republicans have the votes. They just don't have the will. permalink award report block reply\nRogueLeaderX 3 points 6 days ago GOP BETTER NOT CAPITULATE!!! Don’t give them an inch. permalink award report block reply KernalMustard 2 points 6 days ago Are you new? They will capitulate. Watching reruns. The GOP will lose a winning hand permalink parent award report block reply\nKernalMustard 2 points 6 days ago Are you new? They will capitulate. Watching reruns. The GOP will lose a winning hand permalink parent award report block reply\nalucard13mmfmj 3 points 6 days ago I wonder if there is a mass casualty accident with aircraft, who would be blamed? permalink award report block reply Bythrfruitsyknow 5 points 6 days ago Democrat media wasted no time trying to hang the UPS flight crash on President Trump the other day, and insinuated the shutdown. Kind of an odd narrative to try and push for an obvious mechanical failure where the engine burned off the wing -- but their voters are low-IQ, low information anyway. permalink parent award report block reply\nBythrfruitsyknow 5 points 6 days ago Democrat media wasted no time trying to hang the UPS flight crash on President Trump the other day, and insinuated the shutdown. Kind of an odd narrative to try and push for an obvious mechanical failure where the engine burned off the wing -- but their voters are low-IQ, low information anyway. permalink parent award report block reply\nchinigga 3 points 6 days ago AI will replace the ATC in 10 years. permalink award report block reply\nRusherOfDin 3 points 6 days ago Flying is a miserable fucking experience these days so it's a shame for people who have to be somewhere but if you're just flying for pleasure you are punishing yourself for no reason. permalink award report block reply\ngodgoldnguns 3 points 6 days ago Fine - dock back pay by 10% when the shut down ends. permalink award report block reply\nRyunnsun 3 points 6 days ago Sounds like time to privatize the airlines again. permalink award report block reply\nThePatriotGames2016 2 points 6 days ago yeah, fuck the government airlines. 9/11. the government takeover of the airlines. permalink award report block reply\nRizzlieDoodad 2 points 6 days ago Nah man this isn't the Dems anymore. The Republicans have the power to open the government and they're keeping it closed because it's hurting Trump and they know it. permalink award report block reply\nMAGA_APN 2 points 6 days ago Shut down private flights of congress permalink award report block reply\nf_bastiat 2 points 6 days ago I haven't been on a plane in 20 years, I am grateful my family hates the idea of traveling anywhere, we are happy in our home and in our community. permalink award report block reply\nkeeman 2 points 6 days ago Maybe putting the fedgov in charge of this wasn't just unconstitutional but also a bad practical idea? permalink award report block reply\nMcrumples 1 points 6 days ago Please just keep it closed til December. Pleade just long enough for the mass firings permalink award report block reply\nSnowdone 1 points 6 days ago It’s quite simple. The money they want is to fund voter fraud illegals so they can vote and Brown Shirts. Since they know they can’t win without those they ar paying you back for not siding with them. In 1776 the discussions were over with a hostile entity. It needs to happen again. permalink award report block reply\nPapabravo12 1 points 6 days ago Good permalink award report block reply\nSomebody157 1 points 6 days ago Escape from New York is Real! permalink award report block reply\nSimaYi 1 points 6 days ago Doesn't affect me at all, and therefore I do not give a fuck. permalink award report block reply\nLib_Women_Have_HSV 1 points 6 days ago I thought the shut down was going to end yesterday according to this site permalink award report block reply\nBadBrainsBuzzcocks 1 points 6 days ago Don't live in a fantasy land. We'll get blamed for this shutdown because Republicans suck. MTG is a fraud. Whining for Obamacare....we hardly mention the fact this is the same funding the Dems approved 2 yrs ago and they voted for the end to the subsidies. The republitards will fuck this up count on it. permalink award report block reply\nEruditio 1 points 6 days ago Good! It's past the time that the voters feel the PAIN for voting for Democrats! permalink award report block reply stealthboy 4 points 6 days ago They will never in a hundred years actually make the connection that it is the fault of the Democrats. permalink parent award report block reply\nstealthboy 4 points 6 days ago They will never in a hundred years actually make the connection that it is the fault of the Democrats. permalink parent award report block reply\nDev404 1 points 6 days ago That's fine by me, people want to pay more attention to fagball and planning vacations more than what's going on across the country. Let them delay or lose their flights, they deserve it. It's not the time to keep fucking around. permalink award report block reply\nyodayoda 1 points 6 days ago 😅🍿 permalink award report block reply\nTrumpYouMagaFrenner 1 points 6 days ago Its making my dick harder permalink award report block reply\nCuetardian 1 points 6 days ago At first, just cancelling ten percent of the flights didn't sound like much. But apparently that's going to cause such a ripple effect that it's going to cause a much greater cancellation rate. Fine with me. permalink award report block reply\ndumbcomputerguy 0 points 6 days ago Good.  Less carbon emissions.  nobody really needs to move that fast anyways.  i have not been on a plane in 20 years.  ive seen what goes on in those public spaces these days.  i see no need to fly ever again.  its a shitty industry propped up by government. fuck em permalink award report block reply",
  "fetched_at": "2025-11-12T23:09:09.517132Z"
}