{
  "id": "1ARK52CFxB",
  "url": "https://patriots.win/p/1ARK52CFxB/angelina-jolie-made-a-pr-tour-to/c",
  "content": "323 Angelina Jolie made a PR tour to Ukraine but it didn't go well.  During her visit to Kherson, her bodyguard was snatched and sent to the military conscription center. 🤣 🤡🌎  HONK  HONK  🌎🤡 posted 6 days ago by sorrytodisagree 13 comments award share report block Spetsnaℤ 007 🇷🇺 @Alex_Oloyede2 • 7d 🇺🇦🇺🇸 American actress Angelina Jolie made a PR tour to Ukraine but it didn't go well. During her visit to Kherson, her bodyguard was snatched and sent to the military conscription center. After hours, she had to personally go there to release him. What a clown show of a nation.\n13 comments Sort by Top Top New Worst Old Save Around the Web Hair Grows Back in A Few Days! At Any Stage of Baldness HaloGrow Midsouth 14 points 6 days ago Oh!  So there are exemptions to military slavery.  Good to know!  I guess the lesson here is to not go outside without your celebrity. permalink award report block reply patrioticwinning3 8 points 6 days ago Lol XD Too bad all the kids are White, otherwise the cunt might adopt one :p permalink award report block reply Trooph-Hurts 4 points 6 days ago won’t be seeing him ever again permalink award report block reply VirtusHonos 3 points 6 days ago Brad looking younger and happier, Angelina aging pretty fast - when was her last film? permalink award report block reply MakeFloridaRed 4 points 6 days ago She looks hideous. No wonder they wouldn’t take her too. permalink parent award report block reply Reefay 3 points 6 days ago I don't know they could put her on the front lines and that face would probably scare half of the Russian army permalink parent award report block reply fasterthanspeedofdum 3 points 6 days ago Angelina Jolie should volunteer to fight for Ukraine while cosplaying as Tomb Raider. permalink parent award report block reply 2025WhatIsTrue 3 points 6 days ago LOL!  I wonder how long until he is \"gone\". permalink award report block reply Gildoom 1 points 5 days ago Ukraine is totally winning guys. permalink award report block reply henri_derelicte -9 points 6 days ago …according to a Russian propaganda account permalink award report block reply sorrytodisagree OP 8 points 6 days ago Well the NYT is less trustworthy than a rando russian propaganda account but maybe you'll believe them?  Or are you more of a CNN fan? permalink parent award report block reply assblast -4 points 6 days ago \"look my point is backed up by CNN and the NYT\" you're not making the argument you think you are permalink parent award report block reply sorrytodisagree OP 6 points 6 days ago What point? What argument? Facts are facts. It's you and henri_derelicte failing to make a point. permalink parent award report block reply Givesgunstogrannies 4 points 6 days ago Should have known that one of the biggest Israel shills here is also shilling for Ukraine.  HD is a fag permalink parent award report block reply\nMidsouth 14 points 6 days ago Oh!  So there are exemptions to military slavery.  Good to know!  I guess the lesson here is to not go outside without your celebrity. permalink award report block reply\npatrioticwinning3 8 points 6 days ago Lol XD Too bad all the kids are White, otherwise the cunt might adopt one :p permalink award report block reply\nTrooph-Hurts 4 points 6 days ago won’t be seeing him ever again permalink award report block reply\nVirtusHonos 3 points 6 days ago Brad looking younger and happier, Angelina aging pretty fast - when was her last film? permalink award report block reply MakeFloridaRed 4 points 6 days ago She looks hideous. No wonder they wouldn’t take her too. permalink parent award report block reply Reefay 3 points 6 days ago I don't know they could put her on the front lines and that face would probably scare half of the Russian army permalink parent award report block reply fasterthanspeedofdum 3 points 6 days ago Angelina Jolie should volunteer to fight for Ukraine while cosplaying as Tomb Raider. permalink parent award report block reply\nMakeFloridaRed 4 points 6 days ago She looks hideous. No wonder they wouldn’t take her too. permalink parent award report block reply Reefay 3 points 6 days ago I don't know they could put her on the front lines and that face would probably scare half of the Russian army permalink parent award report block reply\nReefay 3 points 6 days ago I don't know they could put her on the front lines and that face would probably scare half of the Russian army permalink parent award report block reply\nfasterthanspeedofdum 3 points 6 days ago Angelina Jolie should volunteer to fight for Ukraine while cosplaying as Tomb Raider. permalink parent award report block reply\n2025WhatIsTrue 3 points 6 days ago LOL!  I wonder how long until he is \"gone\". permalink award report block reply\nGildoom 1 points 5 days ago Ukraine is totally winning guys. permalink award report block reply\nhenri_derelicte -9 points 6 days ago …according to a Russian propaganda account permalink award report block reply sorrytodisagree OP 8 points 6 days ago Well the NYT is less trustworthy than a rando russian propaganda account but maybe you'll believe them?  Or are you more of a CNN fan? permalink parent award report block reply assblast -4 points 6 days ago \"look my point is backed up by CNN and the NYT\" you're not making the argument you think you are permalink parent award report block reply sorrytodisagree OP 6 points 6 days ago What point? What argument? Facts are facts. It's you and henri_derelicte failing to make a point. permalink parent award report block reply Givesgunstogrannies 4 points 6 days ago Should have known that one of the biggest Israel shills here is also shilling for Ukraine.  HD is a fag permalink parent award report block reply\nsorrytodisagree OP 8 points 6 days ago Well the NYT is less trustworthy than a rando russian propaganda account but maybe you'll believe them?  Or are you more of a CNN fan? permalink parent award report block reply assblast -4 points 6 days ago \"look my point is backed up by CNN and the NYT\" you're not making the argument you think you are permalink parent award report block reply sorrytodisagree OP 6 points 6 days ago What point? What argument? Facts are facts. It's you and henri_derelicte failing to make a point. permalink parent award report block reply Givesgunstogrannies 4 points 6 days ago Should have known that one of the biggest Israel shills here is also shilling for Ukraine.  HD is a fag permalink parent award report block reply\nassblast -4 points 6 days ago \"look my point is backed up by CNN and the NYT\" you're not making the argument you think you are permalink parent award report block reply sorrytodisagree OP 6 points 6 days ago What point? What argument? Facts are facts. It's you and henri_derelicte failing to make a point. permalink parent award report block reply Givesgunstogrannies 4 points 6 days ago Should have known that one of the biggest Israel shills here is also shilling for Ukraine.  HD is a fag permalink parent award report block reply\nsorrytodisagree OP 6 points 6 days ago What point? What argument? Facts are facts. It's you and henri_derelicte failing to make a point. permalink parent award report block reply Givesgunstogrannies 4 points 6 days ago Should have known that one of the biggest Israel shills here is also shilling for Ukraine.  HD is a fag permalink parent award report block reply\nGivesgunstogrannies 4 points 6 days ago Should have known that one of the biggest Israel shills here is also shilling for Ukraine.  HD is a fag permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:16:11.483330Z"
}