{
  "id": "1ARK57t3Io",
  "url": "https://patriots.win/p/1ARK57t3Io/got-shot-by-alleged-pipe-bomber-/c",
  "content": "563 \"Got shot by alleged pipe bomber. Alleged Pipe bomber testified against me at trial.... Alleged Pipe bomber speaks at sentencing and calls me a terrorist, a domestic terrorist.\" posted 4 days ago by Capoditutticapi1 11 comments award share report block Guy Reffitt @GuyReffittJ6 • 4d Got shot by alleged pipe bomber. Alleged Pipe bomber testified against me at trial. Alleged Pipe bomber speaks at sentencing and calls me a terrorist, a domestic terrorist. You can’t make this 💩 up, it’s just too rich. Wait, shouldn’t I be getting rich 🤑\n11 comments Sort by Top Top New Worst Old Save Taylor3006 37 points 4 days ago We don't hate them as much as they hate us. That needs to change. permalink award report block reply Capoditutticapi1 OP 16 points 4 days ago True... permalink parent award report block reply skuts 7 points 4 days ago They hate us because they fear us. permalink parent award report block reply Capoditutticapi1 OP 3 points 4 days ago True! permalink parent award report block reply GodIsPerfect 3 points 4 days ago They hate us because they love death. permalink parent award report block reply skuts 2 points 4 days ago Between all the abortions, suicides and murder, you'd think there would be hardly any of them left, yet they multiply like cockroaches, permalink parent award report block reply patrioticwinning3 16 points 4 days ago There is NO JUSTICE that is the problem.  They are allowed to commit all these crimes and our Justice system tries to gaslight us that if we hold them accountable to their crimes they will \"use lawfare against us.\"  They are going to do that either way morons, BRING BACK JUSTICE! permalink parent award report block reply Lol_Garrus 29 points 4 days ago Remember those four capitol police officers who committed \"suicide?\" What did they know? permalink award report block reply deleted 11 points 4 days ago 45fan 8 points 4 days ago Yep there is no way Ms. SoccerDyke made the devices and plotted this herself. permalink parent award report block reply Maxmax 10 points 4 days ago Mr. Reffitt, hold your fire.  Than sue the shit out of her and the US Department of Justice, including the Federal Bureau of Investigation. permalink award report block reply\nTaylor3006 37 points 4 days ago We don't hate them as much as they hate us. That needs to change. permalink award report block reply Capoditutticapi1 OP 16 points 4 days ago True... permalink parent award report block reply skuts 7 points 4 days ago They hate us because they fear us. permalink parent award report block reply Capoditutticapi1 OP 3 points 4 days ago True! permalink parent award report block reply GodIsPerfect 3 points 4 days ago They hate us because they love death. permalink parent award report block reply skuts 2 points 4 days ago Between all the abortions, suicides and murder, you'd think there would be hardly any of them left, yet they multiply like cockroaches, permalink parent award report block reply patrioticwinning3 16 points 4 days ago There is NO JUSTICE that is the problem.  They are allowed to commit all these crimes and our Justice system tries to gaslight us that if we hold them accountable to their crimes they will \"use lawfare against us.\"  They are going to do that either way morons, BRING BACK JUSTICE! permalink parent award report block reply\nCapoditutticapi1 OP 16 points 4 days ago True... permalink parent award report block reply skuts 7 points 4 days ago They hate us because they fear us. permalink parent award report block reply Capoditutticapi1 OP 3 points 4 days ago True! permalink parent award report block reply GodIsPerfect 3 points 4 days ago They hate us because they love death. permalink parent award report block reply skuts 2 points 4 days ago Between all the abortions, suicides and murder, you'd think there would be hardly any of them left, yet they multiply like cockroaches, permalink parent award report block reply\nskuts 7 points 4 days ago They hate us because they fear us. permalink parent award report block reply Capoditutticapi1 OP 3 points 4 days ago True! permalink parent award report block reply GodIsPerfect 3 points 4 days ago They hate us because they love death. permalink parent award report block reply skuts 2 points 4 days ago Between all the abortions, suicides and murder, you'd think there would be hardly any of them left, yet they multiply like cockroaches, permalink parent award report block reply\nCapoditutticapi1 OP 3 points 4 days ago True! permalink parent award report block reply\nGodIsPerfect 3 points 4 days ago They hate us because they love death. permalink parent award report block reply skuts 2 points 4 days ago Between all the abortions, suicides and murder, you'd think there would be hardly any of them left, yet they multiply like cockroaches, permalink parent award report block reply\nskuts 2 points 4 days ago Between all the abortions, suicides and murder, you'd think there would be hardly any of them left, yet they multiply like cockroaches, permalink parent award report block reply\npatrioticwinning3 16 points 4 days ago There is NO JUSTICE that is the problem.  They are allowed to commit all these crimes and our Justice system tries to gaslight us that if we hold them accountable to their crimes they will \"use lawfare against us.\"  They are going to do that either way morons, BRING BACK JUSTICE! permalink parent award report block reply\nLol_Garrus 29 points 4 days ago Remember those four capitol police officers who committed \"suicide?\" What did they know? permalink award report block reply deleted 11 points 4 days ago 45fan 8 points 4 days ago Yep there is no way Ms. SoccerDyke made the devices and plotted this herself. permalink parent award report block reply\ndeleted 11 points 4 days ago 45fan 8 points 4 days ago Yep there is no way Ms. SoccerDyke made the devices and plotted this herself. permalink parent award report block reply\n45fan 8 points 4 days ago Yep there is no way Ms. SoccerDyke made the devices and plotted this herself. permalink parent award report block reply\nMaxmax 10 points 4 days ago Mr. Reffitt, hold your fire.  Than sue the shit out of her and the US Department of Justice, including the Federal Bureau of Investigation. permalink award report block reply",
  "fetched_at": "2025-11-12T20:40:02.808554Z"
}