{
  "id": "8185526",
  "title": "399Contact President Trump and let him know how you feel about H-1Bs(www.whitehouse.gov)posted2 hour",
  "url": "https://patriots.win/p/1ARK9nP4xq/contact-president-trump-and-let-/c",
  "content": "782 Contact President Trump and let him know how you feel about H-1Bs (www.whitehouse.gov) posted 7 hours ago by PepeWashington 122 comments award share report block Contact Us Share your thoughts with President Donald J. Trump and Vice President JD Vance. www.whitehouse.gov\n122 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style fallhollow 111 points 6 hours ago this should be a permanent sticky permalink award report block reply PepeWashington OP 39 points 6 hours ago As OP I cannot legally endorse this message. permalink parent award report block reply CrossTheRubixCube 26 points 6 hours ago Has any of the Chinese student or H-1B been stickied? permalink parent award report block reply MissingTrump 17 points 5 hours ago Not that I saw. Neither have a lot of the EBT news. But hey, lots of shit from the UK. Because reasons. permalink parent award report block reply rebuildingMyself 2 points 4 hours ago While maybe not good for stickies, it's important to pay some attention to UK because that's exactly where the Uniparty wants us to be. permalink parent award report block reply flashersenpai 5 points 5 hours ago no, only way earlier this year then poofed for a new batch of stickies of facebook memes permalink parent award report block reply Drekken- 3 points 4 hours ago They don't sticky negative news. Ever. The man is human, he will have missteps. We are allowed to criticize them and try to help him correct his path. This post got me to send a message to Trump. Good post. Hopefully he reads them or someone that can get to him. permalink parent award report block reply MissingTrump 12 points 5 hours ago Agreed. Also. I did my part. How about you? Be respectful and do your duty. permalink parent award report block reply mikethemarine 4 points 5 hours ago I submitted my letter permalink parent award report block reply congruent 0 points 4 hours ago Dear long-time Trump supporters. Did you or did you not read Sun-Tzu's the art of war? Trump is playing the long game. One very real possibility: By saying \"yay H-1Bs\" Trump presents a target to his enemies. His divided base. N.B. a target of HIS OWN CHOOSING! Entirely possible, even probable, that he wants the country and his enemies focused on this issue while he continues to plan and scheme to make America great. And there are many, many other possibilities. Eg, making a deal with India which ends the threat China poses to the world. Eg 2, posturing that you're making a deal with India to make China play their trump card (no relation) before they're read. And many, many, many other scenarios that we probably can't even imagine. permalink parent award report block reply fallhollow 3 points 4 hours ago it will amount to nothing if we lose the midterms permalink parent award report block reply congruent 0 points 3 hours ago This could be part of winning the midterms. It's not like this issue and its fallout and corollaries is stuck in this one position now forever. It can and will change many times between now and Nov 2016. And not even clear if \"winning the midterms\" is that important. None of those elected officials have any power. They're just names on doors. If Trump has their donors cowed, doesn't matter who gets elected. permalink parent award report block reply Drekken- 2 points 4 hours ago Stop it. He's the best President of our lifetime but let's not pretend he doesn't get bad advice and runs with it. The Chinese students and H1B comments were devistating to anyone that has supported him. I thought he knew his base better. I'll give him the benefit of a doubt but don't pretend like this isnt a huge fuck up. permalink parent award report block reply Repentnow 1 points 2 hours ago If Trump were to solve a trillion dollar trade deficit and shore up the USD remaining as the global reserve currency by accepting a few hundred F-1 Chinese students, that would be an incredibly good deal.  The GOP loses perpetually because they are idealist and purists. Trump is neither. That is why, for the first time since the New Deal, we are turning the ship around.  Stay the course. Trump's worst deal is 100 times better than Kamala or Jeb. permalink parent award report block reply Drekken- 2 points 1 hour ago I'm in it to win it. We should be able to give input and show happiness or disappointment. I see a lot of people being attacked. I'm sure I'll get hate, but you are right. permalink parent award report block reply congruent 1 points 3 hours ago It's a strategic decision from the most strategically gifted president in 50 years, maybe the entire nation's history. permalink parent award report block reply Repentnow 1 points 2 hours ago 👆 permalink parent award report block reply PepeWashington OP 57 points 7 hours ago Please be civil. It can make for a stronger message, especially en mass. permalink award report block reply NebraskanPatriot 5 points 4 hours ago Im way too angry to be civil.  This is betrayal.  This is Anti-American. permalink parent award report block reply Coprolite 4 points 4 hours ago Ok 7 day old handshake permalink parent award report block reply anishr -5 points 53 minutes ago Please be civil? This forum is full of uncivilized racist people. White Americans need to stop whining about stolen jobs and work harder. Maybe if you get properly educated and work hard, you can join the workforce. In good old fashioned capitalism style. Funny how the group that rails against govt handouts wants the govt to handout jobs despite being lesser qualified. permalink parent award report block reply PMSocks 40 points 5 hours ago Trump needs a rally so we can boo him like we did for the vax permalink award report block reply IncredibleMrE1 22 points 5 hours ago Not gonna happen anytime soon. Susie won't allow it, even if the SS managed to get its shit together. Muh Butler, Muh UVU. She has successfully cut him off from the base and isn't going to let him reestablish a connection if she can help it. permalink parent award report block reply Ryanaissance 16 points 5 hours ago He should've stuck with Bannon. permalink parent award report block reply awookienookie 8 points 4 hours ago Susie Wiles - White House chief of staff, dual citizenship with isreal. Jew permalink parent award report block reply SteveRogers42 1 points 37 minutes ago Her father is Pat Summerall. permalink parent award report block reply Zedd2 1 points 5 hours ago Who’s susie permalink parent award report block reply someguy7738 16 points 5 hours ago Trump's Chief of Staff and apparently a former staffer for Netanyahu... So basically Trump's AIPAC handler, so I've heard. permalink parent award report block reply Here_we_go 6 points 4 hours ago Also very good friends with bondi permalink parent award report block reply Ostia 2 points 4 hours ago Yeah, you should leave now. permalink parent award report block reply GayPatriotMAGAUncle 3 points 28 minutes ago I'm sure you libtards would love that. Nothing more MAGA than booing the man who made America great again possible. permalink parent award report block reply PMSocks 0 points 22 minutes ago Course correction is required. Most of us here like 2016 Trump - H1B Trump rubs us all the wrong way. permalink parent award report block reply berserkerbarrage -16 points 5 hours ago Wont happen. Most people outside of this website don't have TDS like you guys. permalink parent award report block reply GatoradeJeb 15 points 5 hours ago Fuck off to india pajeet permalink parent award report block reply Repentnow 4 points 4 hours ago It's always telling when these people come here and tells us what, \" you guys think\".  By contrast, actual MAGA says, \" we believe\". permalink parent award report block reply PMSocks 2 points 3 hours ago We are not a cult and if Nov 2025 turnout is an indicator  ... Trump is shedding the voters he worked really hard to get permalink parent award report block reply view 2 more comments... anishr -2 points 50 minutes ago Please be clear. Indians are ashamed to be “you guys”. I would rather die than be white. My culture is superior and you can choose to assimilate into superior merit, or fuck off back to Europe. “Actual MAGA” seems to believe that the group that’s supporting the dead US economy is somehow bad. Yeah. Make your country great again by throwing out the only productive people. I’m sure the illiterate whites who dropped out of high school can work in intelligent positions. permalink parent award report block reply view 1 more comments... CrossTheRubixCube 38 points 6 hours ago Sending now. Will be civil. permalink award report block reply Lol_Garrus 26 points 5 hours ago America is a country, not an economic zone. We are supposed to be a peoples of shared heritage, values, and beliefs. Not worker bees to be used as needed and disgarded when something cheaper comes along. permalink award report block reply Repentnow 6 points 5 hours ago That requires free market. Our current Neomercantilist system is a distorted departure from our nation's free market capitalism. permalink parent award report block reply anishr -2 points 48 minutes ago Your ancestors did not follow any of those principles by assimilating into the host country Most Indians and H1Bs actually do assimilate pretty well despite the fact that the host country’s culture is non-existent/worse. Despite assimilating and contributing way more than whites (double the average median household income), they still get looked down upon. permalink parent award report block reply Lol_Garrus 5 points 44 minutes ago okay, Pajeet. permalink parent award report block reply anishr -3 points 42 minutes ago Thanks. You just used an honorific that’s higher than “sir”. That just goes to show how retarded/illiterate you guys are. permalink parent award report block reply Grindelwald 18 points 7 hours ago Ok. Dear Mr. President.  I do not like foreigners taking jobs that Americans can do.  I do not like companies in America hiring cheap labor. But, since our educational system has been so bad for so long and we have an urgency for expertise, please limit it for temporary talent. Then fix the G*$ Damn schools and build talent here at home. permalink award report block reply auntjemima 26 points 5 hours ago I remember when lack of talent drove salaries up and led to college graduates migrating to said jobs to meet the demand.  Doesn't work that way with H1B's flooding the talent pool. permalink parent award report block reply _Sully_ 15 points 5 hours ago Yeah but now we have endless pajeets with fake degrees who think you're so fucking stupid for letting them get away with it. Haha only I redeem now!!! permalink parent award report block reply SpellingContable 9 points 4 hours ago There are 4 Jeets for every American, and also 4 Chinamen for every American. Economic course correction can never happen if even 2% of Chyna and India have access to the US job Market. permalink parent award report block reply StoneRealist 5 points 5 hours ago So did you send it or just post it here for upvotes? permalink parent award report block reply NamendaBiden 1 points 5 hours ago Legit question.  Updooted permalink parent award report block reply Viewer01 5 points 4 hours ago It’s just a full on lie. Almost every business that starts hires someone off the street and they figure it out as they go along. Go drag boomers out of retirement and have them teach. Saying we don’t know how to ship build while having the best navy is farcical. permalink parent award report block reply Grindelwald 4 points 4 hours ago Boomers for the win permalink parent award report block reply Parabellum76 12 points 5 hours ago Guys I’m utterly demoralized with this administration, it seems Trump has completely turned his back on his base and surrounded himself the Neocons and deep state elites. permalink award report block reply IncredibleMrE1 10 points 5 hours ago A lot of things changed when Charlie was murdered. permalink parent award report block reply Appeal2Heaven98 4 points 4 hours ago That seemed to be the turning point...and not the right one. permalink parent award report block reply Repentnow 1 points 4 hours ago That's BS.  It's a false narrative to make MAGA feel fractured. permalink parent award report block reply stealthboy 6 points 5 hours ago Nobody is going to save us.  The country we grew up in no longer exists and it never will again. permalink parent award report block reply GayPatriotMAGAUncle 3 points 27 minutes ago That's what the stormfags want you to believe. Only retards like you take the blackpill. permalink parent award report block reply GatoradeJeb 2 points 5 hours ago He openly hates White man and wants us replaced and dead permalink parent award report block reply MageGills 1 points 40 minutes ago Trump took a giant shit on Americans in that interview. He apparently thinks Americans don't have \"talent\".  What a patriotic thing to say. permalink parent award report block reply load 1 more comments... Repentnow 10 points 5 hours ago My President, Please reconsider your stance on H-1B visas. These are not being issued for highly skilled personnel.  I understand that you might be using immigration as a leverage position with India (H-1B visas) and China (F-1 visas), but if that is the case, please be transparent with your base. MAGA wants as close to zero immigration as possible.  This is non-negotiable to your MAGA base. The midterms will be a disaster if you ignore immigration. Respectfully, your most loyal constituent. permalink award report block reply Awan-CIA-Car-Lot 5 points 4 hours ago Excellent message 👍 permalink parent award report block reply Justjayce 2 points 11 minutes ago I steals.. Thank you permalink parent award report block reply anishr -4 points 46 minutes ago Just because you think they’re not highly skilled, doesn’t mean they aren’t. That’s not how capitalism works. I guess you guys just cannot fathom why other cultures like Indians are superior in many ways to your “culture”. permalink parent award report block reply Repentnow 2 points 38 minutes ago Then please, by all means go back to your superior culture and stfu. We literally hate you. permalink parent award report block reply NamendaBiden 8 points 5 hours ago Message sent.  Piece of cake.  EVERYONE needs to do this asap. permalink award report block reply rezimx 7 points 4 hours ago H1B is the dumbest shit ever.  There are Americans with tech skill sets that cant get jobs because they are being undercut by cheap foreign labor.  Tie the number of H1Bs to the number of US citizens in each field looking for work.  Lots of citizens = no H1Bs. permalink award report block reply Eyepatch_McCain 7 points 5 hours ago I'm a lot more concerned with offshoring right now. permalink award report block reply bejeavis 2 points 4 hours ago Two sides of the same coin permalink parent award report block reply mytummyhurts 6 points 5 hours ago I'm doing my part! permalink award report block reply h3xAd3c1m4L 6 points 5 hours ago “Lack of US based talent” my ass. permalink award report block reply UncleTrumpsBand 5 points 5 hours ago I did my part!! permalink award report block reply tarballs 5 points 5 hours ago Wrote a few paragraphs and copied them to the vice president as well. permalink award report block reply NYRepublican72 5 points 4 hours ago Done. The H1B program needs to go. permalink award report block reply Smegmaless2 5 points 5 hours ago Done permalink award report block reply Senaleb 5 points 5 hours ago Wrote him a lengthy paragraph on how there is not a shortage of tech workers in this country and I know this from experience. permalink award report block reply For_All_Mankind 5 points 5 hours ago Contact his Jew handlers permalink award report block reply aphoticamy 4 points 5 hours ago DONE! Mods sticky this or PEDES, repost daily asking us to message him about something different that needs to happen. Next time maybe about doing something on the rogue judiciary permalink award report block reply YaharaRiver 4 points 6 hours ago Muslims: We see it as OUR country now.  We have the prophet’s command to HONOR-KILL YOU! permalink award report block reply Goozmania 4 points 5 hours ago Oh, I let them have it. permalink award report block reply Ryanaissance 4 points 5 hours ago This is the issue that first got me into politics.  They say get a physics degree, we have a severe shortage.  Yet the university is making deals with industry to place their F1/OPT intl students and ignoring domestic.  Going to industry for jobs,  even with professor's inside contacts, will just teach you about H1B.  Get around that, you still have to overcome DEI hiring policies. permalink award report block reply MkultraUSA 3 points 4 hours ago I did it pede! Thanks for the reminder. permalink award report block reply Scot 3 points 4 hours ago Submitted my letter. permalink award report block reply ACActual 3 points 5 hours ago Called him a Rino sell out.  Hope it gets under his skin permalink award report block reply dude_bro 3 points 4 hours ago Commented-  fed up permalink award report block reply Ostia 3 points 4 hours ago Sent. permalink award report block reply GayPatriotMAGAUncle 3 points 35 minutes ago No serious person has issues with H-1B's other than stormfags. Life isn't the internet, retard. Go outside. permalink award report block reply Danofdestiny 3 points 5 hours ago Done. permalink award report block reply call-it-like-i-sees 3 points 5 hours ago done - I wrote his words back to him.  Let's see what Trump and Noem do with this. permalink award report block reply Tacitus1963 2 points 1 hour ago I just sent a lengthy comment using this WH site. permalink award report block reply barwhack 2 points 5 hours ago Do it. He'll Epstard, but do it anyway. Maybe God will bloody give FURTHER weight to the words. permalink award report block reply BTWiuseArch25 2 points 5 hours ago OP I would recommend that you add \"in a civil manor\" to your title. permalink award report block reply TheJakeFroggy 2 points 4 hours ago For a bit of nuance, I remember when Trump used to push for the covid vaccines, and then eventually stopped doing that after he was booed in a rally about it. I even heard that someone directly confronted him about the covid vaccines and told him the truth about it, and it horrified him. Which shows that he has listened to his base before, theoretically we'd just have to do the same about the Chinese student issues and the H-1B issue. permalink award report block reply ILoveSilk 1 points 2 hours ago Can you write a template for us? permalink award report block reply redditadminssuckit 1 points 5 hours ago This is a good post. I'm tired of the whining here on this forum and the complete lack of gratitude for the things Trump has accomplished. He's not perfect and he's going to make mistakes, but he's the closest thing to a perfect president that you will ever see in your life. So, if you have something critical to say, have some fucking balls and say it to him directly on the White House website. This site is not intended to be a non-stop doomer whine fest about every Trump misstep permalink award report block reply Appeal2Heaven98 8 points 5 hours ago It's a free country, dude. We can complain wherever we want, especially when we feel betrayed. That being said, this is a way we can (hopefully) get our message through to him. permalink parent award report block reply redditadminssuckit 5 points 5 hours ago Understood but that's not what I'm seeing here. People are basically saying that Trump played us, they're not just saying he's making a mistake or he shouldn't be doing this or that. They're basically completely turning on him and those are the kind of posts I'm talking about. permalink parent award report block reply Appeal2Heaven98 2 points 5 hours ago I understand that Doomerism won't solve anything. But some people will call some of us antisemites for questioning why we're giving funds to Israel. People will call us liars when we point out that groceries are still expensive (and have increased in price), all because Trump said that they're more affordable in a tweet. He's done so well in many cases, but has fumbled so much that it's become difficult for many of us not to feel like he's played us. I don't think he has; we're asking one man to basically become a dictator for many of the things we're asking for, and what he's up against. The problem is that this place is so high-energy and intense that if Trump doesn't give us 100% what we want, he's compromised. Or, if he says something that we point out is against what his initial beliefs and promises were, we get the response, \"Are you against Trump? Cry more, faggot.\" permalink parent award report block reply redditadminssuckit 3 points 5 hours ago You're forgetting he's only been in office actually working for about 9 months. You're forgetting the pardoning of the January 6th defendants, the appointment of headsseth and the purging of our military, the elimination of a variety of money laundering and wasteful agencies with the help of musk, the elimination of the Department of education, the pulling of funding from transgender ideology universities essentially reversing that trend. You've completely forgotten the influence he has had on private Industry and eliminating their DEI programs, I can go on and on and on. Jesus people support our president or get the hell off of this website. A complaining is fine but acting as though he's failing us overall is just wrong permalink parent award report block reply NebraskanPatriot 0 points 4 hours ago He knows how you feel.  But, he already tricked you out of your vote, so you've been discarded.  Back to the Globalist Agenda, folks. permalink parent award report block reply aphoticamy 4 points 5 hours ago LOVE this post. Sent a respectful, short and to the point message. This post needs to be stickied and if not re-posted daily. As often as I see it I'll message him permalink parent award report block reply 1DontTreadOnMe1 1 points 5 hours ago I think it's gonna rain when I die. permalink award report block reply ItsFunToSay-M-A-G-A 5 points 4 hours ago President Trump needs to dam that river of H-1Bs flooding into our country and deport ALL of the illegal invaders or else America is going to become a sea of sorrow. No excuses! permalink parent award report block reply 1DontTreadOnMe1 2 points 4 hours ago This guy Alice in Chains! permalink parent award report block reply ItsFunToSay-M-A-G-A 1 points 2 hours ago 😎🎸 permalink parent award report block reply ImYourHuckleberry24 1 points 4 hours ago He already knows what we think about this crap. He doesn't give one fuck. permalink award report block reply mohel -1 points 4 hours ago If he doesn't know that, what the fuck does his know? permalink award report block reply WarOfTheFanboys2 -1 points 4 hours ago You guys know Trump added a 100k fee for H1B visas, right? permalink award report block reply RockFlagAndEagle2020 -2 points 5 hours ago Trump went from being one of the best presidents in my life the first few months of his term to one of the worst. permalink award report block reply mav7579 5 points 5 hours ago Did you forget about BIDEN? permalink parent award report block reply RockFlagAndEagle2020 4 points 5 hours ago Deporting these people will do nothing since another president can come in and just let people in the border illegally and nothing will happen. Try again retard. He's done nothing to work with congress to fix our immigration system. He's brought no charges against these people in a meaningful way. He has not gone after any of the employers employing these illegals. I'd rather see the CEO of tyson foods perp walked , charged and convicted then some random ass beaners pulled off the streets giving democrats good PR. permalink parent award report block reply mav7579 1 points 4 hours ago What gives you the idea that congress is interested in fixing it? permalink parent award report block reply berserkerbarrage -2 points 5 hours ago Lol. H-1B has existed for over 35 years, and Trump has made it more difficult and expensive to abuse than ever before. Now he's \"one of the worst\" because he doesn't believe that we should take random, uneducated blacks off the unemployment line and have them start building missiles and car batteries. permalink parent award report block reply RockFlagAndEagle2020 4 points 5 hours ago I would shut the program down. Fuck you permalink parent award report block reply berserkerbarrage -1 points 5 hours ago No, you wouldn't, because you wouldn't have the authority. H-1B was created and can only be ended by Congress, and Trump is already being sued over the restrictions that he has implemented. permalink parent award report block reply try4gain PRO -2 points 4 hours ago the crashing out and crying all over social media is unreal today.  trump has always said 1 dumb thing per month then walked it back later. ffs are people literally brand new permalink award report block reply MoldyLocksNesMonste -2 points 5 hours ago Be careful, might put you on a list. Not being sarcastic. permalink award report block reply oldftg 11 points 5 hours ago Way too late to worry about that. permalink parent award report block reply Appeal2Heaven98 6 points 5 hours ago It's 2025. You're still worried about being placed on a list? We're all probably on a list for even being on this site. Give your balls a tug, you titfucker. permalink parent award report block reply mav7579 4 points 5 hours ago Donnie would do that? permalink parent award report block reply\nfallhollow 111 points 6 hours ago this should be a permanent sticky permalink award report block reply PepeWashington OP 39 points 6 hours ago As OP I cannot legally endorse this message. permalink parent award report block reply CrossTheRubixCube 26 points 6 hours ago Has any of the Chinese student or H-1B been stickied? permalink parent award report block reply MissingTrump 17 points 5 hours ago Not that I saw. Neither have a lot of the EBT news. But hey, lots of shit from the UK. Because reasons. permalink parent award report block reply rebuildingMyself 2 points 4 hours ago While maybe not good for stickies, it's important to pay some attention to UK because that's exactly where the Uniparty wants us to be. permalink parent award report block reply flashersenpai 5 points 5 hours ago no, only way earlier this year then poofed for a new batch of stickies of facebook memes permalink parent award report block reply Drekken- 3 points 4 hours ago They don't sticky negative news. Ever. The man is human, he will have missteps. We are allowed to criticize them and try to help him correct his path. This post got me to send a message to Trump. Good post. Hopefully he reads them or someone that can get to him. permalink parent award report block reply MissingTrump 12 points 5 hours ago Agreed. Also. I did my part. How about you? Be respectful and do your duty. permalink parent award report block reply mikethemarine 4 points 5 hours ago I submitted my letter permalink parent award report block reply congruent 0 points 4 hours ago Dear long-time Trump supporters. Did you or did you not read Sun-Tzu's the art of war? Trump is playing the long game. One very real possibility: By saying \"yay H-1Bs\" Trump presents a target to his enemies. His divided base. N.B. a target of HIS OWN CHOOSING! Entirely possible, even probable, that he wants the country and his enemies focused on this issue while he continues to plan and scheme to make America great. And there are many, many other possibilities. Eg, making a deal with India which ends the threat China poses to the world. Eg 2, posturing that you're making a deal with India to make China play their trump card (no relation) before they're read. And many, many, many other scenarios that we probably can't even imagine. permalink parent award report block reply fallhollow 3 points 4 hours ago it will amount to nothing if we lose the midterms permalink parent award report block reply congruent 0 points 3 hours ago This could be part of winning the midterms. It's not like this issue and its fallout and corollaries is stuck in this one position now forever. It can and will change many times between now and Nov 2016. And not even clear if \"winning the midterms\" is that important. None of those elected officials have any power. They're just names on doors. If Trump has their donors cowed, doesn't matter who gets elected. permalink parent award report block reply Drekken- 2 points 4 hours ago Stop it. He's the best President of our lifetime but let's not pretend he doesn't get bad advice and runs with it. The Chinese students and H1B comments were devistating to anyone that has supported him. I thought he knew his base better. I'll give him the benefit of a doubt but don't pretend like this isnt a huge fuck up. permalink parent award report block reply Repentnow 1 points 2 hours ago If Trump were to solve a trillion dollar trade deficit and shore up the USD remaining as the global reserve currency by accepting a few hundred F-1 Chinese students, that would be an incredibly good deal.  The GOP loses perpetually because they are idealist and purists. Trump is neither. That is why, for the first time since the New Deal, we are turning the ship around.  Stay the course. Trump's worst deal is 100 times better than Kamala or Jeb. permalink parent award report block reply Drekken- 2 points 1 hour ago I'm in it to win it. We should be able to give input and show happiness or disappointment. I see a lot of people being attacked. I'm sure I'll get hate, but you are right. permalink parent award report block reply congruent 1 points 3 hours ago It's a strategic decision from the most strategically gifted president in 50 years, maybe the entire nation's history. permalink parent award report block reply Repentnow 1 points 2 hours ago 👆 permalink parent award report block reply\nPepeWashington OP 39 points 6 hours ago As OP I cannot legally endorse this message. permalink parent award report block reply\nCrossTheRubixCube 26 points 6 hours ago Has any of the Chinese student or H-1B been stickied? permalink parent award report block reply MissingTrump 17 points 5 hours ago Not that I saw. Neither have a lot of the EBT news. But hey, lots of shit from the UK. Because reasons. permalink parent award report block reply rebuildingMyself 2 points 4 hours ago While maybe not good for stickies, it's important to pay some attention to UK because that's exactly where the Uniparty wants us to be. permalink parent award report block reply flashersenpai 5 points 5 hours ago no, only way earlier this year then poofed for a new batch of stickies of facebook memes permalink parent award report block reply Drekken- 3 points 4 hours ago They don't sticky negative news. Ever. The man is human, he will have missteps. We are allowed to criticize them and try to help him correct his path. This post got me to send a message to Trump. Good post. Hopefully he reads them or someone that can get to him. permalink parent award report block reply\nMissingTrump 17 points 5 hours ago Not that I saw. Neither have a lot of the EBT news. But hey, lots of shit from the UK. Because reasons. permalink parent award report block reply rebuildingMyself 2 points 4 hours ago While maybe not good for stickies, it's important to pay some attention to UK because that's exactly where the Uniparty wants us to be. permalink parent award report block reply\nrebuildingMyself 2 points 4 hours ago While maybe not good for stickies, it's important to pay some attention to UK because that's exactly where the Uniparty wants us to be. permalink parent award report block reply\nflashersenpai 5 points 5 hours ago no, only way earlier this year then poofed for a new batch of stickies of facebook memes permalink parent award report block reply\nDrekken- 3 points 4 hours ago They don't sticky negative news. Ever. The man is human, he will have missteps. We are allowed to criticize them and try to help him correct his path. This post got me to send a message to Trump. Good post. Hopefully he reads them or someone that can get to him. permalink parent award report block reply\nMissingTrump 12 points 5 hours ago Agreed. Also. I did my part. How about you? Be respectful and do your duty. permalink parent award report block reply\nmikethemarine 4 points 5 hours ago I submitted my letter permalink parent award report block reply\ncongruent 0 points 4 hours ago Dear long-time Trump supporters. Did you or did you not read Sun-Tzu's the art of war? Trump is playing the long game. One very real possibility: By saying \"yay H-1Bs\" Trump presents a target to his enemies. His divided base. N.B. a target of HIS OWN CHOOSING! Entirely possible, even probable, that he wants the country and his enemies focused on this issue while he continues to plan and scheme to make America great. And there are many, many other possibilities. Eg, making a deal with India which ends the threat China poses to the world. Eg 2, posturing that you're making a deal with India to make China play their trump card (no relation) before they're read. And many, many, many other scenarios that we probably can't even imagine. permalink parent award report block reply fallhollow 3 points 4 hours ago it will amount to nothing if we lose the midterms permalink parent award report block reply congruent 0 points 3 hours ago This could be part of winning the midterms. It's not like this issue and its fallout and corollaries is stuck in this one position now forever. It can and will change many times between now and Nov 2016. And not even clear if \"winning the midterms\" is that important. None of those elected officials have any power. They're just names on doors. If Trump has their donors cowed, doesn't matter who gets elected. permalink parent award report block reply Drekken- 2 points 4 hours ago Stop it. He's the best President of our lifetime but let's not pretend he doesn't get bad advice and runs with it. The Chinese students and H1B comments were devistating to anyone that has supported him. I thought he knew his base better. I'll give him the benefit of a doubt but don't pretend like this isnt a huge fuck up. permalink parent award report block reply Repentnow 1 points 2 hours ago If Trump were to solve a trillion dollar trade deficit and shore up the USD remaining as the global reserve currency by accepting a few hundred F-1 Chinese students, that would be an incredibly good deal.  The GOP loses perpetually because they are idealist and purists. Trump is neither. That is why, for the first time since the New Deal, we are turning the ship around.  Stay the course. Trump's worst deal is 100 times better than Kamala or Jeb. permalink parent award report block reply Drekken- 2 points 1 hour ago I'm in it to win it. We should be able to give input and show happiness or disappointment. I see a lot of people being attacked. I'm sure I'll get hate, but you are right. permalink parent award report block reply congruent 1 points 3 hours ago It's a strategic decision from the most strategically gifted president in 50 years, maybe the entire nation's history. permalink parent award report block reply Repentnow 1 points 2 hours ago 👆 permalink parent award report block reply\nfallhollow 3 points 4 hours ago it will amount to nothing if we lose the midterms permalink parent award report block reply congruent 0 points 3 hours ago This could be part of winning the midterms. It's not like this issue and its fallout and corollaries is stuck in this one position now forever. It can and will change many times between now and Nov 2016. And not even clear if \"winning the midterms\" is that important. None of those elected officials have any power. They're just names on doors. If Trump has their donors cowed, doesn't matter who gets elected. permalink parent award report block reply\ncongruent 0 points 3 hours ago This could be part of winning the midterms. It's not like this issue and its fallout and corollaries is stuck in this one position now forever. It can and will change many times between now and Nov 2016. And not even clear if \"winning the midterms\" is that important. None of those elected officials have any power. They're just names on doors. If Trump has their donors cowed, doesn't matter who gets elected. permalink parent award report block reply\nDrekken- 2 points 4 hours ago Stop it. He's the best President of our lifetime but let's not pretend he doesn't get bad advice and runs with it. The Chinese students and H1B comments were devistating to anyone that has supported him. I thought he knew his base better. I'll give him the benefit of a doubt but don't pretend like this isnt a huge fuck up. permalink parent award report block reply Repentnow 1 points 2 hours ago If Trump were to solve a trillion dollar trade deficit and shore up the USD remaining as the global reserve currency by accepting a few hundred F-1 Chinese students, that would be an incredibly good deal.  The GOP loses perpetually because they are idealist and purists. Trump is neither. That is why, for the first time since the New Deal, we are turning the ship around.  Stay the course. Trump's worst deal is 100 times better than Kamala or Jeb. permalink parent award report block reply Drekken- 2 points 1 hour ago I'm in it to win it. We should be able to give input and show happiness or disappointment. I see a lot of people being attacked. I'm sure I'll get hate, but you are right. permalink parent award report block reply congruent 1 points 3 hours ago It's a strategic decision from the most strategically gifted president in 50 years, maybe the entire nation's history. permalink parent award report block reply Repentnow 1 points 2 hours ago 👆 permalink parent award report block reply\nRepentnow 1 points 2 hours ago If Trump were to solve a trillion dollar trade deficit and shore up the USD remaining as the global reserve currency by accepting a few hundred F-1 Chinese students, that would be an incredibly good deal.  The GOP loses perpetually because they are idealist and purists. Trump is neither. That is why, for the first time since the New Deal, we are turning the ship around.  Stay the course. Trump's worst deal is 100 times better than Kamala or Jeb. permalink parent award report block reply Drekken- 2 points 1 hour ago I'm in it to win it. We should be able to give input and show happiness or disappointment. I see a lot of people being attacked. I'm sure I'll get hate, but you are right. permalink parent award report block reply\nDrekken- 2 points 1 hour ago I'm in it to win it. We should be able to give input and show happiness or disappointment. I see a lot of people being attacked. I'm sure I'll get hate, but you are right. permalink parent award report block reply\ncongruent 1 points 3 hours ago It's a strategic decision from the most strategically gifted president in 50 years, maybe the entire nation's history. permalink parent award report block reply Repentnow 1 points 2 hours ago 👆 permalink parent award report block reply\nRepentnow 1 points 2 hours ago 👆 permalink parent award report block reply\nPepeWashington OP 57 points 7 hours ago Please be civil. It can make for a stronger message, especially en mass. permalink award report block reply NebraskanPatriot 5 points 4 hours ago Im way too angry to be civil.  This is betrayal.  This is Anti-American. permalink parent award report block reply Coprolite 4 points 4 hours ago Ok 7 day old handshake permalink parent award report block reply anishr -5 points 53 minutes ago Please be civil? This forum is full of uncivilized racist people. White Americans need to stop whining about stolen jobs and work harder. Maybe if you get properly educated and work hard, you can join the workforce. In good old fashioned capitalism style. Funny how the group that rails against govt handouts wants the govt to handout jobs despite being lesser qualified. permalink parent award report block reply\nNebraskanPatriot 5 points 4 hours ago Im way too angry to be civil.  This is betrayal.  This is Anti-American. permalink parent award report block reply Coprolite 4 points 4 hours ago Ok 7 day old handshake permalink parent award report block reply\nCoprolite 4 points 4 hours ago Ok 7 day old handshake permalink parent award report block reply\nanishr -5 points 53 minutes ago Please be civil? This forum is full of uncivilized racist people. White Americans need to stop whining about stolen jobs and work harder. Maybe if you get properly educated and work hard, you can join the workforce. In good old fashioned capitalism style. Funny how the group that rails against govt handouts wants the govt to handout jobs despite being lesser qualified. permalink parent award report block reply\nPMSocks 40 points 5 hours ago Trump needs a rally so we can boo him like we did for the vax permalink award report block reply IncredibleMrE1 22 points 5 hours ago Not gonna happen anytime soon. Susie won't allow it, even if the SS managed to get its shit together. Muh Butler, Muh UVU. She has successfully cut him off from the base and isn't going to let him reestablish a connection if she can help it. permalink parent award report block reply Ryanaissance 16 points 5 hours ago He should've stuck with Bannon. permalink parent award report block reply awookienookie 8 points 4 hours ago Susie Wiles - White House chief of staff, dual citizenship with isreal. Jew permalink parent award report block reply SteveRogers42 1 points 37 minutes ago Her father is Pat Summerall. permalink parent award report block reply Zedd2 1 points 5 hours ago Who’s susie permalink parent award report block reply someguy7738 16 points 5 hours ago Trump's Chief of Staff and apparently a former staffer for Netanyahu... So basically Trump's AIPAC handler, so I've heard. permalink parent award report block reply Here_we_go 6 points 4 hours ago Also very good friends with bondi permalink parent award report block reply Ostia 2 points 4 hours ago Yeah, you should leave now. permalink parent award report block reply GayPatriotMAGAUncle 3 points 28 minutes ago I'm sure you libtards would love that. Nothing more MAGA than booing the man who made America great again possible. permalink parent award report block reply PMSocks 0 points 22 minutes ago Course correction is required. Most of us here like 2016 Trump - H1B Trump rubs us all the wrong way. permalink parent award report block reply berserkerbarrage -16 points 5 hours ago Wont happen. Most people outside of this website don't have TDS like you guys. permalink parent award report block reply GatoradeJeb 15 points 5 hours ago Fuck off to india pajeet permalink parent award report block reply Repentnow 4 points 4 hours ago It's always telling when these people come here and tells us what, \" you guys think\".  By contrast, actual MAGA says, \" we believe\". permalink parent award report block reply PMSocks 2 points 3 hours ago We are not a cult and if Nov 2025 turnout is an indicator  ... Trump is shedding the voters he worked really hard to get permalink parent award report block reply view 2 more comments... anishr -2 points 50 minutes ago Please be clear. Indians are ashamed to be “you guys”. I would rather die than be white. My culture is superior and you can choose to assimilate into superior merit, or fuck off back to Europe. “Actual MAGA” seems to believe that the group that’s supporting the dead US economy is somehow bad. Yeah. Make your country great again by throwing out the only productive people. I’m sure the illiterate whites who dropped out of high school can work in intelligent positions. permalink parent award report block reply view 1 more comments...\nIncredibleMrE1 22 points 5 hours ago Not gonna happen anytime soon. Susie won't allow it, even if the SS managed to get its shit together. Muh Butler, Muh UVU. She has successfully cut him off from the base and isn't going to let him reestablish a connection if she can help it. permalink parent award report block reply Ryanaissance 16 points 5 hours ago He should've stuck with Bannon. permalink parent award report block reply awookienookie 8 points 4 hours ago Susie Wiles - White House chief of staff, dual citizenship with isreal. Jew permalink parent award report block reply SteveRogers42 1 points 37 minutes ago Her father is Pat Summerall. permalink parent award report block reply Zedd2 1 points 5 hours ago Who’s susie permalink parent award report block reply someguy7738 16 points 5 hours ago Trump's Chief of Staff and apparently a former staffer for Netanyahu... So basically Trump's AIPAC handler, so I've heard. permalink parent award report block reply Here_we_go 6 points 4 hours ago Also very good friends with bondi permalink parent award report block reply Ostia 2 points 4 hours ago Yeah, you should leave now. permalink parent award report block reply\nRyanaissance 16 points 5 hours ago He should've stuck with Bannon. permalink parent award report block reply\nawookienookie 8 points 4 hours ago Susie Wiles - White House chief of staff, dual citizenship with isreal. Jew permalink parent award report block reply SteveRogers42 1 points 37 minutes ago Her father is Pat Summerall. permalink parent award report block reply\nSteveRogers42 1 points 37 minutes ago Her father is Pat Summerall. permalink parent award report block reply\nZedd2 1 points 5 hours ago Who’s susie permalink parent award report block reply someguy7738 16 points 5 hours ago Trump's Chief of Staff and apparently a former staffer for Netanyahu... So basically Trump's AIPAC handler, so I've heard. permalink parent award report block reply Here_we_go 6 points 4 hours ago Also very good friends with bondi permalink parent award report block reply Ostia 2 points 4 hours ago Yeah, you should leave now. permalink parent award report block reply\nsomeguy7738 16 points 5 hours ago Trump's Chief of Staff and apparently a former staffer for Netanyahu... So basically Trump's AIPAC handler, so I've heard. permalink parent award report block reply Here_we_go 6 points 4 hours ago Also very good friends with bondi permalink parent award report block reply\nHere_we_go 6 points 4 hours ago Also very good friends with bondi permalink parent award report block reply\nOstia 2 points 4 hours ago Yeah, you should leave now. permalink parent award report block reply\nGayPatriotMAGAUncle 3 points 28 minutes ago I'm sure you libtards would love that. Nothing more MAGA than booing the man who made America great again possible. permalink parent award report block reply PMSocks 0 points 22 minutes ago Course correction is required. Most of us here like 2016 Trump - H1B Trump rubs us all the wrong way. permalink parent award report block reply\nPMSocks 0 points 22 minutes ago Course correction is required. Most of us here like 2016 Trump - H1B Trump rubs us all the wrong way. permalink parent award report block reply\nberserkerbarrage -16 points 5 hours ago Wont happen. Most people outside of this website don't have TDS like you guys. permalink parent award report block reply GatoradeJeb 15 points 5 hours ago Fuck off to india pajeet permalink parent award report block reply Repentnow 4 points 4 hours ago It's always telling when these people come here and tells us what, \" you guys think\".  By contrast, actual MAGA says, \" we believe\". permalink parent award report block reply PMSocks 2 points 3 hours ago We are not a cult and if Nov 2025 turnout is an indicator  ... Trump is shedding the voters he worked really hard to get permalink parent award report block reply view 2 more comments... anishr -2 points 50 minutes ago Please be clear. Indians are ashamed to be “you guys”. I would rather die than be white. My culture is superior and you can choose to assimilate into superior merit, or fuck off back to Europe. “Actual MAGA” seems to believe that the group that’s supporting the dead US economy is somehow bad. Yeah. Make your country great again by throwing out the only productive people. I’m sure the illiterate whites who dropped out of high school can work in intelligent positions. permalink parent award report block reply view 1 more comments...\nGatoradeJeb 15 points 5 hours ago Fuck off to india pajeet permalink parent award report block reply Repentnow 4 points 4 hours ago It's always telling when these people come here and tells us what, \" you guys think\".  By contrast, actual MAGA says, \" we believe\". permalink parent award report block reply PMSocks 2 points 3 hours ago We are not a cult and if Nov 2025 turnout is an indicator  ... Trump is shedding the voters he worked really hard to get permalink parent award report block reply view 2 more comments... anishr -2 points 50 minutes ago Please be clear. Indians are ashamed to be “you guys”. I would rather die than be white. My culture is superior and you can choose to assimilate into superior merit, or fuck off back to Europe. “Actual MAGA” seems to believe that the group that’s supporting the dead US economy is somehow bad. Yeah. Make your country great again by throwing out the only productive people. I’m sure the illiterate whites who dropped out of high school can work in intelligent positions. permalink parent award report block reply view 1 more comments...\nRepentnow 4 points 4 hours ago It's always telling when these people come here and tells us what, \" you guys think\".  By contrast, actual MAGA says, \" we believe\". permalink parent award report block reply PMSocks 2 points 3 hours ago We are not a cult and if Nov 2025 turnout is an indicator  ... Trump is shedding the voters he worked really hard to get permalink parent award report block reply view 2 more comments... anishr -2 points 50 minutes ago Please be clear. Indians are ashamed to be “you guys”. I would rather die than be white. My culture is superior and you can choose to assimilate into superior merit, or fuck off back to Europe. “Actual MAGA” seems to believe that the group that’s supporting the dead US economy is somehow bad. Yeah. Make your country great again by throwing out the only productive people. I’m sure the illiterate whites who dropped out of high school can work in intelligent positions. permalink parent award report block reply view 1 more comments...\nPMSocks 2 points 3 hours ago We are not a cult and if Nov 2025 turnout is an indicator  ... Trump is shedding the voters he worked really hard to get permalink parent award report block reply view 2 more comments...\nanishr -2 points 50 minutes ago Please be clear. Indians are ashamed to be “you guys”. I would rather die than be white. My culture is superior and you can choose to assimilate into superior merit, or fuck off back to Europe. “Actual MAGA” seems to believe that the group that’s supporting the dead US economy is somehow bad. Yeah. Make your country great again by throwing out the only productive people. I’m sure the illiterate whites who dropped out of high school can work in intelligent positions. permalink parent award report block reply view 1 more comments...\nCrossTheRubixCube 38 points 6 hours ago Sending now. Will be civil. permalink award report block reply\nLol_Garrus 26 points 5 hours ago America is a country, not an economic zone. We are supposed to be a peoples of shared heritage, values, and beliefs. Not worker bees to be used as needed and disgarded when something cheaper comes along. permalink award report block reply Repentnow 6 points 5 hours ago That requires free market. Our current Neomercantilist system is a distorted departure from our nation's free market capitalism. permalink parent award report block reply anishr -2 points 48 minutes ago Your ancestors did not follow any of those principles by assimilating into the host country Most Indians and H1Bs actually do assimilate pretty well despite the fact that the host country’s culture is non-existent/worse. Despite assimilating and contributing way more than whites (double the average median household income), they still get looked down upon. permalink parent award report block reply Lol_Garrus 5 points 44 minutes ago okay, Pajeet. permalink parent award report block reply anishr -3 points 42 minutes ago Thanks. You just used an honorific that’s higher than “sir”. That just goes to show how retarded/illiterate you guys are. permalink parent award report block reply\nRepentnow 6 points 5 hours ago That requires free market. Our current Neomercantilist system is a distorted departure from our nation's free market capitalism. permalink parent award report block reply\nanishr -2 points 48 minutes ago Your ancestors did not follow any of those principles by assimilating into the host country Most Indians and H1Bs actually do assimilate pretty well despite the fact that the host country’s culture is non-existent/worse. Despite assimilating and contributing way more than whites (double the average median household income), they still get looked down upon. permalink parent award report block reply Lol_Garrus 5 points 44 minutes ago okay, Pajeet. permalink parent award report block reply anishr -3 points 42 minutes ago Thanks. You just used an honorific that’s higher than “sir”. That just goes to show how retarded/illiterate you guys are. permalink parent award report block reply\nLol_Garrus 5 points 44 minutes ago okay, Pajeet. permalink parent award report block reply anishr -3 points 42 minutes ago Thanks. You just used an honorific that’s higher than “sir”. That just goes to show how retarded/illiterate you guys are. permalink parent award report block reply\nanishr -3 points 42 minutes ago Thanks. You just used an honorific that’s higher than “sir”. That just goes to show how retarded/illiterate you guys are. permalink parent award report block reply\nGrindelwald 18 points 7 hours ago Ok. Dear Mr. President.  I do not like foreigners taking jobs that Americans can do.  I do not like companies in America hiring cheap labor. But, since our educational system has been so bad for so long and we have an urgency for expertise, please limit it for temporary talent. Then fix the G*$ Damn schools and build talent here at home. permalink award report block reply auntjemima 26 points 5 hours ago I remember when lack of talent drove salaries up and led to college graduates migrating to said jobs to meet the demand.  Doesn't work that way with H1B's flooding the talent pool. permalink parent award report block reply _Sully_ 15 points 5 hours ago Yeah but now we have endless pajeets with fake degrees who think you're so fucking stupid for letting them get away with it. Haha only I redeem now!!! permalink parent award report block reply SpellingContable 9 points 4 hours ago There are 4 Jeets for every American, and also 4 Chinamen for every American. Economic course correction can never happen if even 2% of Chyna and India have access to the US job Market. permalink parent award report block reply StoneRealist 5 points 5 hours ago So did you send it or just post it here for upvotes? permalink parent award report block reply NamendaBiden 1 points 5 hours ago Legit question.  Updooted permalink parent award report block reply Viewer01 5 points 4 hours ago It’s just a full on lie. Almost every business that starts hires someone off the street and they figure it out as they go along. Go drag boomers out of retirement and have them teach. Saying we don’t know how to ship build while having the best navy is farcical. permalink parent award report block reply Grindelwald 4 points 4 hours ago Boomers for the win permalink parent award report block reply\nauntjemima 26 points 5 hours ago I remember when lack of talent drove salaries up and led to college graduates migrating to said jobs to meet the demand.  Doesn't work that way with H1B's flooding the talent pool. permalink parent award report block reply _Sully_ 15 points 5 hours ago Yeah but now we have endless pajeets with fake degrees who think you're so fucking stupid for letting them get away with it. Haha only I redeem now!!! permalink parent award report block reply SpellingContable 9 points 4 hours ago There are 4 Jeets for every American, and also 4 Chinamen for every American. Economic course correction can never happen if even 2% of Chyna and India have access to the US job Market. permalink parent award report block reply\n_Sully_ 15 points 5 hours ago Yeah but now we have endless pajeets with fake degrees who think you're so fucking stupid for letting them get away with it. Haha only I redeem now!!! permalink parent award report block reply\nSpellingContable 9 points 4 hours ago There are 4 Jeets for every American, and also 4 Chinamen for every American. Economic course correction can never happen if even 2% of Chyna and India have access to the US job Market. permalink parent award report block reply\nStoneRealist 5 points 5 hours ago So did you send it or just post it here for upvotes? permalink parent award report block reply NamendaBiden 1 points 5 hours ago Legit question.  Updooted permalink parent award report block reply\nNamendaBiden 1 points 5 hours ago Legit question.  Updooted permalink parent award report block reply\nViewer01 5 points 4 hours ago It’s just a full on lie. Almost every business that starts hires someone off the street and they figure it out as they go along. Go drag boomers out of retirement and have them teach. Saying we don’t know how to ship build while having the best navy is farcical. permalink parent award report block reply Grindelwald 4 points 4 hours ago Boomers for the win permalink parent award report block reply\nGrindelwald 4 points 4 hours ago Boomers for the win permalink parent award report block reply\nParabellum76 12 points 5 hours ago Guys I’m utterly demoralized with this administration, it seems Trump has completely turned his back on his base and surrounded himself the Neocons and deep state elites. permalink award report block reply IncredibleMrE1 10 points 5 hours ago A lot of things changed when Charlie was murdered. permalink parent award report block reply Appeal2Heaven98 4 points 4 hours ago That seemed to be the turning point...and not the right one. permalink parent award report block reply Repentnow 1 points 4 hours ago That's BS.  It's a false narrative to make MAGA feel fractured. permalink parent award report block reply stealthboy 6 points 5 hours ago Nobody is going to save us.  The country we grew up in no longer exists and it never will again. permalink parent award report block reply GayPatriotMAGAUncle 3 points 27 minutes ago That's what the stormfags want you to believe. Only retards like you take the blackpill. permalink parent award report block reply GatoradeJeb 2 points 5 hours ago He openly hates White man and wants us replaced and dead permalink parent award report block reply MageGills 1 points 40 minutes ago Trump took a giant shit on Americans in that interview. He apparently thinks Americans don't have \"talent\".  What a patriotic thing to say. permalink parent award report block reply load 1 more comments...\nIncredibleMrE1 10 points 5 hours ago A lot of things changed when Charlie was murdered. permalink parent award report block reply Appeal2Heaven98 4 points 4 hours ago That seemed to be the turning point...and not the right one. permalink parent award report block reply Repentnow 1 points 4 hours ago That's BS.  It's a false narrative to make MAGA feel fractured. permalink parent award report block reply\nAppeal2Heaven98 4 points 4 hours ago That seemed to be the turning point...and not the right one. permalink parent award report block reply\nRepentnow 1 points 4 hours ago That's BS.  It's a false narrative to make MAGA feel fractured. permalink parent award report block reply\nstealthboy 6 points 5 hours ago Nobody is going to save us.  The country we grew up in no longer exists and it never will again. permalink parent award report block reply\nGayPatriotMAGAUncle 3 points 27 minutes ago That's what the stormfags want you to believe. Only retards like you take the blackpill. permalink parent award report block reply\nGatoradeJeb 2 points 5 hours ago He openly hates White man and wants us replaced and dead permalink parent award report block reply\nMageGills 1 points 40 minutes ago Trump took a giant shit on Americans in that interview. He apparently thinks Americans don't have \"talent\".  What a patriotic thing to say. permalink parent award report block reply\nRepentnow 10 points 5 hours ago My President, Please reconsider your stance on H-1B visas. These are not being issued for highly skilled personnel.  I understand that you might be using immigration as a leverage position with India (H-1B visas) and China (F-1 visas), but if that is the case, please be transparent with your base. MAGA wants as close to zero immigration as possible.  This is non-negotiable to your MAGA base. The midterms will be a disaster if you ignore immigration. Respectfully, your most loyal constituent. permalink award report block reply Awan-CIA-Car-Lot 5 points 4 hours ago Excellent message 👍 permalink parent award report block reply Justjayce 2 points 11 minutes ago I steals.. Thank you permalink parent award report block reply anishr -4 points 46 minutes ago Just because you think they’re not highly skilled, doesn’t mean they aren’t. That’s not how capitalism works. I guess you guys just cannot fathom why other cultures like Indians are superior in many ways to your “culture”. permalink parent award report block reply Repentnow 2 points 38 minutes ago Then please, by all means go back to your superior culture and stfu. We literally hate you. permalink parent award report block reply\nAwan-CIA-Car-Lot 5 points 4 hours ago Excellent message 👍 permalink parent award report block reply\nJustjayce 2 points 11 minutes ago I steals.. Thank you permalink parent award report block reply\nanishr -4 points 46 minutes ago Just because you think they’re not highly skilled, doesn’t mean they aren’t. That’s not how capitalism works. I guess you guys just cannot fathom why other cultures like Indians are superior in many ways to your “culture”. permalink parent award report block reply Repentnow 2 points 38 minutes ago Then please, by all means go back to your superior culture and stfu. We literally hate you. permalink parent award report block reply\nRepentnow 2 points 38 minutes ago Then please, by all means go back to your superior culture and stfu. We literally hate you. permalink parent award report block reply\nNamendaBiden 8 points 5 hours ago Message sent.  Piece of cake.  EVERYONE needs to do this asap. permalink award report block reply\nrezimx 7 points 4 hours ago H1B is the dumbest shit ever.  There are Americans with tech skill sets that cant get jobs because they are being undercut by cheap foreign labor.  Tie the number of H1Bs to the number of US citizens in each field looking for work.  Lots of citizens = no H1Bs. permalink award report block reply\nEyepatch_McCain 7 points 5 hours ago I'm a lot more concerned with offshoring right now. permalink award report block reply bejeavis 2 points 4 hours ago Two sides of the same coin permalink parent award report block reply\nbejeavis 2 points 4 hours ago Two sides of the same coin permalink parent award report block reply\nmytummyhurts 6 points 5 hours ago I'm doing my part! permalink award report block reply\nh3xAd3c1m4L 6 points 5 hours ago “Lack of US based talent” my ass. permalink award report block reply\nUncleTrumpsBand 5 points 5 hours ago I did my part!! permalink award report block reply\ntarballs 5 points 5 hours ago Wrote a few paragraphs and copied them to the vice president as well. permalink award report block reply\nNYRepublican72 5 points 4 hours ago Done. The H1B program needs to go. permalink award report block reply\nSmegmaless2 5 points 5 hours ago Done permalink award report block reply\nSenaleb 5 points 5 hours ago Wrote him a lengthy paragraph on how there is not a shortage of tech workers in this country and I know this from experience. permalink award report block reply\nFor_All_Mankind 5 points 5 hours ago Contact his Jew handlers permalink award report block reply\naphoticamy 4 points 5 hours ago DONE! Mods sticky this or PEDES, repost daily asking us to message him about something different that needs to happen. Next time maybe about doing something on the rogue judiciary permalink award report block reply\nYaharaRiver 4 points 6 hours ago Muslims: We see it as OUR country now.  We have the prophet’s command to HONOR-KILL YOU! permalink award report block reply\nGoozmania 4 points 5 hours ago Oh, I let them have it. permalink award report block reply\nRyanaissance 4 points 5 hours ago This is the issue that first got me into politics.  They say get a physics degree, we have a severe shortage.  Yet the university is making deals with industry to place their F1/OPT intl students and ignoring domestic.  Going to industry for jobs,  even with professor's inside contacts, will just teach you about H1B.  Get around that, you still have to overcome DEI hiring policies. permalink award report block reply\nMkultraUSA 3 points 4 hours ago I did it pede! Thanks for the reminder. permalink award report block reply\nScot 3 points 4 hours ago Submitted my letter. permalink award report block reply\nACActual 3 points 5 hours ago Called him a Rino sell out.  Hope it gets under his skin permalink award report block reply\ndude_bro 3 points 4 hours ago Commented-  fed up permalink award report block reply\nOstia 3 points 4 hours ago Sent. permalink award report block reply\nGayPatriotMAGAUncle 3 points 35 minutes ago No serious person has issues with H-1B's other than stormfags. Life isn't the internet, retard. Go outside. permalink award report block reply\nDanofdestiny 3 points 5 hours ago Done. permalink award report block reply\ncall-it-like-i-sees 3 points 5 hours ago done - I wrote his words back to him.  Let's see what Trump and Noem do with this. permalink award report block reply\nTacitus1963 2 points 1 hour ago I just sent a lengthy comment using this WH site. permalink award report block reply\nbarwhack 2 points 5 hours ago Do it. He'll Epstard, but do it anyway. Maybe God will bloody give FURTHER weight to the words. permalink award report block reply\nBTWiuseArch25 2 points 5 hours ago OP I would recommend that you add \"in a civil manor\" to your title. permalink award report block reply\nTheJakeFroggy 2 points 4 hours ago For a bit of nuance, I remember when Trump used to push for the covid vaccines, and then eventually stopped doing that after he was booed in a rally about it. I even heard that someone directly confronted him about the covid vaccines and told him the truth about it, and it horrified him. Which shows that he has listened to his base before, theoretically we'd just have to do the same about the Chinese student issues and the H-1B issue. permalink award report block reply\nILoveSilk 1 points 2 hours ago Can you write a template for us? permalink award report block reply\nredditadminssuckit 1 points 5 hours ago This is a good post. I'm tired of the whining here on this forum and the complete lack of gratitude for the things Trump has accomplished. He's not perfect and he's going to make mistakes, but he's the closest thing to a perfect president that you will ever see in your life. So, if you have something critical to say, have some fucking balls and say it to him directly on the White House website. This site is not intended to be a non-stop doomer whine fest about every Trump misstep permalink award report block reply Appeal2Heaven98 8 points 5 hours ago It's a free country, dude. We can complain wherever we want, especially when we feel betrayed. That being said, this is a way we can (hopefully) get our message through to him. permalink parent award report block reply redditadminssuckit 5 points 5 hours ago Understood but that's not what I'm seeing here. People are basically saying that Trump played us, they're not just saying he's making a mistake or he shouldn't be doing this or that. They're basically completely turning on him and those are the kind of posts I'm talking about. permalink parent award report block reply Appeal2Heaven98 2 points 5 hours ago I understand that Doomerism won't solve anything. But some people will call some of us antisemites for questioning why we're giving funds to Israel. People will call us liars when we point out that groceries are still expensive (and have increased in price), all because Trump said that they're more affordable in a tweet. He's done so well in many cases, but has fumbled so much that it's become difficult for many of us not to feel like he's played us. I don't think he has; we're asking one man to basically become a dictator for many of the things we're asking for, and what he's up against. The problem is that this place is so high-energy and intense that if Trump doesn't give us 100% what we want, he's compromised. Or, if he says something that we point out is against what his initial beliefs and promises were, we get the response, \"Are you against Trump? Cry more, faggot.\" permalink parent award report block reply redditadminssuckit 3 points 5 hours ago You're forgetting he's only been in office actually working for about 9 months. You're forgetting the pardoning of the January 6th defendants, the appointment of headsseth and the purging of our military, the elimination of a variety of money laundering and wasteful agencies with the help of musk, the elimination of the Department of education, the pulling of funding from transgender ideology universities essentially reversing that trend. You've completely forgotten the influence he has had on private Industry and eliminating their DEI programs, I can go on and on and on. Jesus people support our president or get the hell off of this website. A complaining is fine but acting as though he's failing us overall is just wrong permalink parent award report block reply NebraskanPatriot 0 points 4 hours ago He knows how you feel.  But, he already tricked you out of your vote, so you've been discarded.  Back to the Globalist Agenda, folks. permalink parent award report block reply aphoticamy 4 points 5 hours ago LOVE this post. Sent a respectful, short and to the point message. This post needs to be stickied and if not re-posted daily. As often as I see it I'll message him permalink parent award report block reply\nAppeal2Heaven98 8 points 5 hours ago It's a free country, dude. We can complain wherever we want, especially when we feel betrayed. That being said, this is a way we can (hopefully) get our message through to him. permalink parent award report block reply redditadminssuckit 5 points 5 hours ago Understood but that's not what I'm seeing here. People are basically saying that Trump played us, they're not just saying he's making a mistake or he shouldn't be doing this or that. They're basically completely turning on him and those are the kind of posts I'm talking about. permalink parent award report block reply Appeal2Heaven98 2 points 5 hours ago I understand that Doomerism won't solve anything. But some people will call some of us antisemites for questioning why we're giving funds to Israel. People will call us liars when we point out that groceries are still expensive (and have increased in price), all because Trump said that they're more affordable in a tweet. He's done so well in many cases, but has fumbled so much that it's become difficult for many of us not to feel like he's played us. I don't think he has; we're asking one man to basically become a dictator for many of the things we're asking for, and what he's up against. The problem is that this place is so high-energy and intense that if Trump doesn't give us 100% what we want, he's compromised. Or, if he says something that we point out is against what his initial beliefs and promises were, we get the response, \"Are you against Trump? Cry more, faggot.\" permalink parent award report block reply redditadminssuckit 3 points 5 hours ago You're forgetting he's only been in office actually working for about 9 months. You're forgetting the pardoning of the January 6th defendants, the appointment of headsseth and the purging of our military, the elimination of a variety of money laundering and wasteful agencies with the help of musk, the elimination of the Department of education, the pulling of funding from transgender ideology universities essentially reversing that trend. You've completely forgotten the influence he has had on private Industry and eliminating their DEI programs, I can go on and on and on. Jesus people support our president or get the hell off of this website. A complaining is fine but acting as though he's failing us overall is just wrong permalink parent award report block reply NebraskanPatriot 0 points 4 hours ago He knows how you feel.  But, he already tricked you out of your vote, so you've been discarded.  Back to the Globalist Agenda, folks. permalink parent award report block reply\nredditadminssuckit 5 points 5 hours ago Understood but that's not what I'm seeing here. People are basically saying that Trump played us, they're not just saying he's making a mistake or he shouldn't be doing this or that. They're basically completely turning on him and those are the kind of posts I'm talking about. permalink parent award report block reply Appeal2Heaven98 2 points 5 hours ago I understand that Doomerism won't solve anything. But some people will call some of us antisemites for questioning why we're giving funds to Israel. People will call us liars when we point out that groceries are still expensive (and have increased in price), all because Trump said that they're more affordable in a tweet. He's done so well in many cases, but has fumbled so much that it's become difficult for many of us not to feel like he's played us. I don't think he has; we're asking one man to basically become a dictator for many of the things we're asking for, and what he's up against. The problem is that this place is so high-energy and intense that if Trump doesn't give us 100% what we want, he's compromised. Or, if he says something that we point out is against what his initial beliefs and promises were, we get the response, \"Are you against Trump? Cry more, faggot.\" permalink parent award report block reply redditadminssuckit 3 points 5 hours ago You're forgetting he's only been in office actually working for about 9 months. You're forgetting the pardoning of the January 6th defendants, the appointment of headsseth and the purging of our military, the elimination of a variety of money laundering and wasteful agencies with the help of musk, the elimination of the Department of education, the pulling of funding from transgender ideology universities essentially reversing that trend. You've completely forgotten the influence he has had on private Industry and eliminating their DEI programs, I can go on and on and on. Jesus people support our president or get the hell off of this website. A complaining is fine but acting as though he's failing us overall is just wrong permalink parent award report block reply\nAppeal2Heaven98 2 points 5 hours ago I understand that Doomerism won't solve anything. But some people will call some of us antisemites for questioning why we're giving funds to Israel. People will call us liars when we point out that groceries are still expensive (and have increased in price), all because Trump said that they're more affordable in a tweet. He's done so well in many cases, but has fumbled so much that it's become difficult for many of us not to feel like he's played us. I don't think he has; we're asking one man to basically become a dictator for many of the things we're asking for, and what he's up against. The problem is that this place is so high-energy and intense that if Trump doesn't give us 100% what we want, he's compromised. Or, if he says something that we point out is against what his initial beliefs and promises were, we get the response, \"Are you against Trump? Cry more, faggot.\" permalink parent award report block reply redditadminssuckit 3 points 5 hours ago You're forgetting he's only been in office actually working for about 9 months. You're forgetting the pardoning of the January 6th defendants, the appointment of headsseth and the purging of our military, the elimination of a variety of money laundering and wasteful agencies with the help of musk, the elimination of the Department of education, the pulling of funding from transgender ideology universities essentially reversing that trend. You've completely forgotten the influence he has had on private Industry and eliminating their DEI programs, I can go on and on and on. Jesus people support our president or get the hell off of this website. A complaining is fine but acting as though he's failing us overall is just wrong permalink parent award report block reply\nredditadminssuckit 3 points 5 hours ago You're forgetting he's only been in office actually working for about 9 months. You're forgetting the pardoning of the January 6th defendants, the appointment of headsseth and the purging of our military, the elimination of a variety of money laundering and wasteful agencies with the help of musk, the elimination of the Department of education, the pulling of funding from transgender ideology universities essentially reversing that trend. You've completely forgotten the influence he has had on private Industry and eliminating their DEI programs, I can go on and on and on. Jesus people support our president or get the hell off of this website. A complaining is fine but acting as though he's failing us overall is just wrong permalink parent award report block reply\nNebraskanPatriot 0 points 4 hours ago He knows how you feel.  But, he already tricked you out of your vote, so you've been discarded.  Back to the Globalist Agenda, folks. permalink parent award report block reply\naphoticamy 4 points 5 hours ago LOVE this post. Sent a respectful, short and to the point message. This post needs to be stickied and if not re-posted daily. As often as I see it I'll message him permalink parent award report block reply\n1DontTreadOnMe1 1 points 5 hours ago I think it's gonna rain when I die. permalink award report block reply ItsFunToSay-M-A-G-A 5 points 4 hours ago President Trump needs to dam that river of H-1Bs flooding into our country and deport ALL of the illegal invaders or else America is going to become a sea of sorrow. No excuses! permalink parent award report block reply 1DontTreadOnMe1 2 points 4 hours ago This guy Alice in Chains! permalink parent award report block reply ItsFunToSay-M-A-G-A 1 points 2 hours ago 😎🎸 permalink parent award report block reply\nItsFunToSay-M-A-G-A 5 points 4 hours ago President Trump needs to dam that river of H-1Bs flooding into our country and deport ALL of the illegal invaders or else America is going to become a sea of sorrow. No excuses! permalink parent award report block reply 1DontTreadOnMe1 2 points 4 hours ago This guy Alice in Chains! permalink parent award report block reply ItsFunToSay-M-A-G-A 1 points 2 hours ago 😎🎸 permalink parent award report block reply\n1DontTreadOnMe1 2 points 4 hours ago This guy Alice in Chains! permalink parent award report block reply ItsFunToSay-M-A-G-A 1 points 2 hours ago 😎🎸 permalink parent award report block reply\nItsFunToSay-M-A-G-A 1 points 2 hours ago 😎🎸 permalink parent award report block reply\nImYourHuckleberry24 1 points 4 hours ago He already knows what we think about this crap. He doesn't give one fuck. permalink award report block reply\nmohel -1 points 4 hours ago If he doesn't know that, what the fuck does his know? permalink award report block reply\nWarOfTheFanboys2 -1 points 4 hours ago You guys know Trump added a 100k fee for H1B visas, right? permalink award report block reply\nRockFlagAndEagle2020 -2 points 5 hours ago Trump went from being one of the best presidents in my life the first few months of his term to one of the worst. permalink award report block reply mav7579 5 points 5 hours ago Did you forget about BIDEN? permalink parent award report block reply RockFlagAndEagle2020 4 points 5 hours ago Deporting these people will do nothing since another president can come in and just let people in the border illegally and nothing will happen. Try again retard. He's done nothing to work with congress to fix our immigration system. He's brought no charges against these people in a meaningful way. He has not gone after any of the employers employing these illegals. I'd rather see the CEO of tyson foods perp walked , charged and convicted then some random ass beaners pulled off the streets giving democrats good PR. permalink parent award report block reply mav7579 1 points 4 hours ago What gives you the idea that congress is interested in fixing it? permalink parent award report block reply berserkerbarrage -2 points 5 hours ago Lol. H-1B has existed for over 35 years, and Trump has made it more difficult and expensive to abuse than ever before. Now he's \"one of the worst\" because he doesn't believe that we should take random, uneducated blacks off the unemployment line and have them start building missiles and car batteries. permalink parent award report block reply RockFlagAndEagle2020 4 points 5 hours ago I would shut the program down. Fuck you permalink parent award report block reply berserkerbarrage -1 points 5 hours ago No, you wouldn't, because you wouldn't have the authority. H-1B was created and can only be ended by Congress, and Trump is already being sued over the restrictions that he has implemented. permalink parent award report block reply\nmav7579 5 points 5 hours ago Did you forget about BIDEN? permalink parent award report block reply RockFlagAndEagle2020 4 points 5 hours ago Deporting these people will do nothing since another president can come in and just let people in the border illegally and nothing will happen. Try again retard. He's done nothing to work with congress to fix our immigration system. He's brought no charges against these people in a meaningful way. He has not gone after any of the employers employing these illegals. I'd rather see the CEO of tyson foods perp walked , charged and convicted then some random ass beaners pulled off the streets giving democrats good PR. permalink parent award report block reply mav7579 1 points 4 hours ago What gives you the idea that congress is interested in fixing it? permalink parent award report block reply\nRockFlagAndEagle2020 4 points 5 hours ago Deporting these people will do nothing since another president can come in and just let people in the border illegally and nothing will happen. Try again retard. He's done nothing to work with congress to fix our immigration system. He's brought no charges against these people in a meaningful way. He has not gone after any of the employers employing these illegals. I'd rather see the CEO of tyson foods perp walked , charged and convicted then some random ass beaners pulled off the streets giving democrats good PR. permalink parent award report block reply mav7579 1 points 4 hours ago What gives you the idea that congress is interested in fixing it? permalink parent award report block reply\nmav7579 1 points 4 hours ago What gives you the idea that congress is interested in fixing it? permalink parent award report block reply\nberserkerbarrage -2 points 5 hours ago Lol. H-1B has existed for over 35 years, and Trump has made it more difficult and expensive to abuse than ever before. Now he's \"one of the worst\" because he doesn't believe that we should take random, uneducated blacks off the unemployment line and have them start building missiles and car batteries. permalink parent award report block reply RockFlagAndEagle2020 4 points 5 hours ago I would shut the program down. Fuck you permalink parent award report block reply berserkerbarrage -1 points 5 hours ago No, you wouldn't, because you wouldn't have the authority. H-1B was created and can only be ended by Congress, and Trump is already being sued over the restrictions that he has implemented. permalink parent award report block reply\nRockFlagAndEagle2020 4 points 5 hours ago I would shut the program down. Fuck you permalink parent award report block reply berserkerbarrage -1 points 5 hours ago No, you wouldn't, because you wouldn't have the authority. H-1B was created and can only be ended by Congress, and Trump is already being sued over the restrictions that he has implemented. permalink parent award report block reply\nberserkerbarrage -1 points 5 hours ago No, you wouldn't, because you wouldn't have the authority. H-1B was created and can only be ended by Congress, and Trump is already being sued over the restrictions that he has implemented. permalink parent award report block reply\ntry4gain PRO -2 points 4 hours ago the crashing out and crying all over social media is unreal today.  trump has always said 1 dumb thing per month then walked it back later. ffs are people literally brand new permalink award report block reply\nMoldyLocksNesMonste -2 points 5 hours ago Be careful, might put you on a list. Not being sarcastic. permalink award report block reply oldftg 11 points 5 hours ago Way too late to worry about that. permalink parent award report block reply Appeal2Heaven98 6 points 5 hours ago It's 2025. You're still worried about being placed on a list? We're all probably on a list for even being on this site. Give your balls a tug, you titfucker. permalink parent award report block reply mav7579 4 points 5 hours ago Donnie would do that? permalink parent award report block reply\noldftg 11 points 5 hours ago Way too late to worry about that. permalink parent award report block reply\nAppeal2Heaven98 6 points 5 hours ago It's 2025. You're still worried about being placed on a list? We're all probably on a list for even being on this site. Give your balls a tug, you titfucker. permalink parent award report block reply\nmav7579 4 points 5 hours ago Donnie would do that? permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:36:14.132094Z"
}