{
  "id": "1ARK5131xI",
  "url": "https://patriots.win/p/1ARK5131xI/this-is-from-a-website-put-toget/c",
  "content": "1223 This is from a website put together by Democracy Funders Network, which is ran by the Pritzker family. \n\nAccording to the website, the total \"democracy\" NGO ecosystem revenue is 33 billion *annually* with more than 200,000 staff. \n\n22% of that funding comes from government grants. posted 6 days ago by PiratePatriotParrot 54 comments award share report block DataRepublican (small r) @DataRepublican • 7d This is from a website put together by Democracy Funders Network, which is ran by the Pritzker family. According to the website, the total \"democracy\" NGO ecosystem revenue is 33 billion *annually* with more than 200,000 staff. 22% of that funding comes from government\n54 comments Sort by Top Top New Worst Old Save The Real Story Behind His Exit No One Saw Coming Read More Ads by Ad.Style 4022a 63 points 6 days ago im sure its closer to 100%. if one NGO gets funding from another NGO, then they don't count that as gov't spending, even if the funding NGO got its fundign from the gov't. the whole thing is a scam. they're laundering our money to subjugate us. permalink award report block reply BigBallsMike 21 points 6 days ago came here to point this out, but already pointed it's so aggravating permalink parent award report block reply CandyBarr 2 points 6 days ago I'm sure there is even more chicanery going on. I don't believe any money outside of seed capital and laundering proceeds have been added to that beast. OWS would have exposed this stuff which is why that had to kill it with fire. Any other pede who has bookkeeping input and want to chime in. I will be following. permalink parent award report block reply guywholikesDjtof2024 8 points 6 days ago Absolutely nobody responsible will be jailed. Absolutely no founders, funders, corrupt people involved, etc. will be jailed. permalink parent award report block reply anotherthing 1 points 6 days ago Thomas Pritzker was one of Epstein's re-occuring guests. permalink parent award report block reply BruddahIz 4 points 6 days ago It's like you need a special accounting designation by law - its a federal dollar until it reaches its point of final spend.  And the person at the \"final spend point\" has to in detail account for everything it went to.\" permalink parent award report block reply vongregormench 3 points 6 days ago There’s no such thing as a final spend point. permalink parent award report block reply BruddahIz 2 points 6 days ago point at which the fed funds bought and caused a physical service or delivery (1st physical sub contractor) - permalink parent award report block reply 4022a 1 points 6 days ago or just dont pay them shit permalink parent award report block reply Burneraccountno4 3 points 6 days ago Exactly. Or if foreign countries give to each other's NGOs in a tit for that exchange. permalink parent award report block reply Bullet3250 2 points 6 days ago The TECH Bros are Billioniars and they give Insane money to these people and both Ex wives, of Bill Gates and of Jeff Bezos walked away with $40 BILLION IN free assets, each stated they were going to give a Billion per year or more to Lefty Causes... Don't forget Hollywood Elites and the normal Rag tag East Coast Limousine Liberals that give Billions too. and compare that to the RIGHT...\nwe only have a few billionaires and they give - but they don't GIVE LIKE THE LEFT... permalink parent award report block reply load 1 more comments... newestofnew 40 points 6 days ago all roads lead to the fed. the federal reserve system enabled the oligarchs to have their private army in intelligence agencies, then an army of ideologue commissars to infiltrate and subvert anywhere they couldn't use outright violence. all with the expressed purpose of turning us back into feudal surfs with no power. permalink award report block reply alucard13mmfmj 1 points 6 days ago Ww3 or a hot civil war to reset things or course correct. permalink parent award report block reply Nellie_the_Beaut 18 points 6 days ago God bless Data Republican.  It would be nice to know what this admin is doing with all her valuable research about government spending waste. permalink award report block reply Helly 4 points 6 days ago Fuck all permalink parent award report block reply ReleasetheList 11 points 6 days ago Would have been great if Susie Wiles wouldn't have forced out Musk. permalink award report block reply cyberwar 10 points 6 days ago he was limited to 120 days as a special government employee permalink parent award report block reply 1LoathsomeDove 2 points 6 days ago Interesting result from Bing CoPilot:\nHuma Abedin served as a special government employee (SGE) from June 2012 to February 2013. This role allowed her to work for private clients while advising the Secretary of State, Hillary Clinton. Per Wikipedia:  2016 - Government Accountability Office found that over the decade from 2005 to 2014, the federal government had an average of roughly 2,000 SGEs in any given year, with a low of about 500 (in 2013) and a high of about 3,100 (in 2009) permalink parent award report block reply alucard13mmfmj 2 points 6 days ago Why cant they hire him for 120 days. Fire him. Then rehire for 120 days. Lawl. permalink parent award report block reply sordfysh PRO 0 points 6 days ago Is Susie Wiles limited to 120 days? permalink parent award report block reply 1LoathsomeDove 1 points 6 days ago Susie Wiles isn't a Special Government Employee (SGE). permalink parent award report block reply sordfysh PRO 1 points 6 days ago So just make Elon what Susie Wiles is. permalink parent award report block reply view 1 more comments... Odyssey 11 points 6 days ago Democrats have the most organized voter fraud syndicate. permalink award report block reply DirtyDiaperJoe 2 points 6 days ago They've perfected it over the last 100 years. This shit has been going on before Truman/Pendergast.  Back in the day, the Democrat ward \"healers\" would pick up the blacks and get them to the polls. For each vote, they got a bottle of booze or a carton of cigarettes. permalink parent award report block reply FuckU/Spez 10 points 6 days ago At this point i'm just gonna live my life with my head in the sand, take care of my fam, mind my business, and not worry about this bullshit. Why? Because nothing will ever happen to anyone. 4 years of Russia Russia Russia, and zero arrest, those riggers that stole Georgia on video got $140 million defamation lawsuit on Gulianni, Colorado lady exposing voter fraud arrested. So why am I supposed to give a whoop, when Dems/leftist can rob/kill/cheat, and nothing ever happens? Trump is too nice. So yeah, I'm a keep posting here, but this is ridiculous. 10 months and not a single arrest. permalink award report block reply alucard13mmfmj 3 points 6 days ago Until its like south africa where mobs of browns take out each property/bunker one by one.. and killing and raping BUT, unfortunately, even if you do something. im 100% sure trump would throw cold water on it and not support you for doing it. Look at j6... those guys still getting screwed. permalink parent award report block reply DirtyDiaperJoe 2 points 6 days ago I'm with you.  There's literally nothing we can do, except be mindful of where we're spending our disposable income. permalink parent award report block reply Titanium5 1 points 6 days ago Agree. All the data in the world to expose this fraud and grift. Everyone sees it, or at least MAGA does. Nothing rarely if ever happens. Comey - that was a major F-up. Leticia, what's happening there? We all warn that when the democrats get back in power because NOTHING is done to secure our elections, the people \"in power\" now will be the first to be put in federal prison or lined up against the wall. Maybe they will just flee to their israel masters, or think they can. After all the joos in NYC just elected a radical muslim commie. <Shrug>... permalink parent award report block reply War_Hamster 9 points 6 days ago I'm glad this got stickied.  I bookmarked the Tweet when it dropped yesterday and have already started perusing the website. permalink award report block reply Klaus73 7 points 6 days ago Its a excellent tweet - I follow datarepublican and suggest anyone that wants to be informed do the same. Still disappointed she didnt sound the election alarm for fear of being called a doomer - but thats the enviroment we are in. permalink parent award report block reply War_Hamster 2 points 6 days ago You'll see me in her comments from time to time.  She's just an amazing researcher and compiler of data. permalink parent award report block reply SuperHonkey 5 points 6 days ago SHUT IT DOWN permalink award report block reply knnbccb 3 points 6 days ago Take out the NGOs and cut off that money supply. permalink award report block reply NoStepNovember 3 points 6 days ago 33, huh? What an oddly specific number for the income that steers public opinion..... permalink award report block reply Eatinglue 2 points 6 days ago If you’re “non-governmental”, you should get no money from any governments. permalink award report block reply Odyssey 2 points 6 days ago Just put this evidence on the top of a pile of evidence we already have against ActBlue money laundering. It's good for ranting on Fox news interviews. permalink award report block reply Sgt_Hulka 1 points 6 days ago 33 billion? That’s a dog whistle for Foggy Bottom sponsorship. permalink award report block reply Oodles 1 points 6 days ago Cut off the corrupt money flow and the snake will die Socialism cannot survive if it is not supported by capitalism permalink award report block reply Wupta PRO 1 points 6 days ago That’s why we have $38 trillion dollar deficits ands ginormous swamp grift enterprise. We haven’t even dented it yet. permalink award report block reply jiujiujiu 1 points 6 days ago Bro HOW is that even slightly legal??? permalink award report block reply LokiHelmsdeep 1 points 6 days ago Looks more and more like drastic times calling for drastic measures is approaching, I'm talking realistically, not just \"woodchipper all the Democrats\" memes. permalink award report block reply monkadelic 1 points 6 days ago So the best get rich quick scheme is \"non-profit\" and NGO's.  You get what you incentivize. permalink award report block reply SpeekFreely 1 points 6 days ago NED is still operational, and funding USAID https://www.ned.org/ The Right is in on this as well permalink award report block reply asiatrails 1 points 6 days ago This is obviously the work of the well-known Chinese philosopher. Ho Le Fuk permalink award report block reply vongregormench 1 points 6 days ago 90% of it is funded by the government and 22% of that is just a direct payment. permalink award report block reply alucard13mmfmj 1 points 6 days ago Democracy is lame and gay. Its literal cuckery. I understand why those rag heads in afghanistan fought so hard against the spread of democracy and gender rights. Itll make their country lamer and gayer. Also.. wtf is the point of democracy?? Isnt the point to do stuff for the majority of your constituents?? You have the left bending ass backwards for trannies which are 0.01% of population. Then you have the right who is opening their mouth for a cleveland steamer from israel.. Democracy.. even a republic is a failed concept at this point. Especially with all the other systems manipulating people, aka social media. permalink award report block reply current_horror 1 points 6 days ago Democracy is how the elites launder their tyranny so that you don’t storm their castles. permalink parent award report block reply alucard13mmfmj 1 points 6 days ago Yeah. Makes enough of the population be complacent where it doesnt reach a threshold to revolt. permalink parent award report block reply Dev404 1 points 6 days ago As I've said time and time again, CONGRESS funds the destruction of this country because they get paid lots of money in backdoor deals to do it. They're above the law and that's why these geriatric career criminal politicians REFUSE to leave office, despite being incapable of doing their job effectively. The money is too good, they are not at risk of being held accountable beyond MAYBE getting removed from office while retaining all of their stolen assets, and they'll just be positioned to another lucrative job behind the scenes when things quiet down. They get golden parachutes no matter how they leave office. permalink award report block reply jml1997 1 points 6 days ago If it's funded by the government, technically it can't be an NGO. But we live in clown world and logic doesn't exist. permalink award report block reply Pats5x 0 points 6 days ago We never had a fucking chance permalink award report block reply\n4022a 63 points 6 days ago im sure its closer to 100%. if one NGO gets funding from another NGO, then they don't count that as gov't spending, even if the funding NGO got its fundign from the gov't. the whole thing is a scam. they're laundering our money to subjugate us. permalink award report block reply BigBallsMike 21 points 6 days ago came here to point this out, but already pointed it's so aggravating permalink parent award report block reply CandyBarr 2 points 6 days ago I'm sure there is even more chicanery going on. I don't believe any money outside of seed capital and laundering proceeds have been added to that beast. OWS would have exposed this stuff which is why that had to kill it with fire. Any other pede who has bookkeeping input and want to chime in. I will be following. permalink parent award report block reply guywholikesDjtof2024 8 points 6 days ago Absolutely nobody responsible will be jailed. Absolutely no founders, funders, corrupt people involved, etc. will be jailed. permalink parent award report block reply anotherthing 1 points 6 days ago Thomas Pritzker was one of Epstein's re-occuring guests. permalink parent award report block reply BruddahIz 4 points 6 days ago It's like you need a special accounting designation by law - its a federal dollar until it reaches its point of final spend.  And the person at the \"final spend point\" has to in detail account for everything it went to.\" permalink parent award report block reply vongregormench 3 points 6 days ago There’s no such thing as a final spend point. permalink parent award report block reply BruddahIz 2 points 6 days ago point at which the fed funds bought and caused a physical service or delivery (1st physical sub contractor) - permalink parent award report block reply 4022a 1 points 6 days ago or just dont pay them shit permalink parent award report block reply Burneraccountno4 3 points 6 days ago Exactly. Or if foreign countries give to each other's NGOs in a tit for that exchange. permalink parent award report block reply Bullet3250 2 points 6 days ago The TECH Bros are Billioniars and they give Insane money to these people and both Ex wives, of Bill Gates and of Jeff Bezos walked away with $40 BILLION IN free assets, each stated they were going to give a Billion per year or more to Lefty Causes... Don't forget Hollywood Elites and the normal Rag tag East Coast Limousine Liberals that give Billions too. and compare that to the RIGHT...\nwe only have a few billionaires and they give - but they don't GIVE LIKE THE LEFT... permalink parent award report block reply load 1 more comments...\nBigBallsMike 21 points 6 days ago came here to point this out, but already pointed it's so aggravating permalink parent award report block reply CandyBarr 2 points 6 days ago I'm sure there is even more chicanery going on. I don't believe any money outside of seed capital and laundering proceeds have been added to that beast. OWS would have exposed this stuff which is why that had to kill it with fire. Any other pede who has bookkeeping input and want to chime in. I will be following. permalink parent award report block reply\nCandyBarr 2 points 6 days ago I'm sure there is even more chicanery going on. I don't believe any money outside of seed capital and laundering proceeds have been added to that beast. OWS would have exposed this stuff which is why that had to kill it with fire. Any other pede who has bookkeeping input and want to chime in. I will be following. permalink parent award report block reply\nguywholikesDjtof2024 8 points 6 days ago Absolutely nobody responsible will be jailed. Absolutely no founders, funders, corrupt people involved, etc. will be jailed. permalink parent award report block reply anotherthing 1 points 6 days ago Thomas Pritzker was one of Epstein's re-occuring guests. permalink parent award report block reply\nanotherthing 1 points 6 days ago Thomas Pritzker was one of Epstein's re-occuring guests. permalink parent award report block reply\nBruddahIz 4 points 6 days ago It's like you need a special accounting designation by law - its a federal dollar until it reaches its point of final spend.  And the person at the \"final spend point\" has to in detail account for everything it went to.\" permalink parent award report block reply vongregormench 3 points 6 days ago There’s no such thing as a final spend point. permalink parent award report block reply BruddahIz 2 points 6 days ago point at which the fed funds bought and caused a physical service or delivery (1st physical sub contractor) - permalink parent award report block reply 4022a 1 points 6 days ago or just dont pay them shit permalink parent award report block reply\nvongregormench 3 points 6 days ago There’s no such thing as a final spend point. permalink parent award report block reply BruddahIz 2 points 6 days ago point at which the fed funds bought and caused a physical service or delivery (1st physical sub contractor) - permalink parent award report block reply\nBruddahIz 2 points 6 days ago point at which the fed funds bought and caused a physical service or delivery (1st physical sub contractor) - permalink parent award report block reply\n4022a 1 points 6 days ago or just dont pay them shit permalink parent award report block reply\nBurneraccountno4 3 points 6 days ago Exactly. Or if foreign countries give to each other's NGOs in a tit for that exchange. permalink parent award report block reply\nBullet3250 2 points 6 days ago The TECH Bros are Billioniars and they give Insane money to these people and both Ex wives, of Bill Gates and of Jeff Bezos walked away with $40 BILLION IN free assets, each stated they were going to give a Billion per year or more to Lefty Causes... Don't forget Hollywood Elites and the normal Rag tag East Coast Limousine Liberals that give Billions too. and compare that to the RIGHT...\nwe only have a few billionaires and they give - but they don't GIVE LIKE THE LEFT... permalink parent award report block reply\nnewestofnew 40 points 6 days ago all roads lead to the fed. the federal reserve system enabled the oligarchs to have their private army in intelligence agencies, then an army of ideologue commissars to infiltrate and subvert anywhere they couldn't use outright violence. all with the expressed purpose of turning us back into feudal surfs with no power. permalink award report block reply alucard13mmfmj 1 points 6 days ago Ww3 or a hot civil war to reset things or course correct. permalink parent award report block reply\nalucard13mmfmj 1 points 6 days ago Ww3 or a hot civil war to reset things or course correct. permalink parent award report block reply\nNellie_the_Beaut 18 points 6 days ago God bless Data Republican.  It would be nice to know what this admin is doing with all her valuable research about government spending waste. permalink award report block reply Helly 4 points 6 days ago Fuck all permalink parent award report block reply\nHelly 4 points 6 days ago Fuck all permalink parent award report block reply\nReleasetheList 11 points 6 days ago Would have been great if Susie Wiles wouldn't have forced out Musk. permalink award report block reply cyberwar 10 points 6 days ago he was limited to 120 days as a special government employee permalink parent award report block reply 1LoathsomeDove 2 points 6 days ago Interesting result from Bing CoPilot:\nHuma Abedin served as a special government employee (SGE) from June 2012 to February 2013. This role allowed her to work for private clients while advising the Secretary of State, Hillary Clinton. Per Wikipedia:  2016 - Government Accountability Office found that over the decade from 2005 to 2014, the federal government had an average of roughly 2,000 SGEs in any given year, with a low of about 500 (in 2013) and a high of about 3,100 (in 2009) permalink parent award report block reply alucard13mmfmj 2 points 6 days ago Why cant they hire him for 120 days. Fire him. Then rehire for 120 days. Lawl. permalink parent award report block reply sordfysh PRO 0 points 6 days ago Is Susie Wiles limited to 120 days? permalink parent award report block reply 1LoathsomeDove 1 points 6 days ago Susie Wiles isn't a Special Government Employee (SGE). permalink parent award report block reply sordfysh PRO 1 points 6 days ago So just make Elon what Susie Wiles is. permalink parent award report block reply view 1 more comments...\ncyberwar 10 points 6 days ago he was limited to 120 days as a special government employee permalink parent award report block reply 1LoathsomeDove 2 points 6 days ago Interesting result from Bing CoPilot:\nHuma Abedin served as a special government employee (SGE) from June 2012 to February 2013. This role allowed her to work for private clients while advising the Secretary of State, Hillary Clinton. Per Wikipedia:  2016 - Government Accountability Office found that over the decade from 2005 to 2014, the federal government had an average of roughly 2,000 SGEs in any given year, with a low of about 500 (in 2013) and a high of about 3,100 (in 2009) permalink parent award report block reply alucard13mmfmj 2 points 6 days ago Why cant they hire him for 120 days. Fire him. Then rehire for 120 days. Lawl. permalink parent award report block reply sordfysh PRO 0 points 6 days ago Is Susie Wiles limited to 120 days? permalink parent award report block reply 1LoathsomeDove 1 points 6 days ago Susie Wiles isn't a Special Government Employee (SGE). permalink parent award report block reply sordfysh PRO 1 points 6 days ago So just make Elon what Susie Wiles is. permalink parent award report block reply view 1 more comments...\n1LoathsomeDove 2 points 6 days ago Interesting result from Bing CoPilot:\nHuma Abedin served as a special government employee (SGE) from June 2012 to February 2013. This role allowed her to work for private clients while advising the Secretary of State, Hillary Clinton. Per Wikipedia:  2016 - Government Accountability Office found that over the decade from 2005 to 2014, the federal government had an average of roughly 2,000 SGEs in any given year, with a low of about 500 (in 2013) and a high of about 3,100 (in 2009) permalink parent award report block reply\nalucard13mmfmj 2 points 6 days ago Why cant they hire him for 120 days. Fire him. Then rehire for 120 days. Lawl. permalink parent award report block reply\nsordfysh PRO 0 points 6 days ago Is Susie Wiles limited to 120 days? permalink parent award report block reply 1LoathsomeDove 1 points 6 days ago Susie Wiles isn't a Special Government Employee (SGE). permalink parent award report block reply sordfysh PRO 1 points 6 days ago So just make Elon what Susie Wiles is. permalink parent award report block reply view 1 more comments...\n1LoathsomeDove 1 points 6 days ago Susie Wiles isn't a Special Government Employee (SGE). permalink parent award report block reply sordfysh PRO 1 points 6 days ago So just make Elon what Susie Wiles is. permalink parent award report block reply view 1 more comments...\nsordfysh PRO 1 points 6 days ago So just make Elon what Susie Wiles is. permalink parent award report block reply view 1 more comments...\nOdyssey 11 points 6 days ago Democrats have the most organized voter fraud syndicate. permalink award report block reply DirtyDiaperJoe 2 points 6 days ago They've perfected it over the last 100 years. This shit has been going on before Truman/Pendergast.  Back in the day, the Democrat ward \"healers\" would pick up the blacks and get them to the polls. For each vote, they got a bottle of booze or a carton of cigarettes. permalink parent award report block reply\nDirtyDiaperJoe 2 points 6 days ago They've perfected it over the last 100 years. This shit has been going on before Truman/Pendergast.  Back in the day, the Democrat ward \"healers\" would pick up the blacks and get them to the polls. For each vote, they got a bottle of booze or a carton of cigarettes. permalink parent award report block reply\nFuckU/Spez 10 points 6 days ago At this point i'm just gonna live my life with my head in the sand, take care of my fam, mind my business, and not worry about this bullshit. Why? Because nothing will ever happen to anyone. 4 years of Russia Russia Russia, and zero arrest, those riggers that stole Georgia on video got $140 million defamation lawsuit on Gulianni, Colorado lady exposing voter fraud arrested. So why am I supposed to give a whoop, when Dems/leftist can rob/kill/cheat, and nothing ever happens? Trump is too nice. So yeah, I'm a keep posting here, but this is ridiculous. 10 months and not a single arrest. permalink award report block reply alucard13mmfmj 3 points 6 days ago Until its like south africa where mobs of browns take out each property/bunker one by one.. and killing and raping BUT, unfortunately, even if you do something. im 100% sure trump would throw cold water on it and not support you for doing it. Look at j6... those guys still getting screwed. permalink parent award report block reply DirtyDiaperJoe 2 points 6 days ago I'm with you.  There's literally nothing we can do, except be mindful of where we're spending our disposable income. permalink parent award report block reply Titanium5 1 points 6 days ago Agree. All the data in the world to expose this fraud and grift. Everyone sees it, or at least MAGA does. Nothing rarely if ever happens. Comey - that was a major F-up. Leticia, what's happening there? We all warn that when the democrats get back in power because NOTHING is done to secure our elections, the people \"in power\" now will be the first to be put in federal prison or lined up against the wall. Maybe they will just flee to their israel masters, or think they can. After all the joos in NYC just elected a radical muslim commie. <Shrug>... permalink parent award report block reply\nalucard13mmfmj 3 points 6 days ago Until its like south africa where mobs of browns take out each property/bunker one by one.. and killing and raping BUT, unfortunately, even if you do something. im 100% sure trump would throw cold water on it and not support you for doing it. Look at j6... those guys still getting screwed. permalink parent award report block reply\nDirtyDiaperJoe 2 points 6 days ago I'm with you.  There's literally nothing we can do, except be mindful of where we're spending our disposable income. permalink parent award report block reply\nTitanium5 1 points 6 days ago Agree. All the data in the world to expose this fraud and grift. Everyone sees it, or at least MAGA does. Nothing rarely if ever happens. Comey - that was a major F-up. Leticia, what's happening there? We all warn that when the democrats get back in power because NOTHING is done to secure our elections, the people \"in power\" now will be the first to be put in federal prison or lined up against the wall. Maybe they will just flee to their israel masters, or think they can. After all the joos in NYC just elected a radical muslim commie. <Shrug>... permalink parent award report block reply\nWar_Hamster 9 points 6 days ago I'm glad this got stickied.  I bookmarked the Tweet when it dropped yesterday and have already started perusing the website. permalink award report block reply Klaus73 7 points 6 days ago Its a excellent tweet - I follow datarepublican and suggest anyone that wants to be informed do the same. Still disappointed she didnt sound the election alarm for fear of being called a doomer - but thats the enviroment we are in. permalink parent award report block reply War_Hamster 2 points 6 days ago You'll see me in her comments from time to time.  She's just an amazing researcher and compiler of data. permalink parent award report block reply\nKlaus73 7 points 6 days ago Its a excellent tweet - I follow datarepublican and suggest anyone that wants to be informed do the same. Still disappointed she didnt sound the election alarm for fear of being called a doomer - but thats the enviroment we are in. permalink parent award report block reply War_Hamster 2 points 6 days ago You'll see me in her comments from time to time.  She's just an amazing researcher and compiler of data. permalink parent award report block reply\nWar_Hamster 2 points 6 days ago You'll see me in her comments from time to time.  She's just an amazing researcher and compiler of data. permalink parent award report block reply\nSuperHonkey 5 points 6 days ago SHUT IT DOWN permalink award report block reply\nknnbccb 3 points 6 days ago Take out the NGOs and cut off that money supply. permalink award report block reply\nNoStepNovember 3 points 6 days ago 33, huh? What an oddly specific number for the income that steers public opinion..... permalink award report block reply\nEatinglue 2 points 6 days ago If you’re “non-governmental”, you should get no money from any governments. permalink award report block reply\nOdyssey 2 points 6 days ago Just put this evidence on the top of a pile of evidence we already have against ActBlue money laundering. It's good for ranting on Fox news interviews. permalink award report block reply\nSgt_Hulka 1 points 6 days ago 33 billion? That’s a dog whistle for Foggy Bottom sponsorship. permalink award report block reply\nOodles 1 points 6 days ago Cut off the corrupt money flow and the snake will die Socialism cannot survive if it is not supported by capitalism permalink award report block reply\nWupta PRO 1 points 6 days ago That’s why we have $38 trillion dollar deficits ands ginormous swamp grift enterprise. We haven’t even dented it yet. permalink award report block reply\njiujiujiu 1 points 6 days ago Bro HOW is that even slightly legal??? permalink award report block reply\nLokiHelmsdeep 1 points 6 days ago Looks more and more like drastic times calling for drastic measures is approaching, I'm talking realistically, not just \"woodchipper all the Democrats\" memes. permalink award report block reply\nmonkadelic 1 points 6 days ago So the best get rich quick scheme is \"non-profit\" and NGO's.  You get what you incentivize. permalink award report block reply\nSpeekFreely 1 points 6 days ago NED is still operational, and funding USAID https://www.ned.org/ The Right is in on this as well permalink award report block reply\nasiatrails 1 points 6 days ago This is obviously the work of the well-known Chinese philosopher. Ho Le Fuk permalink award report block reply\nvongregormench 1 points 6 days ago 90% of it is funded by the government and 22% of that is just a direct payment. permalink award report block reply\nalucard13mmfmj 1 points 6 days ago Democracy is lame and gay. Its literal cuckery. I understand why those rag heads in afghanistan fought so hard against the spread of democracy and gender rights. Itll make their country lamer and gayer. Also.. wtf is the point of democracy?? Isnt the point to do stuff for the majority of your constituents?? You have the left bending ass backwards for trannies which are 0.01% of population. Then you have the right who is opening their mouth for a cleveland steamer from israel.. Democracy.. even a republic is a failed concept at this point. Especially with all the other systems manipulating people, aka social media. permalink award report block reply current_horror 1 points 6 days ago Democracy is how the elites launder their tyranny so that you don’t storm their castles. permalink parent award report block reply alucard13mmfmj 1 points 6 days ago Yeah. Makes enough of the population be complacent where it doesnt reach a threshold to revolt. permalink parent award report block reply\ncurrent_horror 1 points 6 days ago Democracy is how the elites launder their tyranny so that you don’t storm their castles. permalink parent award report block reply alucard13mmfmj 1 points 6 days ago Yeah. Makes enough of the population be complacent where it doesnt reach a threshold to revolt. permalink parent award report block reply\nalucard13mmfmj 1 points 6 days ago Yeah. Makes enough of the population be complacent where it doesnt reach a threshold to revolt. permalink parent award report block reply\nDev404 1 points 6 days ago As I've said time and time again, CONGRESS funds the destruction of this country because they get paid lots of money in backdoor deals to do it. They're above the law and that's why these geriatric career criminal politicians REFUSE to leave office, despite being incapable of doing their job effectively. The money is too good, they are not at risk of being held accountable beyond MAYBE getting removed from office while retaining all of their stolen assets, and they'll just be positioned to another lucrative job behind the scenes when things quiet down. They get golden parachutes no matter how they leave office. permalink award report block reply\njml1997 1 points 6 days ago If it's funded by the government, technically it can't be an NGO. But we live in clown world and logic doesn't exist. permalink award report block reply\nPats5x 0 points 6 days ago We never had a fucking chance permalink award report block reply",
  "fetched_at": "2025-11-12T21:15:25.581435Z"
}