{
  "id": "1ARK53KeCw",
  "url": "https://patriots.win/p/1ARK53KeCw/germans-imported-millions-of-mus/c",
  "content": "451 Germans imported millions of Muslims thinking they would be eager workers and save their pensions.\nMost of them went on welfare and made it worse.\nThey destroyed 1,000 years of Germanic culture and wealth to prop up govt pension plans. The plan failed within less than 10 years. posted 6 days ago by PiratePatriotParrot 33 comments award share report block Wall Street Mav @WallStreetMav • 6d Germans imported millions of Muslims thinking they would be eager workers and save their pensions. Most of them went on welfare and made it worse. They destroyed 1,000 years of Germanic culture and wealth to prop up govt pension plans. The plan failed within less than 10 years.\n33 comments Sort by Top Top New Worst Old Save ColonelKlink 23 points 6 days ago They imported them to rape and murder germans. Same as anywhere else. They know they're parasites wherever they go. permalink award report block reply NotYourMan 2 points 5 days ago Liberal fascism at work.  Replace the Germans with Muslims and start a civil war. permalink parent award report block reply tingo999 16 points 6 days ago Nope, it's called George Soros Open Society, UN 2030 Agenda and WEF Great Reset. It's about pushing Islam on the world. permalink award report block reply Marat1792 6 points 6 days ago Hate to break it to you, but soros is just a foot soldier. Germany has been the petri dish for all these plans and ideas. After WW2 germany IMMEDIATELY started to import people from turkey to rebuild. That plan soured. They tried it again. It soured again. Then they started to escalate east vs west german tension to distract from the fact that their plans got fucked. And so on and so on. Its literally the same damn Kazarian jew shit that lead to WW2 in the first place. Its the children of the same people, doing the same shit. Most of this started before soros's parents even met. Don't forget that all this tranny bs can trace its roots back to the university of frankfurt during the weimar republic. Literal kazarian jews took over and started the whole damn field/concept of gender studies. permalink parent award report block reply the-new-style 3 points 6 days ago The starting point for WW2 was the emancipation of jews in Germany in 1848 after the revolution they fomented. It's been downhill ever since. (there's no doubt an earlier event one can find on this path but that one was quite significant) permalink parent award report block reply justinkayz 1 points 6 days ago It started before Soros and goes a bit deeper than pushing Islam. https://newamericangovernment.org/the-coudenhove-kalergi-plan-the-genocide-of-the-peoples-of-europe-western-spring/ permalink parent award report block reply Pepe_longcockings 10 points 6 days ago Crusades when permalink award report block reply AwareandNonCompliant 6 points 6 days ago I’ll take your Crusaders, but let’s add some Reconquistadors. permalink parent award report block reply CapitalGGeek 1 points 5 days ago Crusades from space (or at least a ballistic trajectory) Like we should have done after 9/11 before the Community Relations Service pushed that 'religion of peace' mantra permalink parent award report block reply NotYourMan 0 points 5 days ago Nothing like this will happen until all the grocery store shelves are empty and we have to go through the USSR situation and it must be worse with labor camps too! permalink parent award report block reply BlokeyMcBlokeFace 10 points 6 days ago What's the matter? Did the magic dirt not instantly transform them into atheist democratic socialist new-europeans with 120 IQs? Obviously white supremacy and toxic masculinity are to blame. permalink award report block reply UNfreeNewZealand 5 points 6 days ago The Plan didn’t fail. It the United Nations (UN) World Without Borders Agenda, and it working just fine. permalink award report block reply reasonablydisturbed 3 points 5 days ago How Angela Merkel has not been tried for treason for pushing this shit is beyond me. At best they should have exiled her ass to Africa so she can be amongst the animals she was so desperate to let in. permalink award report block reply Steve56775 2 points 6 days ago Same thing going on here but the Muslims haven’t arrived in force, YET! permalink award report block reply justinkayz 1 points 6 days ago You don't need Muslims to achieve their objective https://newamericangovernment.org/the-coudenhove-kalergi-plan-the-genocide-of-the-peoples-of-europe-western-spring/ permalink parent award report block reply HockeyMom4Trump 2 points 6 days ago My dad died at 70. Fortunately, he was retired in his 50’s and had a bit of time to enjoy life. permalink award report block reply ILoveSilk 2 points 6 days ago They imported Muslims because some interest groups would make huge money. It is a business for them. Only retarded people believe their story. permalink award report block reply Liberats 1 points 5 days ago \"Germans imported millions of Muslims thinking they would be eager workers and save their pensions\". Hahahaha\nAhahhahahah. A pygmy from Borneo with his brain sucked out through a straw  and his empty skull used as a piss pot, could tell you that only a grade A cunt could think that would work. We have the same cunts in the UK, France and basically the rest of Western Europe. We need to deal with these people at the same time we deal with what they let in. permalink award report block reply soupsandwich69 1 points 5 days ago but migrants get welfare as soon as they settle there.  ouch permalink award report block reply DITTOPatriot 1 points 6 days ago This is and was a concerted effort by the zionist to destroy the west. That's what the Arab Spring was about and that is why you had the mass migration. permalink award report block reply Treintrientje 1 points 5 days ago If it was anything like the Netherlands the original plan was NOT to save pensions: there were a couple of old industry bosses, mainly textile business, that decided it was probably cheaper to import slave labor instead of modernising their factories. (Steel work/cleaning services.. all the dirty jobs the 'educated' boomers did not want to do because they were all social workers and way to smart for real work) Then ofcourse the work was outsourced to China anyway and the industry equipment became obsolete (sound familiar? cause it is) and that's where the bleeding heart lefties came in. That was in the early 1980's when we had about 50.000 muslims here.  The economic right brought them in, the left kept them here. In this century it's the asylum seekers further accelerating this problem. You'd think these rich bastards would learn, but for now we're taking in the new Eastern European slaves too: succesfull Polish people work here for a couple of years and return to Poland with a wallet full hard-earned money. The losers (druggies/alcoholics) stay here and leech off the government via homeless programs and other leftist crap. The gains are always for the big factory owners and they;ll leave the problems for society to solve. Edit: just before this story begins there was also the oil crisis in the seventies when muslim countries blackmailed the EEG (now known as the EU) into taking in more of these muslims invaders and promoting their culture. Bath Ye'or  wrote a very detailed book on it. permalink award report block reply CleanUpPhillyTrump24 1 points 5 days ago So time to ship them home starting with anyone convicted of criminal charges of any kind, anyone that is on any Gov gibs/handouts. Make it illegal for illegals to get any taxpayer funds of any kind. Convict, deport. permalink award report block reply throwaway29834751 1 points 6 days ago the u.s. should learn - repeal hart celler permalink award report block reply TooStoopid 1 points 6 days ago Is anyone going to mending the ball sack in that old lady's neck? permalink award report block reply ConfusedAngryArmed 1 points 6 days ago And yet the one person in their history that gave half a damn about the future demographics of Germany is consistently demonized. permalink award report block reply grassshrimp 1 points 6 days ago Should have incentivized Germans to have more children, but no, that doesn't solve the need for leftists to virtue signal and show how not racist they are. permalink award report block reply verminform 1 points 5 days ago Umm..  That was never the intention.  That was the lie for the current result. permalink award report block reply CaptainWinston 1 points 5 days ago Angela Merkel💩 permalink award report block reply sleepinggiant 1 points 5 days ago Thats the con not the reason permalink award report block reply Darkpoisonousshaddow 0 points 6 days ago No, the Jews imported millions of Muslims. permalink award report block reply HoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply rapskull 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nColonelKlink 23 points 6 days ago They imported them to rape and murder germans. Same as anywhere else. They know they're parasites wherever they go. permalink award report block reply NotYourMan 2 points 5 days ago Liberal fascism at work.  Replace the Germans with Muslims and start a civil war. permalink parent award report block reply\nNotYourMan 2 points 5 days ago Liberal fascism at work.  Replace the Germans with Muslims and start a civil war. permalink parent award report block reply\ntingo999 16 points 6 days ago Nope, it's called George Soros Open Society, UN 2030 Agenda and WEF Great Reset. It's about pushing Islam on the world. permalink award report block reply Marat1792 6 points 6 days ago Hate to break it to you, but soros is just a foot soldier. Germany has been the petri dish for all these plans and ideas. After WW2 germany IMMEDIATELY started to import people from turkey to rebuild. That plan soured. They tried it again. It soured again. Then they started to escalate east vs west german tension to distract from the fact that their plans got fucked. And so on and so on. Its literally the same damn Kazarian jew shit that lead to WW2 in the first place. Its the children of the same people, doing the same shit. Most of this started before soros's parents even met. Don't forget that all this tranny bs can trace its roots back to the university of frankfurt during the weimar republic. Literal kazarian jews took over and started the whole damn field/concept of gender studies. permalink parent award report block reply the-new-style 3 points 6 days ago The starting point for WW2 was the emancipation of jews in Germany in 1848 after the revolution they fomented. It's been downhill ever since. (there's no doubt an earlier event one can find on this path but that one was quite significant) permalink parent award report block reply justinkayz 1 points 6 days ago It started before Soros and goes a bit deeper than pushing Islam. https://newamericangovernment.org/the-coudenhove-kalergi-plan-the-genocide-of-the-peoples-of-europe-western-spring/ permalink parent award report block reply\nMarat1792 6 points 6 days ago Hate to break it to you, but soros is just a foot soldier. Germany has been the petri dish for all these plans and ideas. After WW2 germany IMMEDIATELY started to import people from turkey to rebuild. That plan soured. They tried it again. It soured again. Then they started to escalate east vs west german tension to distract from the fact that their plans got fucked. And so on and so on. Its literally the same damn Kazarian jew shit that lead to WW2 in the first place. Its the children of the same people, doing the same shit. Most of this started before soros's parents even met. Don't forget that all this tranny bs can trace its roots back to the university of frankfurt during the weimar republic. Literal kazarian jews took over and started the whole damn field/concept of gender studies. permalink parent award report block reply the-new-style 3 points 6 days ago The starting point for WW2 was the emancipation of jews in Germany in 1848 after the revolution they fomented. It's been downhill ever since. (there's no doubt an earlier event one can find on this path but that one was quite significant) permalink parent award report block reply\nthe-new-style 3 points 6 days ago The starting point for WW2 was the emancipation of jews in Germany in 1848 after the revolution they fomented. It's been downhill ever since. (there's no doubt an earlier event one can find on this path but that one was quite significant) permalink parent award report block reply\njustinkayz 1 points 6 days ago It started before Soros and goes a bit deeper than pushing Islam. https://newamericangovernment.org/the-coudenhove-kalergi-plan-the-genocide-of-the-peoples-of-europe-western-spring/ permalink parent award report block reply\nPepe_longcockings 10 points 6 days ago Crusades when permalink award report block reply AwareandNonCompliant 6 points 6 days ago I’ll take your Crusaders, but let’s add some Reconquistadors. permalink parent award report block reply CapitalGGeek 1 points 5 days ago Crusades from space (or at least a ballistic trajectory) Like we should have done after 9/11 before the Community Relations Service pushed that 'religion of peace' mantra permalink parent award report block reply NotYourMan 0 points 5 days ago Nothing like this will happen until all the grocery store shelves are empty and we have to go through the USSR situation and it must be worse with labor camps too! permalink parent award report block reply\nAwareandNonCompliant 6 points 6 days ago I’ll take your Crusaders, but let’s add some Reconquistadors. permalink parent award report block reply\nCapitalGGeek 1 points 5 days ago Crusades from space (or at least a ballistic trajectory) Like we should have done after 9/11 before the Community Relations Service pushed that 'religion of peace' mantra permalink parent award report block reply\nNotYourMan 0 points 5 days ago Nothing like this will happen until all the grocery store shelves are empty and we have to go through the USSR situation and it must be worse with labor camps too! permalink parent award report block reply\nBlokeyMcBlokeFace 10 points 6 days ago What's the matter? Did the magic dirt not instantly transform them into atheist democratic socialist new-europeans with 120 IQs? Obviously white supremacy and toxic masculinity are to blame. permalink award report block reply\nUNfreeNewZealand 5 points 6 days ago The Plan didn’t fail. It the United Nations (UN) World Without Borders Agenda, and it working just fine. permalink award report block reply\nreasonablydisturbed 3 points 5 days ago How Angela Merkel has not been tried for treason for pushing this shit is beyond me. At best they should have exiled her ass to Africa so she can be amongst the animals she was so desperate to let in. permalink award report block reply\nSteve56775 2 points 6 days ago Same thing going on here but the Muslims haven’t arrived in force, YET! permalink award report block reply justinkayz 1 points 6 days ago You don't need Muslims to achieve their objective https://newamericangovernment.org/the-coudenhove-kalergi-plan-the-genocide-of-the-peoples-of-europe-western-spring/ permalink parent award report block reply\njustinkayz 1 points 6 days ago You don't need Muslims to achieve their objective https://newamericangovernment.org/the-coudenhove-kalergi-plan-the-genocide-of-the-peoples-of-europe-western-spring/ permalink parent award report block reply\nHockeyMom4Trump 2 points 6 days ago My dad died at 70. Fortunately, he was retired in his 50’s and had a bit of time to enjoy life. permalink award report block reply\nILoveSilk 2 points 6 days ago They imported Muslims because some interest groups would make huge money. It is a business for them. Only retarded people believe their story. permalink award report block reply\nLiberats 1 points 5 days ago \"Germans imported millions of Muslims thinking they would be eager workers and save their pensions\". Hahahaha\nAhahhahahah. A pygmy from Borneo with his brain sucked out through a straw  and his empty skull used as a piss pot, could tell you that only a grade A cunt could think that would work. We have the same cunts in the UK, France and basically the rest of Western Europe. We need to deal with these people at the same time we deal with what they let in. permalink award report block reply\nsoupsandwich69 1 points 5 days ago but migrants get welfare as soon as they settle there.  ouch permalink award report block reply\nDITTOPatriot 1 points 6 days ago This is and was a concerted effort by the zionist to destroy the west. That's what the Arab Spring was about and that is why you had the mass migration. permalink award report block reply\nTreintrientje 1 points 5 days ago If it was anything like the Netherlands the original plan was NOT to save pensions: there were a couple of old industry bosses, mainly textile business, that decided it was probably cheaper to import slave labor instead of modernising their factories. (Steel work/cleaning services.. all the dirty jobs the 'educated' boomers did not want to do because they were all social workers and way to smart for real work) Then ofcourse the work was outsourced to China anyway and the industry equipment became obsolete (sound familiar? cause it is) and that's where the bleeding heart lefties came in. That was in the early 1980's when we had about 50.000 muslims here.  The economic right brought them in, the left kept them here. In this century it's the asylum seekers further accelerating this problem. You'd think these rich bastards would learn, but for now we're taking in the new Eastern European slaves too: succesfull Polish people work here for a couple of years and return to Poland with a wallet full hard-earned money. The losers (druggies/alcoholics) stay here and leech off the government via homeless programs and other leftist crap. The gains are always for the big factory owners and they;ll leave the problems for society to solve. Edit: just before this story begins there was also the oil crisis in the seventies when muslim countries blackmailed the EEG (now known as the EU) into taking in more of these muslims invaders and promoting their culture. Bath Ye'or  wrote a very detailed book on it. permalink award report block reply\nCleanUpPhillyTrump24 1 points 5 days ago So time to ship them home starting with anyone convicted of criminal charges of any kind, anyone that is on any Gov gibs/handouts. Make it illegal for illegals to get any taxpayer funds of any kind. Convict, deport. permalink award report block reply\nthrowaway29834751 1 points 6 days ago the u.s. should learn - repeal hart celler permalink award report block reply\nTooStoopid 1 points 6 days ago Is anyone going to mending the ball sack in that old lady's neck? permalink award report block reply\nConfusedAngryArmed 1 points 6 days ago And yet the one person in their history that gave half a damn about the future demographics of Germany is consistently demonized. permalink award report block reply\ngrassshrimp 1 points 6 days ago Should have incentivized Germans to have more children, but no, that doesn't solve the need for leftists to virtue signal and show how not racist they are. permalink award report block reply\nverminform 1 points 5 days ago Umm..  That was never the intention.  That was the lie for the current result. permalink award report block reply\nCaptainWinston 1 points 5 days ago Angela Merkel💩 permalink award report block reply\nsleepinggiant 1 points 5 days ago Thats the con not the reason permalink award report block reply\nDarkpoisonousshaddow 0 points 6 days ago No, the Jews imported millions of Muslims. permalink award report block reply\nHoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nrapskull 1 points 6 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T22:53:57.073234Z"
}