{
  "id": "1ARK57sEUT",
  "url": "https://patriots.win/p/1ARK57sEUT/fafo-slackjawed-faggots-/c",
  "content": "914 FAFO, slack-jawed faggots 😁 posted 4 days ago by SuperHonkey 118 comments award share report block Right Angle News Network @Rightanglenews • 5d BREAKING - Leftist journalists from Teen Vogue and Wired are being ruthlessly mocked after attempting to strong-arm their head of HR to reinstate dissolved departments focused on “climate” and “LGBT” justice, only to get fired themselves. These are who run the media.\n118 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno MemeWarsVet 97 points 4 days ago Where's the firing part? permalink award report block reply GeneralTsoTofu 59 points 4 days ago There wasn't one. It's another bait post. permalink parent award report block reply CleanUpPhillyTrump24 1 points 4 days ago The firing was prior to this. It literally says this in the post. permalink parent award report block reply MemeWarsVet 37 points 4 days ago It does not. It mentions they were fired but gives no time frame, leading one to logically conclude they were fired AFTER this confrontation as the boss keeps telling them to get back to their work areas. permalink parent award report block reply SurfandTurf 24 points 4 days ago Naw, these faggots are still employed by the outlet but they’re trying to force their boss to reinstate the other fag departments who got axed because they’re totally fuckin’ gay and no one buys their faggot shit. Edit: apparently 4 of these pillow biters got shitcanned after this incident and Teen Vogue is being consolidated into Vogue. https://deadline.com/2025/11/conde-nast-fires-staffers-teen-vogue-1236609695/ permalink parent award report block reply SpellingContable 9 points 4 days ago only to get fired themselves The context was they got fired after being petulant children. I clicked wanting to see low IQ women and gay soy males crying after getting fired for their belligerence. permalink parent award report block reply Liberats 8 points 4 days ago Exactly why I listened to the  whiny fuck for the whole video. Waiting for it to get canned. permalink parent award report block reply view 1 more comments... fluffykitten 5 points 4 days ago LiTTeRaLLy permalink parent award report block reply Doritalos 3 points 4 days ago That was a different group permalink parent award report block reply load 1 more comments... Patrick_Bateman 7 points 4 days ago BREAKING - It probably didn't happen. permalink parent award report block reply CleanUpPhillyTrump24 10 points 4 days ago Teen Vogue fired everyone last week. Try and keep up. It is likely shutting down. permalink parent award report block reply Patrick_Bateman 3 points 4 days ago So they worked for Teen Vogue and were fired. Yet somehow days after they were fired, they were in the building harassing this manager and were subsequently.... fired? Like, again? permalink parent award report block reply Smurfection 2 points 4 days ago Most of the employees from two departments were fired.   Some were retained.  Of those retained and their allies who were not fired, decided they could do some version of a college sit in and four of them ended up fired. Dear Millennials liberal women:   If you follow your boss down a hall shouting slogans about engagement after he told you to go back to your work areas, you're probably going to get fired.   This isn't that Marxist cess pool called college (see, Brett Weinstein, Evergreen) where the \"professor\" gets fired for making you feel bad.   In the real world, which is everything opposite of what you were taught in school is true, your boss is your boss and he doesn't owe you a paycheck. permalink parent award report block reply taytaytay 1 points 4 days ago SAM, SAM, you said they were going to be fired in this post SAM but Patrick Bateman didn't see it in the video. He has questions SAM, Patrick Bateman has questions why won't you talk to him?!? permalink parent award report block reply view 1 more comments... vongregormench 1 points 4 days ago I'm thinking some people were moved over to other publications, so were all of these people shitcanned or just some? permalink parent award report block reply deleted 7 points 4 days ago drattastic1 0 points 4 days ago I want them all bull whipped in public first by someone big and very very angry. permalink parent award report block reply Armiakrajowa 47 points 4 days ago This might be the gayest thing I saw all year. permalink award report block reply JoeBidensDementia6 18 points 4 days ago Its pretty fn gay. permalink parent award report block reply Gletkin 8 points 4 days ago They have to show up to the office in person 4 days a week man. That’s the violence inherent in the system. permalink parent award report block reply Armiakrajowa 5 points 4 days ago It's literally worse than 9-11. permalink parent award report block reply Gletkin 3 points 4 days ago It’s a dog whistle for white supremacist anti-trans systemic queerphobia permalink parent award report block reply Shakakka99 3 points 4 days ago And that's saying something. permalink parent award report block reply SuperHonkey OP 2 points 4 days ago Thamm! THAMMM!! grabs purse and huffs away 😳 permalink parent award report block reply BlackJack1776 30 points 4 days ago This is who he decided to hire. Dipshit gets no sympathy from me. permalink award report block reply Gletkin 5 points 4 days ago If he actually fired them for cause he’s be badass. But is that even happening? permalink parent award report block reply BlackJack1776 6 points 4 days ago Yes. Both Teen Vouge and Wired have laid of something like 70%+ of their staff in the last few weeks. These Was/Were are the comrades of the Get/Gones that basically protested outside his C-Suite office door. FAFO for all involved. permalink parent award report block reply Gletkin 3 points 4 days ago Awesome permalink parent award report block reply Smurfection 4 points 4 days ago At least four from this little REEE fest got fired.  I believe prior to this, 70% of the staff of one publication and a couple of departments were fired. permalink parent award report block reply Gletkin 2 points 4 days ago Awesome. permalink parent award report block reply Bldg_2019 28 points 4 days ago That’s a shitload of hard drives that need to be checked right there, including HR fag. permalink award report block reply SuperHonkey OP 5 points 4 days ago CP goldmine permalink parent award report block reply Nick-Kerr -3 points 4 days ago \"goldmine\"??? That's pretty disgusting. It implies value and something you want. How about a CP filled life ender? permalink parent award report block reply VeryFinePerson84 3 points 4 days ago The gold represents the value of something that can be used to terminate them permalink parent award report block reply Nick-Kerr -2 points 4 days ago If you can't figure out using a term for \"treasure\" and \"value\" applied here to child porn, the  you just may be a pedo yourself. \"Evidence of a heinous crime\" is more suited here. (Pedos will downvote me) I do agree, however, on your term \"terminate them\", but in a much different context. permalink parent award report block reply Filo76 23 points 4 days ago I heard the tranny a mile away. permalink award report block reply couranto 12 points 4 days ago He was shitcanned. Avalle wrote on X, “I love my job, I love my coworkers, and I love my union. I’m devastated the company made this move. There are so few trans women in media at all — particularly ones who aren’t confined to ‘Queer Media’ — and I was incredibly proud of what my position at Bon Appétit meant at large. She added, “More important to me than my identity, I am also the Vice President of the NewsGuild of New York, and targeting me with a blatantly retaliatory termination like this feels like an egregious shot against our union and against media workers as a whole.” permalink parent award report block reply GodSaveTheWest 10 points 4 days ago He* permalink parent award report block reply Nick-Kerr 3 points 4 days ago Union. It can die in a fire with the rest of the commies permalink parent award report block reply XlDEN 4 points 4 days ago Even without sound those clown shoes are a giveaway. permalink parent award report block reply SanityGumby 21 points 4 days ago They are insufferable because these are people working for the company that controls Reddit. I bet each and every one is a mod in some tranny gay sex subreddit permalink award report block reply Doomer_Guy 21 points 4 days ago I liked the part where he mentions that they work 4 days a week permalink award report block reply CleanUpPhillyTrump24 11 points 4 days ago Leftist: REEE YOU MADE US COME INTO THE ACTUAL OFFICE FOUR DAYS A WEEK YOU BIGOT NOW WE GET FIRED REEEE. Lulz. They saw they can't stand having these loons in an office. permalink parent award report block reply raptormissle 7 points 4 days ago It's cute that they call it work. It's basically daycare for trannies. permalink parent award report block reply Chuj 16 points 4 days ago Careful. The tranny might go postal on the office. Dangerous permalink award report block reply SuperHonkey OP 6 points 4 days ago Win/win! permalink parent award report block reply f_bastiat 3 points 4 days ago I was genuinely getting anxious watching that, you can't turn your back on people like that. permalink parent award report block reply Chuj 2 points 4 days ago You are correct! In clinic, the computers face away from the patients, so if type on it with them my back may face the transgender patient. I contort to watch them through peripheral vision. Safest that way permalink parent award report block reply Psarg 1 points 4 days ago They convinced him to cut his dick off to sterilize him and use him as a political tool. They usually don't go postal because the embarrassment of that is so huge they just commit suicide. permalink parent award report block reply Agent_Orange 3 points 4 days ago I'm curious what percentage of trannies actually cut their dicks off. It seems that, based on their weak character in the first place, it's more of a dress-up fad with a fake soft voices than anything else. permalink parent award report block reply Chuj 3 points 4 days ago I disagree. They go back to the schools that disrespected their mental disorder, and shoot them up. Pure postal permalink parent award report block reply hnoble444 14 points 4 days ago They want the anal sex guide back. permalink award report block reply SuperHonkey OP 6 points 4 days ago We're DONE with that shit! - Emperor Hegseth permalink parent award report block reply HunterBidensPC 12 points 4 days ago No remorse for him because he had a climate and lgbt department in the first place. This is what you get. This is who you hired permalink award report block reply CleanUpPhillyTrump24 4 points 4 days ago This is just the HR guy. No say on hiring woke nutters to be \"journalists.\" permalink parent award report block reply RustySheckelford 1 points 4 days ago Imagine having sympathy for someone who willingly takes the most universally hated job in history. permalink parent award report block reply GodSaveTheWest 4 points 4 days ago I mean if we are going to take back our culture thats exactly what we should be doing, taking their jobs from them and enforcing our own beliefs. Conservative giving up power is how all of this has happened in the first place. Take it back by infiltrating like they did. permalink parent award report block reply VirTW 10 points 4 days ago Doesn't look like they are working to me permalink award report block reply Alldayeveryday 10 points 4 days ago Stop letting these retards do this dumb shit. Fire them and move on permalink award report block reply emorphia 7 points 4 days ago that is why you do not hire leftists.\nthey are a headache in every possible way for a company. permalink award report block reply RustySheckelford 6 points 4 days ago Can gay people really expect respect when they make these kinds of videos and 100% of people with ears know the camera\"man\" is a giant flaming faggot? permalink award report block reply Kiwipede22 6 points 4 days ago It is called BULLYING. permalink award report block reply SuperHonkey OP 6 points 4 days ago Crybullies permalink parent award report block reply AbelsRevenge 6 points 4 days ago The soy is strong with these things permalink award report block reply FredRedd 2 points 4 days ago Kek! \"Use the soy, Luke. Let go...\" permalink parent award report block reply Bb1434 6 points 4 days ago At the end, the thing who shouts \"what are you going tondo to stand up to the trump administration?\".  In what world and what universe has Teen Vogue EVER mattered to ANY administration?  These people actually believe their own bs. I cannot imagine living a life where I am that clueless. It's f'ing teen vogue. permalink award report block reply SuperHonkey OP 4 points 4 days ago Well, they are gay, so... permalink parent award report block reply MakeAmericaVapeAgain 5 points 4 days ago look at how these idiots solve problems. they were raised to complain until they get what they wanted, except that isn’t how the world really works. so they show up as a group believing that more numbers equals more power. they are told no, and they get mean and pissy. we are dealing with spoiled brats that have very little going for them. permalink award report block reply Mike_Hoxbigg 4 points 4 days ago I can't imagine anyone wanting to work with that faggot tranny. That voice alone and tone of utter entitlement -- fire it, from a cannon, into the sun. permalink award report block reply s27zw7M1h62lURPyezOa PRO 4 points 4 days ago Subscriped to Wired back in the day that is was not a woke rag.  Can we not have one single tech publication that is not woke.  Does anyone know of one? permalink award report block reply FredRedd 4 points 4 days ago Agree totally that once upon a time, mags like Wired and Mondo 2000 (dating myself again, ain't I?)  were once really great mags, but that was a long time ago. permalink parent award report block reply s27zw7M1h62lURPyezOa PRO 2 points 4 days ago Is there any tech publication that is not woke?  What do you read for tech? permalink parent award report block reply DemPanicAtTheDisco 3 points 4 days ago “Any organization that is not explicitly right-wing will eventually become left-wing.” Conquest's second law of politics permalink parent award report block reply noPTSDforMePlease 4 points 4 days ago Here's more context because our mods are gay and sticky stories that have no context: https://deadline.com/2025/11/conde-nast-fires-staffers-teen-vogue-1236609695/ permalink award report block reply JesusTheOnlyWay 4 points 4 days ago This stuff is why I'm moving into a 'nothing' small town, to live quietly and serve God and raise my son and spend time with my wife I don't want to even be 50 miles within hearing about this degeneracy permalink award report block reply DingleBalls 3 points 4 days ago \"-justice\" = \"make laws to force degeneracy on everyone\". permalink award report block reply GottaMemberMyPW 3 points 4 days ago “What are you gonna do to stand up to the Trump administration?!” Good grief. permalink award report block reply jrhicksjr 3 points 4 days ago Slack-Jawed Faggots? That would be a shitty band name. permalink award report block reply SuperHonkey OP 1 points 4 days ago https://youtu.be/HayFxnfFgZk permalink parent award report block reply PepesJusticeBoner 3 points 4 days ago You're fired! Go be gay somewhere else! permalink award report block reply HillarysBeaverMunch 3 points 4 days ago Teen Vogue exists solely to pollute your 12 year old daughter by pushing deviancy and degeneracy nonstop, as per the agenda of the Khazar masters. permalink award report block reply Nick-Kerr 3 points 4 days ago And sons. They are grooming both sexes permalink parent award report block reply BidensfullAFdiaper 3 points 4 days ago So much soy. NONE of these men piss standing up. permalink award report block reply EatAturdBurger 3 points 4 days ago Insufferable employees should be fired. They are not doing their jobs, they are being insubordinate, and they are harassing their head of HR. permalink award report block reply BrewSwillis 3 points 4 days ago That red haired lady that was talking to him had a very deep voice. permalink award report block reply SuperHonkey OP 3 points 4 days ago That's a MAN baby! permalink parent award report block reply Keep_on_winning_kag 3 points 4 days ago Dude looks like a lady! permalink parent award report block reply Aisle-is-closed 3 points 4 days ago They look like Mandani supporters to me. permalink award report block reply FredRedd 3 points 4 days ago Hey pal, here's an idea: if you don't like the way they run things, why not jump ship and... start a new, competing publication - run the way you and your pals think it thugs SHOULD be run? Or is that too capitalist for you? Or would the fact that would entail some hard work that requires you in the office for more than 4 days a week? Lord knows I'm hardly in the work-ethic range/capability of Donald Trump, but this pussified, entitled attitude spikes my blood pressure bigly. permalink award report block reply CasuallyObservant 3 points 4 days ago Reminds me of that newly opened Portland Lesbian bar/coffee shop (was back in 2022) that was a special meet-up place for gay women only - (no men allowed - except trans men).  It was cleverly decorated, had a bunch of nice menu items and hired only lesbians for this one-of-a-kind niche business. It did well for a whole four days before the entitled workers presented the owner with a list of demands, including expecting an ownership stake (!) and demanded that it be turned into a 'queer worker-owned cooperative' and educational center for far-left activities, rather than a for-profit business. (They failed to realize that wait staff, bussers, and kitchen help have no special talent or immutable characteristics that can't be replaced within the day). The owner, who already had a couple of other successful restaurants and 'regular' coffee shops simply closed the place and changed the locks.  Sometimes that's all you can do. permalink parent award report block reply Mike_Hoxbigg 3 points 4 days ago I remember that! I shook my head and laughed, \"I give them a week.\" 4 days later... permalink parent award report block reply raptormissle 2 points 4 days ago Of course a violent tranny was instigating the confrontation. These companies deserve the shit they put themselves in. permalink award report block reply RyanKeyOh 2 points 4 days ago Good. The entitlement is insane. Do your fucking job. Be an activist on your own time. permalink award report block reply ingrowntoenail 2 points 4 days ago They all sound like mealy-mouthed faggots. permalink award report block reply Tookens 2 points 4 days ago That's because they are all mealy-mouthed faggots. permalink parent award report block reply Agent_86 2 points 4 days ago HAHAHAHAHAHAHA!!!!! permalink award report block reply SuperHonkey OP 2 points 4 days ago HO LEEE SHIIIIIIIIIIT!!! 🚨🚨🚨🚨3 STICKIES IN ONE DAY!!! 🚨🚨🚨🚨 Which one of you mods is homo for me?? 😍😘 permalink award report block reply me-no-likely3 2 points 4 days ago Could you imagine having to work with such insufferable faggots? permalink award report block reply JimmyRussler 2 points 4 days ago Skinny jeans on a dude should be enough to admit to the nuthouse. permalink award report block reply CasuallyObservant 3 points 4 days ago Gay.  Or wannabe trans.  Yeesh. permalink parent award report block reply SavingPrivateGrace 2 points 4 days ago It's still a good sign American journalism is healing. permalink award report block reply True_Curmudgeon 2 points 4 days ago This place needs to be a lot harder to survive in so that people can't be like this permalink award report block reply AgnesDomini 2 points 4 days ago Best Nelson Muntz laugh: Ha-hah! permalink award report block reply DJTXLV 1 points 4 days ago Fucking faggots. Also fuck the OP. There was no firing in this video. permalink award report block reply SuperHonkey OP 1 points 4 days ago Lol eat shit retard... They were fired for this incident. permalink parent award report block reply MadRussian 1 points 4 days ago Gay permalink award report block reply Givesgunstogrannies 1 points 4 days ago I'd walk straight to human resources. Make these faggots walk right into their exit interview. permalink award report block reply DrVSGGEOTUSPhD 1 points 4 days ago Can you imagine...you're desperately trying to keep your stable of dying magazines alive and these brats lay seige to your corner office? permalink award report block reply SuperHonkey OP 2 points 4 days ago Fuck that woke rag! Let it whither and die permalink parent award report block reply DrVSGGEOTUSPhD 2 points 4 days ago Well obviously! But I'm sympathizing with the boss of those brats.  Glad his satanic communist filth is tanking permalink parent award report block reply DrTar 1 points 4 days ago Yeah, Hand them all a small cardboard box, take their ID and or pass cards give them 5 minutes to clean out their desk then have the escorted out of the building by security. Problem solved. permalink award report block reply terribletwos 0 points 4 days ago Bruh, it's always trannies. I'd just reinstate an LGB department just to see the chaos. Thought they just shut down Teen Vogue? permalink award report block reply Slipcue 0 points 4 days ago Man, I wanted to see him turn around and go from calm to lighting them the fuck up! Why is this stickied? permalink award report block reply Choppermagic 0 points 4 days ago no firings permalink award report block reply FORMERCHILDSTAR 0 points 4 days ago I'm my opinion if your work doesn't cause you to sweat, bleed, save lives, fix or build something with your hands, or create something beneficial for mankind, your not really working. What these people do for work isn't really work, it's play time for gay children. permalink award report block reply\nMemeWarsVet 97 points 4 days ago Where's the firing part? permalink award report block reply GeneralTsoTofu 59 points 4 days ago There wasn't one. It's another bait post. permalink parent award report block reply CleanUpPhillyTrump24 1 points 4 days ago The firing was prior to this. It literally says this in the post. permalink parent award report block reply MemeWarsVet 37 points 4 days ago It does not. It mentions they were fired but gives no time frame, leading one to logically conclude they were fired AFTER this confrontation as the boss keeps telling them to get back to their work areas. permalink parent award report block reply SurfandTurf 24 points 4 days ago Naw, these faggots are still employed by the outlet but they’re trying to force their boss to reinstate the other fag departments who got axed because they’re totally fuckin’ gay and no one buys their faggot shit. Edit: apparently 4 of these pillow biters got shitcanned after this incident and Teen Vogue is being consolidated into Vogue. https://deadline.com/2025/11/conde-nast-fires-staffers-teen-vogue-1236609695/ permalink parent award report block reply SpellingContable 9 points 4 days ago only to get fired themselves The context was they got fired after being petulant children. I clicked wanting to see low IQ women and gay soy males crying after getting fired for their belligerence. permalink parent award report block reply Liberats 8 points 4 days ago Exactly why I listened to the  whiny fuck for the whole video. Waiting for it to get canned. permalink parent award report block reply view 1 more comments... fluffykitten 5 points 4 days ago LiTTeRaLLy permalink parent award report block reply Doritalos 3 points 4 days ago That was a different group permalink parent award report block reply load 1 more comments... Patrick_Bateman 7 points 4 days ago BREAKING - It probably didn't happen. permalink parent award report block reply CleanUpPhillyTrump24 10 points 4 days ago Teen Vogue fired everyone last week. Try and keep up. It is likely shutting down. permalink parent award report block reply Patrick_Bateman 3 points 4 days ago So they worked for Teen Vogue and were fired. Yet somehow days after they were fired, they were in the building harassing this manager and were subsequently.... fired? Like, again? permalink parent award report block reply Smurfection 2 points 4 days ago Most of the employees from two departments were fired.   Some were retained.  Of those retained and their allies who were not fired, decided they could do some version of a college sit in and four of them ended up fired. Dear Millennials liberal women:   If you follow your boss down a hall shouting slogans about engagement after he told you to go back to your work areas, you're probably going to get fired.   This isn't that Marxist cess pool called college (see, Brett Weinstein, Evergreen) where the \"professor\" gets fired for making you feel bad.   In the real world, which is everything opposite of what you were taught in school is true, your boss is your boss and he doesn't owe you a paycheck. permalink parent award report block reply taytaytay 1 points 4 days ago SAM, SAM, you said they were going to be fired in this post SAM but Patrick Bateman didn't see it in the video. He has questions SAM, Patrick Bateman has questions why won't you talk to him?!? permalink parent award report block reply view 1 more comments... vongregormench 1 points 4 days ago I'm thinking some people were moved over to other publications, so were all of these people shitcanned or just some? permalink parent award report block reply deleted 7 points 4 days ago drattastic1 0 points 4 days ago I want them all bull whipped in public first by someone big and very very angry. permalink parent award report block reply\nGeneralTsoTofu 59 points 4 days ago There wasn't one. It's another bait post. permalink parent award report block reply CleanUpPhillyTrump24 1 points 4 days ago The firing was prior to this. It literally says this in the post. permalink parent award report block reply MemeWarsVet 37 points 4 days ago It does not. It mentions they were fired but gives no time frame, leading one to logically conclude they were fired AFTER this confrontation as the boss keeps telling them to get back to their work areas. permalink parent award report block reply SurfandTurf 24 points 4 days ago Naw, these faggots are still employed by the outlet but they’re trying to force their boss to reinstate the other fag departments who got axed because they’re totally fuckin’ gay and no one buys their faggot shit. Edit: apparently 4 of these pillow biters got shitcanned after this incident and Teen Vogue is being consolidated into Vogue. https://deadline.com/2025/11/conde-nast-fires-staffers-teen-vogue-1236609695/ permalink parent award report block reply SpellingContable 9 points 4 days ago only to get fired themselves The context was they got fired after being petulant children. I clicked wanting to see low IQ women and gay soy males crying after getting fired for their belligerence. permalink parent award report block reply Liberats 8 points 4 days ago Exactly why I listened to the  whiny fuck for the whole video. Waiting for it to get canned. permalink parent award report block reply view 1 more comments... fluffykitten 5 points 4 days ago LiTTeRaLLy permalink parent award report block reply Doritalos 3 points 4 days ago That was a different group permalink parent award report block reply load 1 more comments...\nCleanUpPhillyTrump24 1 points 4 days ago The firing was prior to this. It literally says this in the post. permalink parent award report block reply MemeWarsVet 37 points 4 days ago It does not. It mentions they were fired but gives no time frame, leading one to logically conclude they were fired AFTER this confrontation as the boss keeps telling them to get back to their work areas. permalink parent award report block reply SurfandTurf 24 points 4 days ago Naw, these faggots are still employed by the outlet but they’re trying to force their boss to reinstate the other fag departments who got axed because they’re totally fuckin’ gay and no one buys their faggot shit. Edit: apparently 4 of these pillow biters got shitcanned after this incident and Teen Vogue is being consolidated into Vogue. https://deadline.com/2025/11/conde-nast-fires-staffers-teen-vogue-1236609695/ permalink parent award report block reply SpellingContable 9 points 4 days ago only to get fired themselves The context was they got fired after being petulant children. I clicked wanting to see low IQ women and gay soy males crying after getting fired for their belligerence. permalink parent award report block reply Liberats 8 points 4 days ago Exactly why I listened to the  whiny fuck for the whole video. Waiting for it to get canned. permalink parent award report block reply view 1 more comments... fluffykitten 5 points 4 days ago LiTTeRaLLy permalink parent award report block reply Doritalos 3 points 4 days ago That was a different group permalink parent award report block reply load 1 more comments...\nMemeWarsVet 37 points 4 days ago It does not. It mentions they were fired but gives no time frame, leading one to logically conclude they were fired AFTER this confrontation as the boss keeps telling them to get back to their work areas. permalink parent award report block reply\nSurfandTurf 24 points 4 days ago Naw, these faggots are still employed by the outlet but they’re trying to force their boss to reinstate the other fag departments who got axed because they’re totally fuckin’ gay and no one buys their faggot shit. Edit: apparently 4 of these pillow biters got shitcanned after this incident and Teen Vogue is being consolidated into Vogue. https://deadline.com/2025/11/conde-nast-fires-staffers-teen-vogue-1236609695/ permalink parent award report block reply\nSpellingContable 9 points 4 days ago only to get fired themselves The context was they got fired after being petulant children. I clicked wanting to see low IQ women and gay soy males crying after getting fired for their belligerence. permalink parent award report block reply Liberats 8 points 4 days ago Exactly why I listened to the  whiny fuck for the whole video. Waiting for it to get canned. permalink parent award report block reply view 1 more comments...\nLiberats 8 points 4 days ago Exactly why I listened to the  whiny fuck for the whole video. Waiting for it to get canned. permalink parent award report block reply view 1 more comments...\nfluffykitten 5 points 4 days ago LiTTeRaLLy permalink parent award report block reply\nDoritalos 3 points 4 days ago That was a different group permalink parent award report block reply\nPatrick_Bateman 7 points 4 days ago BREAKING - It probably didn't happen. permalink parent award report block reply CleanUpPhillyTrump24 10 points 4 days ago Teen Vogue fired everyone last week. Try and keep up. It is likely shutting down. permalink parent award report block reply Patrick_Bateman 3 points 4 days ago So they worked for Teen Vogue and were fired. Yet somehow days after they were fired, they were in the building harassing this manager and were subsequently.... fired? Like, again? permalink parent award report block reply Smurfection 2 points 4 days ago Most of the employees from two departments were fired.   Some were retained.  Of those retained and their allies who were not fired, decided they could do some version of a college sit in and four of them ended up fired. Dear Millennials liberal women:   If you follow your boss down a hall shouting slogans about engagement after he told you to go back to your work areas, you're probably going to get fired.   This isn't that Marxist cess pool called college (see, Brett Weinstein, Evergreen) where the \"professor\" gets fired for making you feel bad.   In the real world, which is everything opposite of what you were taught in school is true, your boss is your boss and he doesn't owe you a paycheck. permalink parent award report block reply taytaytay 1 points 4 days ago SAM, SAM, you said they were going to be fired in this post SAM but Patrick Bateman didn't see it in the video. He has questions SAM, Patrick Bateman has questions why won't you talk to him?!? permalink parent award report block reply view 1 more comments... vongregormench 1 points 4 days ago I'm thinking some people were moved over to other publications, so were all of these people shitcanned or just some? permalink parent award report block reply\nCleanUpPhillyTrump24 10 points 4 days ago Teen Vogue fired everyone last week. Try and keep up. It is likely shutting down. permalink parent award report block reply Patrick_Bateman 3 points 4 days ago So they worked for Teen Vogue and were fired. Yet somehow days after they were fired, they were in the building harassing this manager and were subsequently.... fired? Like, again? permalink parent award report block reply Smurfection 2 points 4 days ago Most of the employees from two departments were fired.   Some were retained.  Of those retained and their allies who were not fired, decided they could do some version of a college sit in and four of them ended up fired. Dear Millennials liberal women:   If you follow your boss down a hall shouting slogans about engagement after he told you to go back to your work areas, you're probably going to get fired.   This isn't that Marxist cess pool called college (see, Brett Weinstein, Evergreen) where the \"professor\" gets fired for making you feel bad.   In the real world, which is everything opposite of what you were taught in school is true, your boss is your boss and he doesn't owe you a paycheck. permalink parent award report block reply taytaytay 1 points 4 days ago SAM, SAM, you said they were going to be fired in this post SAM but Patrick Bateman didn't see it in the video. He has questions SAM, Patrick Bateman has questions why won't you talk to him?!? permalink parent award report block reply view 1 more comments... vongregormench 1 points 4 days ago I'm thinking some people were moved over to other publications, so were all of these people shitcanned or just some? permalink parent award report block reply\nPatrick_Bateman 3 points 4 days ago So they worked for Teen Vogue and were fired. Yet somehow days after they were fired, they were in the building harassing this manager and were subsequently.... fired? Like, again? permalink parent award report block reply Smurfection 2 points 4 days ago Most of the employees from two departments were fired.   Some were retained.  Of those retained and their allies who were not fired, decided they could do some version of a college sit in and four of them ended up fired. Dear Millennials liberal women:   If you follow your boss down a hall shouting slogans about engagement after he told you to go back to your work areas, you're probably going to get fired.   This isn't that Marxist cess pool called college (see, Brett Weinstein, Evergreen) where the \"professor\" gets fired for making you feel bad.   In the real world, which is everything opposite of what you were taught in school is true, your boss is your boss and he doesn't owe you a paycheck. permalink parent award report block reply taytaytay 1 points 4 days ago SAM, SAM, you said they were going to be fired in this post SAM but Patrick Bateman didn't see it in the video. He has questions SAM, Patrick Bateman has questions why won't you talk to him?!? permalink parent award report block reply view 1 more comments...\nSmurfection 2 points 4 days ago Most of the employees from two departments were fired.   Some were retained.  Of those retained and their allies who were not fired, decided they could do some version of a college sit in and four of them ended up fired. Dear Millennials liberal women:   If you follow your boss down a hall shouting slogans about engagement after he told you to go back to your work areas, you're probably going to get fired.   This isn't that Marxist cess pool called college (see, Brett Weinstein, Evergreen) where the \"professor\" gets fired for making you feel bad.   In the real world, which is everything opposite of what you were taught in school is true, your boss is your boss and he doesn't owe you a paycheck. permalink parent award report block reply\ntaytaytay 1 points 4 days ago SAM, SAM, you said they were going to be fired in this post SAM but Patrick Bateman didn't see it in the video. He has questions SAM, Patrick Bateman has questions why won't you talk to him?!? permalink parent award report block reply view 1 more comments...\nvongregormench 1 points 4 days ago I'm thinking some people were moved over to other publications, so were all of these people shitcanned or just some? permalink parent award report block reply\ndeleted 7 points 4 days ago drattastic1 0 points 4 days ago I want them all bull whipped in public first by someone big and very very angry. permalink parent award report block reply\ndrattastic1 0 points 4 days ago I want them all bull whipped in public first by someone big and very very angry. permalink parent award report block reply\nArmiakrajowa 47 points 4 days ago This might be the gayest thing I saw all year. permalink award report block reply JoeBidensDementia6 18 points 4 days ago Its pretty fn gay. permalink parent award report block reply Gletkin 8 points 4 days ago They have to show up to the office in person 4 days a week man. That’s the violence inherent in the system. permalink parent award report block reply Armiakrajowa 5 points 4 days ago It's literally worse than 9-11. permalink parent award report block reply Gletkin 3 points 4 days ago It’s a dog whistle for white supremacist anti-trans systemic queerphobia permalink parent award report block reply Shakakka99 3 points 4 days ago And that's saying something. permalink parent award report block reply SuperHonkey OP 2 points 4 days ago Thamm! THAMMM!! grabs purse and huffs away 😳 permalink parent award report block reply\nJoeBidensDementia6 18 points 4 days ago Its pretty fn gay. permalink parent award report block reply\nGletkin 8 points 4 days ago They have to show up to the office in person 4 days a week man. That’s the violence inherent in the system. permalink parent award report block reply Armiakrajowa 5 points 4 days ago It's literally worse than 9-11. permalink parent award report block reply Gletkin 3 points 4 days ago It’s a dog whistle for white supremacist anti-trans systemic queerphobia permalink parent award report block reply\nArmiakrajowa 5 points 4 days ago It's literally worse than 9-11. permalink parent award report block reply Gletkin 3 points 4 days ago It’s a dog whistle for white supremacist anti-trans systemic queerphobia permalink parent award report block reply\nGletkin 3 points 4 days ago It’s a dog whistle for white supremacist anti-trans systemic queerphobia permalink parent award report block reply\nShakakka99 3 points 4 days ago And that's saying something. permalink parent award report block reply\nSuperHonkey OP 2 points 4 days ago Thamm! THAMMM!! grabs purse and huffs away 😳 permalink parent award report block reply\nBlackJack1776 30 points 4 days ago This is who he decided to hire. Dipshit gets no sympathy from me. permalink award report block reply Gletkin 5 points 4 days ago If he actually fired them for cause he’s be badass. But is that even happening? permalink parent award report block reply BlackJack1776 6 points 4 days ago Yes. Both Teen Vouge and Wired have laid of something like 70%+ of their staff in the last few weeks. These Was/Were are the comrades of the Get/Gones that basically protested outside his C-Suite office door. FAFO for all involved. permalink parent award report block reply Gletkin 3 points 4 days ago Awesome permalink parent award report block reply Smurfection 4 points 4 days ago At least four from this little REEE fest got fired.  I believe prior to this, 70% of the staff of one publication and a couple of departments were fired. permalink parent award report block reply Gletkin 2 points 4 days ago Awesome. permalink parent award report block reply\nGletkin 5 points 4 days ago If he actually fired them for cause he’s be badass. But is that even happening? permalink parent award report block reply BlackJack1776 6 points 4 days ago Yes. Both Teen Vouge and Wired have laid of something like 70%+ of their staff in the last few weeks. These Was/Were are the comrades of the Get/Gones that basically protested outside his C-Suite office door. FAFO for all involved. permalink parent award report block reply Gletkin 3 points 4 days ago Awesome permalink parent award report block reply Smurfection 4 points 4 days ago At least four from this little REEE fest got fired.  I believe prior to this, 70% of the staff of one publication and a couple of departments were fired. permalink parent award report block reply Gletkin 2 points 4 days ago Awesome. permalink parent award report block reply\nBlackJack1776 6 points 4 days ago Yes. Both Teen Vouge and Wired have laid of something like 70%+ of their staff in the last few weeks. These Was/Were are the comrades of the Get/Gones that basically protested outside his C-Suite office door. FAFO for all involved. permalink parent award report block reply Gletkin 3 points 4 days ago Awesome permalink parent award report block reply\nGletkin 3 points 4 days ago Awesome permalink parent award report block reply\nSmurfection 4 points 4 days ago At least four from this little REEE fest got fired.  I believe prior to this, 70% of the staff of one publication and a couple of departments were fired. permalink parent award report block reply Gletkin 2 points 4 days ago Awesome. permalink parent award report block reply\nGletkin 2 points 4 days ago Awesome. permalink parent award report block reply\nBldg_2019 28 points 4 days ago That’s a shitload of hard drives that need to be checked right there, including HR fag. permalink award report block reply SuperHonkey OP 5 points 4 days ago CP goldmine permalink parent award report block reply Nick-Kerr -3 points 4 days ago \"goldmine\"??? That's pretty disgusting. It implies value and something you want. How about a CP filled life ender? permalink parent award report block reply VeryFinePerson84 3 points 4 days ago The gold represents the value of something that can be used to terminate them permalink parent award report block reply Nick-Kerr -2 points 4 days ago If you can't figure out using a term for \"treasure\" and \"value\" applied here to child porn, the  you just may be a pedo yourself. \"Evidence of a heinous crime\" is more suited here. (Pedos will downvote me) I do agree, however, on your term \"terminate them\", but in a much different context. permalink parent award report block reply\nSuperHonkey OP 5 points 4 days ago CP goldmine permalink parent award report block reply Nick-Kerr -3 points 4 days ago \"goldmine\"??? That's pretty disgusting. It implies value and something you want. How about a CP filled life ender? permalink parent award report block reply VeryFinePerson84 3 points 4 days ago The gold represents the value of something that can be used to terminate them permalink parent award report block reply Nick-Kerr -2 points 4 days ago If you can't figure out using a term for \"treasure\" and \"value\" applied here to child porn, the  you just may be a pedo yourself. \"Evidence of a heinous crime\" is more suited here. (Pedos will downvote me) I do agree, however, on your term \"terminate them\", but in a much different context. permalink parent award report block reply\nNick-Kerr -3 points 4 days ago \"goldmine\"??? That's pretty disgusting. It implies value and something you want. How about a CP filled life ender? permalink parent award report block reply VeryFinePerson84 3 points 4 days ago The gold represents the value of something that can be used to terminate them permalink parent award report block reply Nick-Kerr -2 points 4 days ago If you can't figure out using a term for \"treasure\" and \"value\" applied here to child porn, the  you just may be a pedo yourself. \"Evidence of a heinous crime\" is more suited here. (Pedos will downvote me) I do agree, however, on your term \"terminate them\", but in a much different context. permalink parent award report block reply\nVeryFinePerson84 3 points 4 days ago The gold represents the value of something that can be used to terminate them permalink parent award report block reply Nick-Kerr -2 points 4 days ago If you can't figure out using a term for \"treasure\" and \"value\" applied here to child porn, the  you just may be a pedo yourself. \"Evidence of a heinous crime\" is more suited here. (Pedos will downvote me) I do agree, however, on your term \"terminate them\", but in a much different context. permalink parent award report block reply\nNick-Kerr -2 points 4 days ago If you can't figure out using a term for \"treasure\" and \"value\" applied here to child porn, the  you just may be a pedo yourself. \"Evidence of a heinous crime\" is more suited here. (Pedos will downvote me) I do agree, however, on your term \"terminate them\", but in a much different context. permalink parent award report block reply\nFilo76 23 points 4 days ago I heard the tranny a mile away. permalink award report block reply couranto 12 points 4 days ago He was shitcanned. Avalle wrote on X, “I love my job, I love my coworkers, and I love my union. I’m devastated the company made this move. There are so few trans women in media at all — particularly ones who aren’t confined to ‘Queer Media’ — and I was incredibly proud of what my position at Bon Appétit meant at large. She added, “More important to me than my identity, I am also the Vice President of the NewsGuild of New York, and targeting me with a blatantly retaliatory termination like this feels like an egregious shot against our union and against media workers as a whole.” permalink parent award report block reply GodSaveTheWest 10 points 4 days ago He* permalink parent award report block reply Nick-Kerr 3 points 4 days ago Union. It can die in a fire with the rest of the commies permalink parent award report block reply XlDEN 4 points 4 days ago Even without sound those clown shoes are a giveaway. permalink parent award report block reply\ncouranto 12 points 4 days ago He was shitcanned. Avalle wrote on X, “I love my job, I love my coworkers, and I love my union. I’m devastated the company made this move. There are so few trans women in media at all — particularly ones who aren’t confined to ‘Queer Media’ — and I was incredibly proud of what my position at Bon Appétit meant at large. She added, “More important to me than my identity, I am also the Vice President of the NewsGuild of New York, and targeting me with a blatantly retaliatory termination like this feels like an egregious shot against our union and against media workers as a whole.” permalink parent award report block reply GodSaveTheWest 10 points 4 days ago He* permalink parent award report block reply Nick-Kerr 3 points 4 days ago Union. It can die in a fire with the rest of the commies permalink parent award report block reply\nGodSaveTheWest 10 points 4 days ago He* permalink parent award report block reply\nNick-Kerr 3 points 4 days ago Union. It can die in a fire with the rest of the commies permalink parent award report block reply\nXlDEN 4 points 4 days ago Even without sound those clown shoes are a giveaway. permalink parent award report block reply\nSanityGumby 21 points 4 days ago They are insufferable because these are people working for the company that controls Reddit. I bet each and every one is a mod in some tranny gay sex subreddit permalink award report block reply\nDoomer_Guy 21 points 4 days ago I liked the part where he mentions that they work 4 days a week permalink award report block reply CleanUpPhillyTrump24 11 points 4 days ago Leftist: REEE YOU MADE US COME INTO THE ACTUAL OFFICE FOUR DAYS A WEEK YOU BIGOT NOW WE GET FIRED REEEE. Lulz. They saw they can't stand having these loons in an office. permalink parent award report block reply raptormissle 7 points 4 days ago It's cute that they call it work. It's basically daycare for trannies. permalink parent award report block reply\nCleanUpPhillyTrump24 11 points 4 days ago Leftist: REEE YOU MADE US COME INTO THE ACTUAL OFFICE FOUR DAYS A WEEK YOU BIGOT NOW WE GET FIRED REEEE. Lulz. They saw they can't stand having these loons in an office. permalink parent award report block reply\nraptormissle 7 points 4 days ago It's cute that they call it work. It's basically daycare for trannies. permalink parent award report block reply\nChuj 16 points 4 days ago Careful. The tranny might go postal on the office. Dangerous permalink award report block reply SuperHonkey OP 6 points 4 days ago Win/win! permalink parent award report block reply f_bastiat 3 points 4 days ago I was genuinely getting anxious watching that, you can't turn your back on people like that. permalink parent award report block reply Chuj 2 points 4 days ago You are correct! In clinic, the computers face away from the patients, so if type on it with them my back may face the transgender patient. I contort to watch them through peripheral vision. Safest that way permalink parent award report block reply Psarg 1 points 4 days ago They convinced him to cut his dick off to sterilize him and use him as a political tool. They usually don't go postal because the embarrassment of that is so huge they just commit suicide. permalink parent award report block reply Agent_Orange 3 points 4 days ago I'm curious what percentage of trannies actually cut their dicks off. It seems that, based on their weak character in the first place, it's more of a dress-up fad with a fake soft voices than anything else. permalink parent award report block reply Chuj 3 points 4 days ago I disagree. They go back to the schools that disrespected their mental disorder, and shoot them up. Pure postal permalink parent award report block reply\nSuperHonkey OP 6 points 4 days ago Win/win! permalink parent award report block reply\nf_bastiat 3 points 4 days ago I was genuinely getting anxious watching that, you can't turn your back on people like that. permalink parent award report block reply Chuj 2 points 4 days ago You are correct! In clinic, the computers face away from the patients, so if type on it with them my back may face the transgender patient. I contort to watch them through peripheral vision. Safest that way permalink parent award report block reply\nChuj 2 points 4 days ago You are correct! In clinic, the computers face away from the patients, so if type on it with them my back may face the transgender patient. I contort to watch them through peripheral vision. Safest that way permalink parent award report block reply\nPsarg 1 points 4 days ago They convinced him to cut his dick off to sterilize him and use him as a political tool. They usually don't go postal because the embarrassment of that is so huge they just commit suicide. permalink parent award report block reply Agent_Orange 3 points 4 days ago I'm curious what percentage of trannies actually cut their dicks off. It seems that, based on their weak character in the first place, it's more of a dress-up fad with a fake soft voices than anything else. permalink parent award report block reply Chuj 3 points 4 days ago I disagree. They go back to the schools that disrespected their mental disorder, and shoot them up. Pure postal permalink parent award report block reply\nAgent_Orange 3 points 4 days ago I'm curious what percentage of trannies actually cut their dicks off. It seems that, based on their weak character in the first place, it's more of a dress-up fad with a fake soft voices than anything else. permalink parent award report block reply\nChuj 3 points 4 days ago I disagree. They go back to the schools that disrespected their mental disorder, and shoot them up. Pure postal permalink parent award report block reply\nhnoble444 14 points 4 days ago They want the anal sex guide back. permalink award report block reply SuperHonkey OP 6 points 4 days ago We're DONE with that shit! - Emperor Hegseth permalink parent award report block reply\nSuperHonkey OP 6 points 4 days ago We're DONE with that shit! - Emperor Hegseth permalink parent award report block reply\nHunterBidensPC 12 points 4 days ago No remorse for him because he had a climate and lgbt department in the first place. This is what you get. This is who you hired permalink award report block reply CleanUpPhillyTrump24 4 points 4 days ago This is just the HR guy. No say on hiring woke nutters to be \"journalists.\" permalink parent award report block reply RustySheckelford 1 points 4 days ago Imagine having sympathy for someone who willingly takes the most universally hated job in history. permalink parent award report block reply GodSaveTheWest 4 points 4 days ago I mean if we are going to take back our culture thats exactly what we should be doing, taking their jobs from them and enforcing our own beliefs. Conservative giving up power is how all of this has happened in the first place. Take it back by infiltrating like they did. permalink parent award report block reply\nCleanUpPhillyTrump24 4 points 4 days ago This is just the HR guy. No say on hiring woke nutters to be \"journalists.\" permalink parent award report block reply RustySheckelford 1 points 4 days ago Imagine having sympathy for someone who willingly takes the most universally hated job in history. permalink parent award report block reply GodSaveTheWest 4 points 4 days ago I mean if we are going to take back our culture thats exactly what we should be doing, taking their jobs from them and enforcing our own beliefs. Conservative giving up power is how all of this has happened in the first place. Take it back by infiltrating like they did. permalink parent award report block reply\nRustySheckelford 1 points 4 days ago Imagine having sympathy for someone who willingly takes the most universally hated job in history. permalink parent award report block reply GodSaveTheWest 4 points 4 days ago I mean if we are going to take back our culture thats exactly what we should be doing, taking their jobs from them and enforcing our own beliefs. Conservative giving up power is how all of this has happened in the first place. Take it back by infiltrating like they did. permalink parent award report block reply\nGodSaveTheWest 4 points 4 days ago I mean if we are going to take back our culture thats exactly what we should be doing, taking their jobs from them and enforcing our own beliefs. Conservative giving up power is how all of this has happened in the first place. Take it back by infiltrating like they did. permalink parent award report block reply\nVirTW 10 points 4 days ago Doesn't look like they are working to me permalink award report block reply\nAlldayeveryday 10 points 4 days ago Stop letting these retards do this dumb shit. Fire them and move on permalink award report block reply\nemorphia 7 points 4 days ago that is why you do not hire leftists.\nthey are a headache in every possible way for a company. permalink award report block reply\nRustySheckelford 6 points 4 days ago Can gay people really expect respect when they make these kinds of videos and 100% of people with ears know the camera\"man\" is a giant flaming faggot? permalink award report block reply\nKiwipede22 6 points 4 days ago It is called BULLYING. permalink award report block reply SuperHonkey OP 6 points 4 days ago Crybullies permalink parent award report block reply\nSuperHonkey OP 6 points 4 days ago Crybullies permalink parent award report block reply\nAbelsRevenge 6 points 4 days ago The soy is strong with these things permalink award report block reply FredRedd 2 points 4 days ago Kek! \"Use the soy, Luke. Let go...\" permalink parent award report block reply\nFredRedd 2 points 4 days ago Kek! \"Use the soy, Luke. Let go...\" permalink parent award report block reply\nBb1434 6 points 4 days ago At the end, the thing who shouts \"what are you going tondo to stand up to the trump administration?\".  In what world and what universe has Teen Vogue EVER mattered to ANY administration?  These people actually believe their own bs. I cannot imagine living a life where I am that clueless. It's f'ing teen vogue. permalink award report block reply SuperHonkey OP 4 points 4 days ago Well, they are gay, so... permalink parent award report block reply\nSuperHonkey OP 4 points 4 days ago Well, they are gay, so... permalink parent award report block reply\nMakeAmericaVapeAgain 5 points 4 days ago look at how these idiots solve problems. they were raised to complain until they get what they wanted, except that isn’t how the world really works. so they show up as a group believing that more numbers equals more power. they are told no, and they get mean and pissy. we are dealing with spoiled brats that have very little going for them. permalink award report block reply\nMike_Hoxbigg 4 points 4 days ago I can't imagine anyone wanting to work with that faggot tranny. That voice alone and tone of utter entitlement -- fire it, from a cannon, into the sun. permalink award report block reply\ns27zw7M1h62lURPyezOa PRO 4 points 4 days ago Subscriped to Wired back in the day that is was not a woke rag.  Can we not have one single tech publication that is not woke.  Does anyone know of one? permalink award report block reply FredRedd 4 points 4 days ago Agree totally that once upon a time, mags like Wired and Mondo 2000 (dating myself again, ain't I?)  were once really great mags, but that was a long time ago. permalink parent award report block reply s27zw7M1h62lURPyezOa PRO 2 points 4 days ago Is there any tech publication that is not woke?  What do you read for tech? permalink parent award report block reply DemPanicAtTheDisco 3 points 4 days ago “Any organization that is not explicitly right-wing will eventually become left-wing.” Conquest's second law of politics permalink parent award report block reply\nFredRedd 4 points 4 days ago Agree totally that once upon a time, mags like Wired and Mondo 2000 (dating myself again, ain't I?)  were once really great mags, but that was a long time ago. permalink parent award report block reply s27zw7M1h62lURPyezOa PRO 2 points 4 days ago Is there any tech publication that is not woke?  What do you read for tech? permalink parent award report block reply\ns27zw7M1h62lURPyezOa PRO 2 points 4 days ago Is there any tech publication that is not woke?  What do you read for tech? permalink parent award report block reply\nDemPanicAtTheDisco 3 points 4 days ago “Any organization that is not explicitly right-wing will eventually become left-wing.” Conquest's second law of politics permalink parent award report block reply\nnoPTSDforMePlease 4 points 4 days ago Here's more context because our mods are gay and sticky stories that have no context: https://deadline.com/2025/11/conde-nast-fires-staffers-teen-vogue-1236609695/ permalink award report block reply\nJesusTheOnlyWay 4 points 4 days ago This stuff is why I'm moving into a 'nothing' small town, to live quietly and serve God and raise my son and spend time with my wife I don't want to even be 50 miles within hearing about this degeneracy permalink award report block reply\nDingleBalls 3 points 4 days ago \"-justice\" = \"make laws to force degeneracy on everyone\". permalink award report block reply\nGottaMemberMyPW 3 points 4 days ago “What are you gonna do to stand up to the Trump administration?!” Good grief. permalink award report block reply\njrhicksjr 3 points 4 days ago Slack-Jawed Faggots? That would be a shitty band name. permalink award report block reply SuperHonkey OP 1 points 4 days ago https://youtu.be/HayFxnfFgZk permalink parent award report block reply\nSuperHonkey OP 1 points 4 days ago https://youtu.be/HayFxnfFgZk permalink parent award report block reply\nPepesJusticeBoner 3 points 4 days ago You're fired! Go be gay somewhere else! permalink award report block reply\nHillarysBeaverMunch 3 points 4 days ago Teen Vogue exists solely to pollute your 12 year old daughter by pushing deviancy and degeneracy nonstop, as per the agenda of the Khazar masters. permalink award report block reply Nick-Kerr 3 points 4 days ago And sons. They are grooming both sexes permalink parent award report block reply\nNick-Kerr 3 points 4 days ago And sons. They are grooming both sexes permalink parent award report block reply\nBidensfullAFdiaper 3 points 4 days ago So much soy. NONE of these men piss standing up. permalink award report block reply\nEatAturdBurger 3 points 4 days ago Insufferable employees should be fired. They are not doing their jobs, they are being insubordinate, and they are harassing their head of HR. permalink award report block reply\nBrewSwillis 3 points 4 days ago That red haired lady that was talking to him had a very deep voice. permalink award report block reply SuperHonkey OP 3 points 4 days ago That's a MAN baby! permalink parent award report block reply Keep_on_winning_kag 3 points 4 days ago Dude looks like a lady! permalink parent award report block reply\nSuperHonkey OP 3 points 4 days ago That's a MAN baby! permalink parent award report block reply Keep_on_winning_kag 3 points 4 days ago Dude looks like a lady! permalink parent award report block reply\nKeep_on_winning_kag 3 points 4 days ago Dude looks like a lady! permalink parent award report block reply\nAisle-is-closed 3 points 4 days ago They look like Mandani supporters to me. permalink award report block reply\nFredRedd 3 points 4 days ago Hey pal, here's an idea: if you don't like the way they run things, why not jump ship and... start a new, competing publication - run the way you and your pals think it thugs SHOULD be run? Or is that too capitalist for you? Or would the fact that would entail some hard work that requires you in the office for more than 4 days a week? Lord knows I'm hardly in the work-ethic range/capability of Donald Trump, but this pussified, entitled attitude spikes my blood pressure bigly. permalink award report block reply CasuallyObservant 3 points 4 days ago Reminds me of that newly opened Portland Lesbian bar/coffee shop (was back in 2022) that was a special meet-up place for gay women only - (no men allowed - except trans men).  It was cleverly decorated, had a bunch of nice menu items and hired only lesbians for this one-of-a-kind niche business. It did well for a whole four days before the entitled workers presented the owner with a list of demands, including expecting an ownership stake (!) and demanded that it be turned into a 'queer worker-owned cooperative' and educational center for far-left activities, rather than a for-profit business. (They failed to realize that wait staff, bussers, and kitchen help have no special talent or immutable characteristics that can't be replaced within the day). The owner, who already had a couple of other successful restaurants and 'regular' coffee shops simply closed the place and changed the locks.  Sometimes that's all you can do. permalink parent award report block reply Mike_Hoxbigg 3 points 4 days ago I remember that! I shook my head and laughed, \"I give them a week.\" 4 days later... permalink parent award report block reply\nCasuallyObservant 3 points 4 days ago Reminds me of that newly opened Portland Lesbian bar/coffee shop (was back in 2022) that was a special meet-up place for gay women only - (no men allowed - except trans men).  It was cleverly decorated, had a bunch of nice menu items and hired only lesbians for this one-of-a-kind niche business. It did well for a whole four days before the entitled workers presented the owner with a list of demands, including expecting an ownership stake (!) and demanded that it be turned into a 'queer worker-owned cooperative' and educational center for far-left activities, rather than a for-profit business. (They failed to realize that wait staff, bussers, and kitchen help have no special talent or immutable characteristics that can't be replaced within the day). The owner, who already had a couple of other successful restaurants and 'regular' coffee shops simply closed the place and changed the locks.  Sometimes that's all you can do. permalink parent award report block reply Mike_Hoxbigg 3 points 4 days ago I remember that! I shook my head and laughed, \"I give them a week.\" 4 days later... permalink parent award report block reply\nMike_Hoxbigg 3 points 4 days ago I remember that! I shook my head and laughed, \"I give them a week.\" 4 days later... permalink parent award report block reply\nraptormissle 2 points 4 days ago Of course a violent tranny was instigating the confrontation. These companies deserve the shit they put themselves in. permalink award report block reply\nRyanKeyOh 2 points 4 days ago Good. The entitlement is insane. Do your fucking job. Be an activist on your own time. permalink award report block reply\ningrowntoenail 2 points 4 days ago They all sound like mealy-mouthed faggots. permalink award report block reply Tookens 2 points 4 days ago That's because they are all mealy-mouthed faggots. permalink parent award report block reply\nTookens 2 points 4 days ago That's because they are all mealy-mouthed faggots. permalink parent award report block reply\nAgent_86 2 points 4 days ago HAHAHAHAHAHAHA!!!!! permalink award report block reply\nSuperHonkey OP 2 points 4 days ago HO LEEE SHIIIIIIIIIIT!!! 🚨🚨🚨🚨3 STICKIES IN ONE DAY!!! 🚨🚨🚨🚨 Which one of you mods is homo for me?? 😍😘 permalink award report block reply\nme-no-likely3 2 points 4 days ago Could you imagine having to work with such insufferable faggots? permalink award report block reply\nJimmyRussler 2 points 4 days ago Skinny jeans on a dude should be enough to admit to the nuthouse. permalink award report block reply CasuallyObservant 3 points 4 days ago Gay.  Or wannabe trans.  Yeesh. permalink parent award report block reply\nCasuallyObservant 3 points 4 days ago Gay.  Or wannabe trans.  Yeesh. permalink parent award report block reply\nSavingPrivateGrace 2 points 4 days ago It's still a good sign American journalism is healing. permalink award report block reply\nTrue_Curmudgeon 2 points 4 days ago This place needs to be a lot harder to survive in so that people can't be like this permalink award report block reply\nAgnesDomini 2 points 4 days ago Best Nelson Muntz laugh: Ha-hah! permalink award report block reply\nDJTXLV 1 points 4 days ago Fucking faggots. Also fuck the OP. There was no firing in this video. permalink award report block reply SuperHonkey OP 1 points 4 days ago Lol eat shit retard... They were fired for this incident. permalink parent award report block reply\nSuperHonkey OP 1 points 4 days ago Lol eat shit retard... They were fired for this incident. permalink parent award report block reply\nMadRussian 1 points 4 days ago Gay permalink award report block reply\nGivesgunstogrannies 1 points 4 days ago I'd walk straight to human resources. Make these faggots walk right into their exit interview. permalink award report block reply\nDrVSGGEOTUSPhD 1 points 4 days ago Can you imagine...you're desperately trying to keep your stable of dying magazines alive and these brats lay seige to your corner office? permalink award report block reply SuperHonkey OP 2 points 4 days ago Fuck that woke rag! Let it whither and die permalink parent award report block reply DrVSGGEOTUSPhD 2 points 4 days ago Well obviously! But I'm sympathizing with the boss of those brats.  Glad his satanic communist filth is tanking permalink parent award report block reply\nSuperHonkey OP 2 points 4 days ago Fuck that woke rag! Let it whither and die permalink parent award report block reply DrVSGGEOTUSPhD 2 points 4 days ago Well obviously! But I'm sympathizing with the boss of those brats.  Glad his satanic communist filth is tanking permalink parent award report block reply\nDrVSGGEOTUSPhD 2 points 4 days ago Well obviously! But I'm sympathizing with the boss of those brats.  Glad his satanic communist filth is tanking permalink parent award report block reply\nDrTar 1 points 4 days ago Yeah, Hand them all a small cardboard box, take their ID and or pass cards give them 5 minutes to clean out their desk then have the escorted out of the building by security. Problem solved. permalink award report block reply\nterribletwos 0 points 4 days ago Bruh, it's always trannies. I'd just reinstate an LGB department just to see the chaos. Thought they just shut down Teen Vogue? permalink award report block reply\nSlipcue 0 points 4 days ago Man, I wanted to see him turn around and go from calm to lighting them the fuck up! Why is this stickied? permalink award report block reply\nChoppermagic 0 points 4 days ago no firings permalink award report block reply\nFORMERCHILDSTAR 0 points 4 days ago I'm my opinion if your work doesn't cause you to sweat, bleed, save lives, fix or build something with your hands, or create something beneficial for mankind, your not really working. What these people do for work isn't really work, it's play time for gay children. permalink award report block reply",
  "fetched_at": "2025-11-12T21:16:49.732651Z"
}