{
  "id": "1ARK590cg1",
  "url": "https://patriots.win/p/1ARK590cg1/how-to-ny/c",
  "content": "918 How to NY posted 4 days ago by _Liberty_Prime_ 31 comments award share download report block\n31 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style TrancePhreak 20 points 4 days ago Probably ought to read up on Night of the Jinn... likely to increase in happenings around there. permalink award report block reply Awakened 7 points 4 days ago An internet search brings up a much more sanitized version than the original. permalink parent award report block reply TrancePhreak 5 points 4 days ago https://www.youtube.com/watch?v=jtTYxxmVpvA I think many can ascertain the meaning of it from this video. permalink parent award report block reply Awakened 2 points 3 days ago Lol, that was the best one of these videos I've seen on the subject. Thank you again. Will share. permalink parent award report block reply Awakened 2 points 3 days ago Thank you. I was fishing to get you to post something like that. I really couldn't find one with a simple search. They've done a great job of scrubbing and cleaning it. permalink parent award report block reply TreeTop300 3 points 4 days ago They wish those were jinn... permalink parent award report block reply Lostroninsoul 19 points 4 days ago I am a new yorker that has both of those books ... I believe Christ is the only way to defeat both ideologies permalink award report block reply _Liberty_Prime_ OP 10 points 4 days ago ❤ permalink parent award report block reply ModernKnight 2 points 3 days ago The best way to destroy the enemy is to know the enemy.  People should read the Koran 3 times (it's not too long)- once as it's bound, a first time chronologically on its own, and another time chronologically while reading the Hadiths along with it.  It shows EXACTLY what Islam is all about. Picking up a Talmud is a good idea too. permalink parent award report block reply ApprenticeParty 4 points 3 days ago The Quran borrows a lot from the Talmud. Allah believes the Talmud is scripture. Something even Jews don’t. The Talmud is a library. Reading the Quran 3 times sounds like torture. It’s truly awful. permalink parent award report block reply keeman 7 points 4 days ago Book in left hand is pretty much how the US gov has been going for 100 years.  How much or your life is interacting with the gov?  We are supposed to live in a limited government republic where the answer is \"almost none\".  We are on the road to serfdom. permalink award report block reply journalist 5 points 4 days ago Have fun with that… permalink award report block reply FuzzAldrin 5 points 4 days ago New Marx City permalink award report block reply Girthquakes 3 points 4 days ago \"Holy\" permalink award report block reply mass55th 2 points 4 days ago Don't forget to take your prayer rugs with you, when you visit New York City. permalink award report block reply AlmostFullyDilated 4 points 4 days ago why would anyone visit NYC? I'd rather kill myself permalink parent award report block reply mass55th 4 points 4 days ago First time I went was in the 50's. It was a far different place then. My Dad worked for the NY Central Railroad, so we got to ride the train for free. My brother and I were the youngest. My parents would take us from Rochester, NY on the train. We'd leave at midnight on a Friday night, and get to the City early Saturday morning, in time for breakfast. We'd stay overnight at the Hotel Piccadilly, then take the train back home Sunday afternoon. It was a treat for us, because we didn't have car. The Piccadilly Hotel was demolished in 1982. The last time I went to NY City was in 2006. permalink parent award report block reply TexasBrowncoat 2 points 3 days ago Reading material for when you are standing in a bread line. permalink award report block reply DCYR66 1 points 3 days ago Look he’s holding a roll of toilet paper in both hands. permalink award report block reply dontdrinksoy 1 points 3 days ago Lesbians these days look so scruffy. permalink award report block reply Reclaimer69 1 points 3 days ago Idk. They would probably be audio books because he can't actually read. Put some headphones on his head and butt plugs in his hands. permalink award report block reply Made_in_America -2 points 4 days ago This Mamdani psyop is weird. There are no Communist Muslim countries. Communism is a Judeo-Bolshevik monstrosity. And that is who’s backing Mamdani. permalink award report block reply _Liberty_Prime_ OP 7 points 4 days ago Muslims say Muslims are backing him. permalink parent award report block reply Made_in_America 0 points 3 days ago But they’re not. He’s literally taken photos with the Soros family and most of his staff is Jewish. It’s just another Jewish trick. permalink parent award report block reply Friendly_B 1 points 3 days ago Ancient Greece and Rome had communist writers.  There at lots of them. Ever hear of Plato's Republic? Oh, (((Plato))).  Maybe he's one of them. permalink parent award report block reply Made_in_America 0 points 3 days ago Plato was neither a socialist nor communist. Communism is Jewish. This is a fact. permalink parent award report block reply guywholikesDjtof2024 1 points 4 days ago no communist muzz countries So? What's the point? And where's the psyop? There are muzz countries where CHRISTIANS (people who acknowledge reality) are murdered by muzzlims (Bible-disbelieving quranists). permalink parent award report block reply Made_in_America 0 points 3 days ago Communism is Jewish. Mamdani’s staff and financial backers are too. Mamdani is just theater. permalink parent award report block reply Dr_Phil 0 points 3 days ago Take your medication. permalink parent award report block reply Made_in_America 0 points 3 days ago Typical gaslighting. Your generation failed the long running Zionist agenda. It must be so humiliating to know that Zionism is dying because you're a lesser man than your ancestors were. permalink parent award report block reply\nTrancePhreak 20 points 4 days ago Probably ought to read up on Night of the Jinn... likely to increase in happenings around there. permalink award report block reply Awakened 7 points 4 days ago An internet search brings up a much more sanitized version than the original. permalink parent award report block reply TrancePhreak 5 points 4 days ago https://www.youtube.com/watch?v=jtTYxxmVpvA I think many can ascertain the meaning of it from this video. permalink parent award report block reply Awakened 2 points 3 days ago Lol, that was the best one of these videos I've seen on the subject. Thank you again. Will share. permalink parent award report block reply Awakened 2 points 3 days ago Thank you. I was fishing to get you to post something like that. I really couldn't find one with a simple search. They've done a great job of scrubbing and cleaning it. permalink parent award report block reply TreeTop300 3 points 4 days ago They wish those were jinn... permalink parent award report block reply\nAwakened 7 points 4 days ago An internet search brings up a much more sanitized version than the original. permalink parent award report block reply TrancePhreak 5 points 4 days ago https://www.youtube.com/watch?v=jtTYxxmVpvA I think many can ascertain the meaning of it from this video. permalink parent award report block reply Awakened 2 points 3 days ago Lol, that was the best one of these videos I've seen on the subject. Thank you again. Will share. permalink parent award report block reply Awakened 2 points 3 days ago Thank you. I was fishing to get you to post something like that. I really couldn't find one with a simple search. They've done a great job of scrubbing and cleaning it. permalink parent award report block reply\nTrancePhreak 5 points 4 days ago https://www.youtube.com/watch?v=jtTYxxmVpvA I think many can ascertain the meaning of it from this video. permalink parent award report block reply Awakened 2 points 3 days ago Lol, that was the best one of these videos I've seen on the subject. Thank you again. Will share. permalink parent award report block reply Awakened 2 points 3 days ago Thank you. I was fishing to get you to post something like that. I really couldn't find one with a simple search. They've done a great job of scrubbing and cleaning it. permalink parent award report block reply\nAwakened 2 points 3 days ago Lol, that was the best one of these videos I've seen on the subject. Thank you again. Will share. permalink parent award report block reply\nAwakened 2 points 3 days ago Thank you. I was fishing to get you to post something like that. I really couldn't find one with a simple search. They've done a great job of scrubbing and cleaning it. permalink parent award report block reply\nTreeTop300 3 points 4 days ago They wish those were jinn... permalink parent award report block reply\nLostroninsoul 19 points 4 days ago I am a new yorker that has both of those books ... I believe Christ is the only way to defeat both ideologies permalink award report block reply _Liberty_Prime_ OP 10 points 4 days ago ❤ permalink parent award report block reply ModernKnight 2 points 3 days ago The best way to destroy the enemy is to know the enemy.  People should read the Koran 3 times (it's not too long)- once as it's bound, a first time chronologically on its own, and another time chronologically while reading the Hadiths along with it.  It shows EXACTLY what Islam is all about. Picking up a Talmud is a good idea too. permalink parent award report block reply ApprenticeParty 4 points 3 days ago The Quran borrows a lot from the Talmud. Allah believes the Talmud is scripture. Something even Jews don’t. The Talmud is a library. Reading the Quran 3 times sounds like torture. It’s truly awful. permalink parent award report block reply\n_Liberty_Prime_ OP 10 points 4 days ago ❤ permalink parent award report block reply\nModernKnight 2 points 3 days ago The best way to destroy the enemy is to know the enemy.  People should read the Koran 3 times (it's not too long)- once as it's bound, a first time chronologically on its own, and another time chronologically while reading the Hadiths along with it.  It shows EXACTLY what Islam is all about. Picking up a Talmud is a good idea too. permalink parent award report block reply ApprenticeParty 4 points 3 days ago The Quran borrows a lot from the Talmud. Allah believes the Talmud is scripture. Something even Jews don’t. The Talmud is a library. Reading the Quran 3 times sounds like torture. It’s truly awful. permalink parent award report block reply\nApprenticeParty 4 points 3 days ago The Quran borrows a lot from the Talmud. Allah believes the Talmud is scripture. Something even Jews don’t. The Talmud is a library. Reading the Quran 3 times sounds like torture. It’s truly awful. permalink parent award report block reply\nkeeman 7 points 4 days ago Book in left hand is pretty much how the US gov has been going for 100 years.  How much or your life is interacting with the gov?  We are supposed to live in a limited government republic where the answer is \"almost none\".  We are on the road to serfdom. permalink award report block reply\njournalist 5 points 4 days ago Have fun with that… permalink award report block reply\nFuzzAldrin 5 points 4 days ago New Marx City permalink award report block reply\nGirthquakes 3 points 4 days ago \"Holy\" permalink award report block reply\nmass55th 2 points 4 days ago Don't forget to take your prayer rugs with you, when you visit New York City. permalink award report block reply AlmostFullyDilated 4 points 4 days ago why would anyone visit NYC? I'd rather kill myself permalink parent award report block reply mass55th 4 points 4 days ago First time I went was in the 50's. It was a far different place then. My Dad worked for the NY Central Railroad, so we got to ride the train for free. My brother and I were the youngest. My parents would take us from Rochester, NY on the train. We'd leave at midnight on a Friday night, and get to the City early Saturday morning, in time for breakfast. We'd stay overnight at the Hotel Piccadilly, then take the train back home Sunday afternoon. It was a treat for us, because we didn't have car. The Piccadilly Hotel was demolished in 1982. The last time I went to NY City was in 2006. permalink parent award report block reply\nAlmostFullyDilated 4 points 4 days ago why would anyone visit NYC? I'd rather kill myself permalink parent award report block reply mass55th 4 points 4 days ago First time I went was in the 50's. It was a far different place then. My Dad worked for the NY Central Railroad, so we got to ride the train for free. My brother and I were the youngest. My parents would take us from Rochester, NY on the train. We'd leave at midnight on a Friday night, and get to the City early Saturday morning, in time for breakfast. We'd stay overnight at the Hotel Piccadilly, then take the train back home Sunday afternoon. It was a treat for us, because we didn't have car. The Piccadilly Hotel was demolished in 1982. The last time I went to NY City was in 2006. permalink parent award report block reply\nmass55th 4 points 4 days ago First time I went was in the 50's. It was a far different place then. My Dad worked for the NY Central Railroad, so we got to ride the train for free. My brother and I were the youngest. My parents would take us from Rochester, NY on the train. We'd leave at midnight on a Friday night, and get to the City early Saturday morning, in time for breakfast. We'd stay overnight at the Hotel Piccadilly, then take the train back home Sunday afternoon. It was a treat for us, because we didn't have car. The Piccadilly Hotel was demolished in 1982. The last time I went to NY City was in 2006. permalink parent award report block reply\nTexasBrowncoat 2 points 3 days ago Reading material for when you are standing in a bread line. permalink award report block reply\nDCYR66 1 points 3 days ago Look he’s holding a roll of toilet paper in both hands. permalink award report block reply\ndontdrinksoy 1 points 3 days ago Lesbians these days look so scruffy. permalink award report block reply\nReclaimer69 1 points 3 days ago Idk. They would probably be audio books because he can't actually read. Put some headphones on his head and butt plugs in his hands. permalink award report block reply\nMade_in_America -2 points 4 days ago This Mamdani psyop is weird. There are no Communist Muslim countries. Communism is a Judeo-Bolshevik monstrosity. And that is who’s backing Mamdani. permalink award report block reply _Liberty_Prime_ OP 7 points 4 days ago Muslims say Muslims are backing him. permalink parent award report block reply Made_in_America 0 points 3 days ago But they’re not. He’s literally taken photos with the Soros family and most of his staff is Jewish. It’s just another Jewish trick. permalink parent award report block reply Friendly_B 1 points 3 days ago Ancient Greece and Rome had communist writers.  There at lots of them. Ever hear of Plato's Republic? Oh, (((Plato))).  Maybe he's one of them. permalink parent award report block reply Made_in_America 0 points 3 days ago Plato was neither a socialist nor communist. Communism is Jewish. This is a fact. permalink parent award report block reply guywholikesDjtof2024 1 points 4 days ago no communist muzz countries So? What's the point? And where's the psyop? There are muzz countries where CHRISTIANS (people who acknowledge reality) are murdered by muzzlims (Bible-disbelieving quranists). permalink parent award report block reply Made_in_America 0 points 3 days ago Communism is Jewish. Mamdani’s staff and financial backers are too. Mamdani is just theater. permalink parent award report block reply Dr_Phil 0 points 3 days ago Take your medication. permalink parent award report block reply Made_in_America 0 points 3 days ago Typical gaslighting. Your generation failed the long running Zionist agenda. It must be so humiliating to know that Zionism is dying because you're a lesser man than your ancestors were. permalink parent award report block reply\n_Liberty_Prime_ OP 7 points 4 days ago Muslims say Muslims are backing him. permalink parent award report block reply Made_in_America 0 points 3 days ago But they’re not. He’s literally taken photos with the Soros family and most of his staff is Jewish. It’s just another Jewish trick. permalink parent award report block reply\nMade_in_America 0 points 3 days ago But they’re not. He’s literally taken photos with the Soros family and most of his staff is Jewish. It’s just another Jewish trick. permalink parent award report block reply\nFriendly_B 1 points 3 days ago Ancient Greece and Rome had communist writers.  There at lots of them. Ever hear of Plato's Republic? Oh, (((Plato))).  Maybe he's one of them. permalink parent award report block reply Made_in_America 0 points 3 days ago Plato was neither a socialist nor communist. Communism is Jewish. This is a fact. permalink parent award report block reply\nMade_in_America 0 points 3 days ago Plato was neither a socialist nor communist. Communism is Jewish. This is a fact. permalink parent award report block reply\nguywholikesDjtof2024 1 points 4 days ago no communist muzz countries So? What's the point? And where's the psyop? There are muzz countries where CHRISTIANS (people who acknowledge reality) are murdered by muzzlims (Bible-disbelieving quranists). permalink parent award report block reply Made_in_America 0 points 3 days ago Communism is Jewish. Mamdani’s staff and financial backers are too. Mamdani is just theater. permalink parent award report block reply\nMade_in_America 0 points 3 days ago Communism is Jewish. Mamdani’s staff and financial backers are too. Mamdani is just theater. permalink parent award report block reply\nDr_Phil 0 points 3 days ago Take your medication. permalink parent award report block reply Made_in_America 0 points 3 days ago Typical gaslighting. Your generation failed the long running Zionist agenda. It must be so humiliating to know that Zionism is dying because you're a lesser man than your ancestors were. permalink parent award report block reply\nMade_in_America 0 points 3 days ago Typical gaslighting. Your generation failed the long running Zionist agenda. It must be so humiliating to know that Zionism is dying because you're a lesser man than your ancestors were. permalink parent award report block reply",
  "fetched_at": "2025-11-12T21:19:42.194266Z"
}