{
  "id": "8183055",
  "title": "1689Mass Deportation is the moderate solutionposted1 day agobyCrucible111 commentsawardsharedownload",
  "url": "https://patriots.win/p/1ARK9l6usX/mass-deportation-is-the-moderate/c",
  "content": "1689 Mass Deportation is the moderate solution posted 1 day ago by Crucible 111 comments award share download report block\n111 comments Sort by Top Top New Worst Old Save AVeryNakedMan 98 points 1 day ago I don't just want deportations of illegals. I want to exile the Democrats who opened the border. permalink award report block reply TruculentGoose 61 points 1 day ago And every America last employer and landlord who looked the other way permalink parent award report block reply try4gain PRO 37 points 1 day ago Texas has been flooded with illegals since I was a kid in the 80s / 90s.  Things got way worse under Obama Biden but Big Business and Big Banks have been a part of the problem forever. Profit line goes up, Corps dont care where the money comes from.  There are apt complexes in Texas that are 99% illegal immigrants.  Businesses that advertise \"no SS needed\". permalink parent award report block reply TPMJB 13 points 1 day ago Because of Biden, it's now also flooded with H1Bs. Austin is like Mumbai now. permalink parent award report block reply covok48 4 points 23 hours ago Wait till you see New Dhallas! permalink parent award report block reply view 1 more comments... 2scoops2peachmints 8 points 1 day ago And this is why our side knows this is all a big fucking joke and mass deportations are only a pipe dream. If this claim is true ICE should have started at these places permalink parent award report block reply Asianperswayzian 7 points 1 day ago Exactly. Prime example.  We have seen the photo ops and the numbers of illegal CDL drivers being taken off the roads in Oklahoma, Indiana, etc. and that’s great. But why aren’t their companies being shut down and owners being held liable? permalink parent award report block reply TPMJB -3 points 1 day ago Well, being on here for a few days one would think that our side is super Israel first (America last) and sees how good a job our deportations are! This place is so unbelievably compromised. I'm seeing more based comments today - I think they're all sleeping or something. Ohhhh it's Veterans day. The glowfags are off. permalink parent award report block reply Washington_Redskins 2 points 1 day ago If an apartment has 2, 3, or 4 families they can charge higher rents, so they love it. permalink parent award report block reply Deportthemall23 -1 points 1 day ago There's more than enough ample evidence to make the case of declaring the Democrat Party a terrorist organization and shutting it down for good. Not just defeating one or two of them in an election but making the Democrat Party itself illegal and arresting all of its members and all of its financiers There's enough evidence from the Democrats calling for violence to the Democrats committing violence.. It's merely a matter of will. Do the ivy League graduate trust fund millionaire penthouse living Republicans In Washington feel like they have more in common with you or more in common with the ivy League trust fund millionaire penthouse living Democrats across the aisle? permalink parent award report block reply ChinaFlu 1 points 20 hours ago Normies are not ready for that. It also ushers in a worse problem than Rinos, where left leaning people run as Republicans to “change the system”. permalink parent award report block reply Deportthemall23 2 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply bejeavis 7 points 1 day ago Oh they did more than look the other way. They sold out their own neighbors to line their pockets. permalink parent award report block reply Waco419 3 points 1 day ago And every local politician who took Federal bribes to enable the infestation into local hotels and housing complexes. And every local bureaucrat who helped them get food stamps, medicaid, drivers licences and so on. permalink parent award report block reply newestofnew 7 points 1 day ago that's anti septic bro permalink parent award report block reply LonelyPepe 3 points 1 day ago We need all the antiseptic we can get and more if we expect to get mass deportations. permalink parent award report block reply covok48 3 points 23 hours ago That’s racialist Saar! permalink parent award report block reply Klaus73 3 points 23 hours ago More interestingly - would it be possible to add some kind of limitation to immigration into law? Something that would stop the next guy from just not giving a fuck or jacking the numbers sky high? Like \"Immigration rates (including refugees) cannot exceed unemployment+Homelessness by more then +/-% permalink parent award report block reply ConfusedAngryArmed 1 points 20 hours ago I'd rather have a complete 50 year moratorium encoded into law. permalink parent award report block reply Klaus73 2 points 20 hours ago You'd think with the job losses expected due to AI that some sort of slow down is due. permalink parent award report block reply AVeryNakedMan 1 points 21 hours ago The refugee status loophole that Biden used to let in millions of fake refugees on \"parole\" needs to be closed. It could be as simple as putting a yearly cap on the number, or just saying no parole until a judge has seen the case. permalink parent award report block reply Klaus73 1 points 20 hours ago Wasn't that the intent of the whole \"remain in mexico\" thing? permalink parent award report block reply AVeryNakedMan 1 points 19 hours ago Remain in Mexico was an executive branch decision from Trump, which Biden undid on day 1. But if Congress changes the law, then a future president can't undo it. permalink parent award report block reply rebuildingMyself 3 points 1 day ago And a big overhaul of the legal immigration system as well permalink parent award report block reply Motownmow 2 points 20 hours ago Importing military-age men in to terrorize the populations in the West is TREASON and should be considered as such in the US and in Europe. And we all know what the punishment for treason should be. permalink parent award report block reply load 2 more comments... deleted 40 points 1 day ago NazisWereSocialist 30 points 1 day ago Yeah just make it IMPOSSIBLE for them to live here permalink parent award report block reply Noseeboh 7 points 21 hours ago This is the big brain solution. Make America SUCK if you're illegal and they will leave permalink parent award report block reply Glory-Unto-God 2 points 18 hours ago Declare the remainder outlaws and let citizens deal with it with no legal ramifications if its still not finished permalink parent award report block reply CommanderComadant -35 points 1 day ago You’re an idiot, and have no concept of how broken the white American worker is. Tell me I’m dumb mock me do what the hell you will I’m on the ground and I see what’s happening to our culture and society. White people want nothing to do with physical labor anymore. “Oh you don’t pay enough”- bullshit- white kids would rather make eight dollars an hour sitting in a fucking smoke shop not doing Jack shit then make twice that doing something outside in the heat. You have never hired someone in your life. Yeah that’s right motherfuckers you bring those down thumbs!! J6er here. Nothing but cowards, faggots and losers on this website now— fuck you people you have no fucking clue what’s going on!  Keep your head in the sand! Our culture is broken, and no politician is going to fix it. permalink parent award report block reply Viewer01 21 points 1 day ago People don’t work hard for themselves. They’ll break their back for their families. Bring back getting married at 20 and see how many kids jump into hard labor. I also reject your premise because a lot of the trades went from a stable long term jobs to sub minimum wage gigs. It’s just hilarious to see this absolute bullshit lines get slung around like it’s true. permalink parent award report block reply ChinaFlu 5 points 20 hours ago Young adults need something to live for, fight for, die for. And that something is families. Without that, people are directionless; rudderless. They need a purpose in life. permalink parent award report block reply bidensmissingbrain -7 points 1 day ago Bring back getting married at 20 and see how many kids jump into hard labor. Virtually zero. They'd divorce/leave and go work in a smoke shop for $8/hr. permalink parent award report block reply CommanderComadant -8 points 22 hours ago Negative- Hispanic kids specifically will work to support their own family. It’s not the same ratio with others. It’s culture 👏 👏 👏 I don’t necessarily disagree with your sentiment. I think it’s important that we foster a culture of marriage as well. But to say companies only hire because they want cheap labor is FALSE. There’s a specific level of responsibility I no longer get with white Americans and as a white American I’m disappointed in this as Ive noticed a substantial drastic-significant -change before Covid and after relating to white Americans work ethic. You guys can bitch and call me the big bad Wolf all you want but I see reality more than most of you it seems. permalink parent award report block reply 2scoops2peachmints 8 points 1 day ago This was by design. They forced milliners to take out loans and go to college saying it’s the future and the only way you’ll be successful and get a job. Now the next generation sees through the farce and says fuck it, I’ll just work in the smoke shop and collect gov gibs. When schools started getting rid of metal shop and drivers Ed it should have been a wake up call for boomers but they didn’t give a flying fuck and just want to act superior when it’s their fault we’re in the situation we are now. permalink parent award report block reply henri_derelicte 8 points 1 day ago I’m worried about the unemployment rate for those recent college grads due to H1b, AI, and offshoring. The jobs we thought would be available for them are being given to foreigners permalink parent award report block reply covok48 4 points 23 hours ago This. The current employment rate for 2024 grads is 60%. For 2025 grades it’s more like 30%. This is not good. I was full time employed within a month of graduation in 2007. permalink parent award report block reply view 1 more comments... Nancys_drooping_eye 6 points 1 day ago forced milliners I know you meant millennials but I'm laughing at the image of a bunch of people going to college for hat making.  Which is probably true for some of those with useless degrees. permalink parent award report block reply SicSemperTyrannis2 2 points 13 hours ago They're mad as a hatter! permalink parent award report block reply CommanderComadant -11 points 1 day ago oh my God, I love seeing people talk out their ass. I’m a millennial, motherfucker— The generation below us is even more pathetic!! They are the ones I’m talking about! I’d love to pay a 20-30 something white American $1200 a week for 45 hours but for the love of God they don’t exist. It’s only illegals. Holy shit you assholes have all these garbage opinions but no actual experience with what’s going on. permalink parent award report block reply 2scoops2peachmints 10 points 1 day ago Fuck off you garbage piece of shit, you don’t have a fucking clue what you’re talking about. Take your faggot ass back to India you H1B shit. permalink parent award report block reply view 1 more comments... covok48 4 points 23 hours ago You’re giving off serious 2000s copy/paste toughguy vibes right now. permalink parent award report block reply AVeryNakedMan 6 points 1 day ago Why are you using em dash like a chatbot? permalink parent award report block reply justicein2020 3 points 18 hours ago because it's a bot. or a 3rd worlder.  meat bot. permalink parent award report block reply newestofnew 5 points 1 day ago this dual citizen comes up with excuses to exploit foreign labor to satiate their greed rather than be content with a modest margin and a healthy community. in reality we get the real intention is to take from our community and give to yours. permalink parent award report block reply ConfusedAngryArmed 1 points 20 hours ago Comment removed by community filter. permalink parent award report block reply load 1 more comments... Formerlurker92 30 points 1 day ago Countries are a lot like leaves, they change colors as they die permalink award report block reply Megaboom2025 4 points 21 hours ago From beauty to brown rot permalink parent award report block reply try4gain PRO 19 points 1 day ago tons more workers lowers wages tons more people looking for apt / home raises cost tons of workers lowers employee benefits companies dont have to be 'competitive' in their hiring when they have 10,000 Jose's who will work for less pay and no benefits permalink award report block reply ViagraFalls 2 points 18 hours ago It’s almost as if everything being geared towards people making money instead of the public good is a bad idea. Everything should work for the good of the society. Personal efficacy and profit is fine as long as it’s not at odds with the good of society. When you look into it, you will find out this is national socialism and that is literally Hitler. permalink parent award report block reply henri_derelicte 18 points 1 day ago Mass deportation is the humane solution. If that is denied to us, the remaining options to retake our country will be far less peaceful… permalink award report block reply ModernKnight 13 points 1 day ago Far left position: let anyone in Moderate position: deport all illegal immigrants Far right position: we have 50 million illegal immigrants, which can be solved by 50 million pikes on our southern border. permalink parent award report block reply AVeryNakedMan 8 points 1 day ago The actual solution is not to put the illegal aliens' heads on pikes, but to put the Democrats' heads on pikes. Their willingness to vote for the self-destruction of our country is the real source of our problems. The illegals were just coming here for free money; a deportation is good enough to solve that problem. permalink parent award report block reply noPTSDforMePlease 6 points 24 hours ago It's both. It doesn't matter if you remove the Dems because the invaders are still here. permalink parent award report block reply thanksobama 6 points 1 day ago Pike every 2.4 inches. That would be a wall of pikes. permalink parent award report block reply Megaboom2025 2 points 21 hours ago The diary of Juan Frank: “we had to hide in the closet hombre… la policia kept looking for us. We had to eat Taco Bell for 3 weeks straight” permalink parent award report block reply Viewer01 7 points 1 day ago Yeap. This is where we’re at. Nikki Haley’s kid is on Fox News almost fed posting. His moms politics have always been weak and effeminate but he seemed ready to call banners and start burning towns. permalink parent award report block reply LonelyPepe 5 points 1 day ago He can GTFO too, being Nimrata Randhawa-spawn. permalink parent award report block reply MediaBro 0 points 22 hours ago Nah, he ain't going anywhere. permalink parent award report block reply LonelyPepe 0 points 20 hours ago You can go with him. permalink parent award report block reply view 2 more comments... RockFlagAndEagle2020 13 points 1 day ago It's only a problem because boomers decided it was more important to rub their egos then raise families. They demonized motherhood and replaced motherhood with consumerism. There aren't enough tax payers to fund the benefit system boomers voted in for themselves. I see only one solution here if we want to keep America. End boomer benefits - bye bye Medicare and Social Security, Ban multi-home home ownership, ban companies from buying single family homes and watch the market self correct by 50%. Frankly boomers have served their purpose and they offer little to no benefit to our GDP. They have become a chain weighing down their children's futures. Force them to sell their assets to support their lifestyle. No more hand outs. permalink award report block reply BirthHole 12 points 1 day ago For every mooslim that comes here, take $1,000,000 away from Israel's pot of free money. Then they'll stop covertly shipping them over here. permalink award report block reply 24601 8 points 1 day ago This needs some fixing: \"You would never bring in a bunch of Mutated but breeding Pandas.....\" permalink award report block reply Wtf_socialismreally 12 points 1 day ago Cockroaches is more accurate to what illegals are though. permalink parent award report block reply Jaqen 5 points 1 day ago Biden concurs. He knows a lot about roaches. permalink parent award report block reply Edial 2 points 1 day ago I prefer the label of shit-skin parasites. permalink parent award report block reply SavingPrivateGrace 3 points 1 day ago Inbred, mutated, breeding cockroaches. permalink parent award report block reply 2scoops2peachmints 2 points 1 day ago Polar bears should be the ability, aggress killers like what were being replaced with. permalink parent award report block reply MAGALADON9 8 points 1 day ago You are saying big-eyed anime style kawaii migrants are = cockroaches.  REEEEEEEEEEEEEEEEEEE. They are invaders. Many (muslims) have a directly hostile political ideology to your freedoms So some predator animal is better analogy.   Something that would kill pandas and eat their food. permalink award report block reply Seeker_17 7 points 1 day ago Reminds me of those signs they put up near ponds and lakes, stating one should not release non-native fish, mussels etc. Seems fish are more precious than White people. permalink award report block reply tommy3q 5 points 1 day ago Terminate all the radical muslim commie pigs 🐷💥 permalink award report block reply henri_derelicte 3 points 1 day ago Deus Vult! permalink parent award report block reply freedom-thinker 5 points 1 day ago There is nothing wrong with importing cockroaches, because they vote for you, and thats why Dems do it, and no other reason, no matter what they say. permalink award report block reply TPMJB 3 points 1 day ago I feel like if we had a few Crucifixions on the southern border of narcos, the problem would mostly solve itself. Cruel, but not unusual punishment. Sends a message. Though Crucified people tend to live too long so I think I'm leaning towards the Vlad the Impaler treatment. Those people lived for days . Quite the fascinating story. permalink award report block reply minttea2 3 points 1 day ago Not a Panda.  Will never be a Panda.  Not an American.  Will never be an American. https://houstonherald.com/2024/05/zoogoers-in-china-outraged-to-discover-panda-exhibit-was-actually-dogs-dyed-black-and-white/ \"Diversity\" is not strength.  Indians seem to know this in their own fucked up country. The Observer reports that on the day its reporter visited, tourists began snapping photos as soon as the gates to the reserve opened, and \"threw bananas and biscuits to the tribespeople at the roadside, as they would to animals at a safari park.\" The officer in the video will reportedly be punished by having \"his future promotion delayed by six months.\" https://theweek.com/articles/478961/indias-deplorable-human-zoo https://www.theguardian.com/world/video/2012/jan/07/andaman-islanders-human-safari-video permalink award report block reply ViagraFalls 2 points 18 hours ago China should have just imported a bunch of polar bears instead of trying to save panda bears. They could also encourage all the pandas to enter mixed species breeding with the polar bears by making every commercial, TV show, and movie with a couple a male polar bear and female panda. permalink award report block reply based_trekkie 2 points 1 day ago You bring in polar bears and paint black spots on them. permalink award report block reply Motownmow 2 points 20 hours ago Basic economics dictates: Declining population -> low workforce supply, lower demand for everyday products, lower demand for housing -> rising wages for workers, lower prices for everyday products, lower housing costs -> YOU CAN NOW AFFORD MORE, WORK LESS, AND HAVE MORE CHILDREN It would have been self-correcting, but globohomo has no interest in a slump. They'd rather import 20 million third worlders to turn your communities into crime-ridden shitholes if it keeps wages low and demand high. permalink award report block reply SkullE 2 points 1 day ago They have increasingly made things difficult for males. I assume its been on purpose. And Males disengaging in population making is the result. permalink award report block reply ArchRespawnsAgain 1 points 22 hours ago America's immigration policies started being opened up after WWII in the middle of the baby boom. It was never about declining birth rates. permalink award report block reply SisterCovfefeToo 1 points 1 day ago Barred Owl Culture >> Spotted owl culture permalink award report block reply drmrboy 1 points 1 day ago Birthright citizenship.  🤓 permalink award report block reply least_counties_ever 1 points 1 day ago Unless cockroaches do simple work and vote the way you want them to and the remaining pandas pay their healthcare costs. permalink award report block reply Washington_Redskins 1 points 1 day ago The.number of bipedal animals increasing instead of the number of humans is exactly what the leftists  want. permalink award report block reply mattytr 1 points 21 hours ago The extreme solution would be execution of the illegal invaders. And I'm in favor of it. permalink award report block reply Deathmelody 1 points 1 day ago Nothing short of public hangings of the people who voted and facilitated is a failure. permalink award report block reply paramour 1 points 24 hours ago This. permalink award report block reply 4886Battery 1 points 1 day ago Wrong.  Mass importation is most definitely the solution if your problem is declining Democrat voters and a desire to increase census numbers in blue areas to increase electoral college votes.  Think about it, immigrants are ready-made dependents for generations to come. Democrats/liberals have spent decades telling us that we need to lessen the population, why would we believe they now suddenly care about the problem they've spent decades pretending didn't exist? permalink award report block reply hilboggins 1 points 22 hours ago Well the bullshit is the population doesn't grow because they can't afford to grow... They immigrate in people then give them a bunch of free shit so they can grow... Not u. permalink award report block reply RolandDelacroix 1 points 1 day ago A different species of bear would be a better analogy, but yeah permalink award report block reply HeavenlyTrumpets 1 points 1 day ago This is true... permalink award report block reply williammcfadden 1 points 24 hours ago The left needs massive amounts of illegals because of losing house seats and electoral votes. Who does that hurt?  The poor. permalink award report block reply knnbccb 1 points 1 day ago Those that have not yet surrendered or self-deported one year after Trump's inauguration should be killed on sight by the military. Same for those that shelter or assist them. permalink award report block reply LUXURY_USERNAME 1 points 1 day ago you do when you can enslave and tax the cockroach, because you’re a piece of shit politician who can’t own up to your government’s failures and are ready to throw out the entire country just to try and avoid cancelling an entitlement permalink award report block reply iamimaginos 1 points 22 hours ago Cockroaches.  I see what you did there... permalink award report block reply yurimodin 1 points 1 day ago DEUS VAULT permalink award report block reply lifeisahologram 1 points 1 day ago Perfect example and analogy for people who notice. Probably could change the animal examples when sharing this meme with people still plugged in the matrix or with boomer judeo-Christian energy. permalink award report block reply delnaga 1 points 22 hours ago The solution is making more babies. Make Families Great Again! permalink award report block reply TentacleLord 1 points 13 hours ago This had the perfect lay up with bears as an analogy but instead of using brown or black bears as the animal being brought in you used cockroaches? permalink award report block reply Mellop 1 points 22 hours ago Cockroach Lives Matter! They're just doing the jobs pandas don't want to do themselves. \"I think there is a resurgence of anti-rodentism, because at this point in time Pandaland has not yet learned how to be cockroach-enriched. And I think we are going to be part of the throes of that transformation, which must take place. Pandaland is not going to be the monolithic societies that they once were in the last century. Rodents are going to be at the center of that. It's a huge transformation for Pandaland to make. They are now going into a cockroach-friendly mode and Rodents will be resented because of our leading role. But without that leading role and without that transformation, Pandaland will not survive.\" permalink award report block reply Dev404 1 points 1 day ago But you see, western women have it so fucking easy, they have to create problems because they're bored. So they decided cultural genocide was the answer. permalink award report block reply ncswicn 1 points 1 day ago Spot on! permalink award report block reply KungPaoMcChicken 1 points 21 hours ago Yeah, what if Hitler had been this moderate? He would have said to Churchill: you need to take all of these Jews or we will fucking put them in a gas chamber. permalink award report block reply It_takes_10_years -1 points 1 day ago So Is this a post supporting Trumps 600,000 Chinese student visas or..... permalink award report block reply expertnoticer 1 points 18 hours ago Comment removed by community filter, pending further review. permalink award report block reply\nAVeryNakedMan 98 points 1 day ago I don't just want deportations of illegals. I want to exile the Democrats who opened the border. permalink award report block reply TruculentGoose 61 points 1 day ago And every America last employer and landlord who looked the other way permalink parent award report block reply try4gain PRO 37 points 1 day ago Texas has been flooded with illegals since I was a kid in the 80s / 90s.  Things got way worse under Obama Biden but Big Business and Big Banks have been a part of the problem forever. Profit line goes up, Corps dont care where the money comes from.  There are apt complexes in Texas that are 99% illegal immigrants.  Businesses that advertise \"no SS needed\". permalink parent award report block reply TPMJB 13 points 1 day ago Because of Biden, it's now also flooded with H1Bs. Austin is like Mumbai now. permalink parent award report block reply covok48 4 points 23 hours ago Wait till you see New Dhallas! permalink parent award report block reply view 1 more comments... 2scoops2peachmints 8 points 1 day ago And this is why our side knows this is all a big fucking joke and mass deportations are only a pipe dream. If this claim is true ICE should have started at these places permalink parent award report block reply Asianperswayzian 7 points 1 day ago Exactly. Prime example.  We have seen the photo ops and the numbers of illegal CDL drivers being taken off the roads in Oklahoma, Indiana, etc. and that’s great. But why aren’t their companies being shut down and owners being held liable? permalink parent award report block reply TPMJB -3 points 1 day ago Well, being on here for a few days one would think that our side is super Israel first (America last) and sees how good a job our deportations are! This place is so unbelievably compromised. I'm seeing more based comments today - I think they're all sleeping or something. Ohhhh it's Veterans day. The glowfags are off. permalink parent award report block reply Washington_Redskins 2 points 1 day ago If an apartment has 2, 3, or 4 families they can charge higher rents, so they love it. permalink parent award report block reply Deportthemall23 -1 points 1 day ago There's more than enough ample evidence to make the case of declaring the Democrat Party a terrorist organization and shutting it down for good. Not just defeating one or two of them in an election but making the Democrat Party itself illegal and arresting all of its members and all of its financiers There's enough evidence from the Democrats calling for violence to the Democrats committing violence.. It's merely a matter of will. Do the ivy League graduate trust fund millionaire penthouse living Republicans In Washington feel like they have more in common with you or more in common with the ivy League trust fund millionaire penthouse living Democrats across the aisle? permalink parent award report block reply ChinaFlu 1 points 20 hours ago Normies are not ready for that. It also ushers in a worse problem than Rinos, where left leaning people run as Republicans to “change the system”. permalink parent award report block reply Deportthemall23 2 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply bejeavis 7 points 1 day ago Oh they did more than look the other way. They sold out their own neighbors to line their pockets. permalink parent award report block reply Waco419 3 points 1 day ago And every local politician who took Federal bribes to enable the infestation into local hotels and housing complexes. And every local bureaucrat who helped them get food stamps, medicaid, drivers licences and so on. permalink parent award report block reply newestofnew 7 points 1 day ago that's anti septic bro permalink parent award report block reply LonelyPepe 3 points 1 day ago We need all the antiseptic we can get and more if we expect to get mass deportations. permalink parent award report block reply covok48 3 points 23 hours ago That’s racialist Saar! permalink parent award report block reply Klaus73 3 points 23 hours ago More interestingly - would it be possible to add some kind of limitation to immigration into law? Something that would stop the next guy from just not giving a fuck or jacking the numbers sky high? Like \"Immigration rates (including refugees) cannot exceed unemployment+Homelessness by more then +/-% permalink parent award report block reply ConfusedAngryArmed 1 points 20 hours ago I'd rather have a complete 50 year moratorium encoded into law. permalink parent award report block reply Klaus73 2 points 20 hours ago You'd think with the job losses expected due to AI that some sort of slow down is due. permalink parent award report block reply AVeryNakedMan 1 points 21 hours ago The refugee status loophole that Biden used to let in millions of fake refugees on \"parole\" needs to be closed. It could be as simple as putting a yearly cap on the number, or just saying no parole until a judge has seen the case. permalink parent award report block reply Klaus73 1 points 20 hours ago Wasn't that the intent of the whole \"remain in mexico\" thing? permalink parent award report block reply AVeryNakedMan 1 points 19 hours ago Remain in Mexico was an executive branch decision from Trump, which Biden undid on day 1. But if Congress changes the law, then a future president can't undo it. permalink parent award report block reply rebuildingMyself 3 points 1 day ago And a big overhaul of the legal immigration system as well permalink parent award report block reply Motownmow 2 points 20 hours ago Importing military-age men in to terrorize the populations in the West is TREASON and should be considered as such in the US and in Europe. And we all know what the punishment for treason should be. permalink parent award report block reply load 2 more comments...\nTruculentGoose 61 points 1 day ago And every America last employer and landlord who looked the other way permalink parent award report block reply try4gain PRO 37 points 1 day ago Texas has been flooded with illegals since I was a kid in the 80s / 90s.  Things got way worse under Obama Biden but Big Business and Big Banks have been a part of the problem forever. Profit line goes up, Corps dont care where the money comes from.  There are apt complexes in Texas that are 99% illegal immigrants.  Businesses that advertise \"no SS needed\". permalink parent award report block reply TPMJB 13 points 1 day ago Because of Biden, it's now also flooded with H1Bs. Austin is like Mumbai now. permalink parent award report block reply covok48 4 points 23 hours ago Wait till you see New Dhallas! permalink parent award report block reply view 1 more comments... 2scoops2peachmints 8 points 1 day ago And this is why our side knows this is all a big fucking joke and mass deportations are only a pipe dream. If this claim is true ICE should have started at these places permalink parent award report block reply Asianperswayzian 7 points 1 day ago Exactly. Prime example.  We have seen the photo ops and the numbers of illegal CDL drivers being taken off the roads in Oklahoma, Indiana, etc. and that’s great. But why aren’t their companies being shut down and owners being held liable? permalink parent award report block reply TPMJB -3 points 1 day ago Well, being on here for a few days one would think that our side is super Israel first (America last) and sees how good a job our deportations are! This place is so unbelievably compromised. I'm seeing more based comments today - I think they're all sleeping or something. Ohhhh it's Veterans day. The glowfags are off. permalink parent award report block reply Washington_Redskins 2 points 1 day ago If an apartment has 2, 3, or 4 families they can charge higher rents, so they love it. permalink parent award report block reply Deportthemall23 -1 points 1 day ago There's more than enough ample evidence to make the case of declaring the Democrat Party a terrorist organization and shutting it down for good. Not just defeating one or two of them in an election but making the Democrat Party itself illegal and arresting all of its members and all of its financiers There's enough evidence from the Democrats calling for violence to the Democrats committing violence.. It's merely a matter of will. Do the ivy League graduate trust fund millionaire penthouse living Republicans In Washington feel like they have more in common with you or more in common with the ivy League trust fund millionaire penthouse living Democrats across the aisle? permalink parent award report block reply ChinaFlu 1 points 20 hours ago Normies are not ready for that. It also ushers in a worse problem than Rinos, where left leaning people run as Republicans to “change the system”. permalink parent award report block reply Deportthemall23 2 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply bejeavis 7 points 1 day ago Oh they did more than look the other way. They sold out their own neighbors to line their pockets. permalink parent award report block reply Waco419 3 points 1 day ago And every local politician who took Federal bribes to enable the infestation into local hotels and housing complexes. And every local bureaucrat who helped them get food stamps, medicaid, drivers licences and so on. permalink parent award report block reply\ntry4gain PRO 37 points 1 day ago Texas has been flooded with illegals since I was a kid in the 80s / 90s.  Things got way worse under Obama Biden but Big Business and Big Banks have been a part of the problem forever. Profit line goes up, Corps dont care where the money comes from.  There are apt complexes in Texas that are 99% illegal immigrants.  Businesses that advertise \"no SS needed\". permalink parent award report block reply TPMJB 13 points 1 day ago Because of Biden, it's now also flooded with H1Bs. Austin is like Mumbai now. permalink parent award report block reply covok48 4 points 23 hours ago Wait till you see New Dhallas! permalink parent award report block reply view 1 more comments... 2scoops2peachmints 8 points 1 day ago And this is why our side knows this is all a big fucking joke and mass deportations are only a pipe dream. If this claim is true ICE should have started at these places permalink parent award report block reply Asianperswayzian 7 points 1 day ago Exactly. Prime example.  We have seen the photo ops and the numbers of illegal CDL drivers being taken off the roads in Oklahoma, Indiana, etc. and that’s great. But why aren’t their companies being shut down and owners being held liable? permalink parent award report block reply TPMJB -3 points 1 day ago Well, being on here for a few days one would think that our side is super Israel first (America last) and sees how good a job our deportations are! This place is so unbelievably compromised. I'm seeing more based comments today - I think they're all sleeping or something. Ohhhh it's Veterans day. The glowfags are off. permalink parent award report block reply Washington_Redskins 2 points 1 day ago If an apartment has 2, 3, or 4 families they can charge higher rents, so they love it. permalink parent award report block reply Deportthemall23 -1 points 1 day ago There's more than enough ample evidence to make the case of declaring the Democrat Party a terrorist organization and shutting it down for good. Not just defeating one or two of them in an election but making the Democrat Party itself illegal and arresting all of its members and all of its financiers There's enough evidence from the Democrats calling for violence to the Democrats committing violence.. It's merely a matter of will. Do the ivy League graduate trust fund millionaire penthouse living Republicans In Washington feel like they have more in common with you or more in common with the ivy League trust fund millionaire penthouse living Democrats across the aisle? permalink parent award report block reply ChinaFlu 1 points 20 hours ago Normies are not ready for that. It also ushers in a worse problem than Rinos, where left leaning people run as Republicans to “change the system”. permalink parent award report block reply Deportthemall23 2 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nTPMJB 13 points 1 day ago Because of Biden, it's now also flooded with H1Bs. Austin is like Mumbai now. permalink parent award report block reply covok48 4 points 23 hours ago Wait till you see New Dhallas! permalink parent award report block reply view 1 more comments...\ncovok48 4 points 23 hours ago Wait till you see New Dhallas! permalink parent award report block reply view 1 more comments...\n2scoops2peachmints 8 points 1 day ago And this is why our side knows this is all a big fucking joke and mass deportations are only a pipe dream. If this claim is true ICE should have started at these places permalink parent award report block reply Asianperswayzian 7 points 1 day ago Exactly. Prime example.  We have seen the photo ops and the numbers of illegal CDL drivers being taken off the roads in Oklahoma, Indiana, etc. and that’s great. But why aren’t their companies being shut down and owners being held liable? permalink parent award report block reply TPMJB -3 points 1 day ago Well, being on here for a few days one would think that our side is super Israel first (America last) and sees how good a job our deportations are! This place is so unbelievably compromised. I'm seeing more based comments today - I think they're all sleeping or something. Ohhhh it's Veterans day. The glowfags are off. permalink parent award report block reply\nAsianperswayzian 7 points 1 day ago Exactly. Prime example.  We have seen the photo ops and the numbers of illegal CDL drivers being taken off the roads in Oklahoma, Indiana, etc. and that’s great. But why aren’t their companies being shut down and owners being held liable? permalink parent award report block reply\nTPMJB -3 points 1 day ago Well, being on here for a few days one would think that our side is super Israel first (America last) and sees how good a job our deportations are! This place is so unbelievably compromised. I'm seeing more based comments today - I think they're all sleeping or something. Ohhhh it's Veterans day. The glowfags are off. permalink parent award report block reply\nWashington_Redskins 2 points 1 day ago If an apartment has 2, 3, or 4 families they can charge higher rents, so they love it. permalink parent award report block reply\nDeportthemall23 -1 points 1 day ago There's more than enough ample evidence to make the case of declaring the Democrat Party a terrorist organization and shutting it down for good. Not just defeating one or two of them in an election but making the Democrat Party itself illegal and arresting all of its members and all of its financiers There's enough evidence from the Democrats calling for violence to the Democrats committing violence.. It's merely a matter of will. Do the ivy League graduate trust fund millionaire penthouse living Republicans In Washington feel like they have more in common with you or more in common with the ivy League trust fund millionaire penthouse living Democrats across the aisle? permalink parent award report block reply ChinaFlu 1 points 20 hours ago Normies are not ready for that. It also ushers in a worse problem than Rinos, where left leaning people run as Republicans to “change the system”. permalink parent award report block reply\nChinaFlu 1 points 20 hours ago Normies are not ready for that. It also ushers in a worse problem than Rinos, where left leaning people run as Republicans to “change the system”. permalink parent award report block reply\nDeportthemall23 2 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nbejeavis 7 points 1 day ago Oh they did more than look the other way. They sold out their own neighbors to line their pockets. permalink parent award report block reply\nWaco419 3 points 1 day ago And every local politician who took Federal bribes to enable the infestation into local hotels and housing complexes. And every local bureaucrat who helped them get food stamps, medicaid, drivers licences and so on. permalink parent award report block reply\nnewestofnew 7 points 1 day ago that's anti septic bro permalink parent award report block reply LonelyPepe 3 points 1 day ago We need all the antiseptic we can get and more if we expect to get mass deportations. permalink parent award report block reply covok48 3 points 23 hours ago That’s racialist Saar! permalink parent award report block reply\nLonelyPepe 3 points 1 day ago We need all the antiseptic we can get and more if we expect to get mass deportations. permalink parent award report block reply\ncovok48 3 points 23 hours ago That’s racialist Saar! permalink parent award report block reply\nKlaus73 3 points 23 hours ago More interestingly - would it be possible to add some kind of limitation to immigration into law? Something that would stop the next guy from just not giving a fuck or jacking the numbers sky high? Like \"Immigration rates (including refugees) cannot exceed unemployment+Homelessness by more then +/-% permalink parent award report block reply ConfusedAngryArmed 1 points 20 hours ago I'd rather have a complete 50 year moratorium encoded into law. permalink parent award report block reply Klaus73 2 points 20 hours ago You'd think with the job losses expected due to AI that some sort of slow down is due. permalink parent award report block reply AVeryNakedMan 1 points 21 hours ago The refugee status loophole that Biden used to let in millions of fake refugees on \"parole\" needs to be closed. It could be as simple as putting a yearly cap on the number, or just saying no parole until a judge has seen the case. permalink parent award report block reply Klaus73 1 points 20 hours ago Wasn't that the intent of the whole \"remain in mexico\" thing? permalink parent award report block reply AVeryNakedMan 1 points 19 hours ago Remain in Mexico was an executive branch decision from Trump, which Biden undid on day 1. But if Congress changes the law, then a future president can't undo it. permalink parent award report block reply\nConfusedAngryArmed 1 points 20 hours ago I'd rather have a complete 50 year moratorium encoded into law. permalink parent award report block reply Klaus73 2 points 20 hours ago You'd think with the job losses expected due to AI that some sort of slow down is due. permalink parent award report block reply\nKlaus73 2 points 20 hours ago You'd think with the job losses expected due to AI that some sort of slow down is due. permalink parent award report block reply\nAVeryNakedMan 1 points 21 hours ago The refugee status loophole that Biden used to let in millions of fake refugees on \"parole\" needs to be closed. It could be as simple as putting a yearly cap on the number, or just saying no parole until a judge has seen the case. permalink parent award report block reply Klaus73 1 points 20 hours ago Wasn't that the intent of the whole \"remain in mexico\" thing? permalink parent award report block reply AVeryNakedMan 1 points 19 hours ago Remain in Mexico was an executive branch decision from Trump, which Biden undid on day 1. But if Congress changes the law, then a future president can't undo it. permalink parent award report block reply\nKlaus73 1 points 20 hours ago Wasn't that the intent of the whole \"remain in mexico\" thing? permalink parent award report block reply AVeryNakedMan 1 points 19 hours ago Remain in Mexico was an executive branch decision from Trump, which Biden undid on day 1. But if Congress changes the law, then a future president can't undo it. permalink parent award report block reply\nAVeryNakedMan 1 points 19 hours ago Remain in Mexico was an executive branch decision from Trump, which Biden undid on day 1. But if Congress changes the law, then a future president can't undo it. permalink parent award report block reply\nrebuildingMyself 3 points 1 day ago And a big overhaul of the legal immigration system as well permalink parent award report block reply\nMotownmow 2 points 20 hours ago Importing military-age men in to terrorize the populations in the West is TREASON and should be considered as such in the US and in Europe. And we all know what the punishment for treason should be. permalink parent award report block reply\ndeleted 40 points 1 day ago NazisWereSocialist 30 points 1 day ago Yeah just make it IMPOSSIBLE for them to live here permalink parent award report block reply Noseeboh 7 points 21 hours ago This is the big brain solution. Make America SUCK if you're illegal and they will leave permalink parent award report block reply Glory-Unto-God 2 points 18 hours ago Declare the remainder outlaws and let citizens deal with it with no legal ramifications if its still not finished permalink parent award report block reply CommanderComadant -35 points 1 day ago You’re an idiot, and have no concept of how broken the white American worker is. Tell me I’m dumb mock me do what the hell you will I’m on the ground and I see what’s happening to our culture and society. White people want nothing to do with physical labor anymore. “Oh you don’t pay enough”- bullshit- white kids would rather make eight dollars an hour sitting in a fucking smoke shop not doing Jack shit then make twice that doing something outside in the heat. You have never hired someone in your life. Yeah that’s right motherfuckers you bring those down thumbs!! J6er here. Nothing but cowards, faggots and losers on this website now— fuck you people you have no fucking clue what’s going on!  Keep your head in the sand! Our culture is broken, and no politician is going to fix it. permalink parent award report block reply Viewer01 21 points 1 day ago People don’t work hard for themselves. They’ll break their back for their families. Bring back getting married at 20 and see how many kids jump into hard labor. I also reject your premise because a lot of the trades went from a stable long term jobs to sub minimum wage gigs. It’s just hilarious to see this absolute bullshit lines get slung around like it’s true. permalink parent award report block reply ChinaFlu 5 points 20 hours ago Young adults need something to live for, fight for, die for. And that something is families. Without that, people are directionless; rudderless. They need a purpose in life. permalink parent award report block reply bidensmissingbrain -7 points 1 day ago Bring back getting married at 20 and see how many kids jump into hard labor. Virtually zero. They'd divorce/leave and go work in a smoke shop for $8/hr. permalink parent award report block reply CommanderComadant -8 points 22 hours ago Negative- Hispanic kids specifically will work to support their own family. It’s not the same ratio with others. It’s culture 👏 👏 👏 I don’t necessarily disagree with your sentiment. I think it’s important that we foster a culture of marriage as well. But to say companies only hire because they want cheap labor is FALSE. There’s a specific level of responsibility I no longer get with white Americans and as a white American I’m disappointed in this as Ive noticed a substantial drastic-significant -change before Covid and after relating to white Americans work ethic. You guys can bitch and call me the big bad Wolf all you want but I see reality more than most of you it seems. permalink parent award report block reply 2scoops2peachmints 8 points 1 day ago This was by design. They forced milliners to take out loans and go to college saying it’s the future and the only way you’ll be successful and get a job. Now the next generation sees through the farce and says fuck it, I’ll just work in the smoke shop and collect gov gibs. When schools started getting rid of metal shop and drivers Ed it should have been a wake up call for boomers but they didn’t give a flying fuck and just want to act superior when it’s their fault we’re in the situation we are now. permalink parent award report block reply henri_derelicte 8 points 1 day ago I’m worried about the unemployment rate for those recent college grads due to H1b, AI, and offshoring. The jobs we thought would be available for them are being given to foreigners permalink parent award report block reply covok48 4 points 23 hours ago This. The current employment rate for 2024 grads is 60%. For 2025 grades it’s more like 30%. This is not good. I was full time employed within a month of graduation in 2007. permalink parent award report block reply view 1 more comments... Nancys_drooping_eye 6 points 1 day ago forced milliners I know you meant millennials but I'm laughing at the image of a bunch of people going to college for hat making.  Which is probably true for some of those with useless degrees. permalink parent award report block reply SicSemperTyrannis2 2 points 13 hours ago They're mad as a hatter! permalink parent award report block reply CommanderComadant -11 points 1 day ago oh my God, I love seeing people talk out their ass. I’m a millennial, motherfucker— The generation below us is even more pathetic!! They are the ones I’m talking about! I’d love to pay a 20-30 something white American $1200 a week for 45 hours but for the love of God they don’t exist. It’s only illegals. Holy shit you assholes have all these garbage opinions but no actual experience with what’s going on. permalink parent award report block reply 2scoops2peachmints 10 points 1 day ago Fuck off you garbage piece of shit, you don’t have a fucking clue what you’re talking about. Take your faggot ass back to India you H1B shit. permalink parent award report block reply view 1 more comments... covok48 4 points 23 hours ago You’re giving off serious 2000s copy/paste toughguy vibes right now. permalink parent award report block reply AVeryNakedMan 6 points 1 day ago Why are you using em dash like a chatbot? permalink parent award report block reply justicein2020 3 points 18 hours ago because it's a bot. or a 3rd worlder.  meat bot. permalink parent award report block reply newestofnew 5 points 1 day ago this dual citizen comes up with excuses to exploit foreign labor to satiate their greed rather than be content with a modest margin and a healthy community. in reality we get the real intention is to take from our community and give to yours. permalink parent award report block reply ConfusedAngryArmed 1 points 20 hours ago Comment removed by community filter. permalink parent award report block reply load 1 more comments...\nNazisWereSocialist 30 points 1 day ago Yeah just make it IMPOSSIBLE for them to live here permalink parent award report block reply Noseeboh 7 points 21 hours ago This is the big brain solution. Make America SUCK if you're illegal and they will leave permalink parent award report block reply\nNoseeboh 7 points 21 hours ago This is the big brain solution. Make America SUCK if you're illegal and they will leave permalink parent award report block reply\nGlory-Unto-God 2 points 18 hours ago Declare the remainder outlaws and let citizens deal with it with no legal ramifications if its still not finished permalink parent award report block reply\nCommanderComadant -35 points 1 day ago You’re an idiot, and have no concept of how broken the white American worker is. Tell me I’m dumb mock me do what the hell you will I’m on the ground and I see what’s happening to our culture and society. White people want nothing to do with physical labor anymore. “Oh you don’t pay enough”- bullshit- white kids would rather make eight dollars an hour sitting in a fucking smoke shop not doing Jack shit then make twice that doing something outside in the heat. You have never hired someone in your life. Yeah that’s right motherfuckers you bring those down thumbs!! J6er here. Nothing but cowards, faggots and losers on this website now— fuck you people you have no fucking clue what’s going on!  Keep your head in the sand! Our culture is broken, and no politician is going to fix it. permalink parent award report block reply Viewer01 21 points 1 day ago People don’t work hard for themselves. They’ll break their back for their families. Bring back getting married at 20 and see how many kids jump into hard labor. I also reject your premise because a lot of the trades went from a stable long term jobs to sub minimum wage gigs. It’s just hilarious to see this absolute bullshit lines get slung around like it’s true. permalink parent award report block reply ChinaFlu 5 points 20 hours ago Young adults need something to live for, fight for, die for. And that something is families. Without that, people are directionless; rudderless. They need a purpose in life. permalink parent award report block reply bidensmissingbrain -7 points 1 day ago Bring back getting married at 20 and see how many kids jump into hard labor. Virtually zero. They'd divorce/leave and go work in a smoke shop for $8/hr. permalink parent award report block reply CommanderComadant -8 points 22 hours ago Negative- Hispanic kids specifically will work to support their own family. It’s not the same ratio with others. It’s culture 👏 👏 👏 I don’t necessarily disagree with your sentiment. I think it’s important that we foster a culture of marriage as well. But to say companies only hire because they want cheap labor is FALSE. There’s a specific level of responsibility I no longer get with white Americans and as a white American I’m disappointed in this as Ive noticed a substantial drastic-significant -change before Covid and after relating to white Americans work ethic. You guys can bitch and call me the big bad Wolf all you want but I see reality more than most of you it seems. permalink parent award report block reply 2scoops2peachmints 8 points 1 day ago This was by design. They forced milliners to take out loans and go to college saying it’s the future and the only way you’ll be successful and get a job. Now the next generation sees through the farce and says fuck it, I’ll just work in the smoke shop and collect gov gibs. When schools started getting rid of metal shop and drivers Ed it should have been a wake up call for boomers but they didn’t give a flying fuck and just want to act superior when it’s their fault we’re in the situation we are now. permalink parent award report block reply henri_derelicte 8 points 1 day ago I’m worried about the unemployment rate for those recent college grads due to H1b, AI, and offshoring. The jobs we thought would be available for them are being given to foreigners permalink parent award report block reply covok48 4 points 23 hours ago This. The current employment rate for 2024 grads is 60%. For 2025 grades it’s more like 30%. This is not good. I was full time employed within a month of graduation in 2007. permalink parent award report block reply view 1 more comments... Nancys_drooping_eye 6 points 1 day ago forced milliners I know you meant millennials but I'm laughing at the image of a bunch of people going to college for hat making.  Which is probably true for some of those with useless degrees. permalink parent award report block reply SicSemperTyrannis2 2 points 13 hours ago They're mad as a hatter! permalink parent award report block reply CommanderComadant -11 points 1 day ago oh my God, I love seeing people talk out their ass. I’m a millennial, motherfucker— The generation below us is even more pathetic!! They are the ones I’m talking about! I’d love to pay a 20-30 something white American $1200 a week for 45 hours but for the love of God they don’t exist. It’s only illegals. Holy shit you assholes have all these garbage opinions but no actual experience with what’s going on. permalink parent award report block reply 2scoops2peachmints 10 points 1 day ago Fuck off you garbage piece of shit, you don’t have a fucking clue what you’re talking about. Take your faggot ass back to India you H1B shit. permalink parent award report block reply view 1 more comments... covok48 4 points 23 hours ago You’re giving off serious 2000s copy/paste toughguy vibes right now. permalink parent award report block reply AVeryNakedMan 6 points 1 day ago Why are you using em dash like a chatbot? permalink parent award report block reply justicein2020 3 points 18 hours ago because it's a bot. or a 3rd worlder.  meat bot. permalink parent award report block reply newestofnew 5 points 1 day ago this dual citizen comes up with excuses to exploit foreign labor to satiate their greed rather than be content with a modest margin and a healthy community. in reality we get the real intention is to take from our community and give to yours. permalink parent award report block reply ConfusedAngryArmed 1 points 20 hours ago Comment removed by community filter. permalink parent award report block reply load 1 more comments...\nViewer01 21 points 1 day ago People don’t work hard for themselves. They’ll break their back for their families. Bring back getting married at 20 and see how many kids jump into hard labor. I also reject your premise because a lot of the trades went from a stable long term jobs to sub minimum wage gigs. It’s just hilarious to see this absolute bullshit lines get slung around like it’s true. permalink parent award report block reply ChinaFlu 5 points 20 hours ago Young adults need something to live for, fight for, die for. And that something is families. Without that, people are directionless; rudderless. They need a purpose in life. permalink parent award report block reply bidensmissingbrain -7 points 1 day ago Bring back getting married at 20 and see how many kids jump into hard labor. Virtually zero. They'd divorce/leave and go work in a smoke shop for $8/hr. permalink parent award report block reply CommanderComadant -8 points 22 hours ago Negative- Hispanic kids specifically will work to support their own family. It’s not the same ratio with others. It’s culture 👏 👏 👏 I don’t necessarily disagree with your sentiment. I think it’s important that we foster a culture of marriage as well. But to say companies only hire because they want cheap labor is FALSE. There’s a specific level of responsibility I no longer get with white Americans and as a white American I’m disappointed in this as Ive noticed a substantial drastic-significant -change before Covid and after relating to white Americans work ethic. You guys can bitch and call me the big bad Wolf all you want but I see reality more than most of you it seems. permalink parent award report block reply\nChinaFlu 5 points 20 hours ago Young adults need something to live for, fight for, die for. And that something is families. Without that, people are directionless; rudderless. They need a purpose in life. permalink parent award report block reply\nbidensmissingbrain -7 points 1 day ago Bring back getting married at 20 and see how many kids jump into hard labor. Virtually zero. They'd divorce/leave and go work in a smoke shop for $8/hr. permalink parent award report block reply\nCommanderComadant -8 points 22 hours ago Negative- Hispanic kids specifically will work to support their own family. It’s not the same ratio with others. It’s culture 👏 👏 👏 I don’t necessarily disagree with your sentiment. I think it’s important that we foster a culture of marriage as well. But to say companies only hire because they want cheap labor is FALSE. There’s a specific level of responsibility I no longer get with white Americans and as a white American I’m disappointed in this as Ive noticed a substantial drastic-significant -change before Covid and after relating to white Americans work ethic. You guys can bitch and call me the big bad Wolf all you want but I see reality more than most of you it seems. permalink parent award report block reply\n2scoops2peachmints 8 points 1 day ago This was by design. They forced milliners to take out loans and go to college saying it’s the future and the only way you’ll be successful and get a job. Now the next generation sees through the farce and says fuck it, I’ll just work in the smoke shop and collect gov gibs. When schools started getting rid of metal shop and drivers Ed it should have been a wake up call for boomers but they didn’t give a flying fuck and just want to act superior when it’s their fault we’re in the situation we are now. permalink parent award report block reply henri_derelicte 8 points 1 day ago I’m worried about the unemployment rate for those recent college grads due to H1b, AI, and offshoring. The jobs we thought would be available for them are being given to foreigners permalink parent award report block reply covok48 4 points 23 hours ago This. The current employment rate for 2024 grads is 60%. For 2025 grades it’s more like 30%. This is not good. I was full time employed within a month of graduation in 2007. permalink parent award report block reply view 1 more comments... Nancys_drooping_eye 6 points 1 day ago forced milliners I know you meant millennials but I'm laughing at the image of a bunch of people going to college for hat making.  Which is probably true for some of those with useless degrees. permalink parent award report block reply SicSemperTyrannis2 2 points 13 hours ago They're mad as a hatter! permalink parent award report block reply CommanderComadant -11 points 1 day ago oh my God, I love seeing people talk out their ass. I’m a millennial, motherfucker— The generation below us is even more pathetic!! They are the ones I’m talking about! I’d love to pay a 20-30 something white American $1200 a week for 45 hours but for the love of God they don’t exist. It’s only illegals. Holy shit you assholes have all these garbage opinions but no actual experience with what’s going on. permalink parent award report block reply 2scoops2peachmints 10 points 1 day ago Fuck off you garbage piece of shit, you don’t have a fucking clue what you’re talking about. Take your faggot ass back to India you H1B shit. permalink parent award report block reply view 1 more comments... covok48 4 points 23 hours ago You’re giving off serious 2000s copy/paste toughguy vibes right now. permalink parent award report block reply\nhenri_derelicte 8 points 1 day ago I’m worried about the unemployment rate for those recent college grads due to H1b, AI, and offshoring. The jobs we thought would be available for them are being given to foreigners permalink parent award report block reply covok48 4 points 23 hours ago This. The current employment rate for 2024 grads is 60%. For 2025 grades it’s more like 30%. This is not good. I was full time employed within a month of graduation in 2007. permalink parent award report block reply view 1 more comments...\ncovok48 4 points 23 hours ago This. The current employment rate for 2024 grads is 60%. For 2025 grades it’s more like 30%. This is not good. I was full time employed within a month of graduation in 2007. permalink parent award report block reply view 1 more comments...\nNancys_drooping_eye 6 points 1 day ago forced milliners I know you meant millennials but I'm laughing at the image of a bunch of people going to college for hat making.  Which is probably true for some of those with useless degrees. permalink parent award report block reply SicSemperTyrannis2 2 points 13 hours ago They're mad as a hatter! permalink parent award report block reply\nSicSemperTyrannis2 2 points 13 hours ago They're mad as a hatter! permalink parent award report block reply\nCommanderComadant -11 points 1 day ago oh my God, I love seeing people talk out their ass. I’m a millennial, motherfucker— The generation below us is even more pathetic!! They are the ones I’m talking about! I’d love to pay a 20-30 something white American $1200 a week for 45 hours but for the love of God they don’t exist. It’s only illegals. Holy shit you assholes have all these garbage opinions but no actual experience with what’s going on. permalink parent award report block reply 2scoops2peachmints 10 points 1 day ago Fuck off you garbage piece of shit, you don’t have a fucking clue what you’re talking about. Take your faggot ass back to India you H1B shit. permalink parent award report block reply view 1 more comments... covok48 4 points 23 hours ago You’re giving off serious 2000s copy/paste toughguy vibes right now. permalink parent award report block reply\n2scoops2peachmints 10 points 1 day ago Fuck off you garbage piece of shit, you don’t have a fucking clue what you’re talking about. Take your faggot ass back to India you H1B shit. permalink parent award report block reply view 1 more comments...\ncovok48 4 points 23 hours ago You’re giving off serious 2000s copy/paste toughguy vibes right now. permalink parent award report block reply\nAVeryNakedMan 6 points 1 day ago Why are you using em dash like a chatbot? permalink parent award report block reply justicein2020 3 points 18 hours ago because it's a bot. or a 3rd worlder.  meat bot. permalink parent award report block reply\njusticein2020 3 points 18 hours ago because it's a bot. or a 3rd worlder.  meat bot. permalink parent award report block reply\nnewestofnew 5 points 1 day ago this dual citizen comes up with excuses to exploit foreign labor to satiate their greed rather than be content with a modest margin and a healthy community. in reality we get the real intention is to take from our community and give to yours. permalink parent award report block reply ConfusedAngryArmed 1 points 20 hours ago Comment removed by community filter. permalink parent award report block reply\nConfusedAngryArmed 1 points 20 hours ago Comment removed by community filter. permalink parent award report block reply\nFormerlurker92 30 points 1 day ago Countries are a lot like leaves, they change colors as they die permalink award report block reply Megaboom2025 4 points 21 hours ago From beauty to brown rot permalink parent award report block reply\nMegaboom2025 4 points 21 hours ago From beauty to brown rot permalink parent award report block reply\ntry4gain PRO 19 points 1 day ago tons more workers lowers wages tons more people looking for apt / home raises cost tons of workers lowers employee benefits companies dont have to be 'competitive' in their hiring when they have 10,000 Jose's who will work for less pay and no benefits permalink award report block reply ViagraFalls 2 points 18 hours ago It’s almost as if everything being geared towards people making money instead of the public good is a bad idea. Everything should work for the good of the society. Personal efficacy and profit is fine as long as it’s not at odds with the good of society. When you look into it, you will find out this is national socialism and that is literally Hitler. permalink parent award report block reply\nViagraFalls 2 points 18 hours ago It’s almost as if everything being geared towards people making money instead of the public good is a bad idea. Everything should work for the good of the society. Personal efficacy and profit is fine as long as it’s not at odds with the good of society. When you look into it, you will find out this is national socialism and that is literally Hitler. permalink parent award report block reply\nhenri_derelicte 18 points 1 day ago Mass deportation is the humane solution. If that is denied to us, the remaining options to retake our country will be far less peaceful… permalink award report block reply ModernKnight 13 points 1 day ago Far left position: let anyone in Moderate position: deport all illegal immigrants Far right position: we have 50 million illegal immigrants, which can be solved by 50 million pikes on our southern border. permalink parent award report block reply AVeryNakedMan 8 points 1 day ago The actual solution is not to put the illegal aliens' heads on pikes, but to put the Democrats' heads on pikes. Their willingness to vote for the self-destruction of our country is the real source of our problems. The illegals were just coming here for free money; a deportation is good enough to solve that problem. permalink parent award report block reply noPTSDforMePlease 6 points 24 hours ago It's both. It doesn't matter if you remove the Dems because the invaders are still here. permalink parent award report block reply thanksobama 6 points 1 day ago Pike every 2.4 inches. That would be a wall of pikes. permalink parent award report block reply Megaboom2025 2 points 21 hours ago The diary of Juan Frank: “we had to hide in the closet hombre… la policia kept looking for us. We had to eat Taco Bell for 3 weeks straight” permalink parent award report block reply Viewer01 7 points 1 day ago Yeap. This is where we’re at. Nikki Haley’s kid is on Fox News almost fed posting. His moms politics have always been weak and effeminate but he seemed ready to call banners and start burning towns. permalink parent award report block reply LonelyPepe 5 points 1 day ago He can GTFO too, being Nimrata Randhawa-spawn. permalink parent award report block reply MediaBro 0 points 22 hours ago Nah, he ain't going anywhere. permalink parent award report block reply LonelyPepe 0 points 20 hours ago You can go with him. permalink parent award report block reply view 2 more comments...\nModernKnight 13 points 1 day ago Far left position: let anyone in Moderate position: deport all illegal immigrants Far right position: we have 50 million illegal immigrants, which can be solved by 50 million pikes on our southern border. permalink parent award report block reply AVeryNakedMan 8 points 1 day ago The actual solution is not to put the illegal aliens' heads on pikes, but to put the Democrats' heads on pikes. Their willingness to vote for the self-destruction of our country is the real source of our problems. The illegals were just coming here for free money; a deportation is good enough to solve that problem. permalink parent award report block reply noPTSDforMePlease 6 points 24 hours ago It's both. It doesn't matter if you remove the Dems because the invaders are still here. permalink parent award report block reply thanksobama 6 points 1 day ago Pike every 2.4 inches. That would be a wall of pikes. permalink parent award report block reply Megaboom2025 2 points 21 hours ago The diary of Juan Frank: “we had to hide in the closet hombre… la policia kept looking for us. We had to eat Taco Bell for 3 weeks straight” permalink parent award report block reply\nAVeryNakedMan 8 points 1 day ago The actual solution is not to put the illegal aliens' heads on pikes, but to put the Democrats' heads on pikes. Their willingness to vote for the self-destruction of our country is the real source of our problems. The illegals were just coming here for free money; a deportation is good enough to solve that problem. permalink parent award report block reply noPTSDforMePlease 6 points 24 hours ago It's both. It doesn't matter if you remove the Dems because the invaders are still here. permalink parent award report block reply\nnoPTSDforMePlease 6 points 24 hours ago It's both. It doesn't matter if you remove the Dems because the invaders are still here. permalink parent award report block reply\nthanksobama 6 points 1 day ago Pike every 2.4 inches. That would be a wall of pikes. permalink parent award report block reply\nMegaboom2025 2 points 21 hours ago The diary of Juan Frank: “we had to hide in the closet hombre… la policia kept looking for us. We had to eat Taco Bell for 3 weeks straight” permalink parent award report block reply\nViewer01 7 points 1 day ago Yeap. This is where we’re at. Nikki Haley’s kid is on Fox News almost fed posting. His moms politics have always been weak and effeminate but he seemed ready to call banners and start burning towns. permalink parent award report block reply LonelyPepe 5 points 1 day ago He can GTFO too, being Nimrata Randhawa-spawn. permalink parent award report block reply MediaBro 0 points 22 hours ago Nah, he ain't going anywhere. permalink parent award report block reply LonelyPepe 0 points 20 hours ago You can go with him. permalink parent award report block reply view 2 more comments...\nLonelyPepe 5 points 1 day ago He can GTFO too, being Nimrata Randhawa-spawn. permalink parent award report block reply MediaBro 0 points 22 hours ago Nah, he ain't going anywhere. permalink parent award report block reply LonelyPepe 0 points 20 hours ago You can go with him. permalink parent award report block reply view 2 more comments...\nMediaBro 0 points 22 hours ago Nah, he ain't going anywhere. permalink parent award report block reply LonelyPepe 0 points 20 hours ago You can go with him. permalink parent award report block reply view 2 more comments...\nLonelyPepe 0 points 20 hours ago You can go with him. permalink parent award report block reply view 2 more comments...\nRockFlagAndEagle2020 13 points 1 day ago It's only a problem because boomers decided it was more important to rub their egos then raise families. They demonized motherhood and replaced motherhood with consumerism. There aren't enough tax payers to fund the benefit system boomers voted in for themselves. I see only one solution here if we want to keep America. End boomer benefits - bye bye Medicare and Social Security, Ban multi-home home ownership, ban companies from buying single family homes and watch the market self correct by 50%. Frankly boomers have served their purpose and they offer little to no benefit to our GDP. They have become a chain weighing down their children's futures. Force them to sell their assets to support their lifestyle. No more hand outs. permalink award report block reply\nBirthHole 12 points 1 day ago For every mooslim that comes here, take $1,000,000 away from Israel's pot of free money. Then they'll stop covertly shipping them over here. permalink award report block reply\n24601 8 points 1 day ago This needs some fixing: \"You would never bring in a bunch of Mutated but breeding Pandas.....\" permalink award report block reply Wtf_socialismreally 12 points 1 day ago Cockroaches is more accurate to what illegals are though. permalink parent award report block reply Jaqen 5 points 1 day ago Biden concurs. He knows a lot about roaches. permalink parent award report block reply Edial 2 points 1 day ago I prefer the label of shit-skin parasites. permalink parent award report block reply SavingPrivateGrace 3 points 1 day ago Inbred, mutated, breeding cockroaches. permalink parent award report block reply 2scoops2peachmints 2 points 1 day ago Polar bears should be the ability, aggress killers like what were being replaced with. permalink parent award report block reply\nWtf_socialismreally 12 points 1 day ago Cockroaches is more accurate to what illegals are though. permalink parent award report block reply Jaqen 5 points 1 day ago Biden concurs. He knows a lot about roaches. permalink parent award report block reply Edial 2 points 1 day ago I prefer the label of shit-skin parasites. permalink parent award report block reply\nJaqen 5 points 1 day ago Biden concurs. He knows a lot about roaches. permalink parent award report block reply\nEdial 2 points 1 day ago I prefer the label of shit-skin parasites. permalink parent award report block reply\nSavingPrivateGrace 3 points 1 day ago Inbred, mutated, breeding cockroaches. permalink parent award report block reply\n2scoops2peachmints 2 points 1 day ago Polar bears should be the ability, aggress killers like what were being replaced with. permalink parent award report block reply\nMAGALADON9 8 points 1 day ago You are saying big-eyed anime style kawaii migrants are = cockroaches.  REEEEEEEEEEEEEEEEEEE. They are invaders. Many (muslims) have a directly hostile political ideology to your freedoms So some predator animal is better analogy.   Something that would kill pandas and eat their food. permalink award report block reply\nSeeker_17 7 points 1 day ago Reminds me of those signs they put up near ponds and lakes, stating one should not release non-native fish, mussels etc. Seems fish are more precious than White people. permalink award report block reply\ntommy3q 5 points 1 day ago Terminate all the radical muslim commie pigs 🐷💥 permalink award report block reply henri_derelicte 3 points 1 day ago Deus Vult! permalink parent award report block reply\nhenri_derelicte 3 points 1 day ago Deus Vult! permalink parent award report block reply\nfreedom-thinker 5 points 1 day ago There is nothing wrong with importing cockroaches, because they vote for you, and thats why Dems do it, and no other reason, no matter what they say. permalink award report block reply\nTPMJB 3 points 1 day ago I feel like if we had a few Crucifixions on the southern border of narcos, the problem would mostly solve itself. Cruel, but not unusual punishment. Sends a message. Though Crucified people tend to live too long so I think I'm leaning towards the Vlad the Impaler treatment. Those people lived for days . Quite the fascinating story. permalink award report block reply\nminttea2 3 points 1 day ago Not a Panda.  Will never be a Panda.  Not an American.  Will never be an American. https://houstonherald.com/2024/05/zoogoers-in-china-outraged-to-discover-panda-exhibit-was-actually-dogs-dyed-black-and-white/ \"Diversity\" is not strength.  Indians seem to know this in their own fucked up country. The Observer reports that on the day its reporter visited, tourists began snapping photos as soon as the gates to the reserve opened, and \"threw bananas and biscuits to the tribespeople at the roadside, as they would to animals at a safari park.\" The officer in the video will reportedly be punished by having \"his future promotion delayed by six months.\" https://theweek.com/articles/478961/indias-deplorable-human-zoo https://www.theguardian.com/world/video/2012/jan/07/andaman-islanders-human-safari-video permalink award report block reply\nViagraFalls 2 points 18 hours ago China should have just imported a bunch of polar bears instead of trying to save panda bears. They could also encourage all the pandas to enter mixed species breeding with the polar bears by making every commercial, TV show, and movie with a couple a male polar bear and female panda. permalink award report block reply\nbased_trekkie 2 points 1 day ago You bring in polar bears and paint black spots on them. permalink award report block reply\nMotownmow 2 points 20 hours ago Basic economics dictates: Declining population -> low workforce supply, lower demand for everyday products, lower demand for housing -> rising wages for workers, lower prices for everyday products, lower housing costs -> YOU CAN NOW AFFORD MORE, WORK LESS, AND HAVE MORE CHILDREN It would have been self-correcting, but globohomo has no interest in a slump. They'd rather import 20 million third worlders to turn your communities into crime-ridden shitholes if it keeps wages low and demand high. permalink award report block reply\nSkullE 2 points 1 day ago They have increasingly made things difficult for males. I assume its been on purpose. And Males disengaging in population making is the result. permalink award report block reply\nArchRespawnsAgain 1 points 22 hours ago America's immigration policies started being opened up after WWII in the middle of the baby boom. It was never about declining birth rates. permalink award report block reply\nSisterCovfefeToo 1 points 1 day ago Barred Owl Culture >> Spotted owl culture permalink award report block reply\ndrmrboy 1 points 1 day ago Birthright citizenship.  🤓 permalink award report block reply\nleast_counties_ever 1 points 1 day ago Unless cockroaches do simple work and vote the way you want them to and the remaining pandas pay their healthcare costs. permalink award report block reply\nWashington_Redskins 1 points 1 day ago The.number of bipedal animals increasing instead of the number of humans is exactly what the leftists  want. permalink award report block reply\nmattytr 1 points 21 hours ago The extreme solution would be execution of the illegal invaders. And I'm in favor of it. permalink award report block reply\nDeathmelody 1 points 1 day ago Nothing short of public hangings of the people who voted and facilitated is a failure. permalink award report block reply\nparamour 1 points 24 hours ago This. permalink award report block reply\n4886Battery 1 points 1 day ago Wrong.  Mass importation is most definitely the solution if your problem is declining Democrat voters and a desire to increase census numbers in blue areas to increase electoral college votes.  Think about it, immigrants are ready-made dependents for generations to come. Democrats/liberals have spent decades telling us that we need to lessen the population, why would we believe they now suddenly care about the problem they've spent decades pretending didn't exist? permalink award report block reply\nhilboggins 1 points 22 hours ago Well the bullshit is the population doesn't grow because they can't afford to grow... They immigrate in people then give them a bunch of free shit so they can grow... Not u. permalink award report block reply\nRolandDelacroix 1 points 1 day ago A different species of bear would be a better analogy, but yeah permalink award report block reply\nHeavenlyTrumpets 1 points 1 day ago This is true... permalink award report block reply\nwilliammcfadden 1 points 24 hours ago The left needs massive amounts of illegals because of losing house seats and electoral votes. Who does that hurt?  The poor. permalink award report block reply\nknnbccb 1 points 1 day ago Those that have not yet surrendered or self-deported one year after Trump's inauguration should be killed on sight by the military. Same for those that shelter or assist them. permalink award report block reply\nLUXURY_USERNAME 1 points 1 day ago you do when you can enslave and tax the cockroach, because you’re a piece of shit politician who can’t own up to your government’s failures and are ready to throw out the entire country just to try and avoid cancelling an entitlement permalink award report block reply\niamimaginos 1 points 22 hours ago Cockroaches.  I see what you did there... permalink award report block reply\nyurimodin 1 points 1 day ago DEUS VAULT permalink award report block reply\nlifeisahologram 1 points 1 day ago Perfect example and analogy for people who notice. Probably could change the animal examples when sharing this meme with people still plugged in the matrix or with boomer judeo-Christian energy. permalink award report block reply\ndelnaga 1 points 22 hours ago The solution is making more babies. Make Families Great Again! permalink award report block reply\nTentacleLord 1 points 13 hours ago This had the perfect lay up with bears as an analogy but instead of using brown or black bears as the animal being brought in you used cockroaches? permalink award report block reply\nMellop 1 points 22 hours ago Cockroach Lives Matter! They're just doing the jobs pandas don't want to do themselves. \"I think there is a resurgence of anti-rodentism, because at this point in time Pandaland has not yet learned how to be cockroach-enriched. And I think we are going to be part of the throes of that transformation, which must take place. Pandaland is not going to be the monolithic societies that they once were in the last century. Rodents are going to be at the center of that. It's a huge transformation for Pandaland to make. They are now going into a cockroach-friendly mode and Rodents will be resented because of our leading role. But without that leading role and without that transformation, Pandaland will not survive.\" permalink award report block reply\nDev404 1 points 1 day ago But you see, western women have it so fucking easy, they have to create problems because they're bored. So they decided cultural genocide was the answer. permalink award report block reply\nncswicn 1 points 1 day ago Spot on! permalink award report block reply\nKungPaoMcChicken 1 points 21 hours ago Yeah, what if Hitler had been this moderate? He would have said to Churchill: you need to take all of these Jews or we will fucking put them in a gas chamber. permalink award report block reply\nIt_takes_10_years -1 points 1 day ago So Is this a post supporting Trumps 600,000 Chinese student visas or..... permalink award report block reply\nexpertnoticer 1 points 18 hours ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T19:58:21.073256Z"
}