{
  "id": "1ARK9hiHY0",
  "url": "https://patriots.win/p/1ARK9hiHY0/hypocrite-elizabeth-warren-makes/c",
  "content": "493 Hypocrite Elizabeth Warren makes a video complaining about CEO flying around on private jets on your dime. But then she is BUSTED flying on a private jet with taxpayers' money. LMAO, watch her try and hide behind an aide once she realizes she is being filmed. posted 2 days ago by rdvs34283 14 comments award share report block Cash Loren @CashLorenShow • 3d Hypocrite Elizabeth Warren makes a video complaining about CEO flying around on private jets on your dime. But then she is BUSTED flying on a private jet with taxpayers' money. LMAO, watch her try and hide behind an aide once she realizes she is being filmed.\n14 comments Sort by Top Top New Worst Old Save Frenchie619 14 points 2 days ago She's among the worst of the worst.  Those who continue to vote for this lying piece of snake dooty (don't want to get banned) should lose their benefits. permalink award report block reply jermzdeejd 7 points 2 days ago Just say \"snake shit\" what faggot is going to ban you for that? permalink parent award report block reply Beelzy 2 points 2 days ago Shit, it's OK to say that. Especially when it's true. permalink parent award report block reply IBentMyWookie 2 points 2 days ago Sheeeeeeeeeeit. permalink parent award report block reply you_know_GOAT 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply dataonly 11 points 2 days ago Jets for business purposes In another words, legitimate transportation cost. SHE IS A DISINGENUOUS LUNATIC.  JUST GO AWAY POCOHANTAS. permalink award report block reply the-new-style 3 points 2 days ago \"let's meet in Hawaii\" permalink parent award report block reply Bullwinkle 7 points 2 days ago I’m surprised she doesn’t have her Antifa mask and hat on to hide who she is. permalink award report block reply MAGABOND 1 points 2 days ago My same fucking thoughts, she made it way too obvious. permalink parent award report block reply Beelzy 5 points 2 days ago She's the epitome of the middle aged dumb twat. permalink award report block reply worldowedexplanation 1 points 2 days ago She’s not middle aged, she’s 76! She’s past retirement! permalink parent award report block reply guywholikesDjtof2024 4 points 2 days ago She wasn't busted. It is a known fact that TPTB regularly burn \"fossil\" fuels themselves. They attack fossil fuels so vehemently because they want to hog it all, and it helps us more than it helps them. permalink award report block reply MAGAPlenty 2 points 2 days ago Just read animal farm this weekend and she represents the Pigs in charge at the farm permalink award report block reply CyanScales 2 points 2 days ago Someone needs to ask who paid for the jet. If it was one of her pharma friends then it's not our money. permalink award report block reply Califunya 1 points 2 days ago Bundt Cake permalink award report block reply\nFrenchie619 14 points 2 days ago She's among the worst of the worst.  Those who continue to vote for this lying piece of snake dooty (don't want to get banned) should lose their benefits. permalink award report block reply jermzdeejd 7 points 2 days ago Just say \"snake shit\" what faggot is going to ban you for that? permalink parent award report block reply Beelzy 2 points 2 days ago Shit, it's OK to say that. Especially when it's true. permalink parent award report block reply IBentMyWookie 2 points 2 days ago Sheeeeeeeeeeit. permalink parent award report block reply you_know_GOAT 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply\njermzdeejd 7 points 2 days ago Just say \"snake shit\" what faggot is going to ban you for that? permalink parent award report block reply\nBeelzy 2 points 2 days ago Shit, it's OK to say that. Especially when it's true. permalink parent award report block reply IBentMyWookie 2 points 2 days ago Sheeeeeeeeeeit. permalink parent award report block reply\nIBentMyWookie 2 points 2 days ago Sheeeeeeeeeeit. permalink parent award report block reply\nyou_know_GOAT 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply\ndataonly 11 points 2 days ago Jets for business purposes In another words, legitimate transportation cost. SHE IS A DISINGENUOUS LUNATIC.  JUST GO AWAY POCOHANTAS. permalink award report block reply the-new-style 3 points 2 days ago \"let's meet in Hawaii\" permalink parent award report block reply\nthe-new-style 3 points 2 days ago \"let's meet in Hawaii\" permalink parent award report block reply\nBullwinkle 7 points 2 days ago I’m surprised she doesn’t have her Antifa mask and hat on to hide who she is. permalink award report block reply MAGABOND 1 points 2 days ago My same fucking thoughts, she made it way too obvious. permalink parent award report block reply\nMAGABOND 1 points 2 days ago My same fucking thoughts, she made it way too obvious. permalink parent award report block reply\nBeelzy 5 points 2 days ago She's the epitome of the middle aged dumb twat. permalink award report block reply worldowedexplanation 1 points 2 days ago She’s not middle aged, she’s 76! She’s past retirement! permalink parent award report block reply\nworldowedexplanation 1 points 2 days ago She’s not middle aged, she’s 76! She’s past retirement! permalink parent award report block reply\nguywholikesDjtof2024 4 points 2 days ago She wasn't busted. It is a known fact that TPTB regularly burn \"fossil\" fuels themselves. They attack fossil fuels so vehemently because they want to hog it all, and it helps us more than it helps them. permalink award report block reply\nMAGAPlenty 2 points 2 days ago Just read animal farm this weekend and she represents the Pigs in charge at the farm permalink award report block reply\nCyanScales 2 points 2 days ago Someone needs to ask who paid for the jet. If it was one of her pharma friends then it's not our money. permalink award report block reply\nCalifunya 1 points 2 days ago Bundt Cake permalink award report block reply",
  "fetched_at": "2025-11-12T23:16:09.615562Z"
}