{
  "id": "1ARK52Bhej",
  "url": "https://patriots.win/p/1ARK52Bhej/stop-all-immigration-dead-in-its/c",
  "content": "262 \"Stop all immigration dead in its tracks. Get rid of the H-1b visa program until things are sorted.\n\nThis will and an effective economic system will make life easier for the under 30 crowd who feels lost and forgotten.\" posted 6 days ago by bleeje 3 comments award share report block Peter B @realpeteyb123 • 7d @RepThomasMassie Agreed, but also stop all immigration dead in its tracks. Get rid of the H-1b visa program until things are sorted. This will and an effective economic system will make life easier for the under 30 crowd who feels lost and forgotten.\n3 comments Sort by Top Top New Worst Old Save Around the Web One Piece Kills All Parasites in Your Body! Paratoxil MrMcGreenGenes 8 points 6 days ago By the end of business to-fucking-day isn't soon enough. permalink award report block reply Magma_Biscuit 8 points 6 days ago The so called melting pot has become a disease infested pitri dish. permalink award report block reply greatpumpkin 5 points 6 days ago \"Stop all immigration dead in its tracks. Get rid of the H-1b visa program ~ until things are sorted. ~ Fixed it. permalink award report block reply corntortilla 1 points 6 days ago The under 30 crowd just elected mamdani, a muslim socialist. permalink award report block reply\nMrMcGreenGenes 8 points 6 days ago By the end of business to-fucking-day isn't soon enough. permalink award report block reply\nMagma_Biscuit 8 points 6 days ago The so called melting pot has become a disease infested pitri dish. permalink award report block reply\ngreatpumpkin 5 points 6 days ago \"Stop all immigration dead in its tracks. Get rid of the H-1b visa program ~ until things are sorted. ~ Fixed it. permalink award report block reply\ncorntortilla 1 points 6 days ago The under 30 crowd just elected mamdani, a muslim socialist. permalink award report block reply",
  "fetched_at": "2025-11-12T23:12:12.731614Z"
}