{
  "id": "1ARK9nNiBY",
  "url": "https://patriots.win/p/1ARK9nNiBY/suggestion-for-trump-/c",
  "content": "70 Suggestion for Trump posted 9 hours ago by Deplorable_Yankee 7 comments award share report block Let the Chinese funded schools in America fail. Tell the Chinese students to go get educated in their own country. Turn the campuses into mental institutions. America First.\n7 comments Sort by Top Top New Worst Old Save Around the Web SHILL_DETECTOR 2 points 9 hours ago \"Turn the campuses into mental institutions.\" fucking this! brilliant as fuck permalink award report block reply stealthboy 2 points 8 hours ago The campuses are already mental institutions. permalink parent award report block reply B-2StealthTrump 1 points 8 hours ago Funny, I came here to say the same thing. permalink parent award report block reply BlackJack1776 1 points 5 hours ago Oh, feel free to take all those professors and faculty to Chy-na with them. permalink award report block reply Be_The_Change 1 points 9 hours ago Comment removed by community moderators. permalink award report block reply Callsign_Fox1 0 points 9 hours ago Comment removed by community moderators. permalink award report block reply Callsign_Fox1 0 points 9 hours ago Why is my comment hidden now? permalink parent award report block reply\nSHILL_DETECTOR 2 points 9 hours ago \"Turn the campuses into mental institutions.\" fucking this! brilliant as fuck permalink award report block reply stealthboy 2 points 8 hours ago The campuses are already mental institutions. permalink parent award report block reply B-2StealthTrump 1 points 8 hours ago Funny, I came here to say the same thing. permalink parent award report block reply\nstealthboy 2 points 8 hours ago The campuses are already mental institutions. permalink parent award report block reply B-2StealthTrump 1 points 8 hours ago Funny, I came here to say the same thing. permalink parent award report block reply\nB-2StealthTrump 1 points 8 hours ago Funny, I came here to say the same thing. permalink parent award report block reply\nBlackJack1776 1 points 5 hours ago Oh, feel free to take all those professors and faculty to Chy-na with them. permalink award report block reply\nBe_The_Change 1 points 9 hours ago Comment removed by community moderators. permalink award report block reply\nCallsign_Fox1 0 points 9 hours ago Comment removed by community moderators. permalink award report block reply Callsign_Fox1 0 points 9 hours ago Why is my comment hidden now? permalink parent award report block reply\nCallsign_Fox1 0 points 9 hours ago Why is my comment hidden now? permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:03:42.206103Z"
}