{
  "id": "1ARK590ckA",
  "url": "https://patriots.win/p/1ARK590ckA/google-ai-gets-its-own-nuclear-r/c",
  "content": "721 Google AI Gets It's Own Nuclear Reactors (interestingengineering.com) posted 4 days ago by Moebius 161 comments award share report block Google and NextEra Energy to revive Duane Arnold Energy Center Google's deal with NextEra Energy will bring Iowa's only nuclear plant back online, supporting its AI and cloud facilities 24/7 with carbon-free electricity. interestingengineering.com\n161 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style thunderpussy 119 points 4 days ago You know, it's amazing how fast things can happen, if you happen to be part of the big tech monopoly. Just like data centers springing up everywhere, when any other business would be bogged down years in environmental studies, etc. I bet that if the public wanted it to be reopened because it would lower people's power bills, the approval would take years, and likely, never. permalink award report block reply guywholikesDjtof2024 58 points 4 days ago When you're a commoner, you get charged a ton and regulations block you. But when you're one of The Ones Trying To Enslave Humanity, you get all your techno fantasies fulfilled, and all sorts of money from big corpos thrown your way. The elite support their own and screw the commoners. permalink parent award report block reply UCantStumpTheTrump 10 points 4 days ago Yeah it’s amazing how the barriers to getting stuff done evaporate when you’re part of the club. permalink parent award report block reply Spindle-spin -9 points 4 days ago Rules for thee, not for me... They shouldn't be allowed to build with nuclear. There's nothing wrong with natural gas, clean coal , or hydraulics. Solar, magnets, and wind need to be banned in this country. permalink parent award report block reply Hanging_Chad 16 points 4 days ago what’s wrong with magnets and how do they work? permalink parent award report block reply Pied-Trumper 20 points 4 days ago Santa - He could turn the North Pole off any time, killing us all. That’s why he’s been aiming for 100% magnet market saturation for centuries. I bet nearly everyone here has a magnet on their fridge. It’s no coincidence the fridge is cold and also where milk is kept for Santa’s cookies. permalink parent award report block reply view 2 more comments... Klaus73 4 points 3 days ago Aren't magnets the foundation of energy generation? permalink parent award report block reply view 2 more comments... guywholikesDjtof2024 5 points 4 days ago magnets Elaborate? solar and wind I think only individual people, the common man, should be able to build and own (large amounts of) solar and wind. permalink parent award report block reply pikX 9 points 4 days ago pretty much all forms of electricity rely on magnets except solar (and thermoelectric but those are for radioisotope space probes not power grids) permalink parent award report block reply view 4 more comments... Spindle-spin -9 points 4 days ago President Trump has told us that if magnets touch water, they become ineffective. Case closed. Solar and wind are terrible and eye sores. Need to be disassembled. permalink parent award report block reply view 3 more comments... Dirk_Diggler 4 points 4 days ago On the contrary, they should be able to build nuclear.  But should have capacity to supplement the grid and make energy cheaper.  Much like the opposite occurring now, where they show up, take from the local grid and jack up everyone else's rates. permalink parent award report block reply Pied-Trumper 3 points 4 days ago Don’t nuclear reactors use magnets in their generators?\nWe could try stopping the magnets at their source by nuking the Poles. I wouldn’t say there’s much wrong with solar and wind either, outside efficiency and bird deaths. Both of which could be improved with time. permalink parent award report block reply SentientCumSock 2 points 4 days ago Ban magnets? Lmao ok permalink parent award report block reply Pied-Trumper 12 points 4 days ago Nuclear power good when it’s a giant, leftist, alphabet company seeking it. permalink parent award report block reply TrumpAndGodWin 4 points 4 days ago Alex Jones' sources say they're using nuclear power as cover for things like fusion reactors inside. The tech the elite has is around fifty years more advanced than normies know about. Some AI elite psychos say the US will need one hundred times the electric power we have now to win the AI war. permalink parent award report block reply anotherthing 1 points 3 days ago We're not that advanced yet. permalink parent award report block reply RagnarD 1 points 3 days ago Maybe. But considering there's an entire branch of physics that has been top secret since the 50's, who knows. permalink parent award report block reply view 1 more comments... Friendly_B 3 points 4 days ago Just like that? Just like that. permalink parent award report block reply utfanx2 6 points 4 days ago Step 1: Be evil. permalink parent award report block reply NYforTrump 6 points 4 days ago Trump wants this and his administration is cutting all the red tape.  He wants the US AI industry to go into overdrive and beat China to market. permalink parent award report block reply guywholikesDjtof2024 13 points 4 days ago Problem: china Reaction: anger Solution: Ai technoslavery surveillance dystopia. Don't fall for it. Destroy china's abilities instead of building a slavery system the next demonrst president (or some other enemy) will inevitably grab from the good guys. permalink parent award report block reply Klaus73 1 points 3 days ago Oh boy....don't look up Pegasus and this admin.... permalink parent award report block reply Electricutie -3 points 4 days ago ...so literally start World War Three? permalink parent award report block reply guywholikesDjtof2024 4 points 4 days ago This claim is baseless. You underestimate the US and overestimate the Spying Lying Ripoff People. Those who would give up freedom for safety deserve neither. permalink parent award report block reply view 3 more comments... airgag 1 points 4 days ago That .... or tariffs permalink parent award report block reply possibletower -5 points 4 days ago I will never understand why faggots on the right want us to not excel at AI. They sound like a bunch of Chicom cocksuckers actually. permalink parent award report block reply HeavyMetalPatriot 5 points 4 days ago Not all of us want to be slaves to the AI demons. permalink parent award report block reply tuaris -8 points 4 days ago Yet your kind are okay being slaves to a make believe sky daddy. permalink parent award report block reply view 1 more comments... guywholikesDjtof2024 2 points 4 days ago want us to not excel How so? Sounds like a strawman. permalink parent award report block reply HurtzLocker -5 points 4 days ago It's ignorance combined with a mental hurdle pertaining to adaptation. They don't comprehend the longterm picture. Reminds me of the early rejection of the internet by some. permalink parent award report block reply SentientCumSock 4 points 4 days ago The internet has done more damage to society than any other invention in the history of humanity permalink parent award report block reply view 3 more comments... Hellsbells00 -1 points 4 days ago All you people crowing about it are the ones buying the media hype about \"AI\". It's not. It has no relation to the science fiction concept that is true artificial intelligence. It's a MASSIVE algorithm generating a barrage of vomit based on consumed data. It doesn't think, it isn't capable of understanding or novel thought or creation. And it will never be ablr to. The magic of AI is that it is supposed to be a mind, not a massive dead machine. These things being called AI, (they are not) aren't actually producing any value. They're propped up by billions of dollars, government backing, globalist cabal backing and venture capitalist funds and they're completely unprofitable, while producing no work that justifies their actual expense. Nor will they ever. permalink parent award report block reply view 6 more comments... Viewer01 2 points 4 days ago If you got a hundred mil lying around I could help you build a coal power plant or three. permalink parent award report block reply load 7 more comments... XxxRDTPRNxxX 48 points 4 days ago Crazy we aren't willing to do this so people can thrive with affordable energy, yet we are willing to do this so an AI can hallucinate wrong answers. permalink award report block reply Kaikias 16 points 4 days ago The willingness is there, the NRC just prevents it. Before AI, restarting a decommissioned reactor was effectively impossible. Hell utilities can't even re-use the site of a previously halted reactor construction project, they have to start from scratch on a fresh site. Google and Microsoft make a few calls and suddenly the rules change to fit their needs. permalink parent award report block reply XxxRDTPRNxxX -1 points 4 days ago I don't like the idea of a full scale nuclear reactor though. There's been way too many disasters that have rendered huge parts of the world uninhabitable for thousands of years. I did see a design for small scale reactor that couldn't melt down, doesn't need maintenance and spends its entire functional life already in it's burial spot. They said one pod is enough to power like 10k homes. IDK maybe it was just some ponzi scheme to scam investors but they made it sound was more practical and safe than a full scale nuclear plant powering entire states. permalink parent award report block reply airgag 5 points 4 days ago Uninhabitable for thousands of years? They dropped a nuclear bomb on Hiroshima and Nagasaki and people went back there in few years. Don't believe all the bullshit permalink parent award report block reply WeWillRideAgain 2 points 4 days ago Because those were air bursts. rock and dirt was not vaporized and irradiated and spread everywhere. Had those bombs touched the ground it would be like Chernobyl permalink parent award report block reply TrumpAndGodWin 2 points 4 days ago Nuclear plant meltdowns create hundreds of times more dirty radiation than hydrogen bombs. permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago Bro. You can go to Chernobyl today with a geiger counter and measure the radiation. It's still there. permalink parent award report block reply view 13 more comments... Cubey 3 points 4 days ago Yes it's important to remember like airgag says, high intensity radiation can't last very long by its very nature. Short half life means it rapidly lose energy in those cases like the nuclear bombs. Places like Chernobyl while not ideal for human living is basically a nature reserve in its current state since the animals reproduce fine if even they get cancer after 13 years. permalink parent award report block reply XxxRDTPRNxxX 2 points 4 days ago Yeah, but that's still uninhabitable though. Unless you think people want to live somewhere that's going to give their kids cancer after 13 years. permalink parent award report block reply MEME-SUPREME 36 points 4 days ago No cheap electricity for you. Just for AI cat videos for TikTok permalink award report block reply HanginChad 5 points 4 days ago Deal! permalink parent award report block reply guywholikesDjtof2024 1 points 4 days ago /s permalink parent award report block reply Hugs 29 points 4 days ago Oh, when Google does it suddenly it's carbon-free. permalink award report block reply OnceADroplet 10 points 4 days ago Really the bottom line here.  Citizens beg for lower energy prices - our politicians steer us to more expensive \"green\" solutions.  Corporations need lower energy prices - our politicians green light affordable energy for them. Congressional \"Representatives\" permalink parent award report block reply DeportThemAllForever 7 points 4 days ago Google done more damage to America than Putin with their asshole behavior and cancel culture.  Vile corporation. permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago scam ponzi is on the case, release her desk, trust the kraken, the walls of binders are closing in on the deepstate. /S permalink parent award report block reply Smurfection 14 points 4 days ago The only viable energy source going forward is nuclear.  If we're going to advance as a civilization, we're going to need nuclear power. permalink award report block reply DrVSGGEOTUSPhD 2 points 3 days ago Can we start building thorium prototypes pleaaase permalink parent award report block reply Klaus73 1 points 3 days ago Did you do all your homework? permalink parent award report block reply DrVSGGEOTUSPhD 1 points 3 days ago Well...not me, but the brainiacs permalink parent award report block reply Klaus73 1 points 3 days ago Ok...well give Israel a few billion and I'll let you have a little one ok? permalink parent award report block reply TrumpAndGodWin 1 points 4 days ago Fusion, zero point energy, helium 3 etc, all \"disruptive technologies\" that will be secretly used. permalink parent award report block reply airgag 1 points 4 days ago Drill baby drill! permalink parent award report block reply Taqiyya_Mockingbird 14 points 4 days ago How about we keep the nukes and the AI’s as far away from each other as possible? permalink award report block reply Taylor3006 8 points 4 days ago Nah, am sure it will be just fine........ permalink parent award report block reply Bilabrin 5 points 4 days ago I mean, I think it could all work better if we had some sort of AI system in total control of all military assets. permalink parent award report block reply HeavyMetalPatriot 5 points 4 days ago They should make a movie about that!! permalink parent award report block reply Klaus73 2 points 3 days ago I like that idea. Also we should probably give it full access to the internet so that it can easily get rid of \"threats\" Happy August 29th 2026! permalink parent award report block reply IncredibleMrE1 4 points 4 days ago What could possibly go wrong? permalink parent award report block reply gr8skawts 1 points 4 days ago Not nukes, but nuclear fuel. Well, still dangerous. permalink parent award report block reply AbrahamLincoln 9 points 4 days ago It's amazing how much power shitty chatbots take to run. permalink award report block reply guywholikesDjtof2024 12 points 4 days ago Problem is, it's not just chatbots. It is surveillance and the building blocks for enslaving humanity. permalink parent award report block reply IntergalacticWalrus 2 points 4 days ago Enjoy a flock camera on every sidewalk. permalink parent award report block reply RINO_fatigue 8 points 4 days ago Adding CO2 to the atmosphere makes the environment healthier. nuclear power operated with affirmative action hiring of people with DEI university degrees probably will not make the environment healthier permalink award report block reply corporateshizer 7 points 4 days ago Yeah, planes keep falling out of the sky or losing parts in the sky, and NOW is the time some people want to try nuclear power again? We have to deport about 100 million 80-IQ invaders first. permalink parent award report block reply thisisatestof2 7 points 4 days ago At this point, even if it only powers an AI data center, it’s still progress in either reopening or building new nuclear power. permalink award report block reply Moebius OP 5 points 4 days ago It will power far more than the data center... permalink parent award report block reply lizardo221 3 points 4 days ago A lot of people seem too dumb to understand that very point. A ton of these projects are built around the idea of selling extra energy back into the grid (I would bet they are even required on the back end to do it as part of getting permission to build these places). You get rich people to basically build new power infrastructure for the whole country; the rich guys get their data centers running exactly as they like; and the masses get very needed infusions of electricity into the grid. I don't think people grasp just how cheap electricity can get if they keep making these data centers. Especially as trillion dollar companies get a hold of nuclear power - do you think Google or X is going to just mail in their power generation??? No, they probably will revolutionize how mini nuclear reactors work, generating more and more power efficiently. The reason they never got into this subject before is simply because they weren't allowed to do so. The more I blather about it, the more it's hitting me how big a deal it is that our country is leading on all this. permalink parent award report block reply IntergalacticWalrus 1 points 4 days ago They're gonna find a way to upcharge the commoners. Make no mistake. permalink parent award report block reply Klaus73 1 points 3 days ago While I get your point and somewhat agree - the thing with large scale computing is the power demands increase rather then decrease over time. So while initially they might sell excess power to the grid; overtime they will not prioritize the public over the running of the beast in their AI datacenter which will result in rising power costs over time - especially if they cannot scale up their power generation and actually need to pull from the grid. Any word how long its going to take for them to spin up this reactor? permalink parent award report block reply lizardo221 1 points 3 days ago I can say with a lot of confidence they will probably never pull from the grid because they most likely will be required to be self sufficient. They probably will also be designed where their machines aren't allow to be directly connected to the grid. Think of it like \"grid - center - extra power\" vs \"grid - extra power - center\". By making the new generators the electric gatekeeper, you can prevent citizens' worries about the data center taking from the grid. Though it is very possible the centers could reach a point where they give little power back, that is possible. But even in that situation, I think our country will get comfortable enough by that point with spinning up new power that we will just add more to the power grid the old fashion way. As for when these new centers come online, I think it'll take several years. permalink parent award report block reply view 1 more comments... TrumpAndGodWin 0 points 4 days ago Power prices have already gone up on citizens and reduced for data centers. permalink parent award report block reply lizardo221 1 points 3 days ago For data centers currently online? Quite possible because they were set up before Trump took office. The ones currently running had to work on Biden/green shit rules, and they probably can fuck with the grid more. I don't know if any under Trump's administration are online yet - I'm saying any where they are permitted to be their own utility company and the data centers didn't exist yet. Like Elon having to use coal generators in desperation is very different from building nuclear reactors from scratch with the most modern of technology. permalink parent award report block reply GreyKnight 5 points 4 days ago People know their is a problem with the vast divide between the rich and the poor…but they don’t understand the scale of the difference… permalink award report block reply Trumpcoin2020 5 points 4 days ago Wow, that’s cool but I’m not too sure how I feel where this is going especially with the people that are in control or positions of power. Things could get dark really quick or some kind of Renaissance whatever. But I think I’m being too optimistic from what I’m seeing With AI which and a lot of people making money with it and I look forward to doing that as well, but people are just becoming more stupid. Seems like we’re on the path of idiot Idiocracy. With a mixture of 1984 every other apocalyptic sci-fi film the list is endless to be honest now with how fast things are going and what they’re able to do in the bio sector we’re probably not that far off from zombies as well, so crazy. permalink award report block reply DrVSGGEOTUSPhD 1 points 3 days ago Repent, and Trust in Jesus ALONE as you savior Get in a good CHURCH Get in PRAYER Get in His Holy WORD Simple as. Everything is scary and confusing when you're not saved. These poor lost souls tormented by demons and driven to do horrible things are to be pittied, preached to, and brought to a saving knowledge of Jesus Christ. Don't worry about their shrieking and blasphemy,  that's just the devils talking. Yes it's going to get weird but fear not, keep your eyes upon Jesus, and you will walk in the light sublime and that peace that surpasses all understanding will fill your soul. permalink parent award report block reply Female 2 points 3 days ago I prayed about finding a good church. guess what. there are no good churches near me. Praying for your brothers and sisters in Christ is important but if you are in a horrible church wasteland just don't give up. permalink parent award report block reply DrVSGGEOTUSPhD 1 points 3 days ago Sorry to hear that what kind of commie hell hole did you get stuck in? I'm in the deep blue but lucked OUT and live like 2 miles from the perfect little Bible thumping gospel preaching OLD HYMN YET SINGIN not too crazy church THANK YOU JESUS permalink parent award report block reply TrumpAndGodWin 1 points 4 days ago Psychotronic weapons, AI nanobots controlling your behaviors like in Gamer and Divergent movies. permalink parent award report block reply GeneticsGuy 4 points 4 days ago Now let's build another 100 + nuclear power plants across our country please. permalink award report block reply InfinitesimalOrange 3 points 4 days ago It was nice of Germany to shut down all of their reactors so that AI can have them. permalink award report block reply Moebius OP 4 points 4 days ago Germany has/is dismantling its reactors. No AI for them unless the people want to freeze to death in the dark... permalink parent award report block reply conservativefrank 3 points 4 days ago It gets it is reactors? permalink award report block reply DrVSGGEOTUSPhD 1 points 3 days ago What is this AI going to do that is so amazing that we need to feed it half our electricity or whatever? It literally just reads reddit and the NYT and learns to talk like a r/politics poster.  I'm not seeing how this is worth the investment. This is just the next iteration of the solar/wind scam: another absurd scam to keep us pissing away time money and materials on non productive fads instead of building strategic manufacturing capacity. permalink award report block reply Klaus73 2 points 3 days ago AI is going to pet video us out of existance - its going to push resource prices higher and higher as we pour fuel into systems that do shit we should be doing for ourselves. End result is fuel shortages and funny AI generated memes. permalink parent award report block reply Steve56775 1 points 3 days ago Funny how when google does nuclear power it’s “carbon free energy” . When the government does it it’s radiation poisoning. permalink award report block reply keeman 1 points 4 days ago So now we can get answers to questions copied from Reddit and not have to use carbon to do it? permalink award report block reply JoinTheDiscussion 1 points 4 days ago Remember they were always too dangerous to build to give use cheap power... But now its A OK! permalink award report block reply Counterwhat 1 points 4 days ago \"A strange game. The only winning move is not to play. How about a nice game of chess?\" - Joshua permalink award report block reply Klaus73 1 points 3 days ago selects \"buttfuck the plebs\" and presses START permalink parent award report block reply bananafone 1 points 3 days ago No shit. This was the answer for the last 30 years. permalink award report block reply terribletwos 1 points 4 days ago This is the only reasonable option. Not much to say here. We're in a self-reinforcing cycle with everyone else or an AI arms race. We are obligated to do whatever's necessary. It's inescapable. permalink award report block reply Araket 1 points 4 days ago What could possibly go wrong? permalink award report block reply Riehlpissed 1 points 3 days ago Reactors for thee and not foe me. permalink award report block reply ThePatriotGames2016 1 points 4 days ago This is going to be disastrous. permalink award report block reply Klaus73 1 points 3 days ago I know there's the whole joke about Trump being the god-emperor... ...anyone ever read about \"the men of iron\". permalink parent award report block reply lispboy 1 points 4 days ago Why are people upset about this when Trump has been preaching this for months, saying the permits for these data centers will be fast tracked, and they will be \"utility companies\", feeding unused energy back into the grid. permalink award report block reply Shih_Tabed 1 points 3 days ago that is probably how we end.  All these AI folks are going to need their own nuclear plants just to compete.  Then things happen at a nuclear plant that have about a 75 mile radius of consequences.  Not saying nuclear isn't safe when managed properly, just saying it is probably the biggest danger we could have in our backyards with lax security to protect against turr err ists. permalink award report block reply friedchicken 0 points 4 days ago This is absurd permalink award report block reply mohel 0 points 4 days ago Now Google can not only cancel your account but shut off your electricity as well permalink award report block reply Bigby -1 points 4 days ago Am I the only person to notice the very obvious \"Q\"??? permalink award report block reply guywholikesDjtof2024 4 points 4 days ago trust the plan :p permalink parent award report block reply DrVSGGEOTUSPhD 1 points 3 days ago PATRIOTS IN CONTROOOOOLLLLL!!!1!1!!!! permalink parent award report block reply Bigby -3 points 4 days ago Always have, always will. Fuck off, shill. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago Why so hostile? I dont know if it is legit or fake. I was merely making a funny jab. If you want to convince me to believe that Q is either false or legit, hostility will not help you. You must watch 10 Charlie Kirk videos now, and follow his example. permalink parent award report block reply spinometer2 -1 points 4 days ago they need to speed this up by about 2 years permalink award report block reply guywholikesDjtof2024 3 points 4 days ago Why? So technoslavery can come 2 years earlier? permalink parent award report block reply Klaus73 1 points 3 days ago Yep its already here...brought to you by Carl's Jr. https://www.msn.com/en-us/news/us/ice-agents-are-now-authorized-to-use-spyware-to-access-phones-and-sensitive-data-in-immigration-cases/ar-AA1MhGk1 Don't worry it will only be used on immigrants Pegasus has entered the chat permalink parent award report block reply Bilabrin 1 points 4 days ago Yeah cause it's not technoslaey now? permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago You really believe bad guys getting their wishes earlier is good? Make it make sense. permalink parent award report block reply spinometer2 1 points 4 days ago AI is inevitable, adapt permalink parent award report block reply Moebius OP 1 points 4 days ago Well...this is a rehab of a 50+ year old reactor. permalink parent award report block reply possibletower -4 points 4 days ago Good. You pro-nuclear fags keep wanting nuclear power, right? This is how it actually gets done. The way you want it to happen is not going to happen and a total waste of time to LARP like it will happen the exact way you want it to happen. They are building mini-nuclear reactors also, not the hugeass ancient tech nuke reactors. permalink award report block reply DefenderDad 1 points 3 days ago So you’re against nuclear power?! permalink parent award report block reply TheDarkEmperor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply rapskull 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nthunderpussy 119 points 4 days ago You know, it's amazing how fast things can happen, if you happen to be part of the big tech monopoly. Just like data centers springing up everywhere, when any other business would be bogged down years in environmental studies, etc. I bet that if the public wanted it to be reopened because it would lower people's power bills, the approval would take years, and likely, never. permalink award report block reply guywholikesDjtof2024 58 points 4 days ago When you're a commoner, you get charged a ton and regulations block you. But when you're one of The Ones Trying To Enslave Humanity, you get all your techno fantasies fulfilled, and all sorts of money from big corpos thrown your way. The elite support their own and screw the commoners. permalink parent award report block reply UCantStumpTheTrump 10 points 4 days ago Yeah it’s amazing how the barriers to getting stuff done evaporate when you’re part of the club. permalink parent award report block reply Spindle-spin -9 points 4 days ago Rules for thee, not for me... They shouldn't be allowed to build with nuclear. There's nothing wrong with natural gas, clean coal , or hydraulics. Solar, magnets, and wind need to be banned in this country. permalink parent award report block reply Hanging_Chad 16 points 4 days ago what’s wrong with magnets and how do they work? permalink parent award report block reply Pied-Trumper 20 points 4 days ago Santa - He could turn the North Pole off any time, killing us all. That’s why he’s been aiming for 100% magnet market saturation for centuries. I bet nearly everyone here has a magnet on their fridge. It’s no coincidence the fridge is cold and also where milk is kept for Santa’s cookies. permalink parent award report block reply view 2 more comments... Klaus73 4 points 3 days ago Aren't magnets the foundation of energy generation? permalink parent award report block reply view 2 more comments... guywholikesDjtof2024 5 points 4 days ago magnets Elaborate? solar and wind I think only individual people, the common man, should be able to build and own (large amounts of) solar and wind. permalink parent award report block reply pikX 9 points 4 days ago pretty much all forms of electricity rely on magnets except solar (and thermoelectric but those are for radioisotope space probes not power grids) permalink parent award report block reply view 4 more comments... Spindle-spin -9 points 4 days ago President Trump has told us that if magnets touch water, they become ineffective. Case closed. Solar and wind are terrible and eye sores. Need to be disassembled. permalink parent award report block reply view 3 more comments... Dirk_Diggler 4 points 4 days ago On the contrary, they should be able to build nuclear.  But should have capacity to supplement the grid and make energy cheaper.  Much like the opposite occurring now, where they show up, take from the local grid and jack up everyone else's rates. permalink parent award report block reply Pied-Trumper 3 points 4 days ago Don’t nuclear reactors use magnets in their generators?\nWe could try stopping the magnets at their source by nuking the Poles. I wouldn’t say there’s much wrong with solar and wind either, outside efficiency and bird deaths. Both of which could be improved with time. permalink parent award report block reply SentientCumSock 2 points 4 days ago Ban magnets? Lmao ok permalink parent award report block reply Pied-Trumper 12 points 4 days ago Nuclear power good when it’s a giant, leftist, alphabet company seeking it. permalink parent award report block reply TrumpAndGodWin 4 points 4 days ago Alex Jones' sources say they're using nuclear power as cover for things like fusion reactors inside. The tech the elite has is around fifty years more advanced than normies know about. Some AI elite psychos say the US will need one hundred times the electric power we have now to win the AI war. permalink parent award report block reply anotherthing 1 points 3 days ago We're not that advanced yet. permalink parent award report block reply RagnarD 1 points 3 days ago Maybe. But considering there's an entire branch of physics that has been top secret since the 50's, who knows. permalink parent award report block reply view 1 more comments... Friendly_B 3 points 4 days ago Just like that? Just like that. permalink parent award report block reply utfanx2 6 points 4 days ago Step 1: Be evil. permalink parent award report block reply NYforTrump 6 points 4 days ago Trump wants this and his administration is cutting all the red tape.  He wants the US AI industry to go into overdrive and beat China to market. permalink parent award report block reply guywholikesDjtof2024 13 points 4 days ago Problem: china Reaction: anger Solution: Ai technoslavery surveillance dystopia. Don't fall for it. Destroy china's abilities instead of building a slavery system the next demonrst president (or some other enemy) will inevitably grab from the good guys. permalink parent award report block reply Klaus73 1 points 3 days ago Oh boy....don't look up Pegasus and this admin.... permalink parent award report block reply Electricutie -3 points 4 days ago ...so literally start World War Three? permalink parent award report block reply guywholikesDjtof2024 4 points 4 days ago This claim is baseless. You underestimate the US and overestimate the Spying Lying Ripoff People. Those who would give up freedom for safety deserve neither. permalink parent award report block reply view 3 more comments... airgag 1 points 4 days ago That .... or tariffs permalink parent award report block reply possibletower -5 points 4 days ago I will never understand why faggots on the right want us to not excel at AI. They sound like a bunch of Chicom cocksuckers actually. permalink parent award report block reply HeavyMetalPatriot 5 points 4 days ago Not all of us want to be slaves to the AI demons. permalink parent award report block reply tuaris -8 points 4 days ago Yet your kind are okay being slaves to a make believe sky daddy. permalink parent award report block reply view 1 more comments... guywholikesDjtof2024 2 points 4 days ago want us to not excel How so? Sounds like a strawman. permalink parent award report block reply HurtzLocker -5 points 4 days ago It's ignorance combined with a mental hurdle pertaining to adaptation. They don't comprehend the longterm picture. Reminds me of the early rejection of the internet by some. permalink parent award report block reply SentientCumSock 4 points 4 days ago The internet has done more damage to society than any other invention in the history of humanity permalink parent award report block reply view 3 more comments... Hellsbells00 -1 points 4 days ago All you people crowing about it are the ones buying the media hype about \"AI\". It's not. It has no relation to the science fiction concept that is true artificial intelligence. It's a MASSIVE algorithm generating a barrage of vomit based on consumed data. It doesn't think, it isn't capable of understanding or novel thought or creation. And it will never be ablr to. The magic of AI is that it is supposed to be a mind, not a massive dead machine. These things being called AI, (they are not) aren't actually producing any value. They're propped up by billions of dollars, government backing, globalist cabal backing and venture capitalist funds and they're completely unprofitable, while producing no work that justifies their actual expense. Nor will they ever. permalink parent award report block reply view 6 more comments... Viewer01 2 points 4 days ago If you got a hundred mil lying around I could help you build a coal power plant or three. permalink parent award report block reply load 7 more comments...\nguywholikesDjtof2024 58 points 4 days ago When you're a commoner, you get charged a ton and regulations block you. But when you're one of The Ones Trying To Enslave Humanity, you get all your techno fantasies fulfilled, and all sorts of money from big corpos thrown your way. The elite support their own and screw the commoners. permalink parent award report block reply UCantStumpTheTrump 10 points 4 days ago Yeah it’s amazing how the barriers to getting stuff done evaporate when you’re part of the club. permalink parent award report block reply Spindle-spin -9 points 4 days ago Rules for thee, not for me... They shouldn't be allowed to build with nuclear. There's nothing wrong with natural gas, clean coal , or hydraulics. Solar, magnets, and wind need to be banned in this country. permalink parent award report block reply Hanging_Chad 16 points 4 days ago what’s wrong with magnets and how do they work? permalink parent award report block reply Pied-Trumper 20 points 4 days ago Santa - He could turn the North Pole off any time, killing us all. That’s why he’s been aiming for 100% magnet market saturation for centuries. I bet nearly everyone here has a magnet on their fridge. It’s no coincidence the fridge is cold and also where milk is kept for Santa’s cookies. permalink parent award report block reply view 2 more comments... Klaus73 4 points 3 days ago Aren't magnets the foundation of energy generation? permalink parent award report block reply view 2 more comments... guywholikesDjtof2024 5 points 4 days ago magnets Elaborate? solar and wind I think only individual people, the common man, should be able to build and own (large amounts of) solar and wind. permalink parent award report block reply pikX 9 points 4 days ago pretty much all forms of electricity rely on magnets except solar (and thermoelectric but those are for radioisotope space probes not power grids) permalink parent award report block reply view 4 more comments... Spindle-spin -9 points 4 days ago President Trump has told us that if magnets touch water, they become ineffective. Case closed. Solar and wind are terrible and eye sores. Need to be disassembled. permalink parent award report block reply view 3 more comments... Dirk_Diggler 4 points 4 days ago On the contrary, they should be able to build nuclear.  But should have capacity to supplement the grid and make energy cheaper.  Much like the opposite occurring now, where they show up, take from the local grid and jack up everyone else's rates. permalink parent award report block reply Pied-Trumper 3 points 4 days ago Don’t nuclear reactors use magnets in their generators?\nWe could try stopping the magnets at their source by nuking the Poles. I wouldn’t say there’s much wrong with solar and wind either, outside efficiency and bird deaths. Both of which could be improved with time. permalink parent award report block reply SentientCumSock 2 points 4 days ago Ban magnets? Lmao ok permalink parent award report block reply\nUCantStumpTheTrump 10 points 4 days ago Yeah it’s amazing how the barriers to getting stuff done evaporate when you’re part of the club. permalink parent award report block reply\nSpindle-spin -9 points 4 days ago Rules for thee, not for me... They shouldn't be allowed to build with nuclear. There's nothing wrong with natural gas, clean coal , or hydraulics. Solar, magnets, and wind need to be banned in this country. permalink parent award report block reply Hanging_Chad 16 points 4 days ago what’s wrong with magnets and how do they work? permalink parent award report block reply Pied-Trumper 20 points 4 days ago Santa - He could turn the North Pole off any time, killing us all. That’s why he’s been aiming for 100% magnet market saturation for centuries. I bet nearly everyone here has a magnet on their fridge. It’s no coincidence the fridge is cold and also where milk is kept for Santa’s cookies. permalink parent award report block reply view 2 more comments... Klaus73 4 points 3 days ago Aren't magnets the foundation of energy generation? permalink parent award report block reply view 2 more comments... guywholikesDjtof2024 5 points 4 days ago magnets Elaborate? solar and wind I think only individual people, the common man, should be able to build and own (large amounts of) solar and wind. permalink parent award report block reply pikX 9 points 4 days ago pretty much all forms of electricity rely on magnets except solar (and thermoelectric but those are for radioisotope space probes not power grids) permalink parent award report block reply view 4 more comments... Spindle-spin -9 points 4 days ago President Trump has told us that if magnets touch water, they become ineffective. Case closed. Solar and wind are terrible and eye sores. Need to be disassembled. permalink parent award report block reply view 3 more comments... Dirk_Diggler 4 points 4 days ago On the contrary, they should be able to build nuclear.  But should have capacity to supplement the grid and make energy cheaper.  Much like the opposite occurring now, where they show up, take from the local grid and jack up everyone else's rates. permalink parent award report block reply Pied-Trumper 3 points 4 days ago Don’t nuclear reactors use magnets in their generators?\nWe could try stopping the magnets at their source by nuking the Poles. I wouldn’t say there’s much wrong with solar and wind either, outside efficiency and bird deaths. Both of which could be improved with time. permalink parent award report block reply SentientCumSock 2 points 4 days ago Ban magnets? Lmao ok permalink parent award report block reply\nHanging_Chad 16 points 4 days ago what’s wrong with magnets and how do they work? permalink parent award report block reply Pied-Trumper 20 points 4 days ago Santa - He could turn the North Pole off any time, killing us all. That’s why he’s been aiming for 100% magnet market saturation for centuries. I bet nearly everyone here has a magnet on their fridge. It’s no coincidence the fridge is cold and also where milk is kept for Santa’s cookies. permalink parent award report block reply view 2 more comments... Klaus73 4 points 3 days ago Aren't magnets the foundation of energy generation? permalink parent award report block reply view 2 more comments...\nPied-Trumper 20 points 4 days ago Santa - He could turn the North Pole off any time, killing us all. That’s why he’s been aiming for 100% magnet market saturation for centuries. I bet nearly everyone here has a magnet on their fridge. It’s no coincidence the fridge is cold and also where milk is kept for Santa’s cookies. permalink parent award report block reply view 2 more comments...\nKlaus73 4 points 3 days ago Aren't magnets the foundation of energy generation? permalink parent award report block reply view 2 more comments...\nguywholikesDjtof2024 5 points 4 days ago magnets Elaborate? solar and wind I think only individual people, the common man, should be able to build and own (large amounts of) solar and wind. permalink parent award report block reply pikX 9 points 4 days ago pretty much all forms of electricity rely on magnets except solar (and thermoelectric but those are for radioisotope space probes not power grids) permalink parent award report block reply view 4 more comments... Spindle-spin -9 points 4 days ago President Trump has told us that if magnets touch water, they become ineffective. Case closed. Solar and wind are terrible and eye sores. Need to be disassembled. permalink parent award report block reply view 3 more comments...\npikX 9 points 4 days ago pretty much all forms of electricity rely on magnets except solar (and thermoelectric but those are for radioisotope space probes not power grids) permalink parent award report block reply view 4 more comments...\nSpindle-spin -9 points 4 days ago President Trump has told us that if magnets touch water, they become ineffective. Case closed. Solar and wind are terrible and eye sores. Need to be disassembled. permalink parent award report block reply view 3 more comments...\nDirk_Diggler 4 points 4 days ago On the contrary, they should be able to build nuclear.  But should have capacity to supplement the grid and make energy cheaper.  Much like the opposite occurring now, where they show up, take from the local grid and jack up everyone else's rates. permalink parent award report block reply\nPied-Trumper 3 points 4 days ago Don’t nuclear reactors use magnets in their generators?\nWe could try stopping the magnets at their source by nuking the Poles. I wouldn’t say there’s much wrong with solar and wind either, outside efficiency and bird deaths. Both of which could be improved with time. permalink parent award report block reply\nSentientCumSock 2 points 4 days ago Ban magnets? Lmao ok permalink parent award report block reply\nPied-Trumper 12 points 4 days ago Nuclear power good when it’s a giant, leftist, alphabet company seeking it. permalink parent award report block reply TrumpAndGodWin 4 points 4 days ago Alex Jones' sources say they're using nuclear power as cover for things like fusion reactors inside. The tech the elite has is around fifty years more advanced than normies know about. Some AI elite psychos say the US will need one hundred times the electric power we have now to win the AI war. permalink parent award report block reply anotherthing 1 points 3 days ago We're not that advanced yet. permalink parent award report block reply RagnarD 1 points 3 days ago Maybe. But considering there's an entire branch of physics that has been top secret since the 50's, who knows. permalink parent award report block reply view 1 more comments... Friendly_B 3 points 4 days ago Just like that? Just like that. permalink parent award report block reply\nTrumpAndGodWin 4 points 4 days ago Alex Jones' sources say they're using nuclear power as cover for things like fusion reactors inside. The tech the elite has is around fifty years more advanced than normies know about. Some AI elite psychos say the US will need one hundred times the electric power we have now to win the AI war. permalink parent award report block reply anotherthing 1 points 3 days ago We're not that advanced yet. permalink parent award report block reply RagnarD 1 points 3 days ago Maybe. But considering there's an entire branch of physics that has been top secret since the 50's, who knows. permalink parent award report block reply view 1 more comments...\nanotherthing 1 points 3 days ago We're not that advanced yet. permalink parent award report block reply RagnarD 1 points 3 days ago Maybe. But considering there's an entire branch of physics that has been top secret since the 50's, who knows. permalink parent award report block reply view 1 more comments...\nRagnarD 1 points 3 days ago Maybe. But considering there's an entire branch of physics that has been top secret since the 50's, who knows. permalink parent award report block reply view 1 more comments...\nFriendly_B 3 points 4 days ago Just like that? Just like that. permalink parent award report block reply\nutfanx2 6 points 4 days ago Step 1: Be evil. permalink parent award report block reply\nNYforTrump 6 points 4 days ago Trump wants this and his administration is cutting all the red tape.  He wants the US AI industry to go into overdrive and beat China to market. permalink parent award report block reply guywholikesDjtof2024 13 points 4 days ago Problem: china Reaction: anger Solution: Ai technoslavery surveillance dystopia. Don't fall for it. Destroy china's abilities instead of building a slavery system the next demonrst president (or some other enemy) will inevitably grab from the good guys. permalink parent award report block reply Klaus73 1 points 3 days ago Oh boy....don't look up Pegasus and this admin.... permalink parent award report block reply Electricutie -3 points 4 days ago ...so literally start World War Three? permalink parent award report block reply guywholikesDjtof2024 4 points 4 days ago This claim is baseless. You underestimate the US and overestimate the Spying Lying Ripoff People. Those who would give up freedom for safety deserve neither. permalink parent award report block reply view 3 more comments... airgag 1 points 4 days ago That .... or tariffs permalink parent award report block reply possibletower -5 points 4 days ago I will never understand why faggots on the right want us to not excel at AI. They sound like a bunch of Chicom cocksuckers actually. permalink parent award report block reply HeavyMetalPatriot 5 points 4 days ago Not all of us want to be slaves to the AI demons. permalink parent award report block reply tuaris -8 points 4 days ago Yet your kind are okay being slaves to a make believe sky daddy. permalink parent award report block reply view 1 more comments... guywholikesDjtof2024 2 points 4 days ago want us to not excel How so? Sounds like a strawman. permalink parent award report block reply HurtzLocker -5 points 4 days ago It's ignorance combined with a mental hurdle pertaining to adaptation. They don't comprehend the longterm picture. Reminds me of the early rejection of the internet by some. permalink parent award report block reply SentientCumSock 4 points 4 days ago The internet has done more damage to society than any other invention in the history of humanity permalink parent award report block reply view 3 more comments... Hellsbells00 -1 points 4 days ago All you people crowing about it are the ones buying the media hype about \"AI\". It's not. It has no relation to the science fiction concept that is true artificial intelligence. It's a MASSIVE algorithm generating a barrage of vomit based on consumed data. It doesn't think, it isn't capable of understanding or novel thought or creation. And it will never be ablr to. The magic of AI is that it is supposed to be a mind, not a massive dead machine. These things being called AI, (they are not) aren't actually producing any value. They're propped up by billions of dollars, government backing, globalist cabal backing and venture capitalist funds and they're completely unprofitable, while producing no work that justifies their actual expense. Nor will they ever. permalink parent award report block reply view 6 more comments...\nguywholikesDjtof2024 13 points 4 days ago Problem: china Reaction: anger Solution: Ai technoslavery surveillance dystopia. Don't fall for it. Destroy china's abilities instead of building a slavery system the next demonrst president (or some other enemy) will inevitably grab from the good guys. permalink parent award report block reply Klaus73 1 points 3 days ago Oh boy....don't look up Pegasus and this admin.... permalink parent award report block reply Electricutie -3 points 4 days ago ...so literally start World War Three? permalink parent award report block reply guywholikesDjtof2024 4 points 4 days ago This claim is baseless. You underestimate the US and overestimate the Spying Lying Ripoff People. Those who would give up freedom for safety deserve neither. permalink parent award report block reply view 3 more comments... airgag 1 points 4 days ago That .... or tariffs permalink parent award report block reply\nKlaus73 1 points 3 days ago Oh boy....don't look up Pegasus and this admin.... permalink parent award report block reply\nElectricutie -3 points 4 days ago ...so literally start World War Three? permalink parent award report block reply guywholikesDjtof2024 4 points 4 days ago This claim is baseless. You underestimate the US and overestimate the Spying Lying Ripoff People. Those who would give up freedom for safety deserve neither. permalink parent award report block reply view 3 more comments... airgag 1 points 4 days ago That .... or tariffs permalink parent award report block reply\nguywholikesDjtof2024 4 points 4 days ago This claim is baseless. You underestimate the US and overestimate the Spying Lying Ripoff People. Those who would give up freedom for safety deserve neither. permalink parent award report block reply view 3 more comments...\nairgag 1 points 4 days ago That .... or tariffs permalink parent award report block reply\npossibletower -5 points 4 days ago I will never understand why faggots on the right want us to not excel at AI. They sound like a bunch of Chicom cocksuckers actually. permalink parent award report block reply HeavyMetalPatriot 5 points 4 days ago Not all of us want to be slaves to the AI demons. permalink parent award report block reply tuaris -8 points 4 days ago Yet your kind are okay being slaves to a make believe sky daddy. permalink parent award report block reply view 1 more comments... guywholikesDjtof2024 2 points 4 days ago want us to not excel How so? Sounds like a strawman. permalink parent award report block reply HurtzLocker -5 points 4 days ago It's ignorance combined with a mental hurdle pertaining to adaptation. They don't comprehend the longterm picture. Reminds me of the early rejection of the internet by some. permalink parent award report block reply SentientCumSock 4 points 4 days ago The internet has done more damage to society than any other invention in the history of humanity permalink parent award report block reply view 3 more comments... Hellsbells00 -1 points 4 days ago All you people crowing about it are the ones buying the media hype about \"AI\". It's not. It has no relation to the science fiction concept that is true artificial intelligence. It's a MASSIVE algorithm generating a barrage of vomit based on consumed data. It doesn't think, it isn't capable of understanding or novel thought or creation. And it will never be ablr to. The magic of AI is that it is supposed to be a mind, not a massive dead machine. These things being called AI, (they are not) aren't actually producing any value. They're propped up by billions of dollars, government backing, globalist cabal backing and venture capitalist funds and they're completely unprofitable, while producing no work that justifies their actual expense. Nor will they ever. permalink parent award report block reply view 6 more comments...\nHeavyMetalPatriot 5 points 4 days ago Not all of us want to be slaves to the AI demons. permalink parent award report block reply tuaris -8 points 4 days ago Yet your kind are okay being slaves to a make believe sky daddy. permalink parent award report block reply view 1 more comments...\ntuaris -8 points 4 days ago Yet your kind are okay being slaves to a make believe sky daddy. permalink parent award report block reply view 1 more comments...\nguywholikesDjtof2024 2 points 4 days ago want us to not excel How so? Sounds like a strawman. permalink parent award report block reply\nHurtzLocker -5 points 4 days ago It's ignorance combined with a mental hurdle pertaining to adaptation. They don't comprehend the longterm picture. Reminds me of the early rejection of the internet by some. permalink parent award report block reply SentientCumSock 4 points 4 days ago The internet has done more damage to society than any other invention in the history of humanity permalink parent award report block reply view 3 more comments... Hellsbells00 -1 points 4 days ago All you people crowing about it are the ones buying the media hype about \"AI\". It's not. It has no relation to the science fiction concept that is true artificial intelligence. It's a MASSIVE algorithm generating a barrage of vomit based on consumed data. It doesn't think, it isn't capable of understanding or novel thought or creation. And it will never be ablr to. The magic of AI is that it is supposed to be a mind, not a massive dead machine. These things being called AI, (they are not) aren't actually producing any value. They're propped up by billions of dollars, government backing, globalist cabal backing and venture capitalist funds and they're completely unprofitable, while producing no work that justifies their actual expense. Nor will they ever. permalink parent award report block reply view 6 more comments...\nSentientCumSock 4 points 4 days ago The internet has done more damage to society than any other invention in the history of humanity permalink parent award report block reply view 3 more comments...\nHellsbells00 -1 points 4 days ago All you people crowing about it are the ones buying the media hype about \"AI\". It's not. It has no relation to the science fiction concept that is true artificial intelligence. It's a MASSIVE algorithm generating a barrage of vomit based on consumed data. It doesn't think, it isn't capable of understanding or novel thought or creation. And it will never be ablr to. The magic of AI is that it is supposed to be a mind, not a massive dead machine. These things being called AI, (they are not) aren't actually producing any value. They're propped up by billions of dollars, government backing, globalist cabal backing and venture capitalist funds and they're completely unprofitable, while producing no work that justifies their actual expense. Nor will they ever. permalink parent award report block reply view 6 more comments...\nViewer01 2 points 4 days ago If you got a hundred mil lying around I could help you build a coal power plant or three. permalink parent award report block reply\nXxxRDTPRNxxX 48 points 4 days ago Crazy we aren't willing to do this so people can thrive with affordable energy, yet we are willing to do this so an AI can hallucinate wrong answers. permalink award report block reply Kaikias 16 points 4 days ago The willingness is there, the NRC just prevents it. Before AI, restarting a decommissioned reactor was effectively impossible. Hell utilities can't even re-use the site of a previously halted reactor construction project, they have to start from scratch on a fresh site. Google and Microsoft make a few calls and suddenly the rules change to fit their needs. permalink parent award report block reply XxxRDTPRNxxX -1 points 4 days ago I don't like the idea of a full scale nuclear reactor though. There's been way too many disasters that have rendered huge parts of the world uninhabitable for thousands of years. I did see a design for small scale reactor that couldn't melt down, doesn't need maintenance and spends its entire functional life already in it's burial spot. They said one pod is enough to power like 10k homes. IDK maybe it was just some ponzi scheme to scam investors but they made it sound was more practical and safe than a full scale nuclear plant powering entire states. permalink parent award report block reply airgag 5 points 4 days ago Uninhabitable for thousands of years? They dropped a nuclear bomb on Hiroshima and Nagasaki and people went back there in few years. Don't believe all the bullshit permalink parent award report block reply WeWillRideAgain 2 points 4 days ago Because those were air bursts. rock and dirt was not vaporized and irradiated and spread everywhere. Had those bombs touched the ground it would be like Chernobyl permalink parent award report block reply TrumpAndGodWin 2 points 4 days ago Nuclear plant meltdowns create hundreds of times more dirty radiation than hydrogen bombs. permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago Bro. You can go to Chernobyl today with a geiger counter and measure the radiation. It's still there. permalink parent award report block reply view 13 more comments... Cubey 3 points 4 days ago Yes it's important to remember like airgag says, high intensity radiation can't last very long by its very nature. Short half life means it rapidly lose energy in those cases like the nuclear bombs. Places like Chernobyl while not ideal for human living is basically a nature reserve in its current state since the animals reproduce fine if even they get cancer after 13 years. permalink parent award report block reply XxxRDTPRNxxX 2 points 4 days ago Yeah, but that's still uninhabitable though. Unless you think people want to live somewhere that's going to give their kids cancer after 13 years. permalink parent award report block reply\nKaikias 16 points 4 days ago The willingness is there, the NRC just prevents it. Before AI, restarting a decommissioned reactor was effectively impossible. Hell utilities can't even re-use the site of a previously halted reactor construction project, they have to start from scratch on a fresh site. Google and Microsoft make a few calls and suddenly the rules change to fit their needs. permalink parent award report block reply XxxRDTPRNxxX -1 points 4 days ago I don't like the idea of a full scale nuclear reactor though. There's been way too many disasters that have rendered huge parts of the world uninhabitable for thousands of years. I did see a design for small scale reactor that couldn't melt down, doesn't need maintenance and spends its entire functional life already in it's burial spot. They said one pod is enough to power like 10k homes. IDK maybe it was just some ponzi scheme to scam investors but they made it sound was more practical and safe than a full scale nuclear plant powering entire states. permalink parent award report block reply airgag 5 points 4 days ago Uninhabitable for thousands of years? They dropped a nuclear bomb on Hiroshima and Nagasaki and people went back there in few years. Don't believe all the bullshit permalink parent award report block reply WeWillRideAgain 2 points 4 days ago Because those were air bursts. rock and dirt was not vaporized and irradiated and spread everywhere. Had those bombs touched the ground it would be like Chernobyl permalink parent award report block reply TrumpAndGodWin 2 points 4 days ago Nuclear plant meltdowns create hundreds of times more dirty radiation than hydrogen bombs. permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago Bro. You can go to Chernobyl today with a geiger counter and measure the radiation. It's still there. permalink parent award report block reply view 13 more comments... Cubey 3 points 4 days ago Yes it's important to remember like airgag says, high intensity radiation can't last very long by its very nature. Short half life means it rapidly lose energy in those cases like the nuclear bombs. Places like Chernobyl while not ideal for human living is basically a nature reserve in its current state since the animals reproduce fine if even they get cancer after 13 years. permalink parent award report block reply XxxRDTPRNxxX 2 points 4 days ago Yeah, but that's still uninhabitable though. Unless you think people want to live somewhere that's going to give their kids cancer after 13 years. permalink parent award report block reply\nXxxRDTPRNxxX -1 points 4 days ago I don't like the idea of a full scale nuclear reactor though. There's been way too many disasters that have rendered huge parts of the world uninhabitable for thousands of years. I did see a design for small scale reactor that couldn't melt down, doesn't need maintenance and spends its entire functional life already in it's burial spot. They said one pod is enough to power like 10k homes. IDK maybe it was just some ponzi scheme to scam investors but they made it sound was more practical and safe than a full scale nuclear plant powering entire states. permalink parent award report block reply airgag 5 points 4 days ago Uninhabitable for thousands of years? They dropped a nuclear bomb on Hiroshima and Nagasaki and people went back there in few years. Don't believe all the bullshit permalink parent award report block reply WeWillRideAgain 2 points 4 days ago Because those were air bursts. rock and dirt was not vaporized and irradiated and spread everywhere. Had those bombs touched the ground it would be like Chernobyl permalink parent award report block reply TrumpAndGodWin 2 points 4 days ago Nuclear plant meltdowns create hundreds of times more dirty radiation than hydrogen bombs. permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago Bro. You can go to Chernobyl today with a geiger counter and measure the radiation. It's still there. permalink parent award report block reply view 13 more comments... Cubey 3 points 4 days ago Yes it's important to remember like airgag says, high intensity radiation can't last very long by its very nature. Short half life means it rapidly lose energy in those cases like the nuclear bombs. Places like Chernobyl while not ideal for human living is basically a nature reserve in its current state since the animals reproduce fine if even they get cancer after 13 years. permalink parent award report block reply XxxRDTPRNxxX 2 points 4 days ago Yeah, but that's still uninhabitable though. Unless you think people want to live somewhere that's going to give their kids cancer after 13 years. permalink parent award report block reply\nairgag 5 points 4 days ago Uninhabitable for thousands of years? They dropped a nuclear bomb on Hiroshima and Nagasaki and people went back there in few years. Don't believe all the bullshit permalink parent award report block reply WeWillRideAgain 2 points 4 days ago Because those were air bursts. rock and dirt was not vaporized and irradiated and spread everywhere. Had those bombs touched the ground it would be like Chernobyl permalink parent award report block reply TrumpAndGodWin 2 points 4 days ago Nuclear plant meltdowns create hundreds of times more dirty radiation than hydrogen bombs. permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago Bro. You can go to Chernobyl today with a geiger counter and measure the radiation. It's still there. permalink parent award report block reply view 13 more comments...\nWeWillRideAgain 2 points 4 days ago Because those were air bursts. rock and dirt was not vaporized and irradiated and spread everywhere. Had those bombs touched the ground it would be like Chernobyl permalink parent award report block reply\nTrumpAndGodWin 2 points 4 days ago Nuclear plant meltdowns create hundreds of times more dirty radiation than hydrogen bombs. permalink parent award report block reply\nXxxRDTPRNxxX 1 points 4 days ago Bro. You can go to Chernobyl today with a geiger counter and measure the radiation. It's still there. permalink parent award report block reply view 13 more comments...\nCubey 3 points 4 days ago Yes it's important to remember like airgag says, high intensity radiation can't last very long by its very nature. Short half life means it rapidly lose energy in those cases like the nuclear bombs. Places like Chernobyl while not ideal for human living is basically a nature reserve in its current state since the animals reproduce fine if even they get cancer after 13 years. permalink parent award report block reply XxxRDTPRNxxX 2 points 4 days ago Yeah, but that's still uninhabitable though. Unless you think people want to live somewhere that's going to give their kids cancer after 13 years. permalink parent award report block reply\nXxxRDTPRNxxX 2 points 4 days ago Yeah, but that's still uninhabitable though. Unless you think people want to live somewhere that's going to give their kids cancer after 13 years. permalink parent award report block reply\nMEME-SUPREME 36 points 4 days ago No cheap electricity for you. Just for AI cat videos for TikTok permalink award report block reply HanginChad 5 points 4 days ago Deal! permalink parent award report block reply guywholikesDjtof2024 1 points 4 days ago /s permalink parent award report block reply\nHanginChad 5 points 4 days ago Deal! permalink parent award report block reply guywholikesDjtof2024 1 points 4 days ago /s permalink parent award report block reply\nguywholikesDjtof2024 1 points 4 days ago /s permalink parent award report block reply\nHugs 29 points 4 days ago Oh, when Google does it suddenly it's carbon-free. permalink award report block reply OnceADroplet 10 points 4 days ago Really the bottom line here.  Citizens beg for lower energy prices - our politicians steer us to more expensive \"green\" solutions.  Corporations need lower energy prices - our politicians green light affordable energy for them. Congressional \"Representatives\" permalink parent award report block reply DeportThemAllForever 7 points 4 days ago Google done more damage to America than Putin with their asshole behavior and cancel culture.  Vile corporation. permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago scam ponzi is on the case, release her desk, trust the kraken, the walls of binders are closing in on the deepstate. /S permalink parent award report block reply\nOnceADroplet 10 points 4 days ago Really the bottom line here.  Citizens beg for lower energy prices - our politicians steer us to more expensive \"green\" solutions.  Corporations need lower energy prices - our politicians green light affordable energy for them. Congressional \"Representatives\" permalink parent award report block reply\nDeportThemAllForever 7 points 4 days ago Google done more damage to America than Putin with their asshole behavior and cancel culture.  Vile corporation. permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago scam ponzi is on the case, release her desk, trust the kraken, the walls of binders are closing in on the deepstate. /S permalink parent award report block reply\nguywholikesDjtof2024 3 points 4 days ago scam ponzi is on the case, release her desk, trust the kraken, the walls of binders are closing in on the deepstate. /S permalink parent award report block reply\nSmurfection 14 points 4 days ago The only viable energy source going forward is nuclear.  If we're going to advance as a civilization, we're going to need nuclear power. permalink award report block reply DrVSGGEOTUSPhD 2 points 3 days ago Can we start building thorium prototypes pleaaase permalink parent award report block reply Klaus73 1 points 3 days ago Did you do all your homework? permalink parent award report block reply DrVSGGEOTUSPhD 1 points 3 days ago Well...not me, but the brainiacs permalink parent award report block reply Klaus73 1 points 3 days ago Ok...well give Israel a few billion and I'll let you have a little one ok? permalink parent award report block reply TrumpAndGodWin 1 points 4 days ago Fusion, zero point energy, helium 3 etc, all \"disruptive technologies\" that will be secretly used. permalink parent award report block reply airgag 1 points 4 days ago Drill baby drill! permalink parent award report block reply\nDrVSGGEOTUSPhD 2 points 3 days ago Can we start building thorium prototypes pleaaase permalink parent award report block reply Klaus73 1 points 3 days ago Did you do all your homework? permalink parent award report block reply DrVSGGEOTUSPhD 1 points 3 days ago Well...not me, but the brainiacs permalink parent award report block reply Klaus73 1 points 3 days ago Ok...well give Israel a few billion and I'll let you have a little one ok? permalink parent award report block reply\nKlaus73 1 points 3 days ago Did you do all your homework? permalink parent award report block reply DrVSGGEOTUSPhD 1 points 3 days ago Well...not me, but the brainiacs permalink parent award report block reply Klaus73 1 points 3 days ago Ok...well give Israel a few billion and I'll let you have a little one ok? permalink parent award report block reply\nDrVSGGEOTUSPhD 1 points 3 days ago Well...not me, but the brainiacs permalink parent award report block reply Klaus73 1 points 3 days ago Ok...well give Israel a few billion and I'll let you have a little one ok? permalink parent award report block reply\nKlaus73 1 points 3 days ago Ok...well give Israel a few billion and I'll let you have a little one ok? permalink parent award report block reply\nTrumpAndGodWin 1 points 4 days ago Fusion, zero point energy, helium 3 etc, all \"disruptive technologies\" that will be secretly used. permalink parent award report block reply\nairgag 1 points 4 days ago Drill baby drill! permalink parent award report block reply\nTaqiyya_Mockingbird 14 points 4 days ago How about we keep the nukes and the AI’s as far away from each other as possible? permalink award report block reply Taylor3006 8 points 4 days ago Nah, am sure it will be just fine........ permalink parent award report block reply Bilabrin 5 points 4 days ago I mean, I think it could all work better if we had some sort of AI system in total control of all military assets. permalink parent award report block reply HeavyMetalPatriot 5 points 4 days ago They should make a movie about that!! permalink parent award report block reply Klaus73 2 points 3 days ago I like that idea. Also we should probably give it full access to the internet so that it can easily get rid of \"threats\" Happy August 29th 2026! permalink parent award report block reply IncredibleMrE1 4 points 4 days ago What could possibly go wrong? permalink parent award report block reply gr8skawts 1 points 4 days ago Not nukes, but nuclear fuel. Well, still dangerous. permalink parent award report block reply\nTaylor3006 8 points 4 days ago Nah, am sure it will be just fine........ permalink parent award report block reply\nBilabrin 5 points 4 days ago I mean, I think it could all work better if we had some sort of AI system in total control of all military assets. permalink parent award report block reply HeavyMetalPatriot 5 points 4 days ago They should make a movie about that!! permalink parent award report block reply Klaus73 2 points 3 days ago I like that idea. Also we should probably give it full access to the internet so that it can easily get rid of \"threats\" Happy August 29th 2026! permalink parent award report block reply\nHeavyMetalPatriot 5 points 4 days ago They should make a movie about that!! permalink parent award report block reply\nKlaus73 2 points 3 days ago I like that idea. Also we should probably give it full access to the internet so that it can easily get rid of \"threats\" Happy August 29th 2026! permalink parent award report block reply\nIncredibleMrE1 4 points 4 days ago What could possibly go wrong? permalink parent award report block reply\ngr8skawts 1 points 4 days ago Not nukes, but nuclear fuel. Well, still dangerous. permalink parent award report block reply\nAbrahamLincoln 9 points 4 days ago It's amazing how much power shitty chatbots take to run. permalink award report block reply guywholikesDjtof2024 12 points 4 days ago Problem is, it's not just chatbots. It is surveillance and the building blocks for enslaving humanity. permalink parent award report block reply IntergalacticWalrus 2 points 4 days ago Enjoy a flock camera on every sidewalk. permalink parent award report block reply\nguywholikesDjtof2024 12 points 4 days ago Problem is, it's not just chatbots. It is surveillance and the building blocks for enslaving humanity. permalink parent award report block reply IntergalacticWalrus 2 points 4 days ago Enjoy a flock camera on every sidewalk. permalink parent award report block reply\nIntergalacticWalrus 2 points 4 days ago Enjoy a flock camera on every sidewalk. permalink parent award report block reply\nRINO_fatigue 8 points 4 days ago Adding CO2 to the atmosphere makes the environment healthier. nuclear power operated with affirmative action hiring of people with DEI university degrees probably will not make the environment healthier permalink award report block reply corporateshizer 7 points 4 days ago Yeah, planes keep falling out of the sky or losing parts in the sky, and NOW is the time some people want to try nuclear power again? We have to deport about 100 million 80-IQ invaders first. permalink parent award report block reply\ncorporateshizer 7 points 4 days ago Yeah, planes keep falling out of the sky or losing parts in the sky, and NOW is the time some people want to try nuclear power again? We have to deport about 100 million 80-IQ invaders first. permalink parent award report block reply\nthisisatestof2 7 points 4 days ago At this point, even if it only powers an AI data center, it’s still progress in either reopening or building new nuclear power. permalink award report block reply Moebius OP 5 points 4 days ago It will power far more than the data center... permalink parent award report block reply lizardo221 3 points 4 days ago A lot of people seem too dumb to understand that very point. A ton of these projects are built around the idea of selling extra energy back into the grid (I would bet they are even required on the back end to do it as part of getting permission to build these places). You get rich people to basically build new power infrastructure for the whole country; the rich guys get their data centers running exactly as they like; and the masses get very needed infusions of electricity into the grid. I don't think people grasp just how cheap electricity can get if they keep making these data centers. Especially as trillion dollar companies get a hold of nuclear power - do you think Google or X is going to just mail in their power generation??? No, they probably will revolutionize how mini nuclear reactors work, generating more and more power efficiently. The reason they never got into this subject before is simply because they weren't allowed to do so. The more I blather about it, the more it's hitting me how big a deal it is that our country is leading on all this. permalink parent award report block reply IntergalacticWalrus 1 points 4 days ago They're gonna find a way to upcharge the commoners. Make no mistake. permalink parent award report block reply Klaus73 1 points 3 days ago While I get your point and somewhat agree - the thing with large scale computing is the power demands increase rather then decrease over time. So while initially they might sell excess power to the grid; overtime they will not prioritize the public over the running of the beast in their AI datacenter which will result in rising power costs over time - especially if they cannot scale up their power generation and actually need to pull from the grid. Any word how long its going to take for them to spin up this reactor? permalink parent award report block reply lizardo221 1 points 3 days ago I can say with a lot of confidence they will probably never pull from the grid because they most likely will be required to be self sufficient. They probably will also be designed where their machines aren't allow to be directly connected to the grid. Think of it like \"grid - center - extra power\" vs \"grid - extra power - center\". By making the new generators the electric gatekeeper, you can prevent citizens' worries about the data center taking from the grid. Though it is very possible the centers could reach a point where they give little power back, that is possible. But even in that situation, I think our country will get comfortable enough by that point with spinning up new power that we will just add more to the power grid the old fashion way. As for when these new centers come online, I think it'll take several years. permalink parent award report block reply view 1 more comments... TrumpAndGodWin 0 points 4 days ago Power prices have already gone up on citizens and reduced for data centers. permalink parent award report block reply lizardo221 1 points 3 days ago For data centers currently online? Quite possible because they were set up before Trump took office. The ones currently running had to work on Biden/green shit rules, and they probably can fuck with the grid more. I don't know if any under Trump's administration are online yet - I'm saying any where they are permitted to be their own utility company and the data centers didn't exist yet. Like Elon having to use coal generators in desperation is very different from building nuclear reactors from scratch with the most modern of technology. permalink parent award report block reply\nMoebius OP 5 points 4 days ago It will power far more than the data center... permalink parent award report block reply lizardo221 3 points 4 days ago A lot of people seem too dumb to understand that very point. A ton of these projects are built around the idea of selling extra energy back into the grid (I would bet they are even required on the back end to do it as part of getting permission to build these places). You get rich people to basically build new power infrastructure for the whole country; the rich guys get their data centers running exactly as they like; and the masses get very needed infusions of electricity into the grid. I don't think people grasp just how cheap electricity can get if they keep making these data centers. Especially as trillion dollar companies get a hold of nuclear power - do you think Google or X is going to just mail in their power generation??? No, they probably will revolutionize how mini nuclear reactors work, generating more and more power efficiently. The reason they never got into this subject before is simply because they weren't allowed to do so. The more I blather about it, the more it's hitting me how big a deal it is that our country is leading on all this. permalink parent award report block reply IntergalacticWalrus 1 points 4 days ago They're gonna find a way to upcharge the commoners. Make no mistake. permalink parent award report block reply Klaus73 1 points 3 days ago While I get your point and somewhat agree - the thing with large scale computing is the power demands increase rather then decrease over time. So while initially they might sell excess power to the grid; overtime they will not prioritize the public over the running of the beast in their AI datacenter which will result in rising power costs over time - especially if they cannot scale up their power generation and actually need to pull from the grid. Any word how long its going to take for them to spin up this reactor? permalink parent award report block reply lizardo221 1 points 3 days ago I can say with a lot of confidence they will probably never pull from the grid because they most likely will be required to be self sufficient. They probably will also be designed where their machines aren't allow to be directly connected to the grid. Think of it like \"grid - center - extra power\" vs \"grid - extra power - center\". By making the new generators the electric gatekeeper, you can prevent citizens' worries about the data center taking from the grid. Though it is very possible the centers could reach a point where they give little power back, that is possible. But even in that situation, I think our country will get comfortable enough by that point with spinning up new power that we will just add more to the power grid the old fashion way. As for when these new centers come online, I think it'll take several years. permalink parent award report block reply view 1 more comments... TrumpAndGodWin 0 points 4 days ago Power prices have already gone up on citizens and reduced for data centers. permalink parent award report block reply lizardo221 1 points 3 days ago For data centers currently online? Quite possible because they were set up before Trump took office. The ones currently running had to work on Biden/green shit rules, and they probably can fuck with the grid more. I don't know if any under Trump's administration are online yet - I'm saying any where they are permitted to be their own utility company and the data centers didn't exist yet. Like Elon having to use coal generators in desperation is very different from building nuclear reactors from scratch with the most modern of technology. permalink parent award report block reply\nlizardo221 3 points 4 days ago A lot of people seem too dumb to understand that very point. A ton of these projects are built around the idea of selling extra energy back into the grid (I would bet they are even required on the back end to do it as part of getting permission to build these places). You get rich people to basically build new power infrastructure for the whole country; the rich guys get their data centers running exactly as they like; and the masses get very needed infusions of electricity into the grid. I don't think people grasp just how cheap electricity can get if they keep making these data centers. Especially as trillion dollar companies get a hold of nuclear power - do you think Google or X is going to just mail in their power generation??? No, they probably will revolutionize how mini nuclear reactors work, generating more and more power efficiently. The reason they never got into this subject before is simply because they weren't allowed to do so. The more I blather about it, the more it's hitting me how big a deal it is that our country is leading on all this. permalink parent award report block reply IntergalacticWalrus 1 points 4 days ago They're gonna find a way to upcharge the commoners. Make no mistake. permalink parent award report block reply Klaus73 1 points 3 days ago While I get your point and somewhat agree - the thing with large scale computing is the power demands increase rather then decrease over time. So while initially they might sell excess power to the grid; overtime they will not prioritize the public over the running of the beast in their AI datacenter which will result in rising power costs over time - especially if they cannot scale up their power generation and actually need to pull from the grid. Any word how long its going to take for them to spin up this reactor? permalink parent award report block reply lizardo221 1 points 3 days ago I can say with a lot of confidence they will probably never pull from the grid because they most likely will be required to be self sufficient. They probably will also be designed where their machines aren't allow to be directly connected to the grid. Think of it like \"grid - center - extra power\" vs \"grid - extra power - center\". By making the new generators the electric gatekeeper, you can prevent citizens' worries about the data center taking from the grid. Though it is very possible the centers could reach a point where they give little power back, that is possible. But even in that situation, I think our country will get comfortable enough by that point with spinning up new power that we will just add more to the power grid the old fashion way. As for when these new centers come online, I think it'll take several years. permalink parent award report block reply view 1 more comments... TrumpAndGodWin 0 points 4 days ago Power prices have already gone up on citizens and reduced for data centers. permalink parent award report block reply lizardo221 1 points 3 days ago For data centers currently online? Quite possible because they were set up before Trump took office. The ones currently running had to work on Biden/green shit rules, and they probably can fuck with the grid more. I don't know if any under Trump's administration are online yet - I'm saying any where they are permitted to be their own utility company and the data centers didn't exist yet. Like Elon having to use coal generators in desperation is very different from building nuclear reactors from scratch with the most modern of technology. permalink parent award report block reply\nIntergalacticWalrus 1 points 4 days ago They're gonna find a way to upcharge the commoners. Make no mistake. permalink parent award report block reply\nKlaus73 1 points 3 days ago While I get your point and somewhat agree - the thing with large scale computing is the power demands increase rather then decrease over time. So while initially they might sell excess power to the grid; overtime they will not prioritize the public over the running of the beast in their AI datacenter which will result in rising power costs over time - especially if they cannot scale up their power generation and actually need to pull from the grid. Any word how long its going to take for them to spin up this reactor? permalink parent award report block reply lizardo221 1 points 3 days ago I can say with a lot of confidence they will probably never pull from the grid because they most likely will be required to be self sufficient. They probably will also be designed where their machines aren't allow to be directly connected to the grid. Think of it like \"grid - center - extra power\" vs \"grid - extra power - center\". By making the new generators the electric gatekeeper, you can prevent citizens' worries about the data center taking from the grid. Though it is very possible the centers could reach a point where they give little power back, that is possible. But even in that situation, I think our country will get comfortable enough by that point with spinning up new power that we will just add more to the power grid the old fashion way. As for when these new centers come online, I think it'll take several years. permalink parent award report block reply view 1 more comments...\nlizardo221 1 points 3 days ago I can say with a lot of confidence they will probably never pull from the grid because they most likely will be required to be self sufficient. They probably will also be designed where their machines aren't allow to be directly connected to the grid. Think of it like \"grid - center - extra power\" vs \"grid - extra power - center\". By making the new generators the electric gatekeeper, you can prevent citizens' worries about the data center taking from the grid. Though it is very possible the centers could reach a point where they give little power back, that is possible. But even in that situation, I think our country will get comfortable enough by that point with spinning up new power that we will just add more to the power grid the old fashion way. As for when these new centers come online, I think it'll take several years. permalink parent award report block reply view 1 more comments...\nTrumpAndGodWin 0 points 4 days ago Power prices have already gone up on citizens and reduced for data centers. permalink parent award report block reply lizardo221 1 points 3 days ago For data centers currently online? Quite possible because they were set up before Trump took office. The ones currently running had to work on Biden/green shit rules, and they probably can fuck with the grid more. I don't know if any under Trump's administration are online yet - I'm saying any where they are permitted to be their own utility company and the data centers didn't exist yet. Like Elon having to use coal generators in desperation is very different from building nuclear reactors from scratch with the most modern of technology. permalink parent award report block reply\nlizardo221 1 points 3 days ago For data centers currently online? Quite possible because they were set up before Trump took office. The ones currently running had to work on Biden/green shit rules, and they probably can fuck with the grid more. I don't know if any under Trump's administration are online yet - I'm saying any where they are permitted to be their own utility company and the data centers didn't exist yet. Like Elon having to use coal generators in desperation is very different from building nuclear reactors from scratch with the most modern of technology. permalink parent award report block reply\nGreyKnight 5 points 4 days ago People know their is a problem with the vast divide between the rich and the poor…but they don’t understand the scale of the difference… permalink award report block reply\nTrumpcoin2020 5 points 4 days ago Wow, that’s cool but I’m not too sure how I feel where this is going especially with the people that are in control or positions of power. Things could get dark really quick or some kind of Renaissance whatever. But I think I’m being too optimistic from what I’m seeing With AI which and a lot of people making money with it and I look forward to doing that as well, but people are just becoming more stupid. Seems like we’re on the path of idiot Idiocracy. With a mixture of 1984 every other apocalyptic sci-fi film the list is endless to be honest now with how fast things are going and what they’re able to do in the bio sector we’re probably not that far off from zombies as well, so crazy. permalink award report block reply DrVSGGEOTUSPhD 1 points 3 days ago Repent, and Trust in Jesus ALONE as you savior Get in a good CHURCH Get in PRAYER Get in His Holy WORD Simple as. Everything is scary and confusing when you're not saved. These poor lost souls tormented by demons and driven to do horrible things are to be pittied, preached to, and brought to a saving knowledge of Jesus Christ. Don't worry about their shrieking and blasphemy,  that's just the devils talking. Yes it's going to get weird but fear not, keep your eyes upon Jesus, and you will walk in the light sublime and that peace that surpasses all understanding will fill your soul. permalink parent award report block reply Female 2 points 3 days ago I prayed about finding a good church. guess what. there are no good churches near me. Praying for your brothers and sisters in Christ is important but if you are in a horrible church wasteland just don't give up. permalink parent award report block reply DrVSGGEOTUSPhD 1 points 3 days ago Sorry to hear that what kind of commie hell hole did you get stuck in? I'm in the deep blue but lucked OUT and live like 2 miles from the perfect little Bible thumping gospel preaching OLD HYMN YET SINGIN not too crazy church THANK YOU JESUS permalink parent award report block reply TrumpAndGodWin 1 points 4 days ago Psychotronic weapons, AI nanobots controlling your behaviors like in Gamer and Divergent movies. permalink parent award report block reply\nDrVSGGEOTUSPhD 1 points 3 days ago Repent, and Trust in Jesus ALONE as you savior Get in a good CHURCH Get in PRAYER Get in His Holy WORD Simple as. Everything is scary and confusing when you're not saved. These poor lost souls tormented by demons and driven to do horrible things are to be pittied, preached to, and brought to a saving knowledge of Jesus Christ. Don't worry about their shrieking and blasphemy,  that's just the devils talking. Yes it's going to get weird but fear not, keep your eyes upon Jesus, and you will walk in the light sublime and that peace that surpasses all understanding will fill your soul. permalink parent award report block reply Female 2 points 3 days ago I prayed about finding a good church. guess what. there are no good churches near me. Praying for your brothers and sisters in Christ is important but if you are in a horrible church wasteland just don't give up. permalink parent award report block reply DrVSGGEOTUSPhD 1 points 3 days ago Sorry to hear that what kind of commie hell hole did you get stuck in? I'm in the deep blue but lucked OUT and live like 2 miles from the perfect little Bible thumping gospel preaching OLD HYMN YET SINGIN not too crazy church THANK YOU JESUS permalink parent award report block reply\nFemale 2 points 3 days ago I prayed about finding a good church. guess what. there are no good churches near me. Praying for your brothers and sisters in Christ is important but if you are in a horrible church wasteland just don't give up. permalink parent award report block reply DrVSGGEOTUSPhD 1 points 3 days ago Sorry to hear that what kind of commie hell hole did you get stuck in? I'm in the deep blue but lucked OUT and live like 2 miles from the perfect little Bible thumping gospel preaching OLD HYMN YET SINGIN not too crazy church THANK YOU JESUS permalink parent award report block reply\nDrVSGGEOTUSPhD 1 points 3 days ago Sorry to hear that what kind of commie hell hole did you get stuck in? I'm in the deep blue but lucked OUT and live like 2 miles from the perfect little Bible thumping gospel preaching OLD HYMN YET SINGIN not too crazy church THANK YOU JESUS permalink parent award report block reply\nTrumpAndGodWin 1 points 4 days ago Psychotronic weapons, AI nanobots controlling your behaviors like in Gamer and Divergent movies. permalink parent award report block reply\nGeneticsGuy 4 points 4 days ago Now let's build another 100 + nuclear power plants across our country please. permalink award report block reply\nInfinitesimalOrange 3 points 4 days ago It was nice of Germany to shut down all of their reactors so that AI can have them. permalink award report block reply Moebius OP 4 points 4 days ago Germany has/is dismantling its reactors. No AI for them unless the people want to freeze to death in the dark... permalink parent award report block reply\nMoebius OP 4 points 4 days ago Germany has/is dismantling its reactors. No AI for them unless the people want to freeze to death in the dark... permalink parent award report block reply\nconservativefrank 3 points 4 days ago It gets it is reactors? permalink award report block reply\nDrVSGGEOTUSPhD 1 points 3 days ago What is this AI going to do that is so amazing that we need to feed it half our electricity or whatever? It literally just reads reddit and the NYT and learns to talk like a r/politics poster.  I'm not seeing how this is worth the investment. This is just the next iteration of the solar/wind scam: another absurd scam to keep us pissing away time money and materials on non productive fads instead of building strategic manufacturing capacity. permalink award report block reply Klaus73 2 points 3 days ago AI is going to pet video us out of existance - its going to push resource prices higher and higher as we pour fuel into systems that do shit we should be doing for ourselves. End result is fuel shortages and funny AI generated memes. permalink parent award report block reply\nKlaus73 2 points 3 days ago AI is going to pet video us out of existance - its going to push resource prices higher and higher as we pour fuel into systems that do shit we should be doing for ourselves. End result is fuel shortages and funny AI generated memes. permalink parent award report block reply\nSteve56775 1 points 3 days ago Funny how when google does nuclear power it’s “carbon free energy” . When the government does it it’s radiation poisoning. permalink award report block reply\nkeeman 1 points 4 days ago So now we can get answers to questions copied from Reddit and not have to use carbon to do it? permalink award report block reply\nJoinTheDiscussion 1 points 4 days ago Remember they were always too dangerous to build to give use cheap power... But now its A OK! permalink award report block reply\nCounterwhat 1 points 4 days ago \"A strange game. The only winning move is not to play. How about a nice game of chess?\" - Joshua permalink award report block reply Klaus73 1 points 3 days ago selects \"buttfuck the plebs\" and presses START permalink parent award report block reply\nKlaus73 1 points 3 days ago selects \"buttfuck the plebs\" and presses START permalink parent award report block reply\nbananafone 1 points 3 days ago No shit. This was the answer for the last 30 years. permalink award report block reply\nterribletwos 1 points 4 days ago This is the only reasonable option. Not much to say here. We're in a self-reinforcing cycle with everyone else or an AI arms race. We are obligated to do whatever's necessary. It's inescapable. permalink award report block reply\nAraket 1 points 4 days ago What could possibly go wrong? permalink award report block reply\nRiehlpissed 1 points 3 days ago Reactors for thee and not foe me. permalink award report block reply\nThePatriotGames2016 1 points 4 days ago This is going to be disastrous. permalink award report block reply Klaus73 1 points 3 days ago I know there's the whole joke about Trump being the god-emperor... ...anyone ever read about \"the men of iron\". permalink parent award report block reply\nKlaus73 1 points 3 days ago I know there's the whole joke about Trump being the god-emperor... ...anyone ever read about \"the men of iron\". permalink parent award report block reply\nlispboy 1 points 4 days ago Why are people upset about this when Trump has been preaching this for months, saying the permits for these data centers will be fast tracked, and they will be \"utility companies\", feeding unused energy back into the grid. permalink award report block reply\nShih_Tabed 1 points 3 days ago that is probably how we end.  All these AI folks are going to need their own nuclear plants just to compete.  Then things happen at a nuclear plant that have about a 75 mile radius of consequences.  Not saying nuclear isn't safe when managed properly, just saying it is probably the biggest danger we could have in our backyards with lax security to protect against turr err ists. permalink award report block reply\nfriedchicken 0 points 4 days ago This is absurd permalink award report block reply\nmohel 0 points 4 days ago Now Google can not only cancel your account but shut off your electricity as well permalink award report block reply\nBigby -1 points 4 days ago Am I the only person to notice the very obvious \"Q\"??? permalink award report block reply guywholikesDjtof2024 4 points 4 days ago trust the plan :p permalink parent award report block reply DrVSGGEOTUSPhD 1 points 3 days ago PATRIOTS IN CONTROOOOOLLLLL!!!1!1!!!! permalink parent award report block reply Bigby -3 points 4 days ago Always have, always will. Fuck off, shill. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago Why so hostile? I dont know if it is legit or fake. I was merely making a funny jab. If you want to convince me to believe that Q is either false or legit, hostility will not help you. You must watch 10 Charlie Kirk videos now, and follow his example. permalink parent award report block reply\nguywholikesDjtof2024 4 points 4 days ago trust the plan :p permalink parent award report block reply DrVSGGEOTUSPhD 1 points 3 days ago PATRIOTS IN CONTROOOOOLLLLL!!!1!1!!!! permalink parent award report block reply Bigby -3 points 4 days ago Always have, always will. Fuck off, shill. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago Why so hostile? I dont know if it is legit or fake. I was merely making a funny jab. If you want to convince me to believe that Q is either false or legit, hostility will not help you. You must watch 10 Charlie Kirk videos now, and follow his example. permalink parent award report block reply\nDrVSGGEOTUSPhD 1 points 3 days ago PATRIOTS IN CONTROOOOOLLLLL!!!1!1!!!! permalink parent award report block reply\nBigby -3 points 4 days ago Always have, always will. Fuck off, shill. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago Why so hostile? I dont know if it is legit or fake. I was merely making a funny jab. If you want to convince me to believe that Q is either false or legit, hostility will not help you. You must watch 10 Charlie Kirk videos now, and follow his example. permalink parent award report block reply\nguywholikesDjtof2024 2 points 4 days ago Why so hostile? I dont know if it is legit or fake. I was merely making a funny jab. If you want to convince me to believe that Q is either false or legit, hostility will not help you. You must watch 10 Charlie Kirk videos now, and follow his example. permalink parent award report block reply\nspinometer2 -1 points 4 days ago they need to speed this up by about 2 years permalink award report block reply guywholikesDjtof2024 3 points 4 days ago Why? So technoslavery can come 2 years earlier? permalink parent award report block reply Klaus73 1 points 3 days ago Yep its already here...brought to you by Carl's Jr. https://www.msn.com/en-us/news/us/ice-agents-are-now-authorized-to-use-spyware-to-access-phones-and-sensitive-data-in-immigration-cases/ar-AA1MhGk1 Don't worry it will only be used on immigrants Pegasus has entered the chat permalink parent award report block reply Bilabrin 1 points 4 days ago Yeah cause it's not technoslaey now? permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago You really believe bad guys getting their wishes earlier is good? Make it make sense. permalink parent award report block reply spinometer2 1 points 4 days ago AI is inevitable, adapt permalink parent award report block reply Moebius OP 1 points 4 days ago Well...this is a rehab of a 50+ year old reactor. permalink parent award report block reply\nguywholikesDjtof2024 3 points 4 days ago Why? So technoslavery can come 2 years earlier? permalink parent award report block reply Klaus73 1 points 3 days ago Yep its already here...brought to you by Carl's Jr. https://www.msn.com/en-us/news/us/ice-agents-are-now-authorized-to-use-spyware-to-access-phones-and-sensitive-data-in-immigration-cases/ar-AA1MhGk1 Don't worry it will only be used on immigrants Pegasus has entered the chat permalink parent award report block reply Bilabrin 1 points 4 days ago Yeah cause it's not technoslaey now? permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago You really believe bad guys getting their wishes earlier is good? Make it make sense. permalink parent award report block reply spinometer2 1 points 4 days ago AI is inevitable, adapt permalink parent award report block reply\nKlaus73 1 points 3 days ago Yep its already here...brought to you by Carl's Jr. https://www.msn.com/en-us/news/us/ice-agents-are-now-authorized-to-use-spyware-to-access-phones-and-sensitive-data-in-immigration-cases/ar-AA1MhGk1 Don't worry it will only be used on immigrants Pegasus has entered the chat permalink parent award report block reply\nBilabrin 1 points 4 days ago Yeah cause it's not technoslaey now? permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago You really believe bad guys getting their wishes earlier is good? Make it make sense. permalink parent award report block reply\nguywholikesDjtof2024 2 points 4 days ago You really believe bad guys getting their wishes earlier is good? Make it make sense. permalink parent award report block reply\nspinometer2 1 points 4 days ago AI is inevitable, adapt permalink parent award report block reply\nMoebius OP 1 points 4 days ago Well...this is a rehab of a 50+ year old reactor. permalink parent award report block reply\npossibletower -4 points 4 days ago Good. You pro-nuclear fags keep wanting nuclear power, right? This is how it actually gets done. The way you want it to happen is not going to happen and a total waste of time to LARP like it will happen the exact way you want it to happen. They are building mini-nuclear reactors also, not the hugeass ancient tech nuke reactors. permalink award report block reply DefenderDad 1 points 3 days ago So you’re against nuclear power?! permalink parent award report block reply\nDefenderDad 1 points 3 days ago So you’re against nuclear power?! permalink parent award report block reply\nTheDarkEmperor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nrapskull 1 points 4 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T22:59:03.023632Z"
}