{
  "id": "1ARK5BG2fm",
  "url": "https://patriots.win/p/1ARK5BG2fm/before-she-became-cia-director-g/c",
  "content": "1455 Before she became CIA Director, Gina Haspel used to be the Head of CIA's London Station. So she is the most likely candidate to give orders to British intelligence who used the BBC to dirty up President Trump. posted 3 days ago by Capoditutticapi1 123 comments award share report block Svetlana Lokhova @RealSLokhova • 3d Before she became CIA Director, Haspel used to be the Head of CIA's London Station. So she is the most likely candidate to give orders to British intelligence who used the BBC to dirty up President Trump. Svetlana Lokhova @RealSLokhova • 3d These are just patsies. Find out who the master is, who gave the orders for them to do this. BBC works for British intelligence, who work for US intelligence. My money is on Gina Haspel.\n123 comments Sort by Top Top New Worst Old Save Monsieur_Novembre 46 points 3 days ago Welcome to news of 4 years ago permalink award report block reply Capoditutticapi1 OP 17 points 3 days ago You mean like the stolen 2020 election...right... permalink parent award report block reply deleted 11 points 3 days ago Capoditutticapi1 OP 4 points 3 days ago Username checks out! lol permalink parent award report block reply SurfandTurf 25 points 3 days ago Remember when retards claimed she died in a shootout in a data center in Italy? permalink award report block reply YearninNation 8 points 3 days ago she hasn't been seen since 2019..therefore she knew she'd be in hiding when those stories were concocted by the CIA. permalink parent award report block reply barefootozark 7 points 3 days ago Holy shit.  They just disappear to some CIA retirement retreat. permalink parent award report block reply Capoditutticapi1 OP 5 points 3 days ago She is currently a senior advisor at the law firm King & Spalding in Washington, D.C. permalink parent award report block reply Hawksendoom 1 points 3 days ago i am not a number, i am a free man! permalink parent award report block reply KernalMustard 1 points 3 days ago Shes not excatly well known. She could live in a cabin in ND and noone who know who she was. permalink parent award report block reply ragnarokrobo 6 points 3 days ago Uh excuse me, it was Germany. permalink parent award report block reply starjello 7 points 3 days ago It was in Frankfurt to be exact and she was protecting the servers from the US military. Tragically killed trying to defend the stolen vote. permalink parent award report block reply chickeninoven 5 points 3 days ago You guys are all forgetting how epic a battle it was. CIA blackops assassins vs Delta Force commandos. It was basically a bunch of John Wicks and Rambos going at it in a secret server farm hundreds of miles beneath the surface permalink parent award report block reply starjello 1 points 2 days ago I know. I read it on the Gay Awakening. permalink parent award report block reply SurfandTurf 1 points 3 days ago Oh yeah, my bad. permalink parent award report block reply ragnarokrobo 3 points 3 days ago Gotta come correct with the qtardation. permalink parent award report block reply starjello 1 points 3 days ago Oh who could forget that. The Q  faggots at gay awankening stickied that thread. They said she was part of the Q team doing her job over in Frankfurt. Down vote away Q fucked faggots permalink parent award report block reply MrMcGreenGenes 23 points 3 days ago Scarf lady like that scamdemic bitch Birx. permalink award report block reply snoopy3210 6 points 3 days ago Scarf Haspel destroyed evidence in the 2005 CIA tapes investigation (led by the same CIA fixer aka fake prosecutor John Durham, so he didn't charge her) permalink parent award report block reply SuperHonkey 4 points 3 days ago Fucking barren catlady permalink parent award report block reply Double_D 12 points 3 days ago She was likely a key actor in the Halper, Mifsud, Downer, Papadopolous op, as well as the op to paint Flynn as a Russian asset. permalink award report block reply yukondave 9 points 3 days ago DOnt forget Lisa Monaco permalink parent award report block reply Double_D 2 points 3 days ago Definitely. I just singled out Haspel because that’s who the post is about. permalink parent award report block reply yukondave 2 points 3 days ago Lisa Monaco, aka the fixer for Obama, was the person who told Haspel what to do. permalink parent award report block reply Double_D 1 points 2 days ago Yeah, I know who she is. As I already mentioned, I focused on Haspel because that’s who the post is about permalink parent award report block reply GoldwaterVoter 4 points 3 days ago Including the $10,000 cash trap in the Israeli hotel room. George P shrewdly sent it to his lawyer in Greece, so when the FBI (sic), not the TSA, searched his luggage upon his arrival at JFK, the FBI expected to find $10,000 in cash. permalink parent award report block reply perma-maga 2 points 2 days ago Thanks for reminding me, I forgot about that. permalink parent award report block reply FusionBlack 12 points 3 days ago Absolutely. The UK is not a true allie. It never will be at the rate it's going. permalink award report block reply justinkayz 1 points 3 days ago They've been trying to fuck us since 1812 permalink parent award report block reply journalist 10 points 3 days ago Defund the Agency. permalink award report block reply Hawksendoom 3 points 3 days ago you can't too much cocaine money permalink parent award report block reply KernalMustard 8 points 3 days ago And he fucking put her there. His own worst enemy. permalink award report block reply Capoditutticapi1 OP 6 points 3 days ago True... DS advisors... permalink parent award report block reply TheAftermath 5 points 3 days ago This is the key. permalink parent award report block reply Bullwinkle 7 points 3 days ago She’s from Kentucky and close to McConnell. She’s in on it. permalink award report block reply Yawnz13 6 points 3 days ago Or they just made shit up.  Acting like intel agencies are involved just over-complicates a very simple situation. permalink award report block reply corporateshizer 5 points 3 days ago Intel agencies are involved in all these operations. They are both the media and the sources. permalink parent award report block reply Yawnz13 0 points 3 days ago Nah, there's no reason at all for them to get involved.  Far more likely for media to just make shit up on their own at this point. permalink parent award report block reply _Sully_ 1 points 3 days ago That only makes sense if you don't know that's exactly what they do all over the world. You're being naive. permalink parent award report block reply TexasDusty 1 points 3 days ago I mean I don’t necessarily disagree that it happens, but there’s no need to over complicate something into some kind of Qtard nonsense. permalink parent award report block reply view 1 more comments... Yawnz13 1 points 3 days ago No, you're being stupid.  Anyone who tries to overcomplicate these things are far more naive about reality.  They're easily manipulated into being paranoid and thus unwilling to do anything. permalink parent award report block reply view 12 more comments... brainphreeze 2 points 3 days ago Yeah this is a reach, the BBC is full of leftist propagandists that have been on the \"Trump bad\"  train since day one permalink parent award report block reply Whoopies_tds 5 points 3 days ago BBC is CNN for inbreds with bad teeth permalink parent award report block reply BreakingCNN 1 points 3 days ago That's not what the Urban Dictionary says, and I am Breaking CNN permalink parent award report block reply TexasDusty 1 points 3 days ago No no no, you’re supposed to turn legitimate problems we should all have with the way things are run into some kind of multi layered impossible conspiracy theory so that everyone who would be open minded about learning the truth will immediately dismiss everything we say because it comes off as Q bullshit. permalink parent award report block reply Yawnz13 1 points 3 days ago Don't forget to menstruate everywhere when someone points that out. permalink parent award report block reply Txiribiton 1 points 2 days ago The ones who controls those agencies and governments are involved, they also contril the media, banks, etc. Obviously they give them the taxpayer's money, we know USAID financed the BBC and a pair of days ago we know money was spent on some news media to attack Orban's government in Hungary. permalink parent award report block reply Yawnz13 1 points 2 days ago The ones who controls those agencies and governments are involved, they also contril the media, banks, etc. Nah, media companies make up shit on their own all the time.  No reason to think this is any deeper than that. permalink parent award report block reply Stinky1000 6 points 3 days ago And then Trump made her Director.\nTry to make that make sense. permalink award report block reply Capoditutticapi1 OP -1 points 3 days ago Dirty DS Advisors... Spies in his Administration... permalink parent award report block reply GodIsPerfect 5 points 3 days ago Seditious👏. Conspiracy👏. permalink award report block reply Apersonofinterest 3 points 3 days ago Remember when Q said she led a raid of commandos on a data center in Germany to recover servers there that had the actual results of the 2020 election and she was shot in a shootout with German security or some shit? Good times. permalink award report block reply Capoditutticapi1 OP 7 points 3 days ago Q/CIA..., had a ball flooding the zone with stupid disinformation shit, even about themselves... Classic! permalink parent award report block reply YearninNation 1 points 3 days ago she hasn't been seen since 2019..therefore she knew she'd be in hiding when those stories were concocted by the CIA. permalink parent award report block reply starjello 1 points 3 days ago Sorry q retard. She is working in New York city and is alive and well and living the life of luxury. Give up your membership at the gay wanking permalink parent award report block reply justinkayz 1 points 3 days ago I can't believe qtards are still a thing permalink parent award report block reply view 1 more comments... YearninNation 0 points 2 days ago maybe, maybe not permalink parent award report block reply view 1 more comments... YearninNation 0 points 3 days ago she hasn't been seen since 2019..therefore she knew she'd be in hiding when those stories were concocted by the CIA. permalink parent award report block reply Apersonofinterest 3 points 3 days ago She met with Senate Republicans and Mitch McConnell in November of 2020 where the GOP urged Trump to keep her as head of the CIA. This was after she was supposedly shot but in all video and photos, she was not injured. permalink parent award report block reply YearninNation 0 points 3 days ago source? permalink parent award report block reply Apersonofinterest 1 points 3 days ago Search your preferred search engine for Gina Haspel meets with Senate Republicans Nov-11-2020. permalink parent award report block reply view 1 more comments... corporateshizer -2 points 3 days ago She might be dead, but not because of that nonsense. It's very odd for a person of such a high position to not go on speaking tours, interviews, and the rest after leaving. To have never been seen again? Unprecedented. permalink parent award report block reply Capoditutticapi1 OP 2 points 3 days ago She is currently a senior advisor at the law firm King & Spalding in Washington, D.C. permalink parent award report block reply corporateshizer 0 points 3 days ago Is she in their directory? Does she show up in their photos? Does she have any online posts or other examples of her work there? Any proof at all, outside of text-only press releases, indicating she's alive? https://www.kslaw.com/people?capability_id=&locale=en&office_id=&page=2&per_page=12&q=&school_id=&starts_with=H&title_id= permalink parent award report block reply Capoditutticapi1 OP 2 points 3 days ago Great questions... You should do some super sleuthing and find out... permalink parent award report block reply view 3 more comments... learntocode 2 points 3 days ago The plot was hatched at MI6 and run in conjunction with our Atlantacist spooks in the deep state. Britain is our enemy. Their financial empire is laying waste to our cities. permalink award report block reply TearsAficionado 2 points 3 days ago She oozes communism. permalink award report block reply schiff_for_brains 2 points 3 days ago Russiagate also has elements that took place in Britain.  Hmm... permalink award report block reply MrJinxy 2 points 3 days ago Is she related to PencilNeck?  They look related. permalink award report block reply Duster_340 2 points 2 days ago So what? How many people have been put into jail since trump took office? Exactly permalink award report block reply Pappy_Gunn 2 points 3 days ago Nah just quid pro quo.  Obama went over to England back in the day and gave an anti-Brexit speech.  Steele was also an ex-spook. permalink award report block reply Ferretman 2 points 3 days ago Burn her. permalink award report block reply AfterGlow 2 points 3 days ago You're getting warmer.......slowly. permalink award report block reply CanadianTrump2 2 points 3 days ago Well you guys did spy on british as well, and haven’t let Snowden live in America ever sense permalink award report block reply Wrexxis780 2 points 3 days ago Is it still treason if you betray your country with “allies” of your country? permalink award report block reply Capoditutticapi1 OP 0 points 3 days ago It's complicated and on a case by case basis.  It's not treason if the betrayal involves allies, because treason laws explicitly hinge on \"enemies\" in most democratic systems. It could still be a serious crime, just not the capital-one labeled \"treason.\" permalink parent award report block reply Hawksendoom 1 points 3 days ago satan is all good man - we are allies right? so all good? permalink parent award report block reply FusionBlack 2 points 3 days ago This just shows it's time to break ties with the UK. permalink award report block reply MPitcher1776 2 points 3 days ago She was very involved in the 2020 coup. She is a treasonous bitch and should be brought to justice. permalink award report block reply YearninNation 2 points 3 days ago The news now is whether she's dead or hiding because she hasn't been seen since 2019. And who used the fuel-air bomb on the AT&T building. permalink award report block reply starjello 0 points 3 days ago She's working for a law firm in New York. Alive and well and living very comfortably. You need to get away from this place sometime clear your brain fog permalink parent award report block reply YearninNation 0 points 2 days ago maybe, maybe not permalink parent award report block reply starjello 1 points 2 days ago No maybe it's about it idiot she is. permalink parent award report block reply happybirthdaydude 2 points 3 days ago Well, Donald J Trump-tard hired her, so.... permalink award report block reply Capoditutticapi1 OP 0 points 3 days ago Pompeo installed Gina Haspel... It was a joint IC-anti Trump Republican operation. permalink parent award report block reply UltraMagaWA 2 points 2 days ago Spy inside dur permalink award report block reply PiratePatriotAu 2 points 3 days ago \"Find out who the master is, who gave the orders for them to do this.\" nope. convict and remove each and every patsy. During sentencing negotiations, they will cave and sell out their master. permalink award report block reply TakingCoatsWIN 2 points 3 days ago Britain is the true foreign nation controlling us, but no one makes a fuzz. permalink award report block reply corporateshizer 1 points 3 days ago Not Britain, but the City of London. Those who know, know. https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FV2WFWQ63NJVXNHDTRGEYWBMUY.jpg permalink parent award report block reply Hawksendoom 1 points 3 days ago canadia drops maple syrup permalink parent award report block reply Obambi 1 points 3 days ago At one point Biden’s social media account were being handled out of the UK UK is not our friend. They constantly work with Israel to create unrest. permalink award report block reply NewGoldenAge 1 points 3 days ago Soft target. Go nuts. permalink award report block reply perma-maga 1 points 3 days ago Chris Donnelly and Daniel_Lafayeedney https://patriots.win/p/1ARJczsD5c/uk-antitrump-operation/c permalink award report block reply Capoditutticapi1 OP 1 points 3 days ago Well done! permalink parent award report block reply perma-maga 1 points 3 days ago thanks! permalink parent award report block reply TidewaterYank 1 points 3 days ago Skankataceously crooked permalink award report block reply grenades_and_ham 1 points 3 days ago Try and keep up please. Her and Brennan are the genesis of “Russian Collusion.” permalink award report block reply Oodles 1 points 3 days ago Defund the CIA. Until this happens, there will never be lasting change permalink award report block reply Spellmonger 1 points 3 days ago When are they going to be made to face us, the dirty, sneaky traitors? Anybody, anywhere near her, please print this out and put it on her desk, or tape it to her door.  They don't get to second-guess us, they all belong in jail awaiting their turn before the firing squad. . permalink award report block reply TexasDusty 1 points 3 days ago No no no, the Qtards told me five years ago that she was killed in a shoot out in Germany over servers. Then when she was spotted somewhere else we were told by those lunatics who have done nothing but hurt Trump, that it was a clone. Not a look alike, a literal clone. Because you can clone an adult and within days it can speak and walk and has age lines on its face. I hate those fucking retards. They did so much damage to our country it’s almost as if, oh I don’t know, they are retarded or something. permalink award report block reply starjello 0 points 3 days ago And the losers down vote you out of their pain. They are no better than the libtards who are living a life of delusion but destroying the country permalink parent award report block reply irongeek 0 points 3 days ago I thought she was killed. permalink award report block reply Capoditutticapi1 OP 2 points 3 days ago She was not... She is currently a senior advisor at the law firm King & Spalding in Washington, D.C. permalink parent award report block reply corporateshizer -2 points 3 days ago ^ This guy works from Langley, Virginia. permalink parent award report block reply Capoditutticapi1 OP 2 points 3 days ago Go home to mommy Fed \"handshaker\"! permalink parent award report block reply\nMonsieur_Novembre 46 points 3 days ago Welcome to news of 4 years ago permalink award report block reply Capoditutticapi1 OP 17 points 3 days ago You mean like the stolen 2020 election...right... permalink parent award report block reply deleted 11 points 3 days ago Capoditutticapi1 OP 4 points 3 days ago Username checks out! lol permalink parent award report block reply\nCapoditutticapi1 OP 17 points 3 days ago You mean like the stolen 2020 election...right... permalink parent award report block reply\ndeleted 11 points 3 days ago Capoditutticapi1 OP 4 points 3 days ago Username checks out! lol permalink parent award report block reply\nCapoditutticapi1 OP 4 points 3 days ago Username checks out! lol permalink parent award report block reply\nSurfandTurf 25 points 3 days ago Remember when retards claimed she died in a shootout in a data center in Italy? permalink award report block reply YearninNation 8 points 3 days ago she hasn't been seen since 2019..therefore she knew she'd be in hiding when those stories were concocted by the CIA. permalink parent award report block reply barefootozark 7 points 3 days ago Holy shit.  They just disappear to some CIA retirement retreat. permalink parent award report block reply Capoditutticapi1 OP 5 points 3 days ago She is currently a senior advisor at the law firm King & Spalding in Washington, D.C. permalink parent award report block reply Hawksendoom 1 points 3 days ago i am not a number, i am a free man! permalink parent award report block reply KernalMustard 1 points 3 days ago Shes not excatly well known. She could live in a cabin in ND and noone who know who she was. permalink parent award report block reply ragnarokrobo 6 points 3 days ago Uh excuse me, it was Germany. permalink parent award report block reply starjello 7 points 3 days ago It was in Frankfurt to be exact and she was protecting the servers from the US military. Tragically killed trying to defend the stolen vote. permalink parent award report block reply chickeninoven 5 points 3 days ago You guys are all forgetting how epic a battle it was. CIA blackops assassins vs Delta Force commandos. It was basically a bunch of John Wicks and Rambos going at it in a secret server farm hundreds of miles beneath the surface permalink parent award report block reply starjello 1 points 2 days ago I know. I read it on the Gay Awakening. permalink parent award report block reply SurfandTurf 1 points 3 days ago Oh yeah, my bad. permalink parent award report block reply ragnarokrobo 3 points 3 days ago Gotta come correct with the qtardation. permalink parent award report block reply starjello 1 points 3 days ago Oh who could forget that. The Q  faggots at gay awankening stickied that thread. They said she was part of the Q team doing her job over in Frankfurt. Down vote away Q fucked faggots permalink parent award report block reply\nYearninNation 8 points 3 days ago she hasn't been seen since 2019..therefore she knew she'd be in hiding when those stories were concocted by the CIA. permalink parent award report block reply barefootozark 7 points 3 days ago Holy shit.  They just disappear to some CIA retirement retreat. permalink parent award report block reply Capoditutticapi1 OP 5 points 3 days ago She is currently a senior advisor at the law firm King & Spalding in Washington, D.C. permalink parent award report block reply Hawksendoom 1 points 3 days ago i am not a number, i am a free man! permalink parent award report block reply KernalMustard 1 points 3 days ago Shes not excatly well known. She could live in a cabin in ND and noone who know who she was. permalink parent award report block reply\nbarefootozark 7 points 3 days ago Holy shit.  They just disappear to some CIA retirement retreat. permalink parent award report block reply Capoditutticapi1 OP 5 points 3 days ago She is currently a senior advisor at the law firm King & Spalding in Washington, D.C. permalink parent award report block reply Hawksendoom 1 points 3 days ago i am not a number, i am a free man! permalink parent award report block reply KernalMustard 1 points 3 days ago Shes not excatly well known. She could live in a cabin in ND and noone who know who she was. permalink parent award report block reply\nCapoditutticapi1 OP 5 points 3 days ago She is currently a senior advisor at the law firm King & Spalding in Washington, D.C. permalink parent award report block reply\nHawksendoom 1 points 3 days ago i am not a number, i am a free man! permalink parent award report block reply\nKernalMustard 1 points 3 days ago Shes not excatly well known. She could live in a cabin in ND and noone who know who she was. permalink parent award report block reply\nragnarokrobo 6 points 3 days ago Uh excuse me, it was Germany. permalink parent award report block reply starjello 7 points 3 days ago It was in Frankfurt to be exact and she was protecting the servers from the US military. Tragically killed trying to defend the stolen vote. permalink parent award report block reply chickeninoven 5 points 3 days ago You guys are all forgetting how epic a battle it was. CIA blackops assassins vs Delta Force commandos. It was basically a bunch of John Wicks and Rambos going at it in a secret server farm hundreds of miles beneath the surface permalink parent award report block reply starjello 1 points 2 days ago I know. I read it on the Gay Awakening. permalink parent award report block reply SurfandTurf 1 points 3 days ago Oh yeah, my bad. permalink parent award report block reply ragnarokrobo 3 points 3 days ago Gotta come correct with the qtardation. permalink parent award report block reply\nstarjello 7 points 3 days ago It was in Frankfurt to be exact and she was protecting the servers from the US military. Tragically killed trying to defend the stolen vote. permalink parent award report block reply chickeninoven 5 points 3 days ago You guys are all forgetting how epic a battle it was. CIA blackops assassins vs Delta Force commandos. It was basically a bunch of John Wicks and Rambos going at it in a secret server farm hundreds of miles beneath the surface permalink parent award report block reply starjello 1 points 2 days ago I know. I read it on the Gay Awakening. permalink parent award report block reply\nchickeninoven 5 points 3 days ago You guys are all forgetting how epic a battle it was. CIA blackops assassins vs Delta Force commandos. It was basically a bunch of John Wicks and Rambos going at it in a secret server farm hundreds of miles beneath the surface permalink parent award report block reply starjello 1 points 2 days ago I know. I read it on the Gay Awakening. permalink parent award report block reply\nstarjello 1 points 2 days ago I know. I read it on the Gay Awakening. permalink parent award report block reply\nSurfandTurf 1 points 3 days ago Oh yeah, my bad. permalink parent award report block reply ragnarokrobo 3 points 3 days ago Gotta come correct with the qtardation. permalink parent award report block reply\nragnarokrobo 3 points 3 days ago Gotta come correct with the qtardation. permalink parent award report block reply\nstarjello 1 points 3 days ago Oh who could forget that. The Q  faggots at gay awankening stickied that thread. They said she was part of the Q team doing her job over in Frankfurt. Down vote away Q fucked faggots permalink parent award report block reply\nMrMcGreenGenes 23 points 3 days ago Scarf lady like that scamdemic bitch Birx. permalink award report block reply snoopy3210 6 points 3 days ago Scarf Haspel destroyed evidence in the 2005 CIA tapes investigation (led by the same CIA fixer aka fake prosecutor John Durham, so he didn't charge her) permalink parent award report block reply SuperHonkey 4 points 3 days ago Fucking barren catlady permalink parent award report block reply\nsnoopy3210 6 points 3 days ago Scarf Haspel destroyed evidence in the 2005 CIA tapes investigation (led by the same CIA fixer aka fake prosecutor John Durham, so he didn't charge her) permalink parent award report block reply\nSuperHonkey 4 points 3 days ago Fucking barren catlady permalink parent award report block reply\nDouble_D 12 points 3 days ago She was likely a key actor in the Halper, Mifsud, Downer, Papadopolous op, as well as the op to paint Flynn as a Russian asset. permalink award report block reply yukondave 9 points 3 days ago DOnt forget Lisa Monaco permalink parent award report block reply Double_D 2 points 3 days ago Definitely. I just singled out Haspel because that’s who the post is about. permalink parent award report block reply yukondave 2 points 3 days ago Lisa Monaco, aka the fixer for Obama, was the person who told Haspel what to do. permalink parent award report block reply Double_D 1 points 2 days ago Yeah, I know who she is. As I already mentioned, I focused on Haspel because that’s who the post is about permalink parent award report block reply GoldwaterVoter 4 points 3 days ago Including the $10,000 cash trap in the Israeli hotel room. George P shrewdly sent it to his lawyer in Greece, so when the FBI (sic), not the TSA, searched his luggage upon his arrival at JFK, the FBI expected to find $10,000 in cash. permalink parent award report block reply perma-maga 2 points 2 days ago Thanks for reminding me, I forgot about that. permalink parent award report block reply\nyukondave 9 points 3 days ago DOnt forget Lisa Monaco permalink parent award report block reply Double_D 2 points 3 days ago Definitely. I just singled out Haspel because that’s who the post is about. permalink parent award report block reply yukondave 2 points 3 days ago Lisa Monaco, aka the fixer for Obama, was the person who told Haspel what to do. permalink parent award report block reply Double_D 1 points 2 days ago Yeah, I know who she is. As I already mentioned, I focused on Haspel because that’s who the post is about permalink parent award report block reply\nDouble_D 2 points 3 days ago Definitely. I just singled out Haspel because that’s who the post is about. permalink parent award report block reply yukondave 2 points 3 days ago Lisa Monaco, aka the fixer for Obama, was the person who told Haspel what to do. permalink parent award report block reply Double_D 1 points 2 days ago Yeah, I know who she is. As I already mentioned, I focused on Haspel because that’s who the post is about permalink parent award report block reply\nyukondave 2 points 3 days ago Lisa Monaco, aka the fixer for Obama, was the person who told Haspel what to do. permalink parent award report block reply Double_D 1 points 2 days ago Yeah, I know who she is. As I already mentioned, I focused on Haspel because that’s who the post is about permalink parent award report block reply\nDouble_D 1 points 2 days ago Yeah, I know who she is. As I already mentioned, I focused on Haspel because that’s who the post is about permalink parent award report block reply\nGoldwaterVoter 4 points 3 days ago Including the $10,000 cash trap in the Israeli hotel room. George P shrewdly sent it to his lawyer in Greece, so when the FBI (sic), not the TSA, searched his luggage upon his arrival at JFK, the FBI expected to find $10,000 in cash. permalink parent award report block reply perma-maga 2 points 2 days ago Thanks for reminding me, I forgot about that. permalink parent award report block reply\nperma-maga 2 points 2 days ago Thanks for reminding me, I forgot about that. permalink parent award report block reply\nFusionBlack 12 points 3 days ago Absolutely. The UK is not a true allie. It never will be at the rate it's going. permalink award report block reply justinkayz 1 points 3 days ago They've been trying to fuck us since 1812 permalink parent award report block reply\njustinkayz 1 points 3 days ago They've been trying to fuck us since 1812 permalink parent award report block reply\njournalist 10 points 3 days ago Defund the Agency. permalink award report block reply Hawksendoom 3 points 3 days ago you can't too much cocaine money permalink parent award report block reply\nHawksendoom 3 points 3 days ago you can't too much cocaine money permalink parent award report block reply\nKernalMustard 8 points 3 days ago And he fucking put her there. His own worst enemy. permalink award report block reply Capoditutticapi1 OP 6 points 3 days ago True... DS advisors... permalink parent award report block reply TheAftermath 5 points 3 days ago This is the key. permalink parent award report block reply\nCapoditutticapi1 OP 6 points 3 days ago True... DS advisors... permalink parent award report block reply TheAftermath 5 points 3 days ago This is the key. permalink parent award report block reply\nTheAftermath 5 points 3 days ago This is the key. permalink parent award report block reply\nBullwinkle 7 points 3 days ago She’s from Kentucky and close to McConnell. She’s in on it. permalink award report block reply\nYawnz13 6 points 3 days ago Or they just made shit up.  Acting like intel agencies are involved just over-complicates a very simple situation. permalink award report block reply corporateshizer 5 points 3 days ago Intel agencies are involved in all these operations. They are both the media and the sources. permalink parent award report block reply Yawnz13 0 points 3 days ago Nah, there's no reason at all for them to get involved.  Far more likely for media to just make shit up on their own at this point. permalink parent award report block reply _Sully_ 1 points 3 days ago That only makes sense if you don't know that's exactly what they do all over the world. You're being naive. permalink parent award report block reply TexasDusty 1 points 3 days ago I mean I don’t necessarily disagree that it happens, but there’s no need to over complicate something into some kind of Qtard nonsense. permalink parent award report block reply view 1 more comments... Yawnz13 1 points 3 days ago No, you're being stupid.  Anyone who tries to overcomplicate these things are far more naive about reality.  They're easily manipulated into being paranoid and thus unwilling to do anything. permalink parent award report block reply view 12 more comments... brainphreeze 2 points 3 days ago Yeah this is a reach, the BBC is full of leftist propagandists that have been on the \"Trump bad\"  train since day one permalink parent award report block reply Whoopies_tds 5 points 3 days ago BBC is CNN for inbreds with bad teeth permalink parent award report block reply BreakingCNN 1 points 3 days ago That's not what the Urban Dictionary says, and I am Breaking CNN permalink parent award report block reply TexasDusty 1 points 3 days ago No no no, you’re supposed to turn legitimate problems we should all have with the way things are run into some kind of multi layered impossible conspiracy theory so that everyone who would be open minded about learning the truth will immediately dismiss everything we say because it comes off as Q bullshit. permalink parent award report block reply Yawnz13 1 points 3 days ago Don't forget to menstruate everywhere when someone points that out. permalink parent award report block reply Txiribiton 1 points 2 days ago The ones who controls those agencies and governments are involved, they also contril the media, banks, etc. Obviously they give them the taxpayer's money, we know USAID financed the BBC and a pair of days ago we know money was spent on some news media to attack Orban's government in Hungary. permalink parent award report block reply Yawnz13 1 points 2 days ago The ones who controls those agencies and governments are involved, they also contril the media, banks, etc. Nah, media companies make up shit on their own all the time.  No reason to think this is any deeper than that. permalink parent award report block reply\ncorporateshizer 5 points 3 days ago Intel agencies are involved in all these operations. They are both the media and the sources. permalink parent award report block reply Yawnz13 0 points 3 days ago Nah, there's no reason at all for them to get involved.  Far more likely for media to just make shit up on their own at this point. permalink parent award report block reply _Sully_ 1 points 3 days ago That only makes sense if you don't know that's exactly what they do all over the world. You're being naive. permalink parent award report block reply TexasDusty 1 points 3 days ago I mean I don’t necessarily disagree that it happens, but there’s no need to over complicate something into some kind of Qtard nonsense. permalink parent award report block reply view 1 more comments... Yawnz13 1 points 3 days ago No, you're being stupid.  Anyone who tries to overcomplicate these things are far more naive about reality.  They're easily manipulated into being paranoid and thus unwilling to do anything. permalink parent award report block reply view 12 more comments...\nYawnz13 0 points 3 days ago Nah, there's no reason at all for them to get involved.  Far more likely for media to just make shit up on their own at this point. permalink parent award report block reply _Sully_ 1 points 3 days ago That only makes sense if you don't know that's exactly what they do all over the world. You're being naive. permalink parent award report block reply TexasDusty 1 points 3 days ago I mean I don’t necessarily disagree that it happens, but there’s no need to over complicate something into some kind of Qtard nonsense. permalink parent award report block reply view 1 more comments... Yawnz13 1 points 3 days ago No, you're being stupid.  Anyone who tries to overcomplicate these things are far more naive about reality.  They're easily manipulated into being paranoid and thus unwilling to do anything. permalink parent award report block reply view 12 more comments...\n_Sully_ 1 points 3 days ago That only makes sense if you don't know that's exactly what they do all over the world. You're being naive. permalink parent award report block reply TexasDusty 1 points 3 days ago I mean I don’t necessarily disagree that it happens, but there’s no need to over complicate something into some kind of Qtard nonsense. permalink parent award report block reply view 1 more comments... Yawnz13 1 points 3 days ago No, you're being stupid.  Anyone who tries to overcomplicate these things are far more naive about reality.  They're easily manipulated into being paranoid and thus unwilling to do anything. permalink parent award report block reply view 12 more comments...\nTexasDusty 1 points 3 days ago I mean I don’t necessarily disagree that it happens, but there’s no need to over complicate something into some kind of Qtard nonsense. permalink parent award report block reply view 1 more comments...\nYawnz13 1 points 3 days ago No, you're being stupid.  Anyone who tries to overcomplicate these things are far more naive about reality.  They're easily manipulated into being paranoid and thus unwilling to do anything. permalink parent award report block reply view 12 more comments...\nbrainphreeze 2 points 3 days ago Yeah this is a reach, the BBC is full of leftist propagandists that have been on the \"Trump bad\"  train since day one permalink parent award report block reply Whoopies_tds 5 points 3 days ago BBC is CNN for inbreds with bad teeth permalink parent award report block reply BreakingCNN 1 points 3 days ago That's not what the Urban Dictionary says, and I am Breaking CNN permalink parent award report block reply\nWhoopies_tds 5 points 3 days ago BBC is CNN for inbreds with bad teeth permalink parent award report block reply BreakingCNN 1 points 3 days ago That's not what the Urban Dictionary says, and I am Breaking CNN permalink parent award report block reply\nBreakingCNN 1 points 3 days ago That's not what the Urban Dictionary says, and I am Breaking CNN permalink parent award report block reply\nTexasDusty 1 points 3 days ago No no no, you’re supposed to turn legitimate problems we should all have with the way things are run into some kind of multi layered impossible conspiracy theory so that everyone who would be open minded about learning the truth will immediately dismiss everything we say because it comes off as Q bullshit. permalink parent award report block reply Yawnz13 1 points 3 days ago Don't forget to menstruate everywhere when someone points that out. permalink parent award report block reply\nYawnz13 1 points 3 days ago Don't forget to menstruate everywhere when someone points that out. permalink parent award report block reply\nTxiribiton 1 points 2 days ago The ones who controls those agencies and governments are involved, they also contril the media, banks, etc. Obviously they give them the taxpayer's money, we know USAID financed the BBC and a pair of days ago we know money was spent on some news media to attack Orban's government in Hungary. permalink parent award report block reply Yawnz13 1 points 2 days ago The ones who controls those agencies and governments are involved, they also contril the media, banks, etc. Nah, media companies make up shit on their own all the time.  No reason to think this is any deeper than that. permalink parent award report block reply\nYawnz13 1 points 2 days ago The ones who controls those agencies and governments are involved, they also contril the media, banks, etc. Nah, media companies make up shit on their own all the time.  No reason to think this is any deeper than that. permalink parent award report block reply\nStinky1000 6 points 3 days ago And then Trump made her Director.\nTry to make that make sense. permalink award report block reply Capoditutticapi1 OP -1 points 3 days ago Dirty DS Advisors... Spies in his Administration... permalink parent award report block reply\nCapoditutticapi1 OP -1 points 3 days ago Dirty DS Advisors... Spies in his Administration... permalink parent award report block reply\nGodIsPerfect 5 points 3 days ago Seditious👏. Conspiracy👏. permalink award report block reply\nApersonofinterest 3 points 3 days ago Remember when Q said she led a raid of commandos on a data center in Germany to recover servers there that had the actual results of the 2020 election and she was shot in a shootout with German security or some shit? Good times. permalink award report block reply Capoditutticapi1 OP 7 points 3 days ago Q/CIA..., had a ball flooding the zone with stupid disinformation shit, even about themselves... Classic! permalink parent award report block reply YearninNation 1 points 3 days ago she hasn't been seen since 2019..therefore she knew she'd be in hiding when those stories were concocted by the CIA. permalink parent award report block reply starjello 1 points 3 days ago Sorry q retard. She is working in New York city and is alive and well and living the life of luxury. Give up your membership at the gay wanking permalink parent award report block reply justinkayz 1 points 3 days ago I can't believe qtards are still a thing permalink parent award report block reply view 1 more comments... YearninNation 0 points 2 days ago maybe, maybe not permalink parent award report block reply view 1 more comments... YearninNation 0 points 3 days ago she hasn't been seen since 2019..therefore she knew she'd be in hiding when those stories were concocted by the CIA. permalink parent award report block reply Apersonofinterest 3 points 3 days ago She met with Senate Republicans and Mitch McConnell in November of 2020 where the GOP urged Trump to keep her as head of the CIA. This was after she was supposedly shot but in all video and photos, she was not injured. permalink parent award report block reply YearninNation 0 points 3 days ago source? permalink parent award report block reply Apersonofinterest 1 points 3 days ago Search your preferred search engine for Gina Haspel meets with Senate Republicans Nov-11-2020. permalink parent award report block reply view 1 more comments... corporateshizer -2 points 3 days ago She might be dead, but not because of that nonsense. It's very odd for a person of such a high position to not go on speaking tours, interviews, and the rest after leaving. To have never been seen again? Unprecedented. permalink parent award report block reply Capoditutticapi1 OP 2 points 3 days ago She is currently a senior advisor at the law firm King & Spalding in Washington, D.C. permalink parent award report block reply corporateshizer 0 points 3 days ago Is she in their directory? Does she show up in their photos? Does she have any online posts or other examples of her work there? Any proof at all, outside of text-only press releases, indicating she's alive? https://www.kslaw.com/people?capability_id=&locale=en&office_id=&page=2&per_page=12&q=&school_id=&starts_with=H&title_id= permalink parent award report block reply Capoditutticapi1 OP 2 points 3 days ago Great questions... You should do some super sleuthing and find out... permalink parent award report block reply view 3 more comments...\nCapoditutticapi1 OP 7 points 3 days ago Q/CIA..., had a ball flooding the zone with stupid disinformation shit, even about themselves... Classic! permalink parent award report block reply YearninNation 1 points 3 days ago she hasn't been seen since 2019..therefore she knew she'd be in hiding when those stories were concocted by the CIA. permalink parent award report block reply starjello 1 points 3 days ago Sorry q retard. She is working in New York city and is alive and well and living the life of luxury. Give up your membership at the gay wanking permalink parent award report block reply justinkayz 1 points 3 days ago I can't believe qtards are still a thing permalink parent award report block reply view 1 more comments... YearninNation 0 points 2 days ago maybe, maybe not permalink parent award report block reply view 1 more comments...\nYearninNation 1 points 3 days ago she hasn't been seen since 2019..therefore she knew she'd be in hiding when those stories were concocted by the CIA. permalink parent award report block reply starjello 1 points 3 days ago Sorry q retard. She is working in New York city and is alive and well and living the life of luxury. Give up your membership at the gay wanking permalink parent award report block reply justinkayz 1 points 3 days ago I can't believe qtards are still a thing permalink parent award report block reply view 1 more comments... YearninNation 0 points 2 days ago maybe, maybe not permalink parent award report block reply view 1 more comments...\nstarjello 1 points 3 days ago Sorry q retard. She is working in New York city and is alive and well and living the life of luxury. Give up your membership at the gay wanking permalink parent award report block reply justinkayz 1 points 3 days ago I can't believe qtards are still a thing permalink parent award report block reply view 1 more comments... YearninNation 0 points 2 days ago maybe, maybe not permalink parent award report block reply view 1 more comments...\njustinkayz 1 points 3 days ago I can't believe qtards are still a thing permalink parent award report block reply view 1 more comments...\nYearninNation 0 points 2 days ago maybe, maybe not permalink parent award report block reply view 1 more comments...\nYearninNation 0 points 3 days ago she hasn't been seen since 2019..therefore she knew she'd be in hiding when those stories were concocted by the CIA. permalink parent award report block reply Apersonofinterest 3 points 3 days ago She met with Senate Republicans and Mitch McConnell in November of 2020 where the GOP urged Trump to keep her as head of the CIA. This was after she was supposedly shot but in all video and photos, she was not injured. permalink parent award report block reply YearninNation 0 points 3 days ago source? permalink parent award report block reply Apersonofinterest 1 points 3 days ago Search your preferred search engine for Gina Haspel meets with Senate Republicans Nov-11-2020. permalink parent award report block reply view 1 more comments...\nApersonofinterest 3 points 3 days ago She met with Senate Republicans and Mitch McConnell in November of 2020 where the GOP urged Trump to keep her as head of the CIA. This was after she was supposedly shot but in all video and photos, she was not injured. permalink parent award report block reply YearninNation 0 points 3 days ago source? permalink parent award report block reply Apersonofinterest 1 points 3 days ago Search your preferred search engine for Gina Haspel meets with Senate Republicans Nov-11-2020. permalink parent award report block reply view 1 more comments...\nYearninNation 0 points 3 days ago source? permalink parent award report block reply Apersonofinterest 1 points 3 days ago Search your preferred search engine for Gina Haspel meets with Senate Republicans Nov-11-2020. permalink parent award report block reply view 1 more comments...\nApersonofinterest 1 points 3 days ago Search your preferred search engine for Gina Haspel meets with Senate Republicans Nov-11-2020. permalink parent award report block reply view 1 more comments...\ncorporateshizer -2 points 3 days ago She might be dead, but not because of that nonsense. It's very odd for a person of such a high position to not go on speaking tours, interviews, and the rest after leaving. To have never been seen again? Unprecedented. permalink parent award report block reply Capoditutticapi1 OP 2 points 3 days ago She is currently a senior advisor at the law firm King & Spalding in Washington, D.C. permalink parent award report block reply corporateshizer 0 points 3 days ago Is she in their directory? Does she show up in their photos? Does she have any online posts or other examples of her work there? Any proof at all, outside of text-only press releases, indicating she's alive? https://www.kslaw.com/people?capability_id=&locale=en&office_id=&page=2&per_page=12&q=&school_id=&starts_with=H&title_id= permalink parent award report block reply Capoditutticapi1 OP 2 points 3 days ago Great questions... You should do some super sleuthing and find out... permalink parent award report block reply view 3 more comments...\nCapoditutticapi1 OP 2 points 3 days ago She is currently a senior advisor at the law firm King & Spalding in Washington, D.C. permalink parent award report block reply corporateshizer 0 points 3 days ago Is she in their directory? Does she show up in their photos? Does she have any online posts or other examples of her work there? Any proof at all, outside of text-only press releases, indicating she's alive? https://www.kslaw.com/people?capability_id=&locale=en&office_id=&page=2&per_page=12&q=&school_id=&starts_with=H&title_id= permalink parent award report block reply Capoditutticapi1 OP 2 points 3 days ago Great questions... You should do some super sleuthing and find out... permalink parent award report block reply view 3 more comments...\ncorporateshizer 0 points 3 days ago Is she in their directory? Does she show up in their photos? Does she have any online posts or other examples of her work there? Any proof at all, outside of text-only press releases, indicating she's alive? https://www.kslaw.com/people?capability_id=&locale=en&office_id=&page=2&per_page=12&q=&school_id=&starts_with=H&title_id= permalink parent award report block reply Capoditutticapi1 OP 2 points 3 days ago Great questions... You should do some super sleuthing and find out... permalink parent award report block reply view 3 more comments...\nCapoditutticapi1 OP 2 points 3 days ago Great questions... You should do some super sleuthing and find out... permalink parent award report block reply view 3 more comments...\nlearntocode 2 points 3 days ago The plot was hatched at MI6 and run in conjunction with our Atlantacist spooks in the deep state. Britain is our enemy. Their financial empire is laying waste to our cities. permalink award report block reply\nTearsAficionado 2 points 3 days ago She oozes communism. permalink award report block reply\nschiff_for_brains 2 points 3 days ago Russiagate also has elements that took place in Britain.  Hmm... permalink award report block reply\nMrJinxy 2 points 3 days ago Is she related to PencilNeck?  They look related. permalink award report block reply\nDuster_340 2 points 2 days ago So what? How many people have been put into jail since trump took office? Exactly permalink award report block reply\nPappy_Gunn 2 points 3 days ago Nah just quid pro quo.  Obama went over to England back in the day and gave an anti-Brexit speech.  Steele was also an ex-spook. permalink award report block reply\nFerretman 2 points 3 days ago Burn her. permalink award report block reply\nAfterGlow 2 points 3 days ago You're getting warmer.......slowly. permalink award report block reply\nCanadianTrump2 2 points 3 days ago Well you guys did spy on british as well, and haven’t let Snowden live in America ever sense permalink award report block reply\nWrexxis780 2 points 3 days ago Is it still treason if you betray your country with “allies” of your country? permalink award report block reply Capoditutticapi1 OP 0 points 3 days ago It's complicated and on a case by case basis.  It's not treason if the betrayal involves allies, because treason laws explicitly hinge on \"enemies\" in most democratic systems. It could still be a serious crime, just not the capital-one labeled \"treason.\" permalink parent award report block reply Hawksendoom 1 points 3 days ago satan is all good man - we are allies right? so all good? permalink parent award report block reply\nCapoditutticapi1 OP 0 points 3 days ago It's complicated and on a case by case basis.  It's not treason if the betrayal involves allies, because treason laws explicitly hinge on \"enemies\" in most democratic systems. It could still be a serious crime, just not the capital-one labeled \"treason.\" permalink parent award report block reply Hawksendoom 1 points 3 days ago satan is all good man - we are allies right? so all good? permalink parent award report block reply\nHawksendoom 1 points 3 days ago satan is all good man - we are allies right? so all good? permalink parent award report block reply\nFusionBlack 2 points 3 days ago This just shows it's time to break ties with the UK. permalink award report block reply\nMPitcher1776 2 points 3 days ago She was very involved in the 2020 coup. She is a treasonous bitch and should be brought to justice. permalink award report block reply\nYearninNation 2 points 3 days ago The news now is whether she's dead or hiding because she hasn't been seen since 2019. And who used the fuel-air bomb on the AT&T building. permalink award report block reply starjello 0 points 3 days ago She's working for a law firm in New York. Alive and well and living very comfortably. You need to get away from this place sometime clear your brain fog permalink parent award report block reply YearninNation 0 points 2 days ago maybe, maybe not permalink parent award report block reply starjello 1 points 2 days ago No maybe it's about it idiot she is. permalink parent award report block reply\nstarjello 0 points 3 days ago She's working for a law firm in New York. Alive and well and living very comfortably. You need to get away from this place sometime clear your brain fog permalink parent award report block reply YearninNation 0 points 2 days ago maybe, maybe not permalink parent award report block reply starjello 1 points 2 days ago No maybe it's about it idiot she is. permalink parent award report block reply\nYearninNation 0 points 2 days ago maybe, maybe not permalink parent award report block reply starjello 1 points 2 days ago No maybe it's about it idiot she is. permalink parent award report block reply\nstarjello 1 points 2 days ago No maybe it's about it idiot she is. permalink parent award report block reply\nhappybirthdaydude 2 points 3 days ago Well, Donald J Trump-tard hired her, so.... permalink award report block reply Capoditutticapi1 OP 0 points 3 days ago Pompeo installed Gina Haspel... It was a joint IC-anti Trump Republican operation. permalink parent award report block reply\nCapoditutticapi1 OP 0 points 3 days ago Pompeo installed Gina Haspel... It was a joint IC-anti Trump Republican operation. permalink parent award report block reply\nUltraMagaWA 2 points 2 days ago Spy inside dur permalink award report block reply\nPiratePatriotAu 2 points 3 days ago \"Find out who the master is, who gave the orders for them to do this.\" nope. convict and remove each and every patsy. During sentencing negotiations, they will cave and sell out their master. permalink award report block reply\nTakingCoatsWIN 2 points 3 days ago Britain is the true foreign nation controlling us, but no one makes a fuzz. permalink award report block reply corporateshizer 1 points 3 days ago Not Britain, but the City of London. Those who know, know. https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FV2WFWQ63NJVXNHDTRGEYWBMUY.jpg permalink parent award report block reply Hawksendoom 1 points 3 days ago canadia drops maple syrup permalink parent award report block reply\ncorporateshizer 1 points 3 days ago Not Britain, but the City of London. Those who know, know. https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FV2WFWQ63NJVXNHDTRGEYWBMUY.jpg permalink parent award report block reply\nHawksendoom 1 points 3 days ago canadia drops maple syrup permalink parent award report block reply\nObambi 1 points 3 days ago At one point Biden’s social media account were being handled out of the UK UK is not our friend. They constantly work with Israel to create unrest. permalink award report block reply\nNewGoldenAge 1 points 3 days ago Soft target. Go nuts. permalink award report block reply\nperma-maga 1 points 3 days ago Chris Donnelly and Daniel_Lafayeedney https://patriots.win/p/1ARJczsD5c/uk-antitrump-operation/c permalink award report block reply Capoditutticapi1 OP 1 points 3 days ago Well done! permalink parent award report block reply perma-maga 1 points 3 days ago thanks! permalink parent award report block reply\nCapoditutticapi1 OP 1 points 3 days ago Well done! permalink parent award report block reply perma-maga 1 points 3 days ago thanks! permalink parent award report block reply\nperma-maga 1 points 3 days ago thanks! permalink parent award report block reply\nTidewaterYank 1 points 3 days ago Skankataceously crooked permalink award report block reply\ngrenades_and_ham 1 points 3 days ago Try and keep up please. Her and Brennan are the genesis of “Russian Collusion.” permalink award report block reply\nOodles 1 points 3 days ago Defund the CIA. Until this happens, there will never be lasting change permalink award report block reply\nSpellmonger 1 points 3 days ago When are they going to be made to face us, the dirty, sneaky traitors? Anybody, anywhere near her, please print this out and put it on her desk, or tape it to her door.  They don't get to second-guess us, they all belong in jail awaiting their turn before the firing squad. . permalink award report block reply\nTexasDusty 1 points 3 days ago No no no, the Qtards told me five years ago that she was killed in a shoot out in Germany over servers. Then when she was spotted somewhere else we were told by those lunatics who have done nothing but hurt Trump, that it was a clone. Not a look alike, a literal clone. Because you can clone an adult and within days it can speak and walk and has age lines on its face. I hate those fucking retards. They did so much damage to our country it’s almost as if, oh I don’t know, they are retarded or something. permalink award report block reply starjello 0 points 3 days ago And the losers down vote you out of their pain. They are no better than the libtards who are living a life of delusion but destroying the country permalink parent award report block reply\nstarjello 0 points 3 days ago And the losers down vote you out of their pain. They are no better than the libtards who are living a life of delusion but destroying the country permalink parent award report block reply\nirongeek 0 points 3 days ago I thought she was killed. permalink award report block reply Capoditutticapi1 OP 2 points 3 days ago She was not... She is currently a senior advisor at the law firm King & Spalding in Washington, D.C. permalink parent award report block reply corporateshizer -2 points 3 days ago ^ This guy works from Langley, Virginia. permalink parent award report block reply Capoditutticapi1 OP 2 points 3 days ago Go home to mommy Fed \"handshaker\"! permalink parent award report block reply\nCapoditutticapi1 OP 2 points 3 days ago She was not... She is currently a senior advisor at the law firm King & Spalding in Washington, D.C. permalink parent award report block reply corporateshizer -2 points 3 days ago ^ This guy works from Langley, Virginia. permalink parent award report block reply Capoditutticapi1 OP 2 points 3 days ago Go home to mommy Fed \"handshaker\"! permalink parent award report block reply\ncorporateshizer -2 points 3 days ago ^ This guy works from Langley, Virginia. permalink parent award report block reply Capoditutticapi1 OP 2 points 3 days ago Go home to mommy Fed \"handshaker\"! permalink parent award report block reply\nCapoditutticapi1 OP 2 points 3 days ago Go home to mommy Fed \"handshaker\"! permalink parent award report block reply"
}