{
  "id": "8178674",
  "title": "1599🔴President Trump REFUSES to back down, says Senate Republicans must nuke the filibuster to pass ",
  "url": "https://patriots.win/p/1ARK5A9IiC/president-trump-refuses-to-back-/c",
  "content": "1599 🔴President Trump REFUSES to back down, says Senate Republicans must nuke the filibuster to pass VOTER ID and defeat Democrat “SCOUNDRELS, CHEATERS, & PSYCHOPATHS.” TRUMP  TRUTH posted 3 days ago by DeusVult1096 80 comments award share download report block\n80 comments Sort by Top Top New Worst Old Save McFatty7 94 points 3 days ago Voter ID really is life or death of a country. You can have the most perfect candidate run for office, and then some scumbag steals the election, just because he's part of the establishment swamp, like in 2020. Democrats will undoubtedly nuke the filibuster anyways, and then maybe even pass a law to ban Voter ID nationwide. permalink award report block reply PleaseHonk 24 points 3 days ago I don’t even want to imagine the level of corrupt Evil that will come from the murderous Assassination Party and from AGs who got “elected” after wishing murder on their  opponents family permalink parent award report block reply julianReyes 14 points 3 days ago We don't have to imagine it, we lived through it. permalink parent award report block reply TrumpAndGodWin 7 points 3 days ago And like covid that was only the beta test for worse things to come. permalink parent award report block reply ConsrvspkgNJ 6 points 3 days ago More people need to realize this. More people need to realize that Covid was the Beta test to see how quickly the American people would surrender their rights and where the resistance would come from. Do not think for a minute they didn't take detailed notes of that whole sordid affair. permalink parent award report block reply maltese-poodle 9 points 3 days ago WE NEED TO END H1B VISAS FIRST TRUMP. WHY IS THERE SILENCE ON THAT ISSUE??? EVEN DURING THE SHUTDOWN WHEN EVERYTHING ELSE LIKE ATC WAS SIDELINED, TRUMP ADMIN WAS STILL FAST-TRACKING PROCESSING OF H1B VISAS. VOTER FRAUD WILL TAKE CARE OF ITSELF. DEPORT 40M ILLEGAL ALIENS AND STOP THE PIPELINE OF \"LEGAL\" IMMIGRATION THAT ELECTS PEOPLE LIKE OMAR AND MAMDANI. HALF THE PROBLEMS WILL BE GONE BY JUST CLAMPING DOWN ON IMMIGRATION. permalink parent award report block reply bleeje 3 points 3 days ago Second Lady Usha Vance's uncle and cousins will be really mad tho :'( permalink parent award report block reply NoahGav 13 points 3 days ago Congress term limits is just as important. permalink parent award report block reply Worldtraveler0405 4 points 3 days ago u/War_Hamster True, but in the Netherlands, even when you have voter ID, does not automatically rule out you end up with a swamp animal as a prime minister. Due to the multi-party system, formation of coalition cabinets existing out of parties who've been in politics for decades and have been sucked into the Dutch swamp over the years too. Just check out the recent parliamentary elections on October 29th. It seems highly likely we're going to end up with a homosexual swamp slime ball as a primer minister for the coming years ... Not in cognitive decline, as you unfortunate American souls had to endure with 4 years of Biden in the White House, but untrustworthy, career-politician, a 5th column and having the long arm of Brussels right over you. permalink parent award report block reply War_Hamster 2 points 3 days ago I'm not going to have the time today or tomorrow to give you the response this comment deserves. Bring it up again in the near future and I'll share some thoughts. permalink parent award report block reply TrumpAndGodWin 1 points 3 days ago Alex Jones talked about that recently and it's why our US founding fathers didn't choose a parliamentary system. alexjonesapp dot com permalink parent award report block reply fskfsk 1 points 3 days ago They did the same net outcome legally with Great Replacement. permalink parent award report block reply PiratePatriot 1 points 3 days ago \"You can have the most perfect candidate run for office, and then some scumbag steals the election, just because he's part of the ethnic immigrant swamp, like in New York 2025.\" fixed it for you. permalink parent award report block reply load 12 more comments... canadianhere 34 points 3 days ago I'm trying really hard to think of a time that Trump has sent out word on social media that Republicans must do something, and Republicans actually did it. permalink award report block reply dunkeaters 8 points 3 days ago The Big Beautiful Bill? I swear this site has the short-term memory of an MSM consumer. permalink parent award report block reply 24601 10 points 3 days ago The BBB was a Globalist/Marxist ploy.  Trump got played. Unfortunately, the Swamp includes 99.9999% of DC, including nearly all possible staff/cabinet picks. permalink parent award report block reply dunkeaters 5 points 3 days ago Low IQ take. Trump has to negotiate with RINOs because the American population isn't smart enough to weed them out in primaries. Despite that, Trump got his tax cuts included and we'd be paying $10k+ more per year in taxes without it. permalink parent award report block reply HoganT 5 points 3 days ago Yay… we got to… Keep our taxes the same? In exchange for almost 2 trillion dollars in new spending? permalink parent award report block reply view 1 more comments... MasterChief08 23 points 3 days ago He needs to threaten to veto all CR bills unless Republicans revert the filibuster back to the original version. Republicans will freak out if Trump says he's going to basically keep government closed forever as there's no way they can ever achieve a 2/3rds majority. Demographic replacement and election security are all that matter. Address those 2 problems and leftists can never win again. The Senate needs to give us those 2 things. Otherwise they need to all start fearing the right wing base. permalink award report block reply TrumpWonByALandslide 8 points 3 days ago In that case, enough Republicans will vote for the Democrat bills. I guarantee it. permalink parent award report block reply lixa 8 points 3 days ago What bills? Trump would veto those too in that scenario permalink parent award report block reply DatTrumpDoh 5 points 3 days ago He's saying enough RINOs would join with Dems to pass with a veto-proof majority. That's what ended the 2018 shutdown. permalink parent award report block reply lixa 1 points 3 days ago Perhaps but that they'd join the dems on all their bills in the same manner? That's not likely. permalink parent award report block reply MasterChief08 6 points 3 days ago And then lose spectacularly next year? Trump has a 90% approval rating from the base. I don't see 17+ Republicans risking that. permalink parent award report block reply HeavyMetalPatriot 4 points 3 days ago The goal of the GOP is to lose spectacularly next year. See last week for more details. permalink parent award report block reply MasterChief08 20 points 3 days ago The solution is obvious. A Republican senator needs to bring a lawsuit against the Senate accusing the modern filibuster of neutering Congress as a coequal branch. The constitution makes it clear that a simple majority passes a bill. Changing it to 60% has completely destroyed the legislative branch. The old filibuster rules were not a vote.  It was just rules about how long a debate can last. The Senate can't independently decide 60 is the new 51. permalink award report block reply SpeekFreely 14 points 3 days ago Clearly the Rs don’t care about election integrity. More fraud was witnessed just days ago, and no mention of it. permalink award report block reply TrumpIsTheVictor 8 points 3 days ago Trump with another Filibuster post. The GOP isn't going to do it, Trump knows they will not do it, and Trump is ok with that. This is all a show and it is just a bone for the base to keep them interested. Do not fall for this empty shit. The GOP is scum. The only answer is a 3rd party. It is the only way to destroy the GOP. Remember these words: The Left will never be defeated unless the GOP is destroyed first. permalink award report block reply ImYourHuckleberry24 6 points 3 days ago Sorry, but these endless capitalized posts making demands with no results is beyond tiresome anymore. It's been going on for many years. Nothing has changed. permalink award report block reply HoganT 6 points 3 days ago The constant hyperbole is wearing thin. permalink award report block reply giggitybooped 5 points 3 days ago Spoiler. They won't. permalink award report block reply canada_is_communist 4 points 3 days ago You passs voter ID = democrats never win an election again. Sure, they can win in commieformia or Islam York, but not in 99% of the country permalink award report block reply terribletwos 3 points 3 days ago They're not cheaters, scoundrels, and psychopaths, they're foreign invaders we gave citizenship, came here illegally, their children, and people who are trying to profit off them. Denaturalize and deport them all by force. permalink award report block reply cryptotrypto1 1 points 3 days ago E. All of the above permalink parent award report block reply possibletower 3 points 3 days ago Won't happen because fucking Rand Paul votes with Murkowski and Collins and McConnell to make it only 49 yes votes. Fuck Rand Paul. permalink award report block reply Treefiddydiddy 2 points 3 days ago most of these Rino pricks could care less, if they stay out of 'power' they still get paid and get less hassle to boot ....fuckem permalink award report block reply TrumpyOldMan 2 points 3 days ago Plot twist.....they're going to implement Digital ID and call it Voter ID permalink award report block reply Redlabel 1 points 3 days ago Trump needs to threaten GOP holdouts permalink award report block reply 1LoathsomeDove 1 points 3 days ago As a complete smmoth brain on the topic of filibusters, I queried: 'when has a filibuster been successfil (sic)'. Interesting filibuster bill-killing successes:\n1891 - Federal Elections Bill\n1922 - Anti-lynching Bill\n1934 - Anti-lynching Bill\n1942 - Anti Poll-Tax Bill\n1946 - Fair employment Practices Bill\n^^ all Bills killed were attributed to Southern Democrats However,\n1970 Amendment to Abolish the Electoral College (introduced by Bayh - D) was killed via Thurman - D, who believed it would alienate minorities (because he needed their votes?). permalink award report block reply mikejones 1 points 3 days ago Trump is full on panic mode. Suggesting 50 year mortgage rates and other stuff not good like $2000 per person. Knowing Trump the business man, I won't be surprised if Trump is what accelerated the globalists plans by setting him up in so many traps he couldn't escape without looking bad. permalink award report block reply MaBaker 1 points 3 days ago And how easily could it be turned over later? permalink award report block reply friedchicken 1 points 3 days ago They are psychopaths. I hate psychopaths.  When you encounter them, one thing to understand: they often can't tell a lie from a truth.  It's very easy to lead them to believe something, and insodoing you can make their heads explode. permalink award report block reply Wupta PRO 1 points 3 days ago Never back down!!! permalink award report block reply AppalachianTactical 1 points 3 days ago I think its a bad idea.\nI think he is doing it for israel. You guys act like we have a majority of patriots instead of power hungry neocons. permalink award report block reply CandyBarr 1 points 3 days ago Just stopped by to laugh at Deus and know if xir has a dick it's been butchered permalink award report block reply josiborg 1 points 3 days ago If our country can root out all the fraudulent voting it would go a long way in turning around permalink award report block reply assblast 1 points 3 days ago Unfortunately, I see right through this. There's no intention of actually getting rid of the fillibuster, this is just creating leverage to get D's to the table to \"deal\" with them and pass a milquetoast retarded bill to end the shutdown. permalink award report block reply Znut55 1 points 3 days ago Republican hold-outs on this are making a HUGE mistake!!!!  We only have 4 yrs. to get Trump's agenda pushed through and go after all the criminals responsible for the HELL they've put us through. permalink award report block reply AmericanJawa 1 points 3 days ago Can he please do those mass firings while we're waiting for it? permalink award report block reply ModelMinority 1 points 3 days ago Voted last week, they didn't check anything. Horrendous. permalink award report block reply deleted 1 points 3 days ago HoganT 2 points 3 days ago Too many of you have no fucking clue how the senate works. Shut up. permalink parent award report block reply tiamat 1 points 3 days ago Simply because the vast majority of Republicans are feckless cowards, it's probably best to leave the filibuster alone. If they got rid of it, they'd have to actually press the advantage for all it's worth to ensure the demons don't get back to power permalink award report block reply bluewhiteandred 1 points 3 days ago is there a way to nuke the filibuster and then like nuke their ability to nuke it in the future permalink award report block reply Meddlesom 1 points 3 days ago GOP doesn't have the votes to nuke the filibuster.  Rand Cuck, Collins, and Murkowski will all vote against it. permalink award report block reply FBIsurveillance 1 points 3 days ago he got that dawg in him permalink award report block reply popcycle 1 points 3 days ago we don't need to nuke the filibuster and you know what, we don't even need voter id.  we don't even need to get rid of mail in ballots, they would work better for us than for the Dems. what we need is hands off the keyboard and feet on the ground instead.  Republicans regularly lose by 5-10% in blue cities without even campaigning at all. we let Democrats beat us this time by running candidates pretending to be conservative, or even ex Republicans. we let people forget the golden Ishtar that was literally standing on top the nyc courthouse, the satanic inverted rainbows everywhere, the Easter speech, pregnant men.    we let the achievements get soft pedaled.  one ny businessman just shut down the illegal migration to a trickle, blew away the Iran threat as a side project, same way as he pulled NKs teeth last time, proved the U.S.A. wouldnt die without free trade. we need to be on the ground locally with the energy of this one old man. permalink award report block reply Araket 1 points 3 days ago Let me guess, 8 more people arrested for deportation. Yay. Only 80 million to go now. permalink award report block reply 559throw 1 points 3 days ago They won't do it. They don't care about our country, they care only about themselves permalink award report block reply Ziebart1 0 points 3 days ago Voter I.D. is needed, but Nuking the Filibuster would be stepping on a huge rake down the road. permalink award report block reply d_lock 0 points 3 days ago Want to know the secret? Nuke the filibuster, them put it back in place and make rules changes require 2/3 of the Senate. Pass everything you want before you change the rules. Now there's nothing to complain about, and nothing for Dems to do other than whine. It won't happen, because the weaksauce changes Republicans put in place will show exactly why nothing gets improved when they take over. They just want to go downhill with the brakes on half-heartedly. permalink award report block reply HoganT 2 points 3 days ago It won’t happen because it can’t happen. The rules of the senate are decided by each new senate and no previous senate can constrain a future one. You’d need to change the constitution. You might want to actually learn how things really work before opining on them like you have any idea whatsoever what you’re talking about. permalink parent award report block reply d_lock 0 points 2 days ago Fair on future Senate rule changes -- a subtlety I'd missed. Doesn't change the underlying issue that politicians have spines made out of water, and they would show exactly that if they were given the opportunity to fix long broken policy. I've seen them bend over backwards for decades (probably centuries to be honest, I just haven't been around that long) to leave those problems in place and kill bills to fix things in committee, all while they claim they're \"really trying\" to do something this time. permalink parent award report block reply Awakened 0 points 3 days ago Oh please. The GOP doesn't want this either. permalink award report block reply Executarian2 -3 points 3 days ago He's screaming into a void. It's stupid to eliminate the filibuster, and shouting online isn't going to change it. None of the senators actually want to remove it because it only benefits Trump. permalink award report block reply mailinvoter 2 points 3 days ago Wrong! It benefits our Constitutional Republic, legal citizens, voters, and our tax dollars. It doesn't benefit the establishment RINOs and demonrats, but I'm sure you already knew that. permalink parent award report block reply Executarian2 0 points 3 days ago Not true, but either way, it doesn't matter, because it isn't going to happen. permalink parent award report block reply mailinvoter -2 points 3 days ago You're not true. Butt sniffer. permalink parent award report block reply CocaineNewsome 0 points 3 days ago Only the R senators don't want to remove it. The D are just biding time to have power again. I changed my mind on this after seeing them keep the government shut. permalink parent award report block reply Deportthemall23 -1 points 3 days ago Comment removed upon the user being banned. permalink award report block reply\nMcFatty7 94 points 3 days ago Voter ID really is life or death of a country. You can have the most perfect candidate run for office, and then some scumbag steals the election, just because he's part of the establishment swamp, like in 2020. Democrats will undoubtedly nuke the filibuster anyways, and then maybe even pass a law to ban Voter ID nationwide. permalink award report block reply PleaseHonk 24 points 3 days ago I don’t even want to imagine the level of corrupt Evil that will come from the murderous Assassination Party and from AGs who got “elected” after wishing murder on their  opponents family permalink parent award report block reply julianReyes 14 points 3 days ago We don't have to imagine it, we lived through it. permalink parent award report block reply TrumpAndGodWin 7 points 3 days ago And like covid that was only the beta test for worse things to come. permalink parent award report block reply ConsrvspkgNJ 6 points 3 days ago More people need to realize this. More people need to realize that Covid was the Beta test to see how quickly the American people would surrender their rights and where the resistance would come from. Do not think for a minute they didn't take detailed notes of that whole sordid affair. permalink parent award report block reply maltese-poodle 9 points 3 days ago WE NEED TO END H1B VISAS FIRST TRUMP. WHY IS THERE SILENCE ON THAT ISSUE??? EVEN DURING THE SHUTDOWN WHEN EVERYTHING ELSE LIKE ATC WAS SIDELINED, TRUMP ADMIN WAS STILL FAST-TRACKING PROCESSING OF H1B VISAS. VOTER FRAUD WILL TAKE CARE OF ITSELF. DEPORT 40M ILLEGAL ALIENS AND STOP THE PIPELINE OF \"LEGAL\" IMMIGRATION THAT ELECTS PEOPLE LIKE OMAR AND MAMDANI. HALF THE PROBLEMS WILL BE GONE BY JUST CLAMPING DOWN ON IMMIGRATION. permalink parent award report block reply bleeje 3 points 3 days ago Second Lady Usha Vance's uncle and cousins will be really mad tho :'( permalink parent award report block reply NoahGav 13 points 3 days ago Congress term limits is just as important. permalink parent award report block reply Worldtraveler0405 4 points 3 days ago u/War_Hamster True, but in the Netherlands, even when you have voter ID, does not automatically rule out you end up with a swamp animal as a prime minister. Due to the multi-party system, formation of coalition cabinets existing out of parties who've been in politics for decades and have been sucked into the Dutch swamp over the years too. Just check out the recent parliamentary elections on October 29th. It seems highly likely we're going to end up with a homosexual swamp slime ball as a primer minister for the coming years ... Not in cognitive decline, as you unfortunate American souls had to endure with 4 years of Biden in the White House, but untrustworthy, career-politician, a 5th column and having the long arm of Brussels right over you. permalink parent award report block reply War_Hamster 2 points 3 days ago I'm not going to have the time today or tomorrow to give you the response this comment deserves. Bring it up again in the near future and I'll share some thoughts. permalink parent award report block reply TrumpAndGodWin 1 points 3 days ago Alex Jones talked about that recently and it's why our US founding fathers didn't choose a parliamentary system. alexjonesapp dot com permalink parent award report block reply fskfsk 1 points 3 days ago They did the same net outcome legally with Great Replacement. permalink parent award report block reply PiratePatriot 1 points 3 days ago \"You can have the most perfect candidate run for office, and then some scumbag steals the election, just because he's part of the ethnic immigrant swamp, like in New York 2025.\" fixed it for you. permalink parent award report block reply load 12 more comments...\nPleaseHonk 24 points 3 days ago I don’t even want to imagine the level of corrupt Evil that will come from the murderous Assassination Party and from AGs who got “elected” after wishing murder on their  opponents family permalink parent award report block reply julianReyes 14 points 3 days ago We don't have to imagine it, we lived through it. permalink parent award report block reply TrumpAndGodWin 7 points 3 days ago And like covid that was only the beta test for worse things to come. permalink parent award report block reply ConsrvspkgNJ 6 points 3 days ago More people need to realize this. More people need to realize that Covid was the Beta test to see how quickly the American people would surrender their rights and where the resistance would come from. Do not think for a minute they didn't take detailed notes of that whole sordid affair. permalink parent award report block reply maltese-poodle 9 points 3 days ago WE NEED TO END H1B VISAS FIRST TRUMP. WHY IS THERE SILENCE ON THAT ISSUE??? EVEN DURING THE SHUTDOWN WHEN EVERYTHING ELSE LIKE ATC WAS SIDELINED, TRUMP ADMIN WAS STILL FAST-TRACKING PROCESSING OF H1B VISAS. VOTER FRAUD WILL TAKE CARE OF ITSELF. DEPORT 40M ILLEGAL ALIENS AND STOP THE PIPELINE OF \"LEGAL\" IMMIGRATION THAT ELECTS PEOPLE LIKE OMAR AND MAMDANI. HALF THE PROBLEMS WILL BE GONE BY JUST CLAMPING DOWN ON IMMIGRATION. permalink parent award report block reply bleeje 3 points 3 days ago Second Lady Usha Vance's uncle and cousins will be really mad tho :'( permalink parent award report block reply\njulianReyes 14 points 3 days ago We don't have to imagine it, we lived through it. permalink parent award report block reply TrumpAndGodWin 7 points 3 days ago And like covid that was only the beta test for worse things to come. permalink parent award report block reply ConsrvspkgNJ 6 points 3 days ago More people need to realize this. More people need to realize that Covid was the Beta test to see how quickly the American people would surrender their rights and where the resistance would come from. Do not think for a minute they didn't take detailed notes of that whole sordid affair. permalink parent award report block reply\nTrumpAndGodWin 7 points 3 days ago And like covid that was only the beta test for worse things to come. permalink parent award report block reply ConsrvspkgNJ 6 points 3 days ago More people need to realize this. More people need to realize that Covid was the Beta test to see how quickly the American people would surrender their rights and where the resistance would come from. Do not think for a minute they didn't take detailed notes of that whole sordid affair. permalink parent award report block reply\nConsrvspkgNJ 6 points 3 days ago More people need to realize this. More people need to realize that Covid was the Beta test to see how quickly the American people would surrender their rights and where the resistance would come from. Do not think for a minute they didn't take detailed notes of that whole sordid affair. permalink parent award report block reply\nmaltese-poodle 9 points 3 days ago WE NEED TO END H1B VISAS FIRST TRUMP. WHY IS THERE SILENCE ON THAT ISSUE??? EVEN DURING THE SHUTDOWN WHEN EVERYTHING ELSE LIKE ATC WAS SIDELINED, TRUMP ADMIN WAS STILL FAST-TRACKING PROCESSING OF H1B VISAS. VOTER FRAUD WILL TAKE CARE OF ITSELF. DEPORT 40M ILLEGAL ALIENS AND STOP THE PIPELINE OF \"LEGAL\" IMMIGRATION THAT ELECTS PEOPLE LIKE OMAR AND MAMDANI. HALF THE PROBLEMS WILL BE GONE BY JUST CLAMPING DOWN ON IMMIGRATION. permalink parent award report block reply bleeje 3 points 3 days ago Second Lady Usha Vance's uncle and cousins will be really mad tho :'( permalink parent award report block reply\nbleeje 3 points 3 days ago Second Lady Usha Vance's uncle and cousins will be really mad tho :'( permalink parent award report block reply\nNoahGav 13 points 3 days ago Congress term limits is just as important. permalink parent award report block reply\nWorldtraveler0405 4 points 3 days ago u/War_Hamster True, but in the Netherlands, even when you have voter ID, does not automatically rule out you end up with a swamp animal as a prime minister. Due to the multi-party system, formation of coalition cabinets existing out of parties who've been in politics for decades and have been sucked into the Dutch swamp over the years too. Just check out the recent parliamentary elections on October 29th. It seems highly likely we're going to end up with a homosexual swamp slime ball as a primer minister for the coming years ... Not in cognitive decline, as you unfortunate American souls had to endure with 4 years of Biden in the White House, but untrustworthy, career-politician, a 5th column and having the long arm of Brussels right over you. permalink parent award report block reply War_Hamster 2 points 3 days ago I'm not going to have the time today or tomorrow to give you the response this comment deserves. Bring it up again in the near future and I'll share some thoughts. permalink parent award report block reply TrumpAndGodWin 1 points 3 days ago Alex Jones talked about that recently and it's why our US founding fathers didn't choose a parliamentary system. alexjonesapp dot com permalink parent award report block reply\nWar_Hamster 2 points 3 days ago I'm not going to have the time today or tomorrow to give you the response this comment deserves. Bring it up again in the near future and I'll share some thoughts. permalink parent award report block reply\nTrumpAndGodWin 1 points 3 days ago Alex Jones talked about that recently and it's why our US founding fathers didn't choose a parliamentary system. alexjonesapp dot com permalink parent award report block reply\nfskfsk 1 points 3 days ago They did the same net outcome legally with Great Replacement. permalink parent award report block reply\nPiratePatriot 1 points 3 days ago \"You can have the most perfect candidate run for office, and then some scumbag steals the election, just because he's part of the ethnic immigrant swamp, like in New York 2025.\" fixed it for you. permalink parent award report block reply\ncanadianhere 34 points 3 days ago I'm trying really hard to think of a time that Trump has sent out word on social media that Republicans must do something, and Republicans actually did it. permalink award report block reply dunkeaters 8 points 3 days ago The Big Beautiful Bill? I swear this site has the short-term memory of an MSM consumer. permalink parent award report block reply 24601 10 points 3 days ago The BBB was a Globalist/Marxist ploy.  Trump got played. Unfortunately, the Swamp includes 99.9999% of DC, including nearly all possible staff/cabinet picks. permalink parent award report block reply dunkeaters 5 points 3 days ago Low IQ take. Trump has to negotiate with RINOs because the American population isn't smart enough to weed them out in primaries. Despite that, Trump got his tax cuts included and we'd be paying $10k+ more per year in taxes without it. permalink parent award report block reply HoganT 5 points 3 days ago Yay… we got to… Keep our taxes the same? In exchange for almost 2 trillion dollars in new spending? permalink parent award report block reply view 1 more comments...\ndunkeaters 8 points 3 days ago The Big Beautiful Bill? I swear this site has the short-term memory of an MSM consumer. permalink parent award report block reply 24601 10 points 3 days ago The BBB was a Globalist/Marxist ploy.  Trump got played. Unfortunately, the Swamp includes 99.9999% of DC, including nearly all possible staff/cabinet picks. permalink parent award report block reply dunkeaters 5 points 3 days ago Low IQ take. Trump has to negotiate with RINOs because the American population isn't smart enough to weed them out in primaries. Despite that, Trump got his tax cuts included and we'd be paying $10k+ more per year in taxes without it. permalink parent award report block reply HoganT 5 points 3 days ago Yay… we got to… Keep our taxes the same? In exchange for almost 2 trillion dollars in new spending? permalink parent award report block reply view 1 more comments...\n24601 10 points 3 days ago The BBB was a Globalist/Marxist ploy.  Trump got played. Unfortunately, the Swamp includes 99.9999% of DC, including nearly all possible staff/cabinet picks. permalink parent award report block reply dunkeaters 5 points 3 days ago Low IQ take. Trump has to negotiate with RINOs because the American population isn't smart enough to weed them out in primaries. Despite that, Trump got his tax cuts included and we'd be paying $10k+ more per year in taxes without it. permalink parent award report block reply HoganT 5 points 3 days ago Yay… we got to… Keep our taxes the same? In exchange for almost 2 trillion dollars in new spending? permalink parent award report block reply view 1 more comments...\ndunkeaters 5 points 3 days ago Low IQ take. Trump has to negotiate with RINOs because the American population isn't smart enough to weed them out in primaries. Despite that, Trump got his tax cuts included and we'd be paying $10k+ more per year in taxes without it. permalink parent award report block reply HoganT 5 points 3 days ago Yay… we got to… Keep our taxes the same? In exchange for almost 2 trillion dollars in new spending? permalink parent award report block reply view 1 more comments...\nHoganT 5 points 3 days ago Yay… we got to… Keep our taxes the same? In exchange for almost 2 trillion dollars in new spending? permalink parent award report block reply view 1 more comments...\nMasterChief08 23 points 3 days ago He needs to threaten to veto all CR bills unless Republicans revert the filibuster back to the original version. Republicans will freak out if Trump says he's going to basically keep government closed forever as there's no way they can ever achieve a 2/3rds majority. Demographic replacement and election security are all that matter. Address those 2 problems and leftists can never win again. The Senate needs to give us those 2 things. Otherwise they need to all start fearing the right wing base. permalink award report block reply TrumpWonByALandslide 8 points 3 days ago In that case, enough Republicans will vote for the Democrat bills. I guarantee it. permalink parent award report block reply lixa 8 points 3 days ago What bills? Trump would veto those too in that scenario permalink parent award report block reply DatTrumpDoh 5 points 3 days ago He's saying enough RINOs would join with Dems to pass with a veto-proof majority. That's what ended the 2018 shutdown. permalink parent award report block reply lixa 1 points 3 days ago Perhaps but that they'd join the dems on all their bills in the same manner? That's not likely. permalink parent award report block reply MasterChief08 6 points 3 days ago And then lose spectacularly next year? Trump has a 90% approval rating from the base. I don't see 17+ Republicans risking that. permalink parent award report block reply HeavyMetalPatriot 4 points 3 days ago The goal of the GOP is to lose spectacularly next year. See last week for more details. permalink parent award report block reply\nTrumpWonByALandslide 8 points 3 days ago In that case, enough Republicans will vote for the Democrat bills. I guarantee it. permalink parent award report block reply lixa 8 points 3 days ago What bills? Trump would veto those too in that scenario permalink parent award report block reply DatTrumpDoh 5 points 3 days ago He's saying enough RINOs would join with Dems to pass with a veto-proof majority. That's what ended the 2018 shutdown. permalink parent award report block reply lixa 1 points 3 days ago Perhaps but that they'd join the dems on all their bills in the same manner? That's not likely. permalink parent award report block reply MasterChief08 6 points 3 days ago And then lose spectacularly next year? Trump has a 90% approval rating from the base. I don't see 17+ Republicans risking that. permalink parent award report block reply HeavyMetalPatriot 4 points 3 days ago The goal of the GOP is to lose spectacularly next year. See last week for more details. permalink parent award report block reply\nlixa 8 points 3 days ago What bills? Trump would veto those too in that scenario permalink parent award report block reply DatTrumpDoh 5 points 3 days ago He's saying enough RINOs would join with Dems to pass with a veto-proof majority. That's what ended the 2018 shutdown. permalink parent award report block reply lixa 1 points 3 days ago Perhaps but that they'd join the dems on all their bills in the same manner? That's not likely. permalink parent award report block reply\nDatTrumpDoh 5 points 3 days ago He's saying enough RINOs would join with Dems to pass with a veto-proof majority. That's what ended the 2018 shutdown. permalink parent award report block reply lixa 1 points 3 days ago Perhaps but that they'd join the dems on all their bills in the same manner? That's not likely. permalink parent award report block reply\nlixa 1 points 3 days ago Perhaps but that they'd join the dems on all their bills in the same manner? That's not likely. permalink parent award report block reply\nMasterChief08 6 points 3 days ago And then lose spectacularly next year? Trump has a 90% approval rating from the base. I don't see 17+ Republicans risking that. permalink parent award report block reply HeavyMetalPatriot 4 points 3 days ago The goal of the GOP is to lose spectacularly next year. See last week for more details. permalink parent award report block reply\nHeavyMetalPatriot 4 points 3 days ago The goal of the GOP is to lose spectacularly next year. See last week for more details. permalink parent award report block reply\nMasterChief08 20 points 3 days ago The solution is obvious. A Republican senator needs to bring a lawsuit against the Senate accusing the modern filibuster of neutering Congress as a coequal branch. The constitution makes it clear that a simple majority passes a bill. Changing it to 60% has completely destroyed the legislative branch. The old filibuster rules were not a vote.  It was just rules about how long a debate can last. The Senate can't independently decide 60 is the new 51. permalink award report block reply\nSpeekFreely 14 points 3 days ago Clearly the Rs don’t care about election integrity. More fraud was witnessed just days ago, and no mention of it. permalink award report block reply\nTrumpIsTheVictor 8 points 3 days ago Trump with another Filibuster post. The GOP isn't going to do it, Trump knows they will not do it, and Trump is ok with that. This is all a show and it is just a bone for the base to keep them interested. Do not fall for this empty shit. The GOP is scum. The only answer is a 3rd party. It is the only way to destroy the GOP. Remember these words: The Left will never be defeated unless the GOP is destroyed first. permalink award report block reply\nImYourHuckleberry24 6 points 3 days ago Sorry, but these endless capitalized posts making demands with no results is beyond tiresome anymore. It's been going on for many years. Nothing has changed. permalink award report block reply\nHoganT 6 points 3 days ago The constant hyperbole is wearing thin. permalink award report block reply\ngiggitybooped 5 points 3 days ago Spoiler. They won't. permalink award report block reply\ncanada_is_communist 4 points 3 days ago You passs voter ID = democrats never win an election again. Sure, they can win in commieformia or Islam York, but not in 99% of the country permalink award report block reply\nterribletwos 3 points 3 days ago They're not cheaters, scoundrels, and psychopaths, they're foreign invaders we gave citizenship, came here illegally, their children, and people who are trying to profit off them. Denaturalize and deport them all by force. permalink award report block reply cryptotrypto1 1 points 3 days ago E. All of the above permalink parent award report block reply\ncryptotrypto1 1 points 3 days ago E. All of the above permalink parent award report block reply\npossibletower 3 points 3 days ago Won't happen because fucking Rand Paul votes with Murkowski and Collins and McConnell to make it only 49 yes votes. Fuck Rand Paul. permalink award report block reply\nTreefiddydiddy 2 points 3 days ago most of these Rino pricks could care less, if they stay out of 'power' they still get paid and get less hassle to boot ....fuckem permalink award report block reply\nTrumpyOldMan 2 points 3 days ago Plot twist.....they're going to implement Digital ID and call it Voter ID permalink award report block reply\nRedlabel 1 points 3 days ago Trump needs to threaten GOP holdouts permalink award report block reply\n1LoathsomeDove 1 points 3 days ago As a complete smmoth brain on the topic of filibusters, I queried: 'when has a filibuster been successfil (sic)'. Interesting filibuster bill-killing successes:\n1891 - Federal Elections Bill\n1922 - Anti-lynching Bill\n1934 - Anti-lynching Bill\n1942 - Anti Poll-Tax Bill\n1946 - Fair employment Practices Bill\n^^ all Bills killed were attributed to Southern Democrats However,\n1970 Amendment to Abolish the Electoral College (introduced by Bayh - D) was killed via Thurman - D, who believed it would alienate minorities (because he needed their votes?). permalink award report block reply\nmikejones 1 points 3 days ago Trump is full on panic mode. Suggesting 50 year mortgage rates and other stuff not good like $2000 per person. Knowing Trump the business man, I won't be surprised if Trump is what accelerated the globalists plans by setting him up in so many traps he couldn't escape without looking bad. permalink award report block reply\nMaBaker 1 points 3 days ago And how easily could it be turned over later? permalink award report block reply\nfriedchicken 1 points 3 days ago They are psychopaths. I hate psychopaths.  When you encounter them, one thing to understand: they often can't tell a lie from a truth.  It's very easy to lead them to believe something, and insodoing you can make their heads explode. permalink award report block reply\nWupta PRO 1 points 3 days ago Never back down!!! permalink award report block reply\nAppalachianTactical 1 points 3 days ago I think its a bad idea.\nI think he is doing it for israel. You guys act like we have a majority of patriots instead of power hungry neocons. permalink award report block reply\nCandyBarr 1 points 3 days ago Just stopped by to laugh at Deus and know if xir has a dick it's been butchered permalink award report block reply\njosiborg 1 points 3 days ago If our country can root out all the fraudulent voting it would go a long way in turning around permalink award report block reply\nassblast 1 points 3 days ago Unfortunately, I see right through this. There's no intention of actually getting rid of the fillibuster, this is just creating leverage to get D's to the table to \"deal\" with them and pass a milquetoast retarded bill to end the shutdown. permalink award report block reply\nZnut55 1 points 3 days ago Republican hold-outs on this are making a HUGE mistake!!!!  We only have 4 yrs. to get Trump's agenda pushed through and go after all the criminals responsible for the HELL they've put us through. permalink award report block reply\nAmericanJawa 1 points 3 days ago Can he please do those mass firings while we're waiting for it? permalink award report block reply\nModelMinority 1 points 3 days ago Voted last week, they didn't check anything. Horrendous. permalink award report block reply\ndeleted 1 points 3 days ago HoganT 2 points 3 days ago Too many of you have no fucking clue how the senate works. Shut up. permalink parent award report block reply\nHoganT 2 points 3 days ago Too many of you have no fucking clue how the senate works. Shut up. permalink parent award report block reply\ntiamat 1 points 3 days ago Simply because the vast majority of Republicans are feckless cowards, it's probably best to leave the filibuster alone. If they got rid of it, they'd have to actually press the advantage for all it's worth to ensure the demons don't get back to power permalink award report block reply\nbluewhiteandred 1 points 3 days ago is there a way to nuke the filibuster and then like nuke their ability to nuke it in the future permalink award report block reply\nMeddlesom 1 points 3 days ago GOP doesn't have the votes to nuke the filibuster.  Rand Cuck, Collins, and Murkowski will all vote against it. permalink award report block reply\nFBIsurveillance 1 points 3 days ago he got that dawg in him permalink award report block reply\npopcycle 1 points 3 days ago we don't need to nuke the filibuster and you know what, we don't even need voter id.  we don't even need to get rid of mail in ballots, they would work better for us than for the Dems. what we need is hands off the keyboard and feet on the ground instead.  Republicans regularly lose by 5-10% in blue cities without even campaigning at all. we let Democrats beat us this time by running candidates pretending to be conservative, or even ex Republicans. we let people forget the golden Ishtar that was literally standing on top the nyc courthouse, the satanic inverted rainbows everywhere, the Easter speech, pregnant men.    we let the achievements get soft pedaled.  one ny businessman just shut down the illegal migration to a trickle, blew away the Iran threat as a side project, same way as he pulled NKs teeth last time, proved the U.S.A. wouldnt die without free trade. we need to be on the ground locally with the energy of this one old man. permalink award report block reply\nAraket 1 points 3 days ago Let me guess, 8 more people arrested for deportation. Yay. Only 80 million to go now. permalink award report block reply\n559throw 1 points 3 days ago They won't do it. They don't care about our country, they care only about themselves permalink award report block reply\nZiebart1 0 points 3 days ago Voter I.D. is needed, but Nuking the Filibuster would be stepping on a huge rake down the road. permalink award report block reply\nd_lock 0 points 3 days ago Want to know the secret? Nuke the filibuster, them put it back in place and make rules changes require 2/3 of the Senate. Pass everything you want before you change the rules. Now there's nothing to complain about, and nothing for Dems to do other than whine. It won't happen, because the weaksauce changes Republicans put in place will show exactly why nothing gets improved when they take over. They just want to go downhill with the brakes on half-heartedly. permalink award report block reply HoganT 2 points 3 days ago It won’t happen because it can’t happen. The rules of the senate are decided by each new senate and no previous senate can constrain a future one. You’d need to change the constitution. You might want to actually learn how things really work before opining on them like you have any idea whatsoever what you’re talking about. permalink parent award report block reply d_lock 0 points 2 days ago Fair on future Senate rule changes -- a subtlety I'd missed. Doesn't change the underlying issue that politicians have spines made out of water, and they would show exactly that if they were given the opportunity to fix long broken policy. I've seen them bend over backwards for decades (probably centuries to be honest, I just haven't been around that long) to leave those problems in place and kill bills to fix things in committee, all while they claim they're \"really trying\" to do something this time. permalink parent award report block reply\nHoganT 2 points 3 days ago It won’t happen because it can’t happen. The rules of the senate are decided by each new senate and no previous senate can constrain a future one. You’d need to change the constitution. You might want to actually learn how things really work before opining on them like you have any idea whatsoever what you’re talking about. permalink parent award report block reply d_lock 0 points 2 days ago Fair on future Senate rule changes -- a subtlety I'd missed. Doesn't change the underlying issue that politicians have spines made out of water, and they would show exactly that if they were given the opportunity to fix long broken policy. I've seen them bend over backwards for decades (probably centuries to be honest, I just haven't been around that long) to leave those problems in place and kill bills to fix things in committee, all while they claim they're \"really trying\" to do something this time. permalink parent award report block reply\nd_lock 0 points 2 days ago Fair on future Senate rule changes -- a subtlety I'd missed. Doesn't change the underlying issue that politicians have spines made out of water, and they would show exactly that if they were given the opportunity to fix long broken policy. I've seen them bend over backwards for decades (probably centuries to be honest, I just haven't been around that long) to leave those problems in place and kill bills to fix things in committee, all while they claim they're \"really trying\" to do something this time. permalink parent award report block reply\nAwakened 0 points 3 days ago Oh please. The GOP doesn't want this either. permalink award report block reply\nExecutarian2 -3 points 3 days ago He's screaming into a void. It's stupid to eliminate the filibuster, and shouting online isn't going to change it. None of the senators actually want to remove it because it only benefits Trump. permalink award report block reply mailinvoter 2 points 3 days ago Wrong! It benefits our Constitutional Republic, legal citizens, voters, and our tax dollars. It doesn't benefit the establishment RINOs and demonrats, but I'm sure you already knew that. permalink parent award report block reply Executarian2 0 points 3 days ago Not true, but either way, it doesn't matter, because it isn't going to happen. permalink parent award report block reply mailinvoter -2 points 3 days ago You're not true. Butt sniffer. permalink parent award report block reply CocaineNewsome 0 points 3 days ago Only the R senators don't want to remove it. The D are just biding time to have power again. I changed my mind on this after seeing them keep the government shut. permalink parent award report block reply\nmailinvoter 2 points 3 days ago Wrong! It benefits our Constitutional Republic, legal citizens, voters, and our tax dollars. It doesn't benefit the establishment RINOs and demonrats, but I'm sure you already knew that. permalink parent award report block reply Executarian2 0 points 3 days ago Not true, but either way, it doesn't matter, because it isn't going to happen. permalink parent award report block reply mailinvoter -2 points 3 days ago You're not true. Butt sniffer. permalink parent award report block reply\nExecutarian2 0 points 3 days ago Not true, but either way, it doesn't matter, because it isn't going to happen. permalink parent award report block reply mailinvoter -2 points 3 days ago You're not true. Butt sniffer. permalink parent award report block reply\nmailinvoter -2 points 3 days ago You're not true. Butt sniffer. permalink parent award report block reply\nCocaineNewsome 0 points 3 days ago Only the R senators don't want to remove it. The D are just biding time to have power again. I changed my mind on this after seeing them keep the government shut. permalink parent award report block reply\nDeportthemall23 -1 points 3 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T20:00:14.202929Z"
}