{
  "id": "1ARK9mGPSh",
  "url": "https://patriots.win/p/1ARK9mGPSh/nailed-it-brit-hume-of-fox-news-/c",
  "content": "838 NAILED IT: Brit Hume of FOX News Says Government Shutdown Was All About ‘Democrats Positioning Themselves in Resistance to Trump’ (VIDEO) (www.thegatewaypundit.com) posted 19 hours ago by thegatewaybandit 30 comments award share report block NAILED IT: Brit Hume of FOX News Says Government Shutdown Was All About 'Democrats Positioning Themselves in Resistance to Trump... Now that the government shutdown is finally coming to an end, people are starting to ask why it went on for as long as it did. www.thegatewaypundit.com\n30 comments Sort by Top Top New Worst Old Save IllIllIll 24 points 19 hours ago ✓ Brit Hume ✓ on Fox News ✓ via Gateway Pundit ✓ Posted by u/thegatewaybandit ✓ Stickied What're we doin here? permalink award report block reply CounterStrike 9 points 19 hours ago I thought this was Facebook for a minute. Edit: ✓ OP has 0 comments Edit 2: checks notes... ✓ Every post is from the gateway pundit permalink parent award report block reply IllIllIll 6 points 19 hours ago Yeah it's literally a bot posting 50+ Gateway Pundit articles every day. Good times. permalink parent award report block reply B-2StealthTrump 6 points 19 hours ago Mods are bots?  Anyway..   Site’s been fucked for a while now. permalink parent award report block reply TallestSkill 5 points 18 hours ago All of our best users are bots. permalink parent award report block reply TrumpsAmericaForMe 3 points 19 hours ago We deserve a 'good' bot now and then! permalink parent award report block reply KernalMustard 2 points 18 hours ago I miss ballots. permalink parent award report block reply SavingPrivateGrace 1 points 18 hours ago The articles are discussion worthy.  Deport the Posts this bot posts that are advertisements. permalink parent award report block reply MehNahMehNah 2 points 11 hours ago I get that PDW is a natural target for a lot of outside influences, it's interesting to see the sequence laid out on this post. I mean we get the whole anarchist rainbow, foreign globohomo WWE and burnouts from every generation that's been given a catchy nickname. Frustrating and illuminating at the same time. permalink parent award report block reply BallsackPaneer 1 points 18 hours ago So what? Your last post was when? Oh, 5 months ago. Try more contributing, less moaning. permalink parent award report block reply Taqiyya_Mockingbird 4 points 19 hours ago Account breaks self promotion rule, gets banned, immediately unbanned, three times in a row. Things aren’t what they seem to be. permalink parent award report block reply NotYourMan 1 points 10 hours ago Lots of other reasons why democrats shutdown the government.  They wanted to hurt Trump's economy which is going great.  But mostly they wanted to hurt poor families and blame Trump.  All democrat politicians posted them on X/Twitter for the entire time.  This was the narrative.  Democrats literally weaponized poor families going hungry.  Just democrats politics. permalink parent award report block reply RuprechtThaMonkeyBoy 9 points 19 hours ago Lurch is right like a blinking VCR clock. He’s got on 12:00/right for the reminder of the year. permalink award report block reply BeauHD 6 points 19 hours ago That eery white VFD glow! permalink parent award report block reply KernalMustard 1 points 18 hours ago That means hes lying. Thats a known tell. Hes a newscaster I repeat myself. permalink parent award report block reply Wupta PRO 5 points 19 hours ago Yup called it the first day anything to stop the Trump agenda. permalink award report block reply GA_Logic 5 points 19 hours ago Boomer Fox News discovers the Democrats are against Trump.  News at 11. permalink award report block reply cyberrigger 4 points 19 hours ago That's kind of a ---- 'well duh'. permalink award report block reply Skywise 3 points 19 hours ago ... duh? permalink award report block reply MySidesGoUp 3 points 19 hours ago The softball play by ‘Righty’ Fox News… He should have on a gay rodeo hat and satin kerchief around his neck.. permalink award report block reply BallsackPaneer 2 points 18 hours ago Is he interviewing Lindsey? permalink parent award report block reply SavingPrivateGrace 2 points 19 hours ago They propped Biden up and tare Trump down.  It's ridiculous.  A predominately 2 Party system creates rivalry and power struggles.  We're gonna have to cheat bigger than what we've been cheated out of. permalink award report block reply TheRedPilledArtist 2 points 19 hours ago It was about those SHAM elections we just had. Point blank. permalink award report block reply RichardCranium88 1 points 19 hours ago Politicians circling the wagons is nothing new. permalink award report block reply mass55th 1 points 18 hours ago Didn't know Brit was still on Fox News. Thought he might have retired by now. Haven't watched that channel or any news programming on any platform since Obama was selected in 2008. permalink award report block reply GoUSA 1 points 19 hours ago As opposed to every other second of every day since he started running for office permalink award report block reply jcd_007 1 points 19 hours ago And then fucking losing. The Dems look like chumps. permalink award report block reply Crookedlamp 1 points 12 hours ago Yeah that’s why we did so great this past election… permalink award report block reply EstadosUnidosPrimero 1 points 19 hours ago Comment removed by community filter, pending further review. permalink award report block reply\nIllIllIll 24 points 19 hours ago ✓ Brit Hume ✓ on Fox News ✓ via Gateway Pundit ✓ Posted by u/thegatewaybandit ✓ Stickied What're we doin here? permalink award report block reply CounterStrike 9 points 19 hours ago I thought this was Facebook for a minute. Edit: ✓ OP has 0 comments Edit 2: checks notes... ✓ Every post is from the gateway pundit permalink parent award report block reply IllIllIll 6 points 19 hours ago Yeah it's literally a bot posting 50+ Gateway Pundit articles every day. Good times. permalink parent award report block reply B-2StealthTrump 6 points 19 hours ago Mods are bots?  Anyway..   Site’s been fucked for a while now. permalink parent award report block reply TallestSkill 5 points 18 hours ago All of our best users are bots. permalink parent award report block reply TrumpsAmericaForMe 3 points 19 hours ago We deserve a 'good' bot now and then! permalink parent award report block reply KernalMustard 2 points 18 hours ago I miss ballots. permalink parent award report block reply SavingPrivateGrace 1 points 18 hours ago The articles are discussion worthy.  Deport the Posts this bot posts that are advertisements. permalink parent award report block reply MehNahMehNah 2 points 11 hours ago I get that PDW is a natural target for a lot of outside influences, it's interesting to see the sequence laid out on this post. I mean we get the whole anarchist rainbow, foreign globohomo WWE and burnouts from every generation that's been given a catchy nickname. Frustrating and illuminating at the same time. permalink parent award report block reply BallsackPaneer 1 points 18 hours ago So what? Your last post was when? Oh, 5 months ago. Try more contributing, less moaning. permalink parent award report block reply Taqiyya_Mockingbird 4 points 19 hours ago Account breaks self promotion rule, gets banned, immediately unbanned, three times in a row. Things aren’t what they seem to be. permalink parent award report block reply NotYourMan 1 points 10 hours ago Lots of other reasons why democrats shutdown the government.  They wanted to hurt Trump's economy which is going great.  But mostly they wanted to hurt poor families and blame Trump.  All democrat politicians posted them on X/Twitter for the entire time.  This was the narrative.  Democrats literally weaponized poor families going hungry.  Just democrats politics. permalink parent award report block reply\nCounterStrike 9 points 19 hours ago I thought this was Facebook for a minute. Edit: ✓ OP has 0 comments Edit 2: checks notes... ✓ Every post is from the gateway pundit permalink parent award report block reply IllIllIll 6 points 19 hours ago Yeah it's literally a bot posting 50+ Gateway Pundit articles every day. Good times. permalink parent award report block reply B-2StealthTrump 6 points 19 hours ago Mods are bots?  Anyway..   Site’s been fucked for a while now. permalink parent award report block reply TallestSkill 5 points 18 hours ago All of our best users are bots. permalink parent award report block reply TrumpsAmericaForMe 3 points 19 hours ago We deserve a 'good' bot now and then! permalink parent award report block reply KernalMustard 2 points 18 hours ago I miss ballots. permalink parent award report block reply SavingPrivateGrace 1 points 18 hours ago The articles are discussion worthy.  Deport the Posts this bot posts that are advertisements. permalink parent award report block reply MehNahMehNah 2 points 11 hours ago I get that PDW is a natural target for a lot of outside influences, it's interesting to see the sequence laid out on this post. I mean we get the whole anarchist rainbow, foreign globohomo WWE and burnouts from every generation that's been given a catchy nickname. Frustrating and illuminating at the same time. permalink parent award report block reply BallsackPaneer 1 points 18 hours ago So what? Your last post was when? Oh, 5 months ago. Try more contributing, less moaning. permalink parent award report block reply\nIllIllIll 6 points 19 hours ago Yeah it's literally a bot posting 50+ Gateway Pundit articles every day. Good times. permalink parent award report block reply B-2StealthTrump 6 points 19 hours ago Mods are bots?  Anyway..   Site’s been fucked for a while now. permalink parent award report block reply TallestSkill 5 points 18 hours ago All of our best users are bots. permalink parent award report block reply TrumpsAmericaForMe 3 points 19 hours ago We deserve a 'good' bot now and then! permalink parent award report block reply KernalMustard 2 points 18 hours ago I miss ballots. permalink parent award report block reply SavingPrivateGrace 1 points 18 hours ago The articles are discussion worthy.  Deport the Posts this bot posts that are advertisements. permalink parent award report block reply MehNahMehNah 2 points 11 hours ago I get that PDW is a natural target for a lot of outside influences, it's interesting to see the sequence laid out on this post. I mean we get the whole anarchist rainbow, foreign globohomo WWE and burnouts from every generation that's been given a catchy nickname. Frustrating and illuminating at the same time. permalink parent award report block reply BallsackPaneer 1 points 18 hours ago So what? Your last post was when? Oh, 5 months ago. Try more contributing, less moaning. permalink parent award report block reply\nB-2StealthTrump 6 points 19 hours ago Mods are bots?  Anyway..   Site’s been fucked for a while now. permalink parent award report block reply TallestSkill 5 points 18 hours ago All of our best users are bots. permalink parent award report block reply\nTallestSkill 5 points 18 hours ago All of our best users are bots. permalink parent award report block reply\nTrumpsAmericaForMe 3 points 19 hours ago We deserve a 'good' bot now and then! permalink parent award report block reply KernalMustard 2 points 18 hours ago I miss ballots. permalink parent award report block reply SavingPrivateGrace 1 points 18 hours ago The articles are discussion worthy.  Deport the Posts this bot posts that are advertisements. permalink parent award report block reply\nKernalMustard 2 points 18 hours ago I miss ballots. permalink parent award report block reply\nSavingPrivateGrace 1 points 18 hours ago The articles are discussion worthy.  Deport the Posts this bot posts that are advertisements. permalink parent award report block reply\nMehNahMehNah 2 points 11 hours ago I get that PDW is a natural target for a lot of outside influences, it's interesting to see the sequence laid out on this post. I mean we get the whole anarchist rainbow, foreign globohomo WWE and burnouts from every generation that's been given a catchy nickname. Frustrating and illuminating at the same time. permalink parent award report block reply\nBallsackPaneer 1 points 18 hours ago So what? Your last post was when? Oh, 5 months ago. Try more contributing, less moaning. permalink parent award report block reply\nTaqiyya_Mockingbird 4 points 19 hours ago Account breaks self promotion rule, gets banned, immediately unbanned, three times in a row. Things aren’t what they seem to be. permalink parent award report block reply\nNotYourMan 1 points 10 hours ago Lots of other reasons why democrats shutdown the government.  They wanted to hurt Trump's economy which is going great.  But mostly they wanted to hurt poor families and blame Trump.  All democrat politicians posted them on X/Twitter for the entire time.  This was the narrative.  Democrats literally weaponized poor families going hungry.  Just democrats politics. permalink parent award report block reply\nRuprechtThaMonkeyBoy 9 points 19 hours ago Lurch is right like a blinking VCR clock. He’s got on 12:00/right for the reminder of the year. permalink award report block reply BeauHD 6 points 19 hours ago That eery white VFD glow! permalink parent award report block reply KernalMustard 1 points 18 hours ago That means hes lying. Thats a known tell. Hes a newscaster I repeat myself. permalink parent award report block reply\nBeauHD 6 points 19 hours ago That eery white VFD glow! permalink parent award report block reply\nKernalMustard 1 points 18 hours ago That means hes lying. Thats a known tell. Hes a newscaster I repeat myself. permalink parent award report block reply\nWupta PRO 5 points 19 hours ago Yup called it the first day anything to stop the Trump agenda. permalink award report block reply\nGA_Logic 5 points 19 hours ago Boomer Fox News discovers the Democrats are against Trump.  News at 11. permalink award report block reply\ncyberrigger 4 points 19 hours ago That's kind of a ---- 'well duh'. permalink award report block reply\nSkywise 3 points 19 hours ago ... duh? permalink award report block reply\nMySidesGoUp 3 points 19 hours ago The softball play by ‘Righty’ Fox News… He should have on a gay rodeo hat and satin kerchief around his neck.. permalink award report block reply BallsackPaneer 2 points 18 hours ago Is he interviewing Lindsey? permalink parent award report block reply\nBallsackPaneer 2 points 18 hours ago Is he interviewing Lindsey? permalink parent award report block reply\nSavingPrivateGrace 2 points 19 hours ago They propped Biden up and tare Trump down.  It's ridiculous.  A predominately 2 Party system creates rivalry and power struggles.  We're gonna have to cheat bigger than what we've been cheated out of. permalink award report block reply\nTheRedPilledArtist 2 points 19 hours ago It was about those SHAM elections we just had. Point blank. permalink award report block reply\nRichardCranium88 1 points 19 hours ago Politicians circling the wagons is nothing new. permalink award report block reply\nmass55th 1 points 18 hours ago Didn't know Brit was still on Fox News. Thought he might have retired by now. Haven't watched that channel or any news programming on any platform since Obama was selected in 2008. permalink award report block reply\nGoUSA 1 points 19 hours ago As opposed to every other second of every day since he started running for office permalink award report block reply\njcd_007 1 points 19 hours ago And then fucking losing. The Dems look like chumps. permalink award report block reply\nCrookedlamp 1 points 12 hours ago Yeah that’s why we did so great this past election… permalink award report block reply\nEstadosUnidosPrimero 1 points 19 hours ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T23:10:43.534658Z"
}