{
  "id": "8185277",
  "title": "77Muslims hated America long before Israel was created. Listen to Hitchensposted4 hours agobyThereis",
  "url": "https://patriots.win/p/1ARK9nOG9P/muslims-hated-america-long-befor/c",
  "content": "77 Muslims hated America long before Israel was created. Listen to Hitchens posted 4 hours ago by Thereisnogodbutgoat 15 comments award share report block Bosch Fawstin @TheBoschFawstin • 17h Despite what you hear, Muslims hated America long before the establishment of Israel, and Muslims have hated Jews for over a thousand years. And since no one was there to put the punk in his place, an old clip of Hitchens will have to do. America first faced Islam/Jihad in 1788.\n15 comments Sort by Top Top New Worst Old Save Around the Web From Hair Loss to Hair Boss in A Few Days. Try It! HaloGrow reversethefraud 14 points 4 hours ago All you have to do is read a little of the koran to understand this. Moslems are the best of mankind, and unbelievers (everyone else) is the worst of creatures (subhuman). permalink award report block reply South_Florida_Guy -1 points 3 hours ago I know another \"chosen\" group who thinks the same exact thing, weird! permalink parent award report block reply Wizard_Glick 12 points 4 hours ago Islam has been a cancer since it's inception... permalink award report block reply GottaSitStand 2 points 1 hour ago Especially in how the founder raped his child bride. Children should never be considered able to consent. permalink parent award report block reply Awakened 5 points 3 hours ago Yeah backward goat fuckers are savages. We shouldn't be bringing them here, but Jewish and Catholic groups can't get enough of bringing them here. permalink award report block reply RudeFrog 1 points 4 hours ago That's just them doing what they do that's not them hating American, there is a big difference permalink award report block reply BidensButtholeExam 1 points 2 hours ago How exactly has Israel helped?? permalink award report block reply GottaSitStand 1 points 1 hour ago Blood is spilt by the Israelis to prevent the rise of a new Islamic empire to replace the lost Ottoman Empire. Intelligence is shared to ensure their efforts to undermine American interests are less effective. Also, they test our toys and we get real combat analysis from the field without risking our lives. Bibi is insanely awful at many things including PR but there are real benefits to having a friendly nation constantly bombing the shit out of people who want us dead and have since before our nation was even created. A muslim is someone who reads the quran. An ex-muslim is someone who understands it. Islam is a government masquerading as a religion. It is not compatible with the constitutional republic in America. The muslims are outbreeding the rest of the world and taking over American cities in the process. Muslims in the middle east are also largely in incestuous marriages (70%). permalink parent award report block reply current_horror 1 points 3 hours ago Jews killed Christ 700 years before Islam existed. Does Islam control our government through an unregistered foreign influence organization that openly boasts about dominating our elections? Do you worry about wolves in the woods when there’s a traitor in your house? Hitchens was a godless retard who helped usher in Marxism by destroying Christianity in Europe. Now they have no defense against Islam. permalink award report block reply South_Florida_Guy 0 points 2 hours ago OP is an Israel first shill posting from Tel Aviv permalink parent award report block reply newestofnew -4 points 4 hours ago obfuscation propaganda post. there is a letter from bin laden saying al queda is the enemy of the USA because of our support of Israel. permalink award report block reply Thereisnogodbutgoat OP 7 points 4 hours ago Bin Laden was not alive in the 1700’s piss drinker permalink parent award report block reply newestofnew 0 points 4 hours ago neither were we. the muslims attacking us now say its because of our support of Israel. miggas calling card is an instant reaction of insults. that's who they really are, thinly veiled bullies. permalink parent award report block reply current_horror 4 points 3 hours ago Muslims would be attacking us regardless, but that doesn’t make them a bigger problem than AIPAC. permalink parent award report block reply Scipio_Americanus 1 points 2 hours ago Sure, that was Al Qaida's reason for hating the US, but the rest of the Muslim world hates us for being infidels. Not obfuscation in the least. You took an exception and tried to make it the rule. permalink parent award report block reply\nreversethefraud 14 points 4 hours ago All you have to do is read a little of the koran to understand this. Moslems are the best of mankind, and unbelievers (everyone else) is the worst of creatures (subhuman). permalink award report block reply South_Florida_Guy -1 points 3 hours ago I know another \"chosen\" group who thinks the same exact thing, weird! permalink parent award report block reply\nSouth_Florida_Guy -1 points 3 hours ago I know another \"chosen\" group who thinks the same exact thing, weird! permalink parent award report block reply\nWizard_Glick 12 points 4 hours ago Islam has been a cancer since it's inception... permalink award report block reply GottaSitStand 2 points 1 hour ago Especially in how the founder raped his child bride. Children should never be considered able to consent. permalink parent award report block reply\nGottaSitStand 2 points 1 hour ago Especially in how the founder raped his child bride. Children should never be considered able to consent. permalink parent award report block reply\nAwakened 5 points 3 hours ago Yeah backward goat fuckers are savages. We shouldn't be bringing them here, but Jewish and Catholic groups can't get enough of bringing them here. permalink award report block reply\nRudeFrog 1 points 4 hours ago That's just them doing what they do that's not them hating American, there is a big difference permalink award report block reply\nBidensButtholeExam 1 points 2 hours ago How exactly has Israel helped?? permalink award report block reply GottaSitStand 1 points 1 hour ago Blood is spilt by the Israelis to prevent the rise of a new Islamic empire to replace the lost Ottoman Empire. Intelligence is shared to ensure their efforts to undermine American interests are less effective. Also, they test our toys and we get real combat analysis from the field without risking our lives. Bibi is insanely awful at many things including PR but there are real benefits to having a friendly nation constantly bombing the shit out of people who want us dead and have since before our nation was even created. A muslim is someone who reads the quran. An ex-muslim is someone who understands it. Islam is a government masquerading as a religion. It is not compatible with the constitutional republic in America. The muslims are outbreeding the rest of the world and taking over American cities in the process. Muslims in the middle east are also largely in incestuous marriages (70%). permalink parent award report block reply\nGottaSitStand 1 points 1 hour ago Blood is spilt by the Israelis to prevent the rise of a new Islamic empire to replace the lost Ottoman Empire. Intelligence is shared to ensure their efforts to undermine American interests are less effective. Also, they test our toys and we get real combat analysis from the field without risking our lives. Bibi is insanely awful at many things including PR but there are real benefits to having a friendly nation constantly bombing the shit out of people who want us dead and have since before our nation was even created. A muslim is someone who reads the quran. An ex-muslim is someone who understands it. Islam is a government masquerading as a religion. It is not compatible with the constitutional republic in America. The muslims are outbreeding the rest of the world and taking over American cities in the process. Muslims in the middle east are also largely in incestuous marriages (70%). permalink parent award report block reply\ncurrent_horror 1 points 3 hours ago Jews killed Christ 700 years before Islam existed. Does Islam control our government through an unregistered foreign influence organization that openly boasts about dominating our elections? Do you worry about wolves in the woods when there’s a traitor in your house? Hitchens was a godless retard who helped usher in Marxism by destroying Christianity in Europe. Now they have no defense against Islam. permalink award report block reply South_Florida_Guy 0 points 2 hours ago OP is an Israel first shill posting from Tel Aviv permalink parent award report block reply\nSouth_Florida_Guy 0 points 2 hours ago OP is an Israel first shill posting from Tel Aviv permalink parent award report block reply\nnewestofnew -4 points 4 hours ago obfuscation propaganda post. there is a letter from bin laden saying al queda is the enemy of the USA because of our support of Israel. permalink award report block reply Thereisnogodbutgoat OP 7 points 4 hours ago Bin Laden was not alive in the 1700’s piss drinker permalink parent award report block reply newestofnew 0 points 4 hours ago neither were we. the muslims attacking us now say its because of our support of Israel. miggas calling card is an instant reaction of insults. that's who they really are, thinly veiled bullies. permalink parent award report block reply current_horror 4 points 3 hours ago Muslims would be attacking us regardless, but that doesn’t make them a bigger problem than AIPAC. permalink parent award report block reply Scipio_Americanus 1 points 2 hours ago Sure, that was Al Qaida's reason for hating the US, but the rest of the Muslim world hates us for being infidels. Not obfuscation in the least. You took an exception and tried to make it the rule. permalink parent award report block reply\nThereisnogodbutgoat OP 7 points 4 hours ago Bin Laden was not alive in the 1700’s piss drinker permalink parent award report block reply newestofnew 0 points 4 hours ago neither were we. the muslims attacking us now say its because of our support of Israel. miggas calling card is an instant reaction of insults. that's who they really are, thinly veiled bullies. permalink parent award report block reply current_horror 4 points 3 hours ago Muslims would be attacking us regardless, but that doesn’t make them a bigger problem than AIPAC. permalink parent award report block reply\nnewestofnew 0 points 4 hours ago neither were we. the muslims attacking us now say its because of our support of Israel. miggas calling card is an instant reaction of insults. that's who they really are, thinly veiled bullies. permalink parent award report block reply current_horror 4 points 3 hours ago Muslims would be attacking us regardless, but that doesn’t make them a bigger problem than AIPAC. permalink parent award report block reply\ncurrent_horror 4 points 3 hours ago Muslims would be attacking us regardless, but that doesn’t make them a bigger problem than AIPAC. permalink parent award report block reply\nScipio_Americanus 1 points 2 hours ago Sure, that was Al Qaida's reason for hating the US, but the rest of the Muslim world hates us for being infidels. Not obfuscation in the least. You took an exception and tried to make it the rule. permalink parent award report block reply",
  "fetched_at": "2025-11-12T19:30:16.306821Z"
}