{
  "id": "1ARK9iqffZ",
  "url": "https://patriots.win/p/1ARK9iqffZ/the-scale-of-the-bbcs-fraud-is-s/c",
  "content": "258 The scale of the BBC’s fraud is staggering. They took part of a sentence from early in President Trump’s speech, cut out 24 pages, and ended the quote with words from the very end. Even this picture barely captures the full extent of what they did. posted 2 days ago by Capoditutticapi1 7 comments award share report block Hans Mahncke @HansMahncke • 2d The scale of the BBC’s fraud is staggering. They took part of a sentence from early in President Trump’s speech, cut out 24 pages, and ended the quote with words from the very end. Even this picture barely captures the full extent of what they did.\n7 comments Sort by Top Top New Worst Old Save Roadpower 4 points 2 days ago For a publicly broadcasted  \"news\" organization that should be considered a criminal operation or event. They were very clearly defrauding people. It's an outright crime. permalink award report block reply impera 2 points 2 days ago And yet its still ranked towards the top of all the fake-news 'trusted sources'. Because of all the fact-checking and quality journalism! State media are the slime at the bottom of the cesspool, among the very worst of all of the fake news. permalink parent award report block reply Roadpower 2 points 2 days ago It's gullible fools who created this paradigm by being tolerant to it. I stopped watching TV over 25 years ago because I couldn't stomach their vile lying swill and even that took far too long as even as a young child watching black & white TV in the late 60's I was already noticing things... permalink parent award report block reply thelastlast 2 points 2 days ago sorry, are we punishing news organizations for lying now?  because i thought we had all agreed to just let them fuck the world of humans in the ass forever. permalink award report block reply Juzeza 2 points 2 days ago Sue them into irrelevance permalink award report block reply Choppermagic 2 points 2 days ago CBS thinks this is kid stuff.  they do worse every day permalink award report block reply OpusX 2 points 2 days ago Did they really believe that nobody would fact-check them? How desperate and out of touch could they possibly be to think this would go over well? permalink award report block reply\nRoadpower 4 points 2 days ago For a publicly broadcasted  \"news\" organization that should be considered a criminal operation or event. They were very clearly defrauding people. It's an outright crime. permalink award report block reply impera 2 points 2 days ago And yet its still ranked towards the top of all the fake-news 'trusted sources'. Because of all the fact-checking and quality journalism! State media are the slime at the bottom of the cesspool, among the very worst of all of the fake news. permalink parent award report block reply Roadpower 2 points 2 days ago It's gullible fools who created this paradigm by being tolerant to it. I stopped watching TV over 25 years ago because I couldn't stomach their vile lying swill and even that took far too long as even as a young child watching black & white TV in the late 60's I was already noticing things... permalink parent award report block reply\nimpera 2 points 2 days ago And yet its still ranked towards the top of all the fake-news 'trusted sources'. Because of all the fact-checking and quality journalism! State media are the slime at the bottom of the cesspool, among the very worst of all of the fake news. permalink parent award report block reply Roadpower 2 points 2 days ago It's gullible fools who created this paradigm by being tolerant to it. I stopped watching TV over 25 years ago because I couldn't stomach their vile lying swill and even that took far too long as even as a young child watching black & white TV in the late 60's I was already noticing things... permalink parent award report block reply\nRoadpower 2 points 2 days ago It's gullible fools who created this paradigm by being tolerant to it. I stopped watching TV over 25 years ago because I couldn't stomach their vile lying swill and even that took far too long as even as a young child watching black & white TV in the late 60's I was already noticing things... permalink parent award report block reply\nthelastlast 2 points 2 days ago sorry, are we punishing news organizations for lying now?  because i thought we had all agreed to just let them fuck the world of humans in the ass forever. permalink award report block reply\nJuzeza 2 points 2 days ago Sue them into irrelevance permalink award report block reply\nChoppermagic 2 points 2 days ago CBS thinks this is kid stuff.  they do worse every day permalink award report block reply\nOpusX 2 points 2 days ago Did they really believe that nobody would fact-check them? How desperate and out of touch could they possibly be to think this would go over well? permalink award report block reply",
  "fetched_at": "2025-11-12T22:49:54.354357Z"
}