{
  "id": "8185717",
  "title": "66JD Vance on H1-Bs literally a month ago: \"This idea that American citizens don't have the talent t",
  "url": "https://patriots.win/p/1ARK9nPczn/jd-vance-on-h1bs-literally-a-mon/c",
  "content": "73 JD Vance on H1-Bs literally a month ago: \"This idea that American citizens don't have the talent to do great things, that you have to import a foreign class of servants and... professors to do these things… I reject that.\" posted 1 hour ago by Thatunknownguy 10 comments award share report block Defiant L’s @DefiantLs • 27d JD Vance: \"This idea that American citizens don't have the talent to do great things, that you have to import a foreign class of servants and... professors to do these things… I reject that.\"\n10 comments Sort by Top Top New Worst Old Save TheJakeFroggy 16 points 1 hour ago He said this not even a month ago. I think he needs to have a talk with Trump. permalink award report block reply Trooph-Hurts 9 points 57 minutes ago Having worked in MFG for 45 years I can tell you H1B workers have ZERO to offer where we want MFG to go in America…. India and China are the most backwards places of low skill workers you can ever imagine….. they get the job done only through brute force…… they are dangerous, unsafe unskilled! ,,,,, the only thing they are is CHEAP permalink award report block reply RedStoneDeepState 1 points 9 minutes ago Yep. I have worked with skilled people in manufacturing who were immigrants... They are Israeli, Japanese, Korean, German or Soviet-Sphere. Not Indian, not Chinese. permalink parent award report block reply Trooph-Hurts 1 points 6 minutes ago Exactly!  Those countries aren’t going to let all their people leave to work here…. India and China and 3rd world countries have NOTHING TO OFFER permalink parent award report block reply RedStoneDeepState 1 points 1 minute ago The only jobs I have seen that Indians are good at is effectively numbers on paper. That is something to offer... But that can be in India. permalink parent award report block reply JBlaze056 6 points 33 minutes ago It is no coincidence why the same zionists going after Tucker are also going after JD.  That is likely their actual goal to either get him in line or get him off the ticket by 2028.  I think, and hope, the zionists are going to find themselves outside the party this time. permalink award report block reply Appeal2Heaven98 1 points 11 minutes ago For the last time, stop noticing. permalink parent award report block reply JBlaze056 1 points 8 minutes ago That may happen when I die, but definitely never before that time. permalink parent award report block reply sleepinggiant 2 points 34 minutes ago We have an h1b analyst.....dont listen to him permalink award report block reply blitzkrieg1 2 points 33 minutes ago This was posted and may help/ https://patriots.win/p/1ARK9nP4pY/trumps-remarks-explained/c permalink award report block reply Electricutie 1 points 12 minutes ago If this is the case, it needs to be clarified immediately. permalink parent award report block reply\nTheJakeFroggy 16 points 1 hour ago He said this not even a month ago. I think he needs to have a talk with Trump. permalink award report block reply\nTrooph-Hurts 9 points 57 minutes ago Having worked in MFG for 45 years I can tell you H1B workers have ZERO to offer where we want MFG to go in America…. India and China are the most backwards places of low skill workers you can ever imagine….. they get the job done only through brute force…… they are dangerous, unsafe unskilled! ,,,,, the only thing they are is CHEAP permalink award report block reply RedStoneDeepState 1 points 9 minutes ago Yep. I have worked with skilled people in manufacturing who were immigrants... They are Israeli, Japanese, Korean, German or Soviet-Sphere. Not Indian, not Chinese. permalink parent award report block reply Trooph-Hurts 1 points 6 minutes ago Exactly!  Those countries aren’t going to let all their people leave to work here…. India and China and 3rd world countries have NOTHING TO OFFER permalink parent award report block reply RedStoneDeepState 1 points 1 minute ago The only jobs I have seen that Indians are good at is effectively numbers on paper. That is something to offer... But that can be in India. permalink parent award report block reply\nRedStoneDeepState 1 points 9 minutes ago Yep. I have worked with skilled people in manufacturing who were immigrants... They are Israeli, Japanese, Korean, German or Soviet-Sphere. Not Indian, not Chinese. permalink parent award report block reply Trooph-Hurts 1 points 6 minutes ago Exactly!  Those countries aren’t going to let all their people leave to work here…. India and China and 3rd world countries have NOTHING TO OFFER permalink parent award report block reply RedStoneDeepState 1 points 1 minute ago The only jobs I have seen that Indians are good at is effectively numbers on paper. That is something to offer... But that can be in India. permalink parent award report block reply\nTrooph-Hurts 1 points 6 minutes ago Exactly!  Those countries aren’t going to let all their people leave to work here…. India and China and 3rd world countries have NOTHING TO OFFER permalink parent award report block reply RedStoneDeepState 1 points 1 minute ago The only jobs I have seen that Indians are good at is effectively numbers on paper. That is something to offer... But that can be in India. permalink parent award report block reply\nRedStoneDeepState 1 points 1 minute ago The only jobs I have seen that Indians are good at is effectively numbers on paper. That is something to offer... But that can be in India. permalink parent award report block reply\nJBlaze056 6 points 33 minutes ago It is no coincidence why the same zionists going after Tucker are also going after JD.  That is likely their actual goal to either get him in line or get him off the ticket by 2028.  I think, and hope, the zionists are going to find themselves outside the party this time. permalink award report block reply Appeal2Heaven98 1 points 11 minutes ago For the last time, stop noticing. permalink parent award report block reply JBlaze056 1 points 8 minutes ago That may happen when I die, but definitely never before that time. permalink parent award report block reply\nAppeal2Heaven98 1 points 11 minutes ago For the last time, stop noticing. permalink parent award report block reply JBlaze056 1 points 8 minutes ago That may happen when I die, but definitely never before that time. permalink parent award report block reply\nJBlaze056 1 points 8 minutes ago That may happen when I die, but definitely never before that time. permalink parent award report block reply\nsleepinggiant 2 points 34 minutes ago We have an h1b analyst.....dont listen to him permalink award report block reply\nblitzkrieg1 2 points 33 minutes ago This was posted and may help/ https://patriots.win/p/1ARK9nP4pY/trumps-remarks-explained/c permalink award report block reply Electricutie 1 points 12 minutes ago If this is the case, it needs to be clarified immediately. permalink parent award report block reply\nElectricutie 1 points 12 minutes ago If this is the case, it needs to be clarified immediately. permalink parent award report block reply"
}