{
  "id": "1ARK52B9xW",
  "url": "https://patriots.win/p/1ARK52B9xW/finally-learning-something-about/c",
  "content": "341 🍿Finally Learning Something About Consequences!🍿 posted 6 days ago by ncswicn 13 comments award share download report block\n13 comments Sort by Top Top New Worst Old Save SavingPrivateGrace 15 points 6 days ago We knew it was a Tranny. permalink award report block reply ncswicn OP 7 points 6 days ago Oh yeah! permalink parent award report block reply tuaris 11 points 6 days ago It's it a troon? permalink award report block reply 1True-translation 9 points 6 days ago Un-front-holed entity you bigot! permalink parent award report block reply Crappydatum 5 points 6 days ago Troon goon permalink award report block reply 5DchessWatch 3 points 6 days ago Troon goon Justin Calhoon aka DJ Jaltroon star of the new anime One punch tran permalink parent award report block reply ncswicn OP 5 points 6 days ago https://truthsocial.com/@ronaldspeaks/posts/115503634046165776 permalink award report block reply Steve56775 2 points 6 days ago The best lesson he ever learned in college. permalink award report block reply ncswicn OP 1 points 5 days ago Yup! Probably the ONLY lesson of value learned in college! permalink parent award report block reply Trump2024 2 points 6 days ago Not what I stereotypically think of when I hear the name \"Justin Calhoon' permalink award report block reply 5DchessWatch 1 points 6 days ago Justin permalink award report block reply deleted 1 points 6 days ago imnotdeadyet 2 points 6 days ago Was \"It\" suspended from School? permalink parent award report block reply\nSavingPrivateGrace 15 points 6 days ago We knew it was a Tranny. permalink award report block reply ncswicn OP 7 points 6 days ago Oh yeah! permalink parent award report block reply\nncswicn OP 7 points 6 days ago Oh yeah! permalink parent award report block reply\ntuaris 11 points 6 days ago It's it a troon? permalink award report block reply 1True-translation 9 points 6 days ago Un-front-holed entity you bigot! permalink parent award report block reply\n1True-translation 9 points 6 days ago Un-front-holed entity you bigot! permalink parent award report block reply\nCrappydatum 5 points 6 days ago Troon goon permalink award report block reply 5DchessWatch 3 points 6 days ago Troon goon Justin Calhoon aka DJ Jaltroon star of the new anime One punch tran permalink parent award report block reply\n5DchessWatch 3 points 6 days ago Troon goon Justin Calhoon aka DJ Jaltroon star of the new anime One punch tran permalink parent award report block reply\nncswicn OP 5 points 6 days ago https://truthsocial.com/@ronaldspeaks/posts/115503634046165776 permalink award report block reply\nSteve56775 2 points 6 days ago The best lesson he ever learned in college. permalink award report block reply ncswicn OP 1 points 5 days ago Yup! Probably the ONLY lesson of value learned in college! permalink parent award report block reply\nncswicn OP 1 points 5 days ago Yup! Probably the ONLY lesson of value learned in college! permalink parent award report block reply\nTrump2024 2 points 6 days ago Not what I stereotypically think of when I hear the name \"Justin Calhoon' permalink award report block reply\n5DchessWatch 1 points 6 days ago Justin permalink award report block reply\ndeleted 1 points 6 days ago imnotdeadyet 2 points 6 days ago Was \"It\" suspended from School? permalink parent award report block reply\nimnotdeadyet 2 points 6 days ago Was \"It\" suspended from School? permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:05:06.772541Z"
}