{
  "id": "8173379",
  "title": "1481Here’s what actually happened at Illinois daycare — Democrat is lying.posted5 days agobykinbergf",
  "url": "https://patriots.win/p/1ARK54SUxt/heres-what-actually-happened-at-/c",
  "content": "1481 Here’s what actually happened at Illinois daycare — Democrat is lying. posted 5 days ago by kinbergfan 142 comments award share report block Homeland Security @DHSgov • 7d Congressman, you are deliberately misrepresenting the facts. ICE law enforcement did NOT target a daycare and were only at this location because the female illegal alien fled inside. Here is the real story: Officers attempted to conduct a targeted traffic stop of this female Mike Quigley @RepMikeQuigley • 7d ICE isn’t going after the worst of the worst. This morning, they took a preschool teacher without a warrant IN FRONT OF CHILDREN in my district. #ice #chicago\n142 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Lol_Garrus 204 points 5 days ago First, she fled ICE in a chase and tried to flee into a daycare hoping to use the kids of metaphorical shields. Second, I want ICE to capture every illegal. I don't want them to just capture \"the worst of the worst.\" Every illegal must go. permalink award report block reply Formerlurker92 112 points 5 days ago Yup. And their kids. permalink parent award report block reply BeauHD 75 points 5 days ago And their little dog too! permalink parent award report block reply BoatingAccident 42 points 5 days ago Don’t forget Abuela! permalink parent award report block reply The_Return_of_User_x 1 points 5 days ago Piss on her... Piss on all of them illegals! There not citizens... They are not protected from cruel and unusual punishment. permalink parent award report block reply view 2 more comments... zooty 11 points 5 days ago No wiener is illegal! permalink parent award report block reply Filo76 10 points 5 days ago Haitis don’t have and dogs or cats. I’m not sure why. 🤔 permalink parent award report block reply SquiggyMcPepe 2 points 5 days ago Something something tasty treats something something. permalink parent award report block reply Hikedelics 6 points 5 days ago Fair, but what about all the people who aided and abetted these criminals? Let’s get them the fuck out of here with the illegals, their kids and their dogs too. permalink parent award report block reply Redeemable 3 points 5 days ago Just don't send the dogs back with the illegal Chinese. permalink parent award report block reply henri_derelicte 30 points 5 days ago Especially their kids (anchor babies) permalink parent award report block reply Viewer01 63 points 5 days ago I don’t care if they catch these people at their abuelas funeral. I’m so beyond optics at this point. Get it done however whenever. permalink parent award report block reply Electrocutioner 21 points 5 days ago I don't know why it isn't done already. Activate the national guard and do a massive nationwide sweep already. Arrest and prosecute anyone interfering like you would any other time and get the job done. At the rate they are going, its going to turn into what every single other government position becomes: permanent. If we only deport so many each year they get to keep the grift going and always have job security. permalink parent award report block reply Viewer01 15 points 5 days ago I’m about to start asking how the Nazis could have rounded up more Jews over the same time period despite less tech and less of them. That’ll really get aipac sweating. permalink parent award report block reply Coover -1 points 5 days ago We know, that you know, and we all know how it was done.   Straight to the point permalink parent award report block reply view 1 more comments... ColonelKlink 2 points 5 days ago I want to see the politicians that used taxpayer money that  facilitated this invasion and gave them welfare in prison. permalink parent award report block reply rebuildingMyself 6 points 5 days ago Yeah as the left has shown us, they will defend thugs and gang members shamelessly so there is no compromise with these people permalink parent award report block reply Shitsbrokeyo 2 points 5 days ago Exactly, no limits. Hospital, school, grocery, shitter. Open season with bounties and letters of marquee. If you can't speak or read English, you are not being profiled. You're being identified. This is America have an official language.\nAnd as far as profiling, do it. Isreal has the safest airport just because of this. permalink parent award report block reply penguinjay1212 1 points 5 days ago Shoot, I think they should be seiging abuela funerals en masse already. permalink parent award report block reply HawkDriverMN 25 points 5 days ago Sounds like she is the worst of the worst. permalink parent award report block reply Lol_Garrus 18 points 5 days ago Yup. She runs into the daycare hoping to use the kids as a figurative shield. permalink parent award report block reply Rob_Belmonte 2 points 5 days ago \"Literal\" shield probably. permalink parent award report block reply AllisterTwo 4 points 5 days ago She is wanted for paying smugglers to smuggle her two children into the US last month, both them children are no in a government detention area as unaccompanied minors... In my world abandoning your children, then paying a complete stranger to illegally smuggle them into the US is a pretty serious crime!  Add on to it the fact that she literally, like literally just attempted to use children as a shield from being arrested putting all those kids in harms way, yeah she is solidly on the worst side of the scale! permalink parent award report block reply imnotdeadyet 15 points 5 days ago They are reporting she worked at the Day Care.  The question is how did an illegal register a car, get a license and a job?  Time to start arresting politicans for allow this to happen! permalink parent award report block reply AllisterTwo 2 points 5 days ago Biden apparently gave her a work permit, even though she had no legal status... permalink parent award report block reply Pnw4gotpwd 4 points 5 days ago We actually don't fully know what her plans were. It could have been much worse. She could have been planning to use them as human shields or hostages. permalink parent award report block reply load 12 more comments... 26magarat 48 points 5 days ago How is it unacceptably illegal if the person is already illegal? I don't get this logic. permalink award report block reply cock_pushups 13 points 5 days ago Because they aren't white and we are racist for not giving them free rides off our backs. permalink parent award report block reply LearnAboutRoaches 3 points 5 days ago How Daaaaare You!! It's because IN FRONT OF CHILDREN permalink parent award report block reply thisisatestof2 42 points 5 days ago Wait, so the Democrat just saw the video, assumed it was a teacher and threw it out on the Internet. I’m shocked, shocked I tell you!  Turns out not a lot actually happened, and not only really illegal, they tried to use a daycare to hide, making it even worse. permalink award report block reply SwedishChainsaw2 30 points 5 days ago I don't care if it WAS a teacher. Deport all illegals ASAP. Operation Wetback II permalink parent award report block reply Paleo 19 points 5 days ago He wants unvetted illegals working with our kids? permalink parent award report block reply Electrocutioner 8 points 5 days ago Considering that they were pushing hard and could have reached their ultimate goal of being able to legally fuck children just a few years ago, do you think it matters to them? permalink parent award report block reply zooty 5 points 5 days ago Legal aliens have to prove they have no criminal record that would preclude them from entry. Nobody should be allowed entry without that. Put valid asylum seekers (the huge majority aren't) in camps or on an island until they can be vetted. permalink parent award report block reply White-tailed_Eagle 5 points 5 days ago If that illegal alien was actually working as a teacher, then the void left by their deportation would be filled by an American. So ICE is creating jobs all over the country. permalink parent award report block reply Wallllllllllllllllll 2 points 5 days ago Operation Went Back permalink parent award report block reply EmptyNoose 1 points 5 days ago Totally agree. Never apologize, response shall be we will get you anywhere. If you died here as an illegal we will rip you out of your grave and send you home. They have all taken too much and still hate us. permalink parent award report block reply Electrocutioner 9 points 5 days ago The truth doesn't matter when propagandizing. Just like news corps, throwing out the first take, even if its wildly wrong, and then offer a retraction in some obscure way days later when the emotional hysterics have already taken root. permalink parent award report block reply MissingTrump 28 points 5 days ago A demon rat lied? Noooo! Gaslighting pieces of shit catering to their low IQ voters. That's all they are. permalink award report block reply South_Florida_Guy 22 points 5 days ago The words on the outside of the daycare are in Spanish, they should actually raid that place too anyway while they're there just to be safe. permalink award report block reply ianpatrick1966 9 points 5 days ago Exactly permalink parent award report block reply icecreamheadache 9 points 5 days ago And she is screeching in Spanish as well, that doesn't make it look like she is an American. permalink parent award report block reply DestroyerofCobwebs 21 points 5 days ago I wish they WOULD go after daycares.  I hate the 'worst of the worst' strategy, it emboldens everyone else to believe they can stay. Raid daycares.  Snatch grandmas off the street.  Create fear in the illegal community at the maximum rate possible, so they pick up their shit and fucking leave on their own. permalink award report block reply worldowedexplanation 1 points 5 days ago YES permalink parent award report block reply cd3dog 16 points 5 days ago A democrat congressman lying??  Say it ain't so. permalink award report block reply 556x45mm 2 points 5 days ago Maybe he will apologize and then he can be canceled..... is that how it works? permalink parent award report block reply tt777 1 points 5 days ago No, he's probably angling for running for senator in Illinois. permalink parent award report block reply SteelDriver 14 points 5 days ago They also don’t need a warrant to arrest an illegal alien since the illegal alien is in the act of breaking the law.  It’s kind of like how law enforcement officers don’t need a warrant to arrest a bank robber while they’re robbing a bank. permalink award report block reply henri_derelicte 6 points 5 days ago It also means all arrests are criminal enforcement, so any signs/statements by state and local government against civil immigration enforcement are virtue signaling permalink parent award report block reply thehinac PRO 11 points 5 days ago Why the Dems don't like X. permalink award report block reply HellNoKameltoe 8 points 5 days ago Democrat is lying - so it's a day ending in \"y\" permalink award report block reply Prandogolio 2 points 5 days ago Sue them for a billion dollars every time. permalink parent award report block reply 3stepsahead 7 points 5 days ago Im sorry, dont these Congressman take an oath to uphold the constitution?  Isnt he in violation of that oath?  Are there NO fucking consequences for anything anymore? permalink award report block reply ragnarokrobo 6 points 5 days ago No, there aren't. permalink parent award report block reply Trump4Infinity 4 points 5 days ago (D)epends permalink parent award report block reply Prandogolio 2 points 5 days ago Not for communists permalink parent award report block reply berserkerbarrage 6 points 5 days ago Who cares? ICE should raid and shut down the entire daycare if they're hiring illegal aliens to be teachers. Foreign criminals who do not respect our borders and our laws should not be teaching children. permalink award report block reply henri_derelicte 6 points 5 days ago The administration is facing heavy resistance from the district courts, state and local government, as well as the people themselves with respect to immigration enforcement in and around Chicago. You have unelected Obama/Biden judges determining that ICE and the Border Patrol is “lying” about their depiction of events, and disinformation as you’re seeing here when it comes to people getting arrested. If there was ever a case to invoke the Insurrection Act, send in federal troops to arrest elected officials (including federal judges) to restore order, it’s here. permalink award report block reply blue5707 5 points 5 days ago All I care about is she gets a lifetime ban from EVER re-entering the US, in the future. permalink award report block reply henri_derelicte 3 points 5 days ago If what leftists are saying about conditions in ICE detention facilities are remotely true, these criminal scumbags are getting their just desserts permalink parent award report block reply Bearing51 5 points 5 days ago ICE don't need a warrant to arrest illegal aliens, do they? permalink award report block reply henri_derelicte 8 points 5 days ago Do you need a warrant to arrest someone in the process of robbing a bank? Of course not. Your probable cause is right in front of you. Their mere presence in the US is a criminal act. These agents have tools to help them figure out who to look for and where they’re at. It’s when the illegals start running/resisting that helps establish probable cause permalink parent award report block reply zooty 4 points 5 days ago Getting elected to public office is a popularity contest, not an intelligence test. permalink parent award report block reply OTher55 5 points 5 days ago His big problem seems to be it happened in front of kids. Does he get as upset when a Dem Representative in Louisiana with kids in the car gets pulled over and arrested for DUI and child endangerment? Oh, oops, there's kids here. Welp, guess we can't arrest you now. https://www.wdsu.com/article/louisiana-state-rep-kyle-green-arrest-dwi-child-endangerment/64840408 permalink award report block reply SteelBallRun1890 7 points 5 days ago They don't care either if a drag or troon gets naked in front of children for ego or money, in fact they enjoy it. The \"bUt Th1nK oF tHe Ch1LdrEn!!1!\" card expired long ago for them. permalink parent award report block reply Prandogolio 3 points 5 days ago His big problem is that his voters are getting deported. permalink parent award report block reply cptkloss5 4 points 5 days ago don't care if they go into daycares to remove illegals...all the same permalink award report block reply MissileToad 4 points 5 days ago GASP! IN FRONT OF CHILDREN??! OH NOO!!\nHow many CHILDREN did you and your Dems get butchered in the womb last week? How about the ones you try to sterilize and mutilate after you  gaslight about being born in the \"wrong\" body? Tell me about CHILDREN, Mike. permalink award report block reply Prandogolio 5 points 5 days ago I'm gonna take my kid with me to rob a bank.  That way, the cops can't do anything. permalink parent award report block reply White-tailed_Eagle 2 points 5 days ago Do not give the left ideas. permalink parent award report block reply Treefiddydiddy 4 points 5 days ago lies get halfway round the world before truth has time to get it's trousers on permalink award report block reply n4freedom 3 points 5 days ago Who cares either way.  Illegal = go back permalink award report block reply BadBrainsBuzzcocks 3 points 5 days ago The news is full of these ridiculously specious sob stories. I've gotten into the habit of going straight to the comments and the good news is regardless of the leftist news site or how pathetic they pander about poor fat illiterate non-english speaking Juanita and her gangbanging kids and criminal rapist boyfriend, the comments are easily 2 to 4X in favor of ICE; \"too bad not sad - get the fuck out\" permalink award report block reply FromTheTopRope 3 points 5 days ago Human shields. ICE shouldn't have to only go after the \"worst of the worst\" and should also go after the \"best of the best\" because there is no such thing as 'good illegal immigration'. permalink award report block reply CoffeeIsForClosers 3 points 5 days ago By this logic, we can all agree that it's okay to bomb Doctors without Borders since they aided a terrorist. HAHAHA permalink award report block reply BLMTrying2GetUrGuns 3 points 5 days ago She tried to use children as shields? Surprising....she doesn't look Muslim! permalink award report block reply MemeWarsVet 3 points 5 days ago without a warrant They don't need one. Even I'd they had a warrant, you would still cry like the sour milk sucking little bitch you are. permalink award report block reply Ligersrule1 3 points 5 days ago Everything with democrats are fake and gay permalink award report block reply Choppermagic 3 points 5 days ago still a criminal and using kids as human shields permalink award report block reply Law_Sam 3 points 5 days ago Don’t care they all need to go home and make their countries great  if they are illegally here they need to go. permalink award report block reply Wallllllllllllllllll 3 points 5 days ago They love this argument. \"...but you said you would only target the worst of the worst.\" Nah. Trump said worst would be first, self-deport now, you have to go back. It's been a year since the election. We are past the first stages of the largest mass deportation effort in history. All illegal aliens would be wise to self deport. You have to go back. ICE is well funded and growing. America is ramping up deportations and shipping these foos outta here. Get out of our country. Go home and fix your own country. permalink award report block reply UltraMagaWA 3 points 5 days ago Don't forget to deport her spawns if she has some permalink award report block reply terribletwos 3 points 5 days ago Who gives a fuck. Shut down the daycare and deport all the children too. Stop playing THEIR game fucking retarded fucks. You let them set the conversation and wonder why everything is so hard. permalink award report block reply MAGA-2028 3 points 5 days ago They need to start arresting the masked antifa that are pretending to be ICE. We’ve been targeting them one by one but the national guard needs to round them up. permalink award report block reply POTUS_DonnieJ 2 points 5 days ago Why do we continue to let our elected representatives knowingly and blatantly lie to us? Frankly I've maintained that government officials, be they elected (including candidates), appointed or hired, shouldn't be offered the same constitutional protections as private citizens. You shouldn't get to claim 1st Amendment while knowingly lying to the people to advance your agenda (this fucker right here, or Schiff claiming he has evidence of Russian collusion, and yes, even Bondi saying she has Epstein's files on her desk). You shouldn't get to claim the 5th if you're caught doing something bad while acting in an official capacity and are brought to testify (think Clinton pleading the 5th about her emails or Fauci about his kickbacks). Don't like it? Easy solution, don't go into government, remain a private citizens with the full protection of the Constitution and the Bill of Rights. permalink award report block reply Bramage 2 points 5 days ago Hey mikey, you faggot lying fuck, buzz off. permalink award report block reply indigo_truther 2 points 5 days ago ICE heroically saves children when fugitive bursts into daycare permalink award report block reply ravonaf 2 points 5 days ago We live in a world where people in power lie and no one cares. You absolutely can not have a free country when anyone can say anything they want with authority and millions believe the lie. I can not see how this can be fixed. As far as I can see, this experiment in a free Republic has failed. We might as well wipe the board and start over from scratch. I see no other way. permalink award report block reply 2Clutch 2 points 5 days ago I wouldn't have given a shit if they did snatch her ass out of a daycare iN frOnT oF cHiLDrEN while she was working there. Deport the fuck out of her. permalink award report block reply cosmos411 2 points 5 days ago Unfortunately ... A Lie Can Travel Halfway Around the World While the Truth Is Putting On Its Shoes permalink award report block reply MythArcana 2 points 5 days ago What? A democrat spreading propaganda? Now that's rare.  🙄 permalink award report block reply RedditStillSucks 2 points 5 days ago I always wonder how liberals fall for such absolute BS. Then I remember all the retards on this website that still believe Scott Pressler isn't a grifter. permalink award report block reply henri_derelicte 2 points 5 days ago TBH, liberals are more susceptible to fake news than we are permalink parent award report block reply RedditStillSucks 2 points 5 days ago Very true. Some of them still believe in Global warming and that masks worked! permalink parent award report block reply worldowedexplanation 1 points 5 days ago I don’t even care if they took a teacher in front of children. GOOD. Here illegally? Make an example out of them, they’re breaking the fucking LAW. Remember laws, anyone? permalink award report block reply surgeriot 1 points 5 days ago Too late, he already lied and no consequences will happen why thousands of people blindly believe what he said. Because we don't have the mechanism in place to remove news like this when it's blatantly proven false. permalink award report block reply Aoikaze2000 1 points 5 days ago Maybe we should let them think ICE is the new boogeyman? permalink award report block reply zooty 1 points 5 days ago Oh no, someone breaking the law arrested in front of children! Whatev.... hold on. That's exactly what I want. Good lesson. permalink award report block reply mcoulton 1 points 5 days ago Seems like she was working there and they knew she would be there and she ran inside, isn’t the issue tat a “worst of the worst” is taking care of children permalink award report block reply asiatrails 1 points 5 days ago Illegal, runs away from ICE, ICE follows and captures. The Demonkrat who now has Rahm Emanuel's seat howls in protest, probably wants to set up a margarita date with her. permalink award report block reply 2016TrumpMAGA 1 points 5 days ago I.  Do.  Not.  Care. I don't care if they went in there guns blazing, as long as they nabbed the illegal. permalink award report block reply Keiichi81 1 points 5 days ago All day yesterday, the media was painting this as an angelic little school teacher who was in the middle of teaching class when evil white supremacist ICE agents burst in and dragged her out of the classroom at gunpoint in front of her sobbing schoolchildren. Now I find out not only was it not a school, not only was she never in a classroom, but she wasn't even an employee there and was instead a potentially dangerous fugitive who tried to gain entry to and hide inside a daycare while fleeing arrest. I'm sure if scared children were even present (which is a big \"if\" at this point) then they were probably just crying out of fear of some stranger trying to break in. Will the media be forced to issue a correction for the false coverage? Just kidding, we all know it'll never even be mentioned. permalink award report block reply IAmDisappoint 1 points 5 days ago Awww but it made such a nice headline! Now, how are they going to call ICE fascists over this? permalink award report block reply 95Rockytoby95 1 points 5 days ago Quigley is gay. And a liar. permalink award report block reply Oodles 1 points 5 days ago These are the exact pieces of shit illegals we need deported immediately permalink award report block reply someguy7738 1 points 5 days ago Always the same shit from the left. It could have been a registered sex offender working as a teacher under false pretenses in order to molest children and they'd still whine about it \"ERMAGERD they arrested a TEACHER in front of CHILDREN!!!\" permalink award report block reply ltbadpuppy 1 points 5 days ago Democrats already found out via the 'both sides' lie that even if there is video evidence of the event proving the leftist narrative is a lie, if they repeat the lie enough their base will simply believe them. permalink award report block reply Beat_to_Quarters 1 points 5 days ago Democrats using the Hamas public relations playbook. permalink award report block reply Lunatic_Fringe_PhD 1 points 5 days ago Congresspeople LIE!?!?! I'm SHOCKED permalink award report block reply DoMagnum 1 points 5 days ago Dem pols lie because they have trained their intended audience to believe only lies and reflexively reject truth like a psychological gag reflex. permalink award report block reply AmannamedRJ 1 points 5 days ago Democrats just elected a man who wanted to kill his opponent and his opponents children right on the heels of a man being assassinated in front of his children And they mocked that man and his wife and his children ruthlessly. Frankly, kill yourself if you're offended by this. Fuck your fake outrage. permalink award report block reply TheSonOfGadsden 1 points 5 days ago A democrat lying? What a surprise permalink award report block reply ERIC_CIARAMELLA 1 points 5 days ago Fucking mic drop.  Hell yeah. permalink award report block reply fjzappa 1 points 5 days ago Democrat is lying. And the sky is blue. permalink award report block reply ThouShallNotSteal 1 points 5 days ago Mike Quigley sounds like a quad vaxxed fucking faggot. Fuck him. permalink award report block reply JBlaze056 1 points 5 days ago \"deliberately misrepresenting the facts\" is a requirement for congress. permalink award report block reply BoDude 1 points 5 days ago Nice Every one of them permalink award report block reply Thep1mp 1 points 5 days ago Who cares. If the kids are illegal deport them and their parent. Let the anchor babies anchor in Mexico permalink award report block reply Double_O 1 points 5 days ago Congressman, you are deliberately misrepresenting the facts. <-- so I can find this in my history.. permalink award report block reply AliceCooperBiden 1 points 5 days ago Hopefully they checked the kids as well. Send them and their parents back if they’re illegal. permalink award report block reply FredRedd 1 points 5 days ago Hey Quigley, how exactly was a car -IN YOUR DISTRICT - \"registered to a female illegal alien?\" Like, how does that work exactly? An illegal alien shouldn't have documents that would make them eligible to buy, much less register, a car. How'd THAT go down in your district? permalink award report block reply throttlejohnson 1 points 5 days ago tbh, i wouldn't care if they did roll up to the daycare and pull her out kicking and screaming. permalink award report block reply PearlyGaits57 1 points 5 days ago Media yet again, embelishes/lies, about the real truth. Media is asshoe! permalink award report block reply ElectionMeddler 1 points 5 days ago So a criminal was trying to turn it into a hostage scenario?  The daycare should have a buzzer entry to prevent criminals from coming off the street permalink award report block reply Greenhills 1 points 5 days ago Never resist arrest. permalink award report block reply AwShitHereWeGoAgain 0 points 5 days ago A kid-fucking Congressman was lying.... the hell you say!!!!!!!!!!!!! permalink award report block reply\nLol_Garrus 204 points 5 days ago First, she fled ICE in a chase and tried to flee into a daycare hoping to use the kids of metaphorical shields. Second, I want ICE to capture every illegal. I don't want them to just capture \"the worst of the worst.\" Every illegal must go. permalink award report block reply Formerlurker92 112 points 5 days ago Yup. And their kids. permalink parent award report block reply BeauHD 75 points 5 days ago And their little dog too! permalink parent award report block reply BoatingAccident 42 points 5 days ago Don’t forget Abuela! permalink parent award report block reply The_Return_of_User_x 1 points 5 days ago Piss on her... Piss on all of them illegals! There not citizens... They are not protected from cruel and unusual punishment. permalink parent award report block reply view 2 more comments... zooty 11 points 5 days ago No wiener is illegal! permalink parent award report block reply Filo76 10 points 5 days ago Haitis don’t have and dogs or cats. I’m not sure why. 🤔 permalink parent award report block reply SquiggyMcPepe 2 points 5 days ago Something something tasty treats something something. permalink parent award report block reply Hikedelics 6 points 5 days ago Fair, but what about all the people who aided and abetted these criminals? Let’s get them the fuck out of here with the illegals, their kids and their dogs too. permalink parent award report block reply Redeemable 3 points 5 days ago Just don't send the dogs back with the illegal Chinese. permalink parent award report block reply henri_derelicte 30 points 5 days ago Especially their kids (anchor babies) permalink parent award report block reply Viewer01 63 points 5 days ago I don’t care if they catch these people at their abuelas funeral. I’m so beyond optics at this point. Get it done however whenever. permalink parent award report block reply Electrocutioner 21 points 5 days ago I don't know why it isn't done already. Activate the national guard and do a massive nationwide sweep already. Arrest and prosecute anyone interfering like you would any other time and get the job done. At the rate they are going, its going to turn into what every single other government position becomes: permanent. If we only deport so many each year they get to keep the grift going and always have job security. permalink parent award report block reply Viewer01 15 points 5 days ago I’m about to start asking how the Nazis could have rounded up more Jews over the same time period despite less tech and less of them. That’ll really get aipac sweating. permalink parent award report block reply Coover -1 points 5 days ago We know, that you know, and we all know how it was done.   Straight to the point permalink parent award report block reply view 1 more comments... ColonelKlink 2 points 5 days ago I want to see the politicians that used taxpayer money that  facilitated this invasion and gave them welfare in prison. permalink parent award report block reply rebuildingMyself 6 points 5 days ago Yeah as the left has shown us, they will defend thugs and gang members shamelessly so there is no compromise with these people permalink parent award report block reply Shitsbrokeyo 2 points 5 days ago Exactly, no limits. Hospital, school, grocery, shitter. Open season with bounties and letters of marquee. If you can't speak or read English, you are not being profiled. You're being identified. This is America have an official language.\nAnd as far as profiling, do it. Isreal has the safest airport just because of this. permalink parent award report block reply penguinjay1212 1 points 5 days ago Shoot, I think they should be seiging abuela funerals en masse already. permalink parent award report block reply HawkDriverMN 25 points 5 days ago Sounds like she is the worst of the worst. permalink parent award report block reply Lol_Garrus 18 points 5 days ago Yup. She runs into the daycare hoping to use the kids as a figurative shield. permalink parent award report block reply Rob_Belmonte 2 points 5 days ago \"Literal\" shield probably. permalink parent award report block reply AllisterTwo 4 points 5 days ago She is wanted for paying smugglers to smuggle her two children into the US last month, both them children are no in a government detention area as unaccompanied minors... In my world abandoning your children, then paying a complete stranger to illegally smuggle them into the US is a pretty serious crime!  Add on to it the fact that she literally, like literally just attempted to use children as a shield from being arrested putting all those kids in harms way, yeah she is solidly on the worst side of the scale! permalink parent award report block reply imnotdeadyet 15 points 5 days ago They are reporting she worked at the Day Care.  The question is how did an illegal register a car, get a license and a job?  Time to start arresting politicans for allow this to happen! permalink parent award report block reply AllisterTwo 2 points 5 days ago Biden apparently gave her a work permit, even though she had no legal status... permalink parent award report block reply Pnw4gotpwd 4 points 5 days ago We actually don't fully know what her plans were. It could have been much worse. She could have been planning to use them as human shields or hostages. permalink parent award report block reply load 12 more comments...\nFormerlurker92 112 points 5 days ago Yup. And their kids. permalink parent award report block reply BeauHD 75 points 5 days ago And their little dog too! permalink parent award report block reply BoatingAccident 42 points 5 days ago Don’t forget Abuela! permalink parent award report block reply The_Return_of_User_x 1 points 5 days ago Piss on her... Piss on all of them illegals! There not citizens... They are not protected from cruel and unusual punishment. permalink parent award report block reply view 2 more comments... zooty 11 points 5 days ago No wiener is illegal! permalink parent award report block reply Filo76 10 points 5 days ago Haitis don’t have and dogs or cats. I’m not sure why. 🤔 permalink parent award report block reply SquiggyMcPepe 2 points 5 days ago Something something tasty treats something something. permalink parent award report block reply Hikedelics 6 points 5 days ago Fair, but what about all the people who aided and abetted these criminals? Let’s get them the fuck out of here with the illegals, their kids and their dogs too. permalink parent award report block reply Redeemable 3 points 5 days ago Just don't send the dogs back with the illegal Chinese. permalink parent award report block reply henri_derelicte 30 points 5 days ago Especially their kids (anchor babies) permalink parent award report block reply\nBeauHD 75 points 5 days ago And their little dog too! permalink parent award report block reply BoatingAccident 42 points 5 days ago Don’t forget Abuela! permalink parent award report block reply The_Return_of_User_x 1 points 5 days ago Piss on her... Piss on all of them illegals! There not citizens... They are not protected from cruel and unusual punishment. permalink parent award report block reply view 2 more comments... zooty 11 points 5 days ago No wiener is illegal! permalink parent award report block reply Filo76 10 points 5 days ago Haitis don’t have and dogs or cats. I’m not sure why. 🤔 permalink parent award report block reply SquiggyMcPepe 2 points 5 days ago Something something tasty treats something something. permalink parent award report block reply Hikedelics 6 points 5 days ago Fair, but what about all the people who aided and abetted these criminals? Let’s get them the fuck out of here with the illegals, their kids and their dogs too. permalink parent award report block reply Redeemable 3 points 5 days ago Just don't send the dogs back with the illegal Chinese. permalink parent award report block reply\nBoatingAccident 42 points 5 days ago Don’t forget Abuela! permalink parent award report block reply The_Return_of_User_x 1 points 5 days ago Piss on her... Piss on all of them illegals! There not citizens... They are not protected from cruel and unusual punishment. permalink parent award report block reply view 2 more comments...\nThe_Return_of_User_x 1 points 5 days ago Piss on her... Piss on all of them illegals! There not citizens... They are not protected from cruel and unusual punishment. permalink parent award report block reply view 2 more comments...\nzooty 11 points 5 days ago No wiener is illegal! permalink parent award report block reply\nFilo76 10 points 5 days ago Haitis don’t have and dogs or cats. I’m not sure why. 🤔 permalink parent award report block reply SquiggyMcPepe 2 points 5 days ago Something something tasty treats something something. permalink parent award report block reply\nSquiggyMcPepe 2 points 5 days ago Something something tasty treats something something. permalink parent award report block reply\nHikedelics 6 points 5 days ago Fair, but what about all the people who aided and abetted these criminals? Let’s get them the fuck out of here with the illegals, their kids and their dogs too. permalink parent award report block reply\nRedeemable 3 points 5 days ago Just don't send the dogs back with the illegal Chinese. permalink parent award report block reply\nhenri_derelicte 30 points 5 days ago Especially their kids (anchor babies) permalink parent award report block reply\nViewer01 63 points 5 days ago I don’t care if they catch these people at their abuelas funeral. I’m so beyond optics at this point. Get it done however whenever. permalink parent award report block reply Electrocutioner 21 points 5 days ago I don't know why it isn't done already. Activate the national guard and do a massive nationwide sweep already. Arrest and prosecute anyone interfering like you would any other time and get the job done. At the rate they are going, its going to turn into what every single other government position becomes: permanent. If we only deport so many each year they get to keep the grift going and always have job security. permalink parent award report block reply Viewer01 15 points 5 days ago I’m about to start asking how the Nazis could have rounded up more Jews over the same time period despite less tech and less of them. That’ll really get aipac sweating. permalink parent award report block reply Coover -1 points 5 days ago We know, that you know, and we all know how it was done.   Straight to the point permalink parent award report block reply view 1 more comments... ColonelKlink 2 points 5 days ago I want to see the politicians that used taxpayer money that  facilitated this invasion and gave them welfare in prison. permalink parent award report block reply rebuildingMyself 6 points 5 days ago Yeah as the left has shown us, they will defend thugs and gang members shamelessly so there is no compromise with these people permalink parent award report block reply Shitsbrokeyo 2 points 5 days ago Exactly, no limits. Hospital, school, grocery, shitter. Open season with bounties and letters of marquee. If you can't speak or read English, you are not being profiled. You're being identified. This is America have an official language.\nAnd as far as profiling, do it. Isreal has the safest airport just because of this. permalink parent award report block reply penguinjay1212 1 points 5 days ago Shoot, I think they should be seiging abuela funerals en masse already. permalink parent award report block reply\nElectrocutioner 21 points 5 days ago I don't know why it isn't done already. Activate the national guard and do a massive nationwide sweep already. Arrest and prosecute anyone interfering like you would any other time and get the job done. At the rate they are going, its going to turn into what every single other government position becomes: permanent. If we only deport so many each year they get to keep the grift going and always have job security. permalink parent award report block reply Viewer01 15 points 5 days ago I’m about to start asking how the Nazis could have rounded up more Jews over the same time period despite less tech and less of them. That’ll really get aipac sweating. permalink parent award report block reply Coover -1 points 5 days ago We know, that you know, and we all know how it was done.   Straight to the point permalink parent award report block reply view 1 more comments... ColonelKlink 2 points 5 days ago I want to see the politicians that used taxpayer money that  facilitated this invasion and gave them welfare in prison. permalink parent award report block reply\nViewer01 15 points 5 days ago I’m about to start asking how the Nazis could have rounded up more Jews over the same time period despite less tech and less of them. That’ll really get aipac sweating. permalink parent award report block reply Coover -1 points 5 days ago We know, that you know, and we all know how it was done.   Straight to the point permalink parent award report block reply view 1 more comments...\nCoover -1 points 5 days ago We know, that you know, and we all know how it was done.   Straight to the point permalink parent award report block reply view 1 more comments...\nColonelKlink 2 points 5 days ago I want to see the politicians that used taxpayer money that  facilitated this invasion and gave them welfare in prison. permalink parent award report block reply\nrebuildingMyself 6 points 5 days ago Yeah as the left has shown us, they will defend thugs and gang members shamelessly so there is no compromise with these people permalink parent award report block reply\nShitsbrokeyo 2 points 5 days ago Exactly, no limits. Hospital, school, grocery, shitter. Open season with bounties and letters of marquee. If you can't speak or read English, you are not being profiled. You're being identified. This is America have an official language.\nAnd as far as profiling, do it. Isreal has the safest airport just because of this. permalink parent award report block reply\npenguinjay1212 1 points 5 days ago Shoot, I think they should be seiging abuela funerals en masse already. permalink parent award report block reply\nHawkDriverMN 25 points 5 days ago Sounds like she is the worst of the worst. permalink parent award report block reply Lol_Garrus 18 points 5 days ago Yup. She runs into the daycare hoping to use the kids as a figurative shield. permalink parent award report block reply Rob_Belmonte 2 points 5 days ago \"Literal\" shield probably. permalink parent award report block reply AllisterTwo 4 points 5 days ago She is wanted for paying smugglers to smuggle her two children into the US last month, both them children are no in a government detention area as unaccompanied minors... In my world abandoning your children, then paying a complete stranger to illegally smuggle them into the US is a pretty serious crime!  Add on to it the fact that she literally, like literally just attempted to use children as a shield from being arrested putting all those kids in harms way, yeah she is solidly on the worst side of the scale! permalink parent award report block reply\nLol_Garrus 18 points 5 days ago Yup. She runs into the daycare hoping to use the kids as a figurative shield. permalink parent award report block reply Rob_Belmonte 2 points 5 days ago \"Literal\" shield probably. permalink parent award report block reply\nRob_Belmonte 2 points 5 days ago \"Literal\" shield probably. permalink parent award report block reply\nAllisterTwo 4 points 5 days ago She is wanted for paying smugglers to smuggle her two children into the US last month, both them children are no in a government detention area as unaccompanied minors... In my world abandoning your children, then paying a complete stranger to illegally smuggle them into the US is a pretty serious crime!  Add on to it the fact that she literally, like literally just attempted to use children as a shield from being arrested putting all those kids in harms way, yeah she is solidly on the worst side of the scale! permalink parent award report block reply\nimnotdeadyet 15 points 5 days ago They are reporting she worked at the Day Care.  The question is how did an illegal register a car, get a license and a job?  Time to start arresting politicans for allow this to happen! permalink parent award report block reply AllisterTwo 2 points 5 days ago Biden apparently gave her a work permit, even though she had no legal status... permalink parent award report block reply\nAllisterTwo 2 points 5 days ago Biden apparently gave her a work permit, even though she had no legal status... permalink parent award report block reply\nPnw4gotpwd 4 points 5 days ago We actually don't fully know what her plans were. It could have been much worse. She could have been planning to use them as human shields or hostages. permalink parent award report block reply\n26magarat 48 points 5 days ago How is it unacceptably illegal if the person is already illegal? I don't get this logic. permalink award report block reply cock_pushups 13 points 5 days ago Because they aren't white and we are racist for not giving them free rides off our backs. permalink parent award report block reply LearnAboutRoaches 3 points 5 days ago How Daaaaare You!! It's because IN FRONT OF CHILDREN permalink parent award report block reply\ncock_pushups 13 points 5 days ago Because they aren't white and we are racist for not giving them free rides off our backs. permalink parent award report block reply\nLearnAboutRoaches 3 points 5 days ago How Daaaaare You!! It's because IN FRONT OF CHILDREN permalink parent award report block reply\nthisisatestof2 42 points 5 days ago Wait, so the Democrat just saw the video, assumed it was a teacher and threw it out on the Internet. I’m shocked, shocked I tell you!  Turns out not a lot actually happened, and not only really illegal, they tried to use a daycare to hide, making it even worse. permalink award report block reply SwedishChainsaw2 30 points 5 days ago I don't care if it WAS a teacher. Deport all illegals ASAP. Operation Wetback II permalink parent award report block reply Paleo 19 points 5 days ago He wants unvetted illegals working with our kids? permalink parent award report block reply Electrocutioner 8 points 5 days ago Considering that they were pushing hard and could have reached their ultimate goal of being able to legally fuck children just a few years ago, do you think it matters to them? permalink parent award report block reply zooty 5 points 5 days ago Legal aliens have to prove they have no criminal record that would preclude them from entry. Nobody should be allowed entry without that. Put valid asylum seekers (the huge majority aren't) in camps or on an island until they can be vetted. permalink parent award report block reply White-tailed_Eagle 5 points 5 days ago If that illegal alien was actually working as a teacher, then the void left by their deportation would be filled by an American. So ICE is creating jobs all over the country. permalink parent award report block reply Wallllllllllllllllll 2 points 5 days ago Operation Went Back permalink parent award report block reply EmptyNoose 1 points 5 days ago Totally agree. Never apologize, response shall be we will get you anywhere. If you died here as an illegal we will rip you out of your grave and send you home. They have all taken too much and still hate us. permalink parent award report block reply Electrocutioner 9 points 5 days ago The truth doesn't matter when propagandizing. Just like news corps, throwing out the first take, even if its wildly wrong, and then offer a retraction in some obscure way days later when the emotional hysterics have already taken root. permalink parent award report block reply\nSwedishChainsaw2 30 points 5 days ago I don't care if it WAS a teacher. Deport all illegals ASAP. Operation Wetback II permalink parent award report block reply Paleo 19 points 5 days ago He wants unvetted illegals working with our kids? permalink parent award report block reply Electrocutioner 8 points 5 days ago Considering that they were pushing hard and could have reached their ultimate goal of being able to legally fuck children just a few years ago, do you think it matters to them? permalink parent award report block reply zooty 5 points 5 days ago Legal aliens have to prove they have no criminal record that would preclude them from entry. Nobody should be allowed entry without that. Put valid asylum seekers (the huge majority aren't) in camps or on an island until they can be vetted. permalink parent award report block reply White-tailed_Eagle 5 points 5 days ago If that illegal alien was actually working as a teacher, then the void left by their deportation would be filled by an American. So ICE is creating jobs all over the country. permalink parent award report block reply Wallllllllllllllllll 2 points 5 days ago Operation Went Back permalink parent award report block reply EmptyNoose 1 points 5 days ago Totally agree. Never apologize, response shall be we will get you anywhere. If you died here as an illegal we will rip you out of your grave and send you home. They have all taken too much and still hate us. permalink parent award report block reply\nPaleo 19 points 5 days ago He wants unvetted illegals working with our kids? permalink parent award report block reply Electrocutioner 8 points 5 days ago Considering that they were pushing hard and could have reached their ultimate goal of being able to legally fuck children just a few years ago, do you think it matters to them? permalink parent award report block reply zooty 5 points 5 days ago Legal aliens have to prove they have no criminal record that would preclude them from entry. Nobody should be allowed entry without that. Put valid asylum seekers (the huge majority aren't) in camps or on an island until they can be vetted. permalink parent award report block reply\nElectrocutioner 8 points 5 days ago Considering that they were pushing hard and could have reached their ultimate goal of being able to legally fuck children just a few years ago, do you think it matters to them? permalink parent award report block reply\nzooty 5 points 5 days ago Legal aliens have to prove they have no criminal record that would preclude them from entry. Nobody should be allowed entry without that. Put valid asylum seekers (the huge majority aren't) in camps or on an island until they can be vetted. permalink parent award report block reply\nWhite-tailed_Eagle 5 points 5 days ago If that illegal alien was actually working as a teacher, then the void left by their deportation would be filled by an American. So ICE is creating jobs all over the country. permalink parent award report block reply\nWallllllllllllllllll 2 points 5 days ago Operation Went Back permalink parent award report block reply\nEmptyNoose 1 points 5 days ago Totally agree. Never apologize, response shall be we will get you anywhere. If you died here as an illegal we will rip you out of your grave and send you home. They have all taken too much and still hate us. permalink parent award report block reply\nElectrocutioner 9 points 5 days ago The truth doesn't matter when propagandizing. Just like news corps, throwing out the first take, even if its wildly wrong, and then offer a retraction in some obscure way days later when the emotional hysterics have already taken root. permalink parent award report block reply\nMissingTrump 28 points 5 days ago A demon rat lied? Noooo! Gaslighting pieces of shit catering to their low IQ voters. That's all they are. permalink award report block reply\nSouth_Florida_Guy 22 points 5 days ago The words on the outside of the daycare are in Spanish, they should actually raid that place too anyway while they're there just to be safe. permalink award report block reply ianpatrick1966 9 points 5 days ago Exactly permalink parent award report block reply icecreamheadache 9 points 5 days ago And she is screeching in Spanish as well, that doesn't make it look like she is an American. permalink parent award report block reply\nianpatrick1966 9 points 5 days ago Exactly permalink parent award report block reply\nicecreamheadache 9 points 5 days ago And she is screeching in Spanish as well, that doesn't make it look like she is an American. permalink parent award report block reply\nDestroyerofCobwebs 21 points 5 days ago I wish they WOULD go after daycares.  I hate the 'worst of the worst' strategy, it emboldens everyone else to believe they can stay. Raid daycares.  Snatch grandmas off the street.  Create fear in the illegal community at the maximum rate possible, so they pick up their shit and fucking leave on their own. permalink award report block reply worldowedexplanation 1 points 5 days ago YES permalink parent award report block reply\nworldowedexplanation 1 points 5 days ago YES permalink parent award report block reply\ncd3dog 16 points 5 days ago A democrat congressman lying??  Say it ain't so. permalink award report block reply 556x45mm 2 points 5 days ago Maybe he will apologize and then he can be canceled..... is that how it works? permalink parent award report block reply tt777 1 points 5 days ago No, he's probably angling for running for senator in Illinois. permalink parent award report block reply\n556x45mm 2 points 5 days ago Maybe he will apologize and then he can be canceled..... is that how it works? permalink parent award report block reply tt777 1 points 5 days ago No, he's probably angling for running for senator in Illinois. permalink parent award report block reply\ntt777 1 points 5 days ago No, he's probably angling for running for senator in Illinois. permalink parent award report block reply\nSteelDriver 14 points 5 days ago They also don’t need a warrant to arrest an illegal alien since the illegal alien is in the act of breaking the law.  It’s kind of like how law enforcement officers don’t need a warrant to arrest a bank robber while they’re robbing a bank. permalink award report block reply henri_derelicte 6 points 5 days ago It also means all arrests are criminal enforcement, so any signs/statements by state and local government against civil immigration enforcement are virtue signaling permalink parent award report block reply\nhenri_derelicte 6 points 5 days ago It also means all arrests are criminal enforcement, so any signs/statements by state and local government against civil immigration enforcement are virtue signaling permalink parent award report block reply\nthehinac PRO 11 points 5 days ago Why the Dems don't like X. permalink award report block reply\nHellNoKameltoe 8 points 5 days ago Democrat is lying - so it's a day ending in \"y\" permalink award report block reply Prandogolio 2 points 5 days ago Sue them for a billion dollars every time. permalink parent award report block reply\nPrandogolio 2 points 5 days ago Sue them for a billion dollars every time. permalink parent award report block reply\n3stepsahead 7 points 5 days ago Im sorry, dont these Congressman take an oath to uphold the constitution?  Isnt he in violation of that oath?  Are there NO fucking consequences for anything anymore? permalink award report block reply ragnarokrobo 6 points 5 days ago No, there aren't. permalink parent award report block reply Trump4Infinity 4 points 5 days ago (D)epends permalink parent award report block reply Prandogolio 2 points 5 days ago Not for communists permalink parent award report block reply\nragnarokrobo 6 points 5 days ago No, there aren't. permalink parent award report block reply\nTrump4Infinity 4 points 5 days ago (D)epends permalink parent award report block reply\nPrandogolio 2 points 5 days ago Not for communists permalink parent award report block reply\nberserkerbarrage 6 points 5 days ago Who cares? ICE should raid and shut down the entire daycare if they're hiring illegal aliens to be teachers. Foreign criminals who do not respect our borders and our laws should not be teaching children. permalink award report block reply\nhenri_derelicte 6 points 5 days ago The administration is facing heavy resistance from the district courts, state and local government, as well as the people themselves with respect to immigration enforcement in and around Chicago. You have unelected Obama/Biden judges determining that ICE and the Border Patrol is “lying” about their depiction of events, and disinformation as you’re seeing here when it comes to people getting arrested. If there was ever a case to invoke the Insurrection Act, send in federal troops to arrest elected officials (including federal judges) to restore order, it’s here. permalink award report block reply\nblue5707 5 points 5 days ago All I care about is she gets a lifetime ban from EVER re-entering the US, in the future. permalink award report block reply henri_derelicte 3 points 5 days ago If what leftists are saying about conditions in ICE detention facilities are remotely true, these criminal scumbags are getting their just desserts permalink parent award report block reply\nhenri_derelicte 3 points 5 days ago If what leftists are saying about conditions in ICE detention facilities are remotely true, these criminal scumbags are getting their just desserts permalink parent award report block reply\nBearing51 5 points 5 days ago ICE don't need a warrant to arrest illegal aliens, do they? permalink award report block reply henri_derelicte 8 points 5 days ago Do you need a warrant to arrest someone in the process of robbing a bank? Of course not. Your probable cause is right in front of you. Their mere presence in the US is a criminal act. These agents have tools to help them figure out who to look for and where they’re at. It’s when the illegals start running/resisting that helps establish probable cause permalink parent award report block reply zooty 4 points 5 days ago Getting elected to public office is a popularity contest, not an intelligence test. permalink parent award report block reply\nhenri_derelicte 8 points 5 days ago Do you need a warrant to arrest someone in the process of robbing a bank? Of course not. Your probable cause is right in front of you. Their mere presence in the US is a criminal act. These agents have tools to help them figure out who to look for and where they’re at. It’s when the illegals start running/resisting that helps establish probable cause permalink parent award report block reply\nzooty 4 points 5 days ago Getting elected to public office is a popularity contest, not an intelligence test. permalink parent award report block reply\nOTher55 5 points 5 days ago His big problem seems to be it happened in front of kids. Does he get as upset when a Dem Representative in Louisiana with kids in the car gets pulled over and arrested for DUI and child endangerment? Oh, oops, there's kids here. Welp, guess we can't arrest you now. https://www.wdsu.com/article/louisiana-state-rep-kyle-green-arrest-dwi-child-endangerment/64840408 permalink award report block reply SteelBallRun1890 7 points 5 days ago They don't care either if a drag or troon gets naked in front of children for ego or money, in fact they enjoy it. The \"bUt Th1nK oF tHe Ch1LdrEn!!1!\" card expired long ago for them. permalink parent award report block reply Prandogolio 3 points 5 days ago His big problem is that his voters are getting deported. permalink parent award report block reply\nSteelBallRun1890 7 points 5 days ago They don't care either if a drag or troon gets naked in front of children for ego or money, in fact they enjoy it. The \"bUt Th1nK oF tHe Ch1LdrEn!!1!\" card expired long ago for them. permalink parent award report block reply\nPrandogolio 3 points 5 days ago His big problem is that his voters are getting deported. permalink parent award report block reply\ncptkloss5 4 points 5 days ago don't care if they go into daycares to remove illegals...all the same permalink award report block reply\nMissileToad 4 points 5 days ago GASP! IN FRONT OF CHILDREN??! OH NOO!!\nHow many CHILDREN did you and your Dems get butchered in the womb last week? How about the ones you try to sterilize and mutilate after you  gaslight about being born in the \"wrong\" body? Tell me about CHILDREN, Mike. permalink award report block reply Prandogolio 5 points 5 days ago I'm gonna take my kid with me to rob a bank.  That way, the cops can't do anything. permalink parent award report block reply White-tailed_Eagle 2 points 5 days ago Do not give the left ideas. permalink parent award report block reply\nPrandogolio 5 points 5 days ago I'm gonna take my kid with me to rob a bank.  That way, the cops can't do anything. permalink parent award report block reply White-tailed_Eagle 2 points 5 days ago Do not give the left ideas. permalink parent award report block reply\nWhite-tailed_Eagle 2 points 5 days ago Do not give the left ideas. permalink parent award report block reply\nTreefiddydiddy 4 points 5 days ago lies get halfway round the world before truth has time to get it's trousers on permalink award report block reply\nn4freedom 3 points 5 days ago Who cares either way.  Illegal = go back permalink award report block reply\nBadBrainsBuzzcocks 3 points 5 days ago The news is full of these ridiculously specious sob stories. I've gotten into the habit of going straight to the comments and the good news is regardless of the leftist news site or how pathetic they pander about poor fat illiterate non-english speaking Juanita and her gangbanging kids and criminal rapist boyfriend, the comments are easily 2 to 4X in favor of ICE; \"too bad not sad - get the fuck out\" permalink award report block reply\nFromTheTopRope 3 points 5 days ago Human shields. ICE shouldn't have to only go after the \"worst of the worst\" and should also go after the \"best of the best\" because there is no such thing as 'good illegal immigration'. permalink award report block reply\nCoffeeIsForClosers 3 points 5 days ago By this logic, we can all agree that it's okay to bomb Doctors without Borders since they aided a terrorist. HAHAHA permalink award report block reply\nBLMTrying2GetUrGuns 3 points 5 days ago She tried to use children as shields? Surprising....she doesn't look Muslim! permalink award report block reply\nMemeWarsVet 3 points 5 days ago without a warrant They don't need one. Even I'd they had a warrant, you would still cry like the sour milk sucking little bitch you are. permalink award report block reply\nLigersrule1 3 points 5 days ago Everything with democrats are fake and gay permalink award report block reply\nChoppermagic 3 points 5 days ago still a criminal and using kids as human shields permalink award report block reply\nLaw_Sam 3 points 5 days ago Don’t care they all need to go home and make their countries great  if they are illegally here they need to go. permalink award report block reply\nWallllllllllllllllll 3 points 5 days ago They love this argument. \"...but you said you would only target the worst of the worst.\" Nah. Trump said worst would be first, self-deport now, you have to go back. It's been a year since the election. We are past the first stages of the largest mass deportation effort in history. All illegal aliens would be wise to self deport. You have to go back. ICE is well funded and growing. America is ramping up deportations and shipping these foos outta here. Get out of our country. Go home and fix your own country. permalink award report block reply\nUltraMagaWA 3 points 5 days ago Don't forget to deport her spawns if she has some permalink award report block reply\nterribletwos 3 points 5 days ago Who gives a fuck. Shut down the daycare and deport all the children too. Stop playing THEIR game fucking retarded fucks. You let them set the conversation and wonder why everything is so hard. permalink award report block reply\nMAGA-2028 3 points 5 days ago They need to start arresting the masked antifa that are pretending to be ICE. We’ve been targeting them one by one but the national guard needs to round them up. permalink award report block reply\nPOTUS_DonnieJ 2 points 5 days ago Why do we continue to let our elected representatives knowingly and blatantly lie to us? Frankly I've maintained that government officials, be they elected (including candidates), appointed or hired, shouldn't be offered the same constitutional protections as private citizens. You shouldn't get to claim 1st Amendment while knowingly lying to the people to advance your agenda (this fucker right here, or Schiff claiming he has evidence of Russian collusion, and yes, even Bondi saying she has Epstein's files on her desk). You shouldn't get to claim the 5th if you're caught doing something bad while acting in an official capacity and are brought to testify (think Clinton pleading the 5th about her emails or Fauci about his kickbacks). Don't like it? Easy solution, don't go into government, remain a private citizens with the full protection of the Constitution and the Bill of Rights. permalink award report block reply\nBramage 2 points 5 days ago Hey mikey, you faggot lying fuck, buzz off. permalink award report block reply\nindigo_truther 2 points 5 days ago ICE heroically saves children when fugitive bursts into daycare permalink award report block reply\nravonaf 2 points 5 days ago We live in a world where people in power lie and no one cares. You absolutely can not have a free country when anyone can say anything they want with authority and millions believe the lie. I can not see how this can be fixed. As far as I can see, this experiment in a free Republic has failed. We might as well wipe the board and start over from scratch. I see no other way. permalink award report block reply\n2Clutch 2 points 5 days ago I wouldn't have given a shit if they did snatch her ass out of a daycare iN frOnT oF cHiLDrEN while she was working there. Deport the fuck out of her. permalink award report block reply\ncosmos411 2 points 5 days ago Unfortunately ... A Lie Can Travel Halfway Around the World While the Truth Is Putting On Its Shoes permalink award report block reply\nMythArcana 2 points 5 days ago What? A democrat spreading propaganda? Now that's rare.  🙄 permalink award report block reply\nRedditStillSucks 2 points 5 days ago I always wonder how liberals fall for such absolute BS. Then I remember all the retards on this website that still believe Scott Pressler isn't a grifter. permalink award report block reply henri_derelicte 2 points 5 days ago TBH, liberals are more susceptible to fake news than we are permalink parent award report block reply RedditStillSucks 2 points 5 days ago Very true. Some of them still believe in Global warming and that masks worked! permalink parent award report block reply\nhenri_derelicte 2 points 5 days ago TBH, liberals are more susceptible to fake news than we are permalink parent award report block reply RedditStillSucks 2 points 5 days ago Very true. Some of them still believe in Global warming and that masks worked! permalink parent award report block reply\nRedditStillSucks 2 points 5 days ago Very true. Some of them still believe in Global warming and that masks worked! permalink parent award report block reply\nworldowedexplanation 1 points 5 days ago I don’t even care if they took a teacher in front of children. GOOD. Here illegally? Make an example out of them, they’re breaking the fucking LAW. Remember laws, anyone? permalink award report block reply\nsurgeriot 1 points 5 days ago Too late, he already lied and no consequences will happen why thousands of people blindly believe what he said. Because we don't have the mechanism in place to remove news like this when it's blatantly proven false. permalink award report block reply\nAoikaze2000 1 points 5 days ago Maybe we should let them think ICE is the new boogeyman? permalink award report block reply\nzooty 1 points 5 days ago Oh no, someone breaking the law arrested in front of children! Whatev.... hold on. That's exactly what I want. Good lesson. permalink award report block reply\nmcoulton 1 points 5 days ago Seems like she was working there and they knew she would be there and she ran inside, isn’t the issue tat a “worst of the worst” is taking care of children permalink award report block reply\nasiatrails 1 points 5 days ago Illegal, runs away from ICE, ICE follows and captures. The Demonkrat who now has Rahm Emanuel's seat howls in protest, probably wants to set up a margarita date with her. permalink award report block reply\n2016TrumpMAGA 1 points 5 days ago I.  Do.  Not.  Care. I don't care if they went in there guns blazing, as long as they nabbed the illegal. permalink award report block reply\nKeiichi81 1 points 5 days ago All day yesterday, the media was painting this as an angelic little school teacher who was in the middle of teaching class when evil white supremacist ICE agents burst in and dragged her out of the classroom at gunpoint in front of her sobbing schoolchildren. Now I find out not only was it not a school, not only was she never in a classroom, but she wasn't even an employee there and was instead a potentially dangerous fugitive who tried to gain entry to and hide inside a daycare while fleeing arrest. I'm sure if scared children were even present (which is a big \"if\" at this point) then they were probably just crying out of fear of some stranger trying to break in. Will the media be forced to issue a correction for the false coverage? Just kidding, we all know it'll never even be mentioned. permalink award report block reply\nIAmDisappoint 1 points 5 days ago Awww but it made such a nice headline! Now, how are they going to call ICE fascists over this? permalink award report block reply\n95Rockytoby95 1 points 5 days ago Quigley is gay. And a liar. permalink award report block reply\nOodles 1 points 5 days ago These are the exact pieces of shit illegals we need deported immediately permalink award report block reply\nsomeguy7738 1 points 5 days ago Always the same shit from the left. It could have been a registered sex offender working as a teacher under false pretenses in order to molest children and they'd still whine about it \"ERMAGERD they arrested a TEACHER in front of CHILDREN!!!\" permalink award report block reply\nltbadpuppy 1 points 5 days ago Democrats already found out via the 'both sides' lie that even if there is video evidence of the event proving the leftist narrative is a lie, if they repeat the lie enough their base will simply believe them. permalink award report block reply\nBeat_to_Quarters 1 points 5 days ago Democrats using the Hamas public relations playbook. permalink award report block reply\nLunatic_Fringe_PhD 1 points 5 days ago Congresspeople LIE!?!?! I'm SHOCKED permalink award report block reply\nDoMagnum 1 points 5 days ago Dem pols lie because they have trained their intended audience to believe only lies and reflexively reject truth like a psychological gag reflex. permalink award report block reply\nAmannamedRJ 1 points 5 days ago Democrats just elected a man who wanted to kill his opponent and his opponents children right on the heels of a man being assassinated in front of his children And they mocked that man and his wife and his children ruthlessly. Frankly, kill yourself if you're offended by this. Fuck your fake outrage. permalink award report block reply\nTheSonOfGadsden 1 points 5 days ago A democrat lying? What a surprise permalink award report block reply\nERIC_CIARAMELLA 1 points 5 days ago Fucking mic drop.  Hell yeah. permalink award report block reply\nfjzappa 1 points 5 days ago Democrat is lying. And the sky is blue. permalink award report block reply\nThouShallNotSteal 1 points 5 days ago Mike Quigley sounds like a quad vaxxed fucking faggot. Fuck him. permalink award report block reply\nJBlaze056 1 points 5 days ago \"deliberately misrepresenting the facts\" is a requirement for congress. permalink award report block reply\nBoDude 1 points 5 days ago Nice Every one of them permalink award report block reply\nThep1mp 1 points 5 days ago Who cares. If the kids are illegal deport them and their parent. Let the anchor babies anchor in Mexico permalink award report block reply\nDouble_O 1 points 5 days ago Congressman, you are deliberately misrepresenting the facts. <-- so I can find this in my history.. permalink award report block reply\nAliceCooperBiden 1 points 5 days ago Hopefully they checked the kids as well. Send them and their parents back if they’re illegal. permalink award report block reply\nFredRedd 1 points 5 days ago Hey Quigley, how exactly was a car -IN YOUR DISTRICT - \"registered to a female illegal alien?\" Like, how does that work exactly? An illegal alien shouldn't have documents that would make them eligible to buy, much less register, a car. How'd THAT go down in your district? permalink award report block reply\nthrottlejohnson 1 points 5 days ago tbh, i wouldn't care if they did roll up to the daycare and pull her out kicking and screaming. permalink award report block reply\nPearlyGaits57 1 points 5 days ago Media yet again, embelishes/lies, about the real truth. Media is asshoe! permalink award report block reply\nElectionMeddler 1 points 5 days ago So a criminal was trying to turn it into a hostage scenario?  The daycare should have a buzzer entry to prevent criminals from coming off the street permalink award report block reply\nGreenhills 1 points 5 days ago Never resist arrest. permalink award report block reply\nAwShitHereWeGoAgain 0 points 5 days ago A kid-fucking Congressman was lying.... the hell you say!!!!!!!!!!!!! permalink award report block reply"
}