{
  "id": "1ARK9nQBQW",
  "url": "https://patriots.win/p/1ARK9nQBQW/prominent-proh1b-indian-account-/c",
  "content": "22 PROMINENT PRO-H1B INDIAN ACCOUNT SIDHARTH (who has previously threatened Americans with harm and doxxing) -  \"LMAO 💀 What an absolute demolition by the KING himself  @realDonaldTrump. The Groypers and their foreign-funded clown brigade are in full meltdown mode. Watching them cope is art.\" posted 3 hours ago by bleeje 5 comments award share report block Sidharth @Cloudwatch199 • 21h LMAO 💀 What an absolute demolition by the KING himself  @realDonaldTrump. The Groypers and their foreign-funded clown brigade are in full meltdown mode. Watching them cope is art. Eric Daugherty @EricLDaugh • 22h 🚨 JUST IN: Laura Ingraham PRESSES President Trump on restricting H-1B visas \"H-1B visa thing won't be a big priority for you? If you wanna raise wages for Americans, you can't flood the country with THOUSANDS of foreign workers.\" TRUMP: You have to bring in talent. \"We have\n5 comments Sort by Top Top New Worst Old Save Around the Web Glory-Unto-God 6 points 3 hours ago Selling out a people to make line go up after watching a third of the children this generation be killed in the womb. I would call this tiresome but honestly this is infuriating. permalink award report block reply WheelsUpNorth 1 points 3 hours ago Listen to the clip carefully. Trump actually answered Ingraham’s comment about flooding the country with foreign workers by saying “I agree but you have to bring in talent.” Not a great answer, but it puts a slightly different spin on his statement. This thing is beginning to smell like a “very fine people” type operation to split Trump from his supporters. Note: I’d prefer we do away with the H1-B program. permalink award report block reply TheTelltaleFly 3 points 2 hours ago I think we’re being greased for a new immigration/ amnesty bill. It was probably the price to end the govt shutdown permalink parent award report block reply ganachain 2 points 2 hours ago O1 instead of H1-B? permalink parent award report block reply MastaJoda 1 points 2 hours ago If only I had the mfs address... permalink award report block reply\nGlory-Unto-God 6 points 3 hours ago Selling out a people to make line go up after watching a third of the children this generation be killed in the womb. I would call this tiresome but honestly this is infuriating. permalink award report block reply\nWheelsUpNorth 1 points 3 hours ago Listen to the clip carefully. Trump actually answered Ingraham’s comment about flooding the country with foreign workers by saying “I agree but you have to bring in talent.” Not a great answer, but it puts a slightly different spin on his statement. This thing is beginning to smell like a “very fine people” type operation to split Trump from his supporters. Note: I’d prefer we do away with the H1-B program. permalink award report block reply TheTelltaleFly 3 points 2 hours ago I think we’re being greased for a new immigration/ amnesty bill. It was probably the price to end the govt shutdown permalink parent award report block reply ganachain 2 points 2 hours ago O1 instead of H1-B? permalink parent award report block reply\nTheTelltaleFly 3 points 2 hours ago I think we’re being greased for a new immigration/ amnesty bill. It was probably the price to end the govt shutdown permalink parent award report block reply\nganachain 2 points 2 hours ago O1 instead of H1-B? permalink parent award report block reply\nMastaJoda 1 points 2 hours ago If only I had the mfs address... permalink award report block reply",
  "fetched_at": "2025-11-12T23:13:07.964828Z"
}