{
  "id": "1ARK5BGaZS",
  "url": "https://patriots.win/p/1ARK5BGaZS/exusaid-employees-describe-how-b/c",
  "content": "414 Ex-USAID employees describe how, before January 20, they moved internal groups off government systems and into encrypted Signal chats, then quickly linked with foreign partners and NGOs after the inauguration. posted 3 days ago by Moebius 9 comments award share report block DataRepublican (small r) @DataRepublican • 3d 🧵🚨 MAJOR BREAKING: International actors are involved in the State Department led color revolution 🚨🚨 This is not speculation; it’s straight from a recorded call. Ex-USAID employees describe how, before January 20, they moved internal groups off government systems and into\n9 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style RiolindasReturn 16 points 3 days ago It doesn’t become treason, it IS treason. permalink award report block reply 2016TrumpMAGA 9 points 3 days ago \"Treason\" is a term thrown around incorrectly on here to describe sedition. This is actual Treason. US government employees colluding with members of foreign governments against the President. permalink parent award report block reply HeavyMetalPatriot 11 points 3 days ago If Trump doesn't cross the Rubicon, America is lost. permalink award report block reply Greenhills 6 points 3 days ago Oy vey permalink award report block reply Crappydatum 3 points 3 days ago \"Long time implementing partner\" Who dat? permalink award report block reply Crappydatum 1 points 3 days ago 3:34 full screen permalink parent award report block reply MPitcher1776 2 points 3 days ago Who hired that bumbling idiot. permalink award report block reply FredRedd 2 points 3 days ago DataRepublican is a national treasure. permalink award report block reply NZbacon 1 points 3 days ago I like how they're ex employees. permalink award report block reply\nRiolindasReturn 16 points 3 days ago It doesn’t become treason, it IS treason. permalink award report block reply 2016TrumpMAGA 9 points 3 days ago \"Treason\" is a term thrown around incorrectly on here to describe sedition. This is actual Treason. US government employees colluding with members of foreign governments against the President. permalink parent award report block reply\n2016TrumpMAGA 9 points 3 days ago \"Treason\" is a term thrown around incorrectly on here to describe sedition. This is actual Treason. US government employees colluding with members of foreign governments against the President. permalink parent award report block reply\nHeavyMetalPatriot 11 points 3 days ago If Trump doesn't cross the Rubicon, America is lost. permalink award report block reply\nGreenhills 6 points 3 days ago Oy vey permalink award report block reply\nCrappydatum 3 points 3 days ago \"Long time implementing partner\" Who dat? permalink award report block reply Crappydatum 1 points 3 days ago 3:34 full screen permalink parent award report block reply\nCrappydatum 1 points 3 days ago 3:34 full screen permalink parent award report block reply\nMPitcher1776 2 points 3 days ago Who hired that bumbling idiot. permalink award report block reply\nFredRedd 2 points 3 days ago DataRepublican is a national treasure. permalink award report block reply\nNZbacon 1 points 3 days ago I like how they're ex employees. permalink award report block reply",
  "fetched_at": "2025-11-12T23:03:30.598209Z"
}