{
  "id": "1ARK513J4Q",
  "url": "https://patriots.win/p/1ARK513J4Q/back-in-the-day/c",
  "content": "318 Back In The Day posted 6 days ago by hecubus 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save Around the Web Restaurants In Salt Lake City With Good Senior Discounts TheWalletGuru TrancePhreak 8 points 6 days ago Some of us still do, sonny! permalink award report block reply hecubus OP 7 points 6 days ago Show me the onion strapped on your belt. permalink parent award report block reply TrancePhreak 5 points 6 days ago ===🧅== permalink parent award report block reply RudeFrog 2 points 6 days ago AI overload, is that true? permalink award report block reply patrioticwinning3 1 points 6 days ago PDW mods told me its not true.  Excuse me, I must send more money to our greatest ally eva!  :p permalink parent award report block reply Rock 2 points 6 days ago I agree with this permalink award report block reply Filo76 2 points 6 days ago Let me check with Reddit to see if I should be mad at this or not. permalink award report block reply\nTrancePhreak 8 points 6 days ago Some of us still do, sonny! permalink award report block reply hecubus OP 7 points 6 days ago Show me the onion strapped on your belt. permalink parent award report block reply TrancePhreak 5 points 6 days ago ===🧅== permalink parent award report block reply\nhecubus OP 7 points 6 days ago Show me the onion strapped on your belt. permalink parent award report block reply TrancePhreak 5 points 6 days ago ===🧅== permalink parent award report block reply\nTrancePhreak 5 points 6 days ago ===🧅== permalink parent award report block reply\nRudeFrog 2 points 6 days ago AI overload, is that true? permalink award report block reply patrioticwinning3 1 points 6 days ago PDW mods told me its not true.  Excuse me, I must send more money to our greatest ally eva!  :p permalink parent award report block reply\npatrioticwinning3 1 points 6 days ago PDW mods told me its not true.  Excuse me, I must send more money to our greatest ally eva!  :p permalink parent award report block reply\nRock 2 points 6 days ago I agree with this permalink award report block reply\nFilo76 2 points 6 days ago Let me check with Reddit to see if I should be mad at this or not. permalink award report block reply",
  "fetched_at": "2025-11-12T22:57:22.879670Z"
}