{
  "id": "1ARK5BGrgf",
  "url": "https://patriots.win/p/1ARK5BGrgf/breaking-deal-reached-to-reopen-/c",
  "content": "1571 BREAKING: DEAL REACHED to REOPEN the U.S. government... posted 3 days ago by hocuspocusfocusjeep 381 comments award share download report block\n381 comments Sort by Top Top New Worst Old Save Aquamine-Amarine 322 points 3 days ago Shame, I wanted the shutdown to continue. permalink award report block reply ShlomoJoe 127 points 3 days ago I wanted the whole government to burn down so we could consolidate power under Trump. At that point, real progress could be made in this country. permalink parent award report block reply Than0sIII 47 points 3 days ago And then we'd probably get an actual Civil War. permalink parent award report block reply molonlabe9 57 points 3 days ago Well, he said real progress.  That is technically progression... permalink parent award report block reply lostremote- 35 points 3 days ago something has to be done about these illegals and foreigners usurping power.  a civil war might actually be the trick. permalink parent award report block reply view 4 more comments... Trumpwon306 35 points 3 days ago If you think the way to avoid a civil war is for Republicans not to consolidate power, you need to wear water wings to drink soup. The only way we avoid civil war or worse, is through early action to remigrate millions of foreigners, and defunding leftists projects such as Obamacare so as to deprive their networks of millions if not billions in funding every year. Otherwise it's just a count down to the mid 2030's. permalink parent award report block reply HeavyMetalPatriot 19 points 3 days ago Correct. Either the left is totally destroyed and 50M+ foreigners are tossed out, or America dies in blood. permalink parent award report block reply view 2 more comments... Hunter77 8 points 3 days ago Not sure any of that is enough. There are immense numbers of left leaning citizens in this country. Seems like civil war is inevitable as long as that remains the case. permalink parent award report block reply view 3 more comments... MasterChief08 34 points 3 days ago Last year 70% of active duty military and over 80% of law enforcement voted for Trump. Over 400 sheriffs in America are militia members for right wing clubs and organizations. Sheriffs are 2x more likely to be conservative than the average American voter. A Civil War would be far worse for the left. Leftists in cities would be constantly under fire from gangs so they'd have zero periods of calm while Republicans live far away in secure rural strongholds. And that military number I cited included the 10k LGBT/DEI commisars Hesgeth released this year. permalink parent award report block reply Floridacus 16 points 3 days ago \"Worse\" is a relative term. It would be \"bad\" for everyone. permalink parent award report block reply view 5 more comments... BigIglooActual 6 points 3 days ago The problem is that a civil war will not remain one permalink parent award report block reply view 2 more comments... KungPaoMcChicken 5 points 3 days ago In a civil war, all the illegals would be too scared to stay... permalink parent award report block reply view 2 more comments... ThorsonTT 3 points 3 days ago A civil war would be over in days.  Simply cutting power to some cities would collapse the Left's base. permalink parent award report block reply view 3 more comments... ProfessorJagoff 1 points 3 days ago Comment removed by spam filter, pending further review. permalink parent award report block reply ERIC_CIARAMELLA 3 points 3 days ago Good. permalink parent award report block reply Than0sIII 3 points 3 days ago If you want the country to be fucked over, sure. permalink parent award report block reply view 2 more comments... Quiznos585 3 points 3 days ago GOOD permalink parent award report block reply load 13 more comments... TrustYourself 3 points 3 days ago There is always next month. permalink parent award report block reply Mhmm2MoreWeeks -1 points 3 days ago And other countries too!!! permalink parent award report block reply Polander 49 points 3 days ago Trump was bluffing when he said he'd cut government when it was closed. Might as well leave it open if they aren't going to fix anything permalink parent award report block reply Cyer6 47 points 3 days ago I've been wondering WTF happened to all that? Kinda went away with the Fort Knox gold inspection and \"other things\". permalink parent award report block reply Lelleck 24 points 3 days ago A list of other things.. permalink parent award report block reply DeportThemAllForever 10 points 3 days ago That list is getting really long now... permalink parent award report block reply view 1 more comments... GodBlessColumbia 21 points 3 days ago He bluffs about a lot of things.  Locking Hillary up for example.  Obamagate will turn out to be a big bluff too I’d wager permalink parent award report block reply Gadsden 9 points 3 days ago He said in a interview that he had the chance to put Hilary in prison, and it was justified to do so. But he didn't, because he thought it was bad for the overall country. Bet he regrets that, now. permalink parent award report block reply Brakesbreaktrains2 4 points 3 days ago Can I assume this was before they shot him then shot at him again? permalink parent award report block reply view 2 more comments... UCantStumpTheTrump 2 points 3 days ago Yeah, I don't see Trump making the same mistake twice, hence why all these federal grand jury indictments are coming down for the people who tried to illegally oust Trump... permalink parent award report block reply cardinaldrones 1 points 3 days ago Maybe that’s his weakness.  A politician that actually listens to him word for word and takes his bluffs seriously. permalink parent award report block reply Burisma 2 points 3 days ago You think this is the end? This was phase 2. You've learned nothing. permalink parent award report block reply Tellman125 2 points 3 days ago The Art of the Semi-Sorta-Shutdown P.R. Campaign? Tens of thousands of people were furloughed though: https://en.wikipedia.org/wiki/2025_United_States_federal_government_shutdown#Furloughed_workers permalink parent award report block reply 1_Badcop -7 points 3 days ago TACO permalink parent award report block reply Shih_Tabed 2 points 2 days ago Trump Always Creates Opportunities permalink parent award report block reply 1_Badcop 0 points 2 days ago To Be Disappointed permalink parent award report block reply view 1 more comments... SavingPrivateGrace 19 points 3 days ago I wanted the filibuster axed. permalink parent award report block reply Hikedelics 11 points 3 days ago Any of you guys actually notice any difference at all during the shutdown? I was going to say that I didn’t, but I did just remember in the first week we went to Rocky Mountain National Park and they didn’t give a shit if we had park passes or not. That was it. In 40 days. Should have let the bitch stayed shutdown permanently. permalink parent award report block reply Underpants 3 points 3 days ago Eh... as fun as it is to say that... I need my ATC friends to get paid. permalink parent award report block reply load 8 more comments... MickHigan2 170 points 3 days ago Which way from Sunday are we getting screwed? permalink award report block reply Tryhardneckbeard 136 points 3 days ago The fact that this is a CR at Biden Spending levels... permalink parent award report block reply henri_derelicte 41 points 3 days ago Didn’t multiple GOP votes to reopen the government keep spending at current levels? permalink parent award report block reply Gletkin 22 points 3 days ago GOP is mostly grifting professional political profiteers like everyone else in DC. permalink parent award report block reply Simple_Doot 7 points 3 days ago Republicans are exactly as shitty as Dems when it comes to spending.  There is no way to stop the spending - ever. permalink parent award report block reply lemonparty 18 points 3 days ago Don't the BBB cuts hit Jan 1? permalink parent award report block reply SicSemperTyrannis2 12 points 3 days ago No, they were all \"ruled against\" by the Parliamentarian, and VP who had sole power to axe all that, did nothing. permalink parent award report block reply Hanging_Chad 0 points 3 days ago has he explained why he did nothing? permalink parent award report block reply view 1 more comments... ParmesanCartel 1 points 3 days ago \"cuts\"... Plus 2 trillion permalink parent award report block reply lefty295 15 points 3 days ago Correct, the game was always rigged in the first place. permalink parent award report block reply KernalMustard 2 points 3 days ago House always wins permalink parent award report block reply Tellman125 1 points 3 days ago Is Jeffries the dealer? permalink parent award report block reply DRKMSTR 5 points 3 days ago All this time and they can't do a budget permalink parent award report block reply MastaJoda 4 points 3 days ago We haven't balanced the budget since Bubba was president, and he used Social Security ''surplus'' to achieve that. Clinton's Congress just stole from everyones SS retirement. Lol Fuck this government. permalink parent award report block reply Hellsbells00 3 points 3 days ago Social security was pillaged from day one. It was never really a retirement fund, it was a government operated pyramid scheme. Social security is nothing more than a tax with a giant lying PR campaign. permalink parent award report block reply view 2 more comments... DeportThemAllForever 1 points 3 days ago Correction:  They can, but they won't. permalink parent award report block reply SpeekFreely 11 points 3 days ago Let it cook a couple hours, the commies will be out bragging for their next fundraiser. permalink parent award report block reply Brownwaterboys 5 points 3 days ago every way :D permalink parent award report block reply JesusTheOnlyWay 4 points 3 days ago Muh gibs fully restored. Maybe they'll double snap for Kangs so we have the privilege of working a 2nd or 3rd job and not seeing our wife or children. At least they can get ps5 though permalink parent award report block reply DingleBalls 4 points 3 days ago #6 permalink parent award report block reply load 28 more comments... lemonparty 88 points 3 days ago My initial read here, and I do hope that I am right is this:  the Democrats lost this one, and they needed an \"out\" that made it look like they got something.   Like Iran being able to \"punch back\" and hit a few patches of dirt. I'm aware of rose-colored glasses, and the GOP has stabbed us in the back too many times to trust, but this looks like a pretty big win. permalink award report block reply JohnN 65 points 3 days ago I gotta disagree.  Yes, the Dems caved.  Yes, it's great to see it.  But from now until the midterms... -- \"We had no choice; people were going to starve to death.\" -- \"Your healthcare premiums are going up because of the GOP.\" This will be non-stop.  Many stupid white women will be empathetic. permalink parent award report block reply Trumpwon306 28 points 3 days ago Dems didn't cave to shit. They got what they wanted and the Charlie Brown republicans keep trying to kick the football. They lost nothing. At this point it would have been better for Republicans to keep the shutdown going until the pressure from our side was such that the filibuster was removed or we used the threat of which to demand that democrats vote down filibustering from their side so we could actually pass legislation that might actually help white americans. permalink parent award report block reply Tellman125 4 points 3 days ago It's all about perception as shaped on social media by brief posts from politicians and prominent political accounts; that is THE media now. permalink parent award report block reply Repentnow 2 points 3 days ago Yep, buts exactly why the uniparty wrapped this thing up before there could be a vote to nuke the filibuster. permalink parent award report block reply ForceMultiplier 2 points 2 days ago Any Senator could delay this for at least a couple of days The House will need to be called back into session and pass it before it gets to Trump's desk. Any Dem that tried to delay reopening the Government could be used as a pretext to nuke the Filibuster. Dems will nuke the filibuster, pack the courts, and prosecute anyone not pardoned if we can't fix election fraud and they cheat their way back into power. Fixing election fraud would force Dems back toward the center because that's the only way they could get elected. permalink parent award report block reply MAGA_APN 19 points 3 days ago Yup-I know several permalink parent award report block reply EgregiousPhilbin 16 points 3 days ago Hey here's a thought. Call me crazy. Maybe our side could put up a fight or improve their messaging? Nah, what was I thinking. permalink parent award report block reply ForceMultiplier 2 points 2 days ago The MSM lies and distorts. What are your ideas to improve GOP messaging? permalink parent award report block reply ListenJack 7 points 3 days ago ACA subsidies are a political ticking time bomb. The only way out of that mess is for the Reps to offer something better than what the ACA is right now OR fund the stupid subsidy past 2026. My money is on the later. permalink parent award report block reply KernalMustard 4 points 3 days ago How about not having it. permalink parent award report block reply ListenJack 1 points 3 days ago Lame duck for dinner please! permalink parent award report block reply ForceMultiplier 2 points 2 days ago Republicans don't seem to have a plan to replace the \"Affordable\" Care Act. I would love to hear a comprehensive plan permalink parent award report block reply tired-of-crap 2 points 2 days ago There is discussion about taking the subsidies and the positing it into a health savings account instead of providing ACA insurance. Most people don't get anything back because of the high deductible so this way at least they would get some health care. permalink parent award report block reply ListenJack 1 points 2 days ago Thats definitely an improvement from where it’s currently at. permalink parent award report block reply HunterBidensPC 2 points 3 days ago Hard to do when everyone can just point to trumps multiple tweets in all caps begging Dems to end the shutdown and demanding GOP ends the filibuster permalink parent award report block reply load 13 more comments... genericamerican69 41 points 3 days ago If you think the average person blames the democrats for the snap outages etc.. you are sorely mistaken. Anyway mass deportations would solve every problem permalink parent award report block reply EgregiousPhilbin 25 points 3 days ago “Think about how stupid the average person is, and realize half of them are stupider than that.” permalink parent award report block reply Aambrick 8 points 3 days ago I do know a similar quote: The average person isn't stupid. The average person is gullible. Half of them will always believe the lie because they cannot ever face the truth, otherwise, it will shatter their little shadow theatre. They believe in shadows more than an actual person waving a hand in front of their face. Just the observation in the last 20 years. permalink parent award report block reply Repentnow 5 points 3 days ago Being gullible is literally being stupid. permalink parent award report block reply view 1 more comments... Lib_Women_Have_HSV 2 points 3 days ago I saw protesters in Springfield IL that waved at me when I gave a Nazi salute. permalink parent award report block reply ChinaFlu 1 points 3 days ago Elwood: \"Illinois Nazis\"\nJake: \"I hate Illinois Nazis\" permalink parent award report block reply view 1 more comments... Beachboy1b 5 points 3 days ago Mass deportation would absolutely solve every problem. As to the first part of your comment, we NEED to spread this information far and wide. permalink parent award report block reply MajorClark 9 points 3 days ago Looks can be deceiving.  The time frame isn't good.  This will buy the crooked democrats time to pay off the crooked republican rinos to vote in their favor.  We know there at at least 12 rino's that can't be trusted. permalink parent award report block reply Deplora 15 points 3 days ago If people who rely on SNAP and people who were planning to fly somewhere for Thanksgiving with family all get their Thanksgiving ruined because of the shutdown, Republicans would be screwed in the midterms, meaning Trump would be screwed for the second half of his term.  Absolutely not worth it. u/lemonparty permalink parent award report block reply MajorClark 8 points 3 days ago Again!   Congress did this.   Trump didn't shut anything down and Republicans voted 15 times to leave the govt. open.  What is it that you just don't get?   It's a #SchumerShutDown. permalink parent award report block reply Deplora 25 points 3 days ago It's not that I don't get it, but millions of low-information voters don't get it, and Dem political operatives aggressively \"help\" them to draw the wrong conclusions.  All they get is that their flight is cancelled or their SNAP benefits didn't show up as usual, and Trump is President. permalink parent award report block reply view 2 more comments... Seruna_Kanus 7 points 3 days ago Retards don't know or care how politics work and will blame Trump for not being the dictator that the media claims him to be. permalink parent award report block reply tholinz 5 points 3 days ago Yes but there are a lot of idiots out there who'll believe whatever CNN or their favorite idiot influencer on TikTok says. Reality doesn't matter; perception does. Now the Dems can't blame Trump for ruining Thanksgiving. permalink parent award report block reply KernalMustard 2 points 3 days ago Trump is Republican. Republicans shut it down.  Hence Trump shut it down in the left eyes. permalink parent award report block reply HoganT 1 points 3 days ago Democrats would have voted 15 times to open it too if they had the ability to bring votes to the floor on it. And we would have voted against their methods. permalink parent award report block reply Klaus73 7 points 3 days ago Everyone is gonna claim this is a win; thats just the way it works - they are all telling the truth ironically enough; only the public loses. permalink parent award report block reply Goozmania 3 points 3 days ago They rehired everyone Trump fired for the past 2 months. Republicans caved, despite having no reason to. permalink parent award report block reply load 5 more comments... Light_HIV_Effect 56 points 3 days ago I would be shocked if that's the only concession they gave up. We're getting screwed at some point with a christmas omnibus bill. I say don't even give them the ACA vote. Republicans ought to let it lapse and do their own reform with transparent pricing, end of all subsidies, end of drug and care gouging, tort reform and permanent work requirements for medicaid permalink award report block reply goldkeyboardwarrior 8 points 3 days ago I say let them get the vote. They don’t have the votes to pass it without a few Republicans crossing the aisle in both chambers. permalink parent award report block reply ChinaFlu 14 points 3 days ago Just like we heard the screeching over lost EBT benefits, we will next hear the screeching over lost insurance coverage. They'll fold at the next vote and extend ACA. permalink parent award report block reply Strzok 4 points 3 days ago GOP will talk hard on Fox and then fold like rice paper Happens again and again. We keep re-electing the same uniparty rats in the same states permalink parent award report block reply goldkeyboardwarrior 3 points 3 days ago If Trump’s not on board they would still have to get 2/3rds of both chambers to overrride his veto. I don’t see them getting that and if they do then that’s all on Congress and not on Trump. permalink parent award report block reply The_RedWolf 1 points 3 days ago isnt the vote only for extended ACA and not the main subsidy? permalink parent award report block reply Light_HIV_Effect 3 points 3 days ago I don't have any faith in the rinos that are in congress. We already have a few squishy senators with collins and murkowski that love to vote against Trump. The house is mildly better, but not by much. permalink parent award report block reply Viewer01 2 points 3 days ago They punted to the new year. Basically Republicans caved because they didn’t want anyone missing thanksgiving or Christmas. permalink parent award report block reply MAGA_APN 1 points 3 days ago Bend over -you know that old school GOP have never had a back bone-they only know how to screw the voters. permalink parent award report block reply ConfusedAngryArmed 1 points 3 days ago Imo we're getting screwed just by the nature of SNAP being reinstated. permalink parent award report block reply SqRt7744 1 points 3 days ago Well, that and selling out the whole country to foreign interests and pedos. But other than that, no concessions. permalink parent award report block reply Corse46 42 points 3 days ago Does everyone realize we are STILL using Nancy Pelosi's budget from 2022? We've had the House since 2023 and House, Senate, and WH since Jan 2025, and we are STILL \"continuing\" Nancy's budget from 2025. That's how weak and feckless we are. permalink award report block reply HuggableBear 6 points 2 days ago That's not true. There hasn't been an actual budget passed since 2009. We're still using OBAMA'S stimulus budget, which is why spending is so fucked. It's been nothing but continuing resolutions for 15 years. permalink parent award report block reply JesusTheOnlyWay 2 points 3 days ago They'll revise the budget in just 2 more weeks Or maybe 2 more Trump terms permalink parent award report block reply MakeAmericaGreat9 29 points 3 days ago They were scared Republicans might actually find some balls and remove the filibuster permalink award report block reply Cyer6 4 points 3 days ago That's a possibility. They got a few R's to go to the D's and say... \"We now have the numbers to do this and if it does, we're going to ram everything Trump has right through before Thanksgiving and he'll sign it the next day.\" permalink parent award report block reply politicsaside 9 points 3 days ago We need to do it anyways. It’s time. This is not a win. Nuking the filibuster would’ve been a win. This is a uniparty win, not us. permalink parent award report block reply The_RedWolf 1 points 3 days ago I'm glad they didnt.  Sure we'd get some wins now, but the moment Dems retook office, it'd be all undone and worse because they are more depraved than we are in general. permalink parent award report block reply DingleBalls 28 points 3 days ago So, what did we REALLY give up that isn't being officially said yet? permalink award report block reply POTUS_DonnieJ 19 points 3 days ago Heard some rumors about having to rehire federal employees fired since October. I hope that turns out to be just a rumor. EDIT: Confirmed, not a rumor. permalink parent award report block reply DemPanicAtTheDisco 3 points 3 days ago Sauce? permalink parent award report block reply stjimmy92 3 points 2 days ago https://www.msn.com/en-us/news/politics/senate-reaches-deal-on-ending-the-shutdown/ar-AA1Q6Hz0?ocid=BingNewsSerp The shutdown-ending agreement guarantees that federal employees laid off during the shutdown are rehired and gives federal employees back pay. It also would require agencies to give written notice to Congress about the withdrawal of the layoff notices issued during the funding lapse, plus details on the amount of back pay owed. permalink parent award report block reply pollsarefake -6 points 3 days ago Trump never gives an inch This is what happens when you have a powerful alpha like Trump in charge We are winning like never before on all fronts And the best is yet to come permalink parent award report block reply Simple_Doot 3 points 3 days ago Uhhhhh what permalink parent award report block reply Visceroth 28 points 3 days ago that's a loss for our side.\nzero good news lately. no funding cuts, no prosecutions, no codifying MAGA, no mass firings, AND they're letting professional welfare queens steal our tax money again. permalink award report block reply Simple_Doot 12 points 3 days ago I can't find anything to be proud of. permalink parent award report block reply BoomShtick 10 points 3 days ago Same old shit different day permalink parent award report block reply Bythrfruitsyknow 27 points 3 days ago So kicking the can down the road again? fucking papermache is more rigid than any Republicans spine. permalink award report block reply MOLON-LABE 24 points 3 days ago I would rather the shutdown continue and drain the leftist of every penny they have stolen from us. permalink award report block reply Cyer6 2 points 3 days ago Same here but having air traffic controllers and other critical workers not getting paid would've led to many just walking away. All air traffic could shutdown including commercial cargo which would lead to supply chain disruptions down to the trucks that roll into stores every day. If we could keep the real stuff running, then F 'em, let it all drain out and watch the chimp outs. permalink parent award report block reply realeagle 3 points 3 days ago Commercial cargo has alternative ways of getting to the US. permalink parent award report block reply MOLON-LABE 1 points 2 days ago Well ya see they can be considered essential and funding could be restored to them. Just like they did for the military, find the money so everyone is safe. We must take all the money away from the leftists and then start arresting them all. permalink parent award report block reply Damaged_Dirk 21 points 3 days ago We are getting fucked I guarantee it permalink award report block reply hilboggins 1 points 2 days ago Difficult to feel the micro peen permalink parent award report block reply Damaged_Dirk 1 points 2 days ago Tell me more. permalink parent award report block reply NancyPeloci -13 points 3 days ago You seem fun. permalink parent award report block reply Damaged_Dirk 12 points 3 days ago I'm not permalink parent award report block reply sully 9 points 3 days ago We honestly need more people like you because far too many people are too busy having “fun” while the USA keeps getting fucked five ways til Sunday. “Fun” to most is just turning a blind eye. Out of sight out of mind isn’t how we fix all the bullshit that’s completely screwed this country up. permalink parent award report block reply tuaris 20 points 3 days ago Probably has something to do with this: https://www.rt.com/news/627536-us-shutdown-stalls-arms-ukraine/ permalink award report block reply 24601 11 points 3 days ago The Communists got what they wanted from the shutdown.  That's why it;s over. permalink parent award report block reply Silencedogood76 2 points 3 days ago Good find, $5 Bil is a lot. permalink parent award report block reply FatigueIsReal -3 points 3 days ago I wish I lived in the one dimensional world you live in. permalink parent award report block reply johnqpublic864 20 points 3 days ago I was hoping for a longer shutdown. permalink parent award report block reply McFatty7 5 points 3 days ago Same. I don't see the benefit of ever reopening, except for paying our military. The only headline disruption is air travel. Does anyone really need to travel that much when we have the internet? Nope. It's not like we'll be getting a 40-day reduction in our taxes. Tax obligation x (40/365 days) = Tax credit permalink parent award report block reply goldkeyboardwarrior 9 points 3 days ago Air traffic controllers being out of work affects way more than just leisure air travel. permalink parent award report block reply view 4 more comments... FatigueIsReal 0 points 3 days ago Yes people need to travel that much and more. permalink parent award report block reply ChinaFlu 20 points 3 days ago Doesn’t a continuing resolution just extend money under the old budget to the illegals and other terrible things? permalink award report block reply ParmesanCartel 7 points 3 days ago Yes. Trump: you believed I was your saviour? permalink parent award report block reply Simple_Doot 9 points 3 days ago Trump is not the protagonist we believed he was for the last 10 years.  Quite a bummer. permalink parent award report block reply Praetor_Sean 15 points 3 days ago I wanted 61 days so we could fire most of the federal employees.  Guess we are just going back to business as usual, with tiny cuts to unimaginable spending. permalink award report block reply JDVance4President28 5 points 3 days ago Thats politics. Even MAGA politics unfortunately. permalink parent award report block reply BeauHD 14 points 3 days ago G [od] E [mperor] O [f] T [he] U [nited] S [tates] permalink award report block reply Coprolite 10 points 3 days ago G [reatest]\nO [f]\nA [ll]\nT [ime] permalink parent award report block reply BeauHD 1 points 3 days ago Use hash signs to get the big new lines permalink parent award report block reply TooBright 10 points 3 days ago I remember when it was called the pound sign. permalink parent award report block reply Scumbag-reddit 7 points 3 days ago Pound me too permalink parent award report block reply BeauHD -8 points 3 days ago Ok boomer permalink parent award report block reply view 3 more comments... Coprolite 1 points 3 days ago use * permalink parent award report block reply MakeAmericaGreat9 0 points 3 days ago Wrong. Not what it stands for. permalink parent award report block reply TheGreatWhiteNorth -3 points 3 days ago God Emperor Trump : Chosen By Heaven https://www.youtube.com/watch?v=_g8A96RPJDc&list=RD_g8A96RPJDc&start_radio=1 permalink parent award report block reply Dontbeafraid -6 points 3 days ago GEOTIS = God Emperor Of The Israeli State permalink parent award report block reply Klaus73 2 points 3 days ago MAGA - Make Ai Great Again! permalink parent award report block reply BeauHD -2 points 3 days ago I have spotted the Anaconda For Hire account. permalink parent award report block reply ParmesanCartel -4 points 3 days ago I have spotted the offspring of a Jonestown victim permalink parent award report block reply DT170x 1 points 3 days ago Probably Brain Damaged due to not drinking enough of the Jonetown Fruit Punch. permalink parent award report block reply BeauHD -1 points 3 days ago How many containers are in your kube cluster? permalink parent award report block reply Axiom502 -3 points 3 days ago Good one faggot. Get that from Ian Carroll's twitter? permalink parent award report block reply armyofpedes4usa 14 points 3 days ago I didn't want the shutdown to end. permalink award report block reply Quiznos585 14 points 3 days ago I don’t want it reopened. Let the SNAP people starve. GOP caved again didn’t they. permalink award report block reply PatriotSam 13 points 3 days ago So all this was just to get a vote on Obamacare? We all know what's going to happen there. permalink award report block reply magamagashii 1 points 3 days ago The subsidys for ACA will expire end of December so at least there's that. Same government funding but ACA will finally break instead of sending good money after bad money. permalink parent award report block reply MajJamesMcFarlane 6 points 3 days ago The subsidys for ACA will expire end of December so at least there's that. I can't wait to watch as Republicans re-up the subsidies and all we get is Trump talking about how necessary and important they are permalink parent award report block reply PatriotSam 0 points 3 days ago The Supreme Court will probably keep the law alive, they've defended the law tooth and nail. permalink parent award report block reply ThePatriotGames2016 12 points 3 days ago bad news. permalink award report block reply MemeWarsVet 11 points 3 days ago meh When are the tribunals? permalink award report block reply SanityGumby 11 points 3 days ago This is what was always going to happen permalink award report block reply MemoryHoleyeO 10 points 3 days ago Then vote no on Obama care. The Republicans don't have McCain this time; who will be the sacrificial rino lamb? permalink award report block reply Nellie_the_Beaut 4 points 3 days ago Program Note: Rand Paul will be playing the role of Traitor McCain in tonight’s performance. No flash photography, thank you. permalink parent award report block reply BaronFalcon 2 points 2 days ago Eyepatch McCain permalink parent award report block reply SorosHasBallsackEyes 8 points 3 days ago Reach out to your senators and reps regarding the ACA.\nMy insurance premiums skyrocketed while coverage plummeted.\nI cannot vote for anyone who supports the ACA. permalink award report block reply Senaleb 8 points 3 days ago shitass deal, just erased a lot of wins by Trump permalink award report block reply parttimefed 8 points 3 days ago \"simply allow aca vote next month\" next month just enough GOP members flip to pass it permalink award report block reply gorilla_grip 7 points 3 days ago The house democrats are saying they won’t vote on the revisions without all the stuff the dem senators were holding out for, like another trillion in debt to continue subsidizing Obamacare, passing laws that say no one can be fired in a shutdown, etc etc etc. This isn’t a “deal”. permalink award report block reply NYforTrump 7 points 3 days ago This is the same offer the GOP made weeks ago.  Democrats just fucked everyone by waiting until the election. permalink award report block reply MajorClark 7 points 3 days ago This will give the rino's time to be paid off by the lunatic democrats and stab the American people in the backs. permalink award report block reply ragnarokrobo 6 points 3 days ago They don't need time for that, they do it for free on a daily basis. permalink parent award report block reply Ricky_CIA 6 points 3 days ago Congressional GOP faggotry, like usual. permalink award report block reply Grindelwald 6 points 3 days ago Watch the maneuvers in the next month.  On the dead of night on a holiday. permalink award report block reply GuerillaYourDreams 6 points 3 days ago The most useless people in the world go back to work now. permalink award report block reply fjzappa 6 points 3 days ago H1-b's are gonna rejoice. permalink award report block reply SuperUltraMegaMAGA1 6 points 3 days ago As someone who works for a living I didn’t notice a single thing that changed during this “shutdown” permalink award report block reply Quiznos585 6 points 3 days ago I don’t want this shit to reopen and I want all of Snap to starve permalink award report block reply DefKon1 3 points 3 days ago I'm for that. But if they end SNAP, I expect my fuckin' Taxes to go down..👇🐸 permalink parent award report block reply meanwhileinamerica 5 points 3 days ago The Government was shutdown? permalink award report block reply WhatsFappening 5 points 3 days ago Nice month vac for all the Fed workers who will get back pay now. permalink award report block reply LordKuroTheGreat 5 points 3 days ago :( permalink award report block reply forefatherstanding 5 points 3 days ago Brace yourselves, I'm Shure Thune has sold us out. permalink award report block reply utfanx2 4 points 3 days ago Trump promised to never sign another Omnibus. Veto it all. permalink award report block reply SickofItall 4 points 3 days ago Fuck...there goes shopping in peace this week. permalink award report block reply MAGAnic316 4 points 3 days ago Nuke the filibuster permalink award report block reply JoinTheDiscussion 3 points 3 days ago won't do it now! permalink parent award report block reply RolandDelacroix 4 points 3 days ago Dems didn't want this to go long enough that Trump can fire deep staters. permalink award report block reply Texas_81 4 points 3 days ago At my church they have armed guards but I still carry because my safety is my responsibility. Every day everywhere I go permalink award report block reply Twobuck40 4 points 3 days ago Fuck this! KEEP THE SHUTDOWN GOING!! permalink award report block reply MondayCoupleIsDead -4 points 3 days ago Found John Cornyn. Get back to work you old fuck. permalink parent award report block reply TheAttackTitan 4 points 3 days ago Theres a poison pill in this “deal”. There always is. Democrats agreed to SNAP funding and VA funding until, you guessed it, September 2026. What a CONVENIENT TIME for this continuing resolution to run out of funds for SNAP! Mark my words, there will be another refusal to reach 60 votes on the next spending bill. The Democrats will allow SNAP to expire well into October 2026 and they’ll ride a blue wave in November with their angry legion of cat ladies and minorities who have their hands out for a handout. permalink award report block reply America101 4 points 3 days ago It says no Obamacare subsidies, is that no medical for illegals? permalink award report block reply chronistus 4 points 3 days ago Watch them do this shit again in a year. permalink award report block reply Jimster 4 points 3 days ago They need to use this shutdown as leverage to eliminate the fillibuster permalink award report block reply RockyBalboa 3 points 3 days ago Nooooooo permalink award report block reply HumblePig 3 points 3 days ago No. :< permalink award report block reply emorphia 3 points 3 days ago so the government will reopen and there been no mass firings and passing of MAGA agenda ?  so Trump did not take advantage of the shutdown ?. permalink award report block reply CMDRConanAAnderson 3 points 3 days ago Quit fucking doing this stopgap bullshit and pass the annual budget like you're supposed to. A shutdown is what's supposed to happen when that isn't achieved. permalink award report block reply Than0sIII 3 points 3 days ago Still need to nuke the filibuster to secure our elections. permalink award report block reply Kholland65 3 points 3 days ago Rinos will probably still vote to keep ACA permalink award report block reply Wupta PRO 3 points 3 days ago Of course angling to stop the filibuster being taken out and c election integrity codified. permalink award report block reply JoinTheDiscussion 2 points 2 days ago This right here! permalink parent award report block reply DefKon1 3 points 3 days ago I still want to end the filibuster. Like, yesterday! 🐸👍 permalink award report block reply Gnometard 3 points 2 days ago The GOP will vote for it, we'll yell RINO, and things will continue as they have. Pattern recognition is impossible with the social media addiction. permalink award report block reply spezisacuckold 3 points 3 days ago Damn permalink award report block reply MondayCoupleIsDead 3 points 3 days ago Dammit! All the filet mignon and lobsters will be instantly gone! You can't do this to us! Fuuuuuuuuuuuuuuuu-----. permalink award report block reply KungPaoMcChicken 3 points 3 days ago What's the ACA thing? permalink award report block reply mcoulton 3 points 3 days ago ACA is screwed and they need to sort out what the issue is and remove noncitezens from getting it paid for permalink award report block reply j2daeww 3 points 3 days ago Hahaha bullshit. It will pass with 1 vote because the corrupt republicans that vote yes are getting kickbacks. Just fucking wait. permalink award report block reply ianpatrick1966 2 points 3 days ago So, we caved. No medications until the gov was reopened.... Then we negotiated while it was closed permalink award report block reply MasterChief08 2 points 3 days ago Are air traffic controllers and people doing real work getting paid ? I don't care about courts permalink award report block reply Freeth3usa 1 points 3 days ago With this agreement everyone gets paid. A vote on ACA supsides in a few weeks, and another potential shutdown in January. permalink parent award report block reply MasterChief08 2 points 3 days ago Now that the subsidies will be a separate bill, they are dead. Trump can just veto permalink parent award report block reply TrumpOrTreason 2 points 3 days ago Naw dawg... fuck this deal. \"the agreement contains a “minibus” — three full-year appropriations bills that will fund certain departments like Agriculture through the end of the fiscal year next fall — and a continuing resolution to fund the rest of the government at existing spending levels through Jan. 30. It would also fully fund the Supplemental Nutrition Assistance Program, once known as food stamps, through next September, a major flashpoint in the shutdown.\" THREE FULL YEARS OF APPROPRATIONS?! That's the rest of Trump's second term.  Fuck that! permalink award report block reply The_RedWolf 2 points 3 days ago What a giant waste of time for the dems permalink award report block reply henri_derelicte 2 points 3 days ago I think it’s good we have a deal because these air travel disruptions lasting through Thanksgiving would not be good for the Trump administration. Going forward, I think we need to change the rules so that a government shutdown can be averted with only 51 votes permalink award report block reply KernalMustard 2 points 3 days ago You know there trains, buses and cars right permalink parent award report block reply covok48 2 points 3 days ago I’m done with this admin. permalink award report block reply JoinTheDiscussion 1 points 2 days ago Same! permalink parent award report block reply Dangerous 2 points 3 days ago We lose again it seems permalink award report block reply Cyberpunkd 2 points 3 days ago Repubs pussy out. What else is new? permalink award report block reply SmellyButtFart 2 points 3 days ago There were concessions.  The mass layoffs were were canceled permalink award report block reply YodaBannon 2 points 3 days ago Happy Thanksgiving permalink award report block reply tiamat 2 points 3 days ago It was over the second there was going to be flight reductions, there's no way the democrats could dodge that permalink award report block reply Freeth3usa 1 points 3 days ago To be honest republicans caved more than the Dems. Dems get what they really want, they want republicans going on record not voting for the aca subsidies. GOP won’t have shit ready to remove it, people will get fucked by insuring vote for Dems in mass at midterms. permalink parent award report block reply grandfather_nurgle 2 points 3 days ago So we do this all again in January. permalink award report block reply clmeachum 3 points 3 days ago Get through Thanksgiving and Christmas. permalink parent award report block reply canada_is_communist 2 points 3 days ago ITS SNAP TIME!!! permalink award report block reply tired-of-crap 2 points 2 days ago Unfortunately the deal also undoes president trump's firing during this time. This means we don't save the money by getting rid of these people but we can pass a budget later without them. The pressure points like snap And WIC have been funded to the end of the year. We need to insist there will be no more CRS after this point By passing the budget bills themselves 1 by 1.  Each budget bill needs to be gone through and have its fat eliminated.  That is where trump can Get rid of the people already identified as not needed during the shutdown. Start passing the bills 1 by 1 and ignore any pressure to pass another CR.  There are only 12 of them, get them done. permalink award report block reply TrumpIsMyyPresident 2 points 3 days ago Deal reached does not mean Vote \"Yay'd\" permalink award report block reply rocco_saint 2 points 3 days ago What's so special about January 30th? permalink award report block reply AbrahamLincoln 7 points 3 days ago It gives congress time to take 3 more vacations before the budget runs out again. permalink parent award report block reply rocco_saint 2 points 3 days ago True.  But is anyone quitting/retiring?  Something else going on? permalink parent award report block reply cherokeepeople 2 points 3 days ago they will let the dems have a vote to keep the subsidies,but no way in hell IF it does pass will trump sign it. permalink award report block reply WarOfTheFanboys2 1 points 3 days ago LET THE MARKET COME FORTH permalink award report block reply Papabravo12 1 points 3 days ago Eh permalink award report block reply RizzlieDoodad 1 points 3 days ago Temu version permalink award report block reply BusterHyman99 1 points 3 days ago So we will have the 12 separate funding bills on Jan 30th then? Since this was just so they could keep negotiating that permalink award report block reply ProfessorJagoff 1 points 3 days ago Folks, no, civil war is never the first option. If its meant to be, it will happen, but for god's sake, don't hope for something that very well could ruin the entire nation and have us under a flag of a foreign adversary by the end. permalink award report block reply Beardholder 1 points 2 days ago This is not a win. All airports are suffering proving they need to go to a private company not government. permalink award report block reply katsumi27 1 points 3 days ago Is this because Nancy Pelosi is retiring and they don’t have to feel her wrath anymore? I hope Obama care gets nuked from orbit, and then an amendment made to ban it from ever coming back or anything like it permalink award report block reply YearninNation 1 points 3 days ago the little faggots in the media are at this moment crafting some bullshit propaganda related to this ACA vote, whatever the fuck that is. permalink award report block reply Fromseatoshinningsea 1 points 3 days ago He had to pre permalink award report block reply john9985 1 points 3 days ago How bad did us patriots get fucked? permalink award report block reply Apersonofinterest 1 points 3 days ago I haven’t really noticed anything different. permalink award report block reply BrionK 1 points 3 days ago Shocker as soon as emotional terrorism to rally the base is no longer need the swamp gets back to open theft. Americans deserve to get replaced. Fucking faggots. permalink award report block reply Fromseatoshinningsea 1 points 3 days ago PDJT had to preserve TGiving. permalink award report block reply GabeC1997 1 points 3 days ago DAMMIT! permalink award report block reply Ghost_Soul167 1 points 2 days ago Not the only GOP concession, they have to rehire everyone who was fired or took retirements.... permalink award report block reply BarneyFrank 1 points 3 days ago Hooray!…errr I think permalink award report block reply Wallllllllllllllllll 1 points 2 days ago I think this was preemptive caving by the Democrats. The last thing they want is the Republicans using the nuclear option and being able to pass Trump's agenda. That would allow Trump to fix a lot of problems in America. They don't want that. permalink award report block reply MondayCoupleIsDead 1 points 3 days ago Of course Cornyn is fucking around just to hurt Trump. Scumbag fuck. permalink award report block reply ridge3z 1 points 3 days ago Republicans can maximize their political and public relations (PR) advantage from the end of the government shutdown by focusing their messaging, legislative strategy, and grassroots engagement. This approach involves both highlighting GOP achievements and proactively countering Democratic narratives about the shutdown and healthcare. Here’s a detailed breakdown of how Republicans and their supporters can pull this into their favor: Strategic GOP Messaging Emphasize Responsibility and Stability: Republicans should consistently frame themselves as the party that prioritized the national interest, restoring government services, paychecks for federal workers, and critical programs for families and veterans after weeks of Democratic obstruction. They can stress that they worked across the aisle, while Democrats eventually relented to public pressure.[1][2] Highlight Concessions Won: Reiterate that Democrats failed in their attempt to force through immediate ACA subsidy extensions—these were postponed in favor of a promise for a future Senate vote, not a done deal. Republicans can credit their negotiating strategy for avoiding a costly expansion of government entitlements “forced” by Democrats during a crisis.[3][1] Underscore Economic Impact: Make the case that ending the shutdown limited further economic damage, and warn voters about the dangers of partisan brinkmanship tied to unpopular or costly Democratic demands. Point to restored federal operations, normalizing travel and economic activity before Thanksgiving, as examples of Republican responsiveness.[1] PR and Media Tactics Leverage Social and Conservative Media: Republican officeholders, influencers, and grassroots supporters should flood social media and conservative outlets with concise, repeated talking points about Democratic “hostage-taking,” the hardship caused by the shutdown fight, and the GOP’s solution-oriented approach. Use Testimonials: Spotlight stories of workers and families hurt by the prolonged shutdown, blaming Democratic intransigence. Feature business owners, federal employees, travelers, and beneficiaries of restored programs thanking GOP leaders for reopening the government. Contrast Leadership Styles: Frame President Trump and GOP Senate leaders as “tough negotiators” who forced the opposition to compromise, compared to Democrats who were “divided and unrealistic.” Legislative and Voting Strategy Demand Accountability: Call for hearings, town halls, and investigations into the effects of the Democratic shutdown, using them as campaign platforms to energize conservative voters and independents frustrated by the gridlock. Prepare for ACA Vote: Position the upcoming December vote on ACA subsidies as a chance for Republicans to hold Democrats to account for costly health care proposals—launch educational campaigns about the fiscal downsides of enhanced subsidies and promote alternatives like health savings accounts or private options. Keep Unity: Encourage all wings of the GOP, including more populist (MAGA) factions, to unite behind the narrative that Republican persistence delivered results for ordinary Americans. Grassroots and Regular Citizen Engagement Mobilize Local Activists: Encourage conservatives, MAGA supporters, and regular citizens to call into talk radio, attend local GOP events, and share stories online amplifying the Republican version of events. Use Letter-Writing and Opinion Pieces: Submit op-eds and letters to editors in local newspapers blaming Democrats for the hardship, praising Republican efforts, and warning about future Democratic spending proposals. Challenge Opposing Narratives: Actively push back on Democratic claims that they “protected health care,” emphasizing instead the delays, disruptions, and economic harm their stance created. Counteracting Democrat Narratives Refocus Debate: When Democrats argue that they won a future vote or protected the ACA, Republicans should respond that they forced Democrats to drop their immediate demands, prevented a massive increase in spending, and extracted key concessions on layoffs and SNAP funding. Fact-Check in Real-Time: Use social media graphics, talk shows, and independent fact-checkers to challenge any Democratic claims of overall “victory,” pointing out what was left out or postponed. Engage Independent and Swing Voters: Stress the bipartisan nature of the final deal and frame it as commonsense governance after weeks of unnecessary Democratic-driven pain. By relentlessly repeating these themes and encouraging broad-based participation, the GOP can position the shutdown’s end as a Republican win for order, responsibility, and economic stability, while putting Democrats on the defensive about their strategy and motivations.[2][3][1] 1 2 3 permalink award report block reply here2red 1 points 3 days ago blegh permalink award report block reply Getelectedordietryin 1 points 3 days ago Fucking bull shit I wanted at least a year of the shutdown permalink award report block reply mass55th 1 points 3 days ago Great deal for the RATS so they have three months to get their strategy together for the next continuing resolution. Kick the can down the road again, and there's no guarantee that the next CR will pass so easily in the House next time. permalink award report block reply dres3 1 points 3 days ago \"next month\" that leaves around 30 days for lefty violence in the viscinity of R house members and R Senate members. permalink award report block reply SavingPrivateGrace 1 points 3 days ago Welcome back ya filthy animals. permalink award report block reply jdemarco2014 1 points 3 days ago Great now these disgusting fucking parasites can go back to spending my stolen money permalink award report block reply uniformist 1 points 3 days ago Classic negotiation technique by Trump ... invent something which is nothing, then bargain it away. permalink award report block reply mediweevil 1 points 3 days ago dimmocrats caved as expected.  now vote that shit down once and forever. permalink award report block reply VanDeKoik 0 points 3 days ago Fine agreement. But then again I see things in the real world and not as some clown behind a keyboard that can demand and damn fool thing because doing that is easy. permalink award report block reply YesImWhite 0 points 3 days ago Guess dems realized we shouldnt end the fillibuster after all. Nice leverage play Trump. permalink award report block reply JoinTheDiscussion 0 points 3 days ago there goes republicans chance to remove the filibuster.. country is for sure fucked now.. only thing that will bring it around is watering some trees permalink award report block reply JoinTheDiscussion 0 points 3 days ago great.. now we can pay for the illegals and freeloaders FUCKING SNAP GIBMEDATS AGAIN!!! permalink award report block reply UpvoteBot 0 points 2 days ago I was REALLLLLLYYYYYY hoping the shut down would continue through the holidays so the EBT Americans wouldn’t have their ill gotten monies for Christmas shopping. permalink award report block reply Trumpchoochoo -1 points 3 days ago Doomers incoming permalink award report block reply DT170x -1 points 3 days ago They already here. permalink parent award report block reply fbiizassshoe -2 points 3 days ago Im a veteran who refused the vax and I'm about to call trump a fucking taco president. permalink award report block reply SickOfNeoPolitics -2 points 3 days ago Saw cloud seeding chemtrails in the sky earlier for the first time since the shutdown so I saw this coming. permalink award report block reply tooanalytical -2 points 3 days ago THIS IS HOW YOU WIN. FUCK THESE TERRORISTS HOLDING OUR COUNTRY HOSTAGE. WE DO NOT NEGOTIATE WITH TERRORISTS! permalink award report block reply Kickass2001 2 points 3 days ago Wtf are you talking about? Dems just won the midterms permalink parent award report block reply tooanalytical 1 points 2 days ago What midterms? The midterms that haven’t happened yet? Dems got nothing but a meaningless vote on the floor within 90 days on the extensions, which won’t pass Trump. They got nothing except for the optics they think they got in their delusional minds. permalink parent award report block reply new_guy2 1 points 3 days ago Comment removed by community moderators. permalink award report block reply EyesSewnShut 0 points 2 days ago Comment removed by community moderators. permalink award report block reply\nAquamine-Amarine 322 points 3 days ago Shame, I wanted the shutdown to continue. permalink award report block reply ShlomoJoe 127 points 3 days ago I wanted the whole government to burn down so we could consolidate power under Trump. At that point, real progress could be made in this country. permalink parent award report block reply Than0sIII 47 points 3 days ago And then we'd probably get an actual Civil War. permalink parent award report block reply molonlabe9 57 points 3 days ago Well, he said real progress.  That is technically progression... permalink parent award report block reply lostremote- 35 points 3 days ago something has to be done about these illegals and foreigners usurping power.  a civil war might actually be the trick. permalink parent award report block reply view 4 more comments... Trumpwon306 35 points 3 days ago If you think the way to avoid a civil war is for Republicans not to consolidate power, you need to wear water wings to drink soup. The only way we avoid civil war or worse, is through early action to remigrate millions of foreigners, and defunding leftists projects such as Obamacare so as to deprive their networks of millions if not billions in funding every year. Otherwise it's just a count down to the mid 2030's. permalink parent award report block reply HeavyMetalPatriot 19 points 3 days ago Correct. Either the left is totally destroyed and 50M+ foreigners are tossed out, or America dies in blood. permalink parent award report block reply view 2 more comments... Hunter77 8 points 3 days ago Not sure any of that is enough. There are immense numbers of left leaning citizens in this country. Seems like civil war is inevitable as long as that remains the case. permalink parent award report block reply view 3 more comments... MasterChief08 34 points 3 days ago Last year 70% of active duty military and over 80% of law enforcement voted for Trump. Over 400 sheriffs in America are militia members for right wing clubs and organizations. Sheriffs are 2x more likely to be conservative than the average American voter. A Civil War would be far worse for the left. Leftists in cities would be constantly under fire from gangs so they'd have zero periods of calm while Republicans live far away in secure rural strongholds. And that military number I cited included the 10k LGBT/DEI commisars Hesgeth released this year. permalink parent award report block reply Floridacus 16 points 3 days ago \"Worse\" is a relative term. It would be \"bad\" for everyone. permalink parent award report block reply view 5 more comments... BigIglooActual 6 points 3 days ago The problem is that a civil war will not remain one permalink parent award report block reply view 2 more comments... KungPaoMcChicken 5 points 3 days ago In a civil war, all the illegals would be too scared to stay... permalink parent award report block reply view 2 more comments... ThorsonTT 3 points 3 days ago A civil war would be over in days.  Simply cutting power to some cities would collapse the Left's base. permalink parent award report block reply view 3 more comments... ProfessorJagoff 1 points 3 days ago Comment removed by spam filter, pending further review. permalink parent award report block reply ERIC_CIARAMELLA 3 points 3 days ago Good. permalink parent award report block reply Than0sIII 3 points 3 days ago If you want the country to be fucked over, sure. permalink parent award report block reply view 2 more comments... Quiznos585 3 points 3 days ago GOOD permalink parent award report block reply load 13 more comments... TrustYourself 3 points 3 days ago There is always next month. permalink parent award report block reply Mhmm2MoreWeeks -1 points 3 days ago And other countries too!!! permalink parent award report block reply Polander 49 points 3 days ago Trump was bluffing when he said he'd cut government when it was closed. Might as well leave it open if they aren't going to fix anything permalink parent award report block reply Cyer6 47 points 3 days ago I've been wondering WTF happened to all that? Kinda went away with the Fort Knox gold inspection and \"other things\". permalink parent award report block reply Lelleck 24 points 3 days ago A list of other things.. permalink parent award report block reply DeportThemAllForever 10 points 3 days ago That list is getting really long now... permalink parent award report block reply view 1 more comments... GodBlessColumbia 21 points 3 days ago He bluffs about a lot of things.  Locking Hillary up for example.  Obamagate will turn out to be a big bluff too I’d wager permalink parent award report block reply Gadsden 9 points 3 days ago He said in a interview that he had the chance to put Hilary in prison, and it was justified to do so. But he didn't, because he thought it was bad for the overall country. Bet he regrets that, now. permalink parent award report block reply Brakesbreaktrains2 4 points 3 days ago Can I assume this was before they shot him then shot at him again? permalink parent award report block reply view 2 more comments... UCantStumpTheTrump 2 points 3 days ago Yeah, I don't see Trump making the same mistake twice, hence why all these federal grand jury indictments are coming down for the people who tried to illegally oust Trump... permalink parent award report block reply cardinaldrones 1 points 3 days ago Maybe that’s his weakness.  A politician that actually listens to him word for word and takes his bluffs seriously. permalink parent award report block reply Burisma 2 points 3 days ago You think this is the end? This was phase 2. You've learned nothing. permalink parent award report block reply Tellman125 2 points 3 days ago The Art of the Semi-Sorta-Shutdown P.R. Campaign? Tens of thousands of people were furloughed though: https://en.wikipedia.org/wiki/2025_United_States_federal_government_shutdown#Furloughed_workers permalink parent award report block reply 1_Badcop -7 points 3 days ago TACO permalink parent award report block reply Shih_Tabed 2 points 2 days ago Trump Always Creates Opportunities permalink parent award report block reply 1_Badcop 0 points 2 days ago To Be Disappointed permalink parent award report block reply view 1 more comments... SavingPrivateGrace 19 points 3 days ago I wanted the filibuster axed. permalink parent award report block reply Hikedelics 11 points 3 days ago Any of you guys actually notice any difference at all during the shutdown? I was going to say that I didn’t, but I did just remember in the first week we went to Rocky Mountain National Park and they didn’t give a shit if we had park passes or not. That was it. In 40 days. Should have let the bitch stayed shutdown permanently. permalink parent award report block reply Underpants 3 points 3 days ago Eh... as fun as it is to say that... I need my ATC friends to get paid. permalink parent award report block reply load 8 more comments...\nShlomoJoe 127 points 3 days ago I wanted the whole government to burn down so we could consolidate power under Trump. At that point, real progress could be made in this country. permalink parent award report block reply Than0sIII 47 points 3 days ago And then we'd probably get an actual Civil War. permalink parent award report block reply molonlabe9 57 points 3 days ago Well, he said real progress.  That is technically progression... permalink parent award report block reply lostremote- 35 points 3 days ago something has to be done about these illegals and foreigners usurping power.  a civil war might actually be the trick. permalink parent award report block reply view 4 more comments... Trumpwon306 35 points 3 days ago If you think the way to avoid a civil war is for Republicans not to consolidate power, you need to wear water wings to drink soup. The only way we avoid civil war or worse, is through early action to remigrate millions of foreigners, and defunding leftists projects such as Obamacare so as to deprive their networks of millions if not billions in funding every year. Otherwise it's just a count down to the mid 2030's. permalink parent award report block reply HeavyMetalPatriot 19 points 3 days ago Correct. Either the left is totally destroyed and 50M+ foreigners are tossed out, or America dies in blood. permalink parent award report block reply view 2 more comments... Hunter77 8 points 3 days ago Not sure any of that is enough. There are immense numbers of left leaning citizens in this country. Seems like civil war is inevitable as long as that remains the case. permalink parent award report block reply view 3 more comments... MasterChief08 34 points 3 days ago Last year 70% of active duty military and over 80% of law enforcement voted for Trump. Over 400 sheriffs in America are militia members for right wing clubs and organizations. Sheriffs are 2x more likely to be conservative than the average American voter. A Civil War would be far worse for the left. Leftists in cities would be constantly under fire from gangs so they'd have zero periods of calm while Republicans live far away in secure rural strongholds. And that military number I cited included the 10k LGBT/DEI commisars Hesgeth released this year. permalink parent award report block reply Floridacus 16 points 3 days ago \"Worse\" is a relative term. It would be \"bad\" for everyone. permalink parent award report block reply view 5 more comments... BigIglooActual 6 points 3 days ago The problem is that a civil war will not remain one permalink parent award report block reply view 2 more comments... KungPaoMcChicken 5 points 3 days ago In a civil war, all the illegals would be too scared to stay... permalink parent award report block reply view 2 more comments... ThorsonTT 3 points 3 days ago A civil war would be over in days.  Simply cutting power to some cities would collapse the Left's base. permalink parent award report block reply view 3 more comments... ProfessorJagoff 1 points 3 days ago Comment removed by spam filter, pending further review. permalink parent award report block reply ERIC_CIARAMELLA 3 points 3 days ago Good. permalink parent award report block reply Than0sIII 3 points 3 days ago If you want the country to be fucked over, sure. permalink parent award report block reply view 2 more comments... Quiznos585 3 points 3 days ago GOOD permalink parent award report block reply load 13 more comments... TrustYourself 3 points 3 days ago There is always next month. permalink parent award report block reply Mhmm2MoreWeeks -1 points 3 days ago And other countries too!!! permalink parent award report block reply\nThan0sIII 47 points 3 days ago And then we'd probably get an actual Civil War. permalink parent award report block reply molonlabe9 57 points 3 days ago Well, he said real progress.  That is technically progression... permalink parent award report block reply lostremote- 35 points 3 days ago something has to be done about these illegals and foreigners usurping power.  a civil war might actually be the trick. permalink parent award report block reply view 4 more comments... Trumpwon306 35 points 3 days ago If you think the way to avoid a civil war is for Republicans not to consolidate power, you need to wear water wings to drink soup. The only way we avoid civil war or worse, is through early action to remigrate millions of foreigners, and defunding leftists projects such as Obamacare so as to deprive their networks of millions if not billions in funding every year. Otherwise it's just a count down to the mid 2030's. permalink parent award report block reply HeavyMetalPatriot 19 points 3 days ago Correct. Either the left is totally destroyed and 50M+ foreigners are tossed out, or America dies in blood. permalink parent award report block reply view 2 more comments... Hunter77 8 points 3 days ago Not sure any of that is enough. There are immense numbers of left leaning citizens in this country. Seems like civil war is inevitable as long as that remains the case. permalink parent award report block reply view 3 more comments... MasterChief08 34 points 3 days ago Last year 70% of active duty military and over 80% of law enforcement voted for Trump. Over 400 sheriffs in America are militia members for right wing clubs and organizations. Sheriffs are 2x more likely to be conservative than the average American voter. A Civil War would be far worse for the left. Leftists in cities would be constantly under fire from gangs so they'd have zero periods of calm while Republicans live far away in secure rural strongholds. And that military number I cited included the 10k LGBT/DEI commisars Hesgeth released this year. permalink parent award report block reply Floridacus 16 points 3 days ago \"Worse\" is a relative term. It would be \"bad\" for everyone. permalink parent award report block reply view 5 more comments... BigIglooActual 6 points 3 days ago The problem is that a civil war will not remain one permalink parent award report block reply view 2 more comments... KungPaoMcChicken 5 points 3 days ago In a civil war, all the illegals would be too scared to stay... permalink parent award report block reply view 2 more comments... ThorsonTT 3 points 3 days ago A civil war would be over in days.  Simply cutting power to some cities would collapse the Left's base. permalink parent award report block reply view 3 more comments... ProfessorJagoff 1 points 3 days ago Comment removed by spam filter, pending further review. permalink parent award report block reply ERIC_CIARAMELLA 3 points 3 days ago Good. permalink parent award report block reply Than0sIII 3 points 3 days ago If you want the country to be fucked over, sure. permalink parent award report block reply view 2 more comments... Quiznos585 3 points 3 days ago GOOD permalink parent award report block reply load 13 more comments...\nmolonlabe9 57 points 3 days ago Well, he said real progress.  That is technically progression... permalink parent award report block reply lostremote- 35 points 3 days ago something has to be done about these illegals and foreigners usurping power.  a civil war might actually be the trick. permalink parent award report block reply view 4 more comments...\nlostremote- 35 points 3 days ago something has to be done about these illegals and foreigners usurping power.  a civil war might actually be the trick. permalink parent award report block reply view 4 more comments...\nTrumpwon306 35 points 3 days ago If you think the way to avoid a civil war is for Republicans not to consolidate power, you need to wear water wings to drink soup. The only way we avoid civil war or worse, is through early action to remigrate millions of foreigners, and defunding leftists projects such as Obamacare so as to deprive their networks of millions if not billions in funding every year. Otherwise it's just a count down to the mid 2030's. permalink parent award report block reply HeavyMetalPatriot 19 points 3 days ago Correct. Either the left is totally destroyed and 50M+ foreigners are tossed out, or America dies in blood. permalink parent award report block reply view 2 more comments... Hunter77 8 points 3 days ago Not sure any of that is enough. There are immense numbers of left leaning citizens in this country. Seems like civil war is inevitable as long as that remains the case. permalink parent award report block reply view 3 more comments...\nHeavyMetalPatriot 19 points 3 days ago Correct. Either the left is totally destroyed and 50M+ foreigners are tossed out, or America dies in blood. permalink parent award report block reply view 2 more comments...\nHunter77 8 points 3 days ago Not sure any of that is enough. There are immense numbers of left leaning citizens in this country. Seems like civil war is inevitable as long as that remains the case. permalink parent award report block reply view 3 more comments...\nMasterChief08 34 points 3 days ago Last year 70% of active duty military and over 80% of law enforcement voted for Trump. Over 400 sheriffs in America are militia members for right wing clubs and organizations. Sheriffs are 2x more likely to be conservative than the average American voter. A Civil War would be far worse for the left. Leftists in cities would be constantly under fire from gangs so they'd have zero periods of calm while Republicans live far away in secure rural strongholds. And that military number I cited included the 10k LGBT/DEI commisars Hesgeth released this year. permalink parent award report block reply Floridacus 16 points 3 days ago \"Worse\" is a relative term. It would be \"bad\" for everyone. permalink parent award report block reply view 5 more comments... BigIglooActual 6 points 3 days ago The problem is that a civil war will not remain one permalink parent award report block reply view 2 more comments... KungPaoMcChicken 5 points 3 days ago In a civil war, all the illegals would be too scared to stay... permalink parent award report block reply view 2 more comments... ThorsonTT 3 points 3 days ago A civil war would be over in days.  Simply cutting power to some cities would collapse the Left's base. permalink parent award report block reply view 3 more comments... ProfessorJagoff 1 points 3 days ago Comment removed by spam filter, pending further review. permalink parent award report block reply\nFloridacus 16 points 3 days ago \"Worse\" is a relative term. It would be \"bad\" for everyone. permalink parent award report block reply view 5 more comments...\nBigIglooActual 6 points 3 days ago The problem is that a civil war will not remain one permalink parent award report block reply view 2 more comments...\nKungPaoMcChicken 5 points 3 days ago In a civil war, all the illegals would be too scared to stay... permalink parent award report block reply view 2 more comments...\nThorsonTT 3 points 3 days ago A civil war would be over in days.  Simply cutting power to some cities would collapse the Left's base. permalink parent award report block reply view 3 more comments...\nProfessorJagoff 1 points 3 days ago Comment removed by spam filter, pending further review. permalink parent award report block reply\nERIC_CIARAMELLA 3 points 3 days ago Good. permalink parent award report block reply Than0sIII 3 points 3 days ago If you want the country to be fucked over, sure. permalink parent award report block reply view 2 more comments...\nThan0sIII 3 points 3 days ago If you want the country to be fucked over, sure. permalink parent award report block reply view 2 more comments...\nQuiznos585 3 points 3 days ago GOOD permalink parent award report block reply\nTrustYourself 3 points 3 days ago There is always next month. permalink parent award report block reply\nMhmm2MoreWeeks -1 points 3 days ago And other countries too!!! permalink parent award report block reply\nPolander 49 points 3 days ago Trump was bluffing when he said he'd cut government when it was closed. Might as well leave it open if they aren't going to fix anything permalink parent award report block reply Cyer6 47 points 3 days ago I've been wondering WTF happened to all that? Kinda went away with the Fort Knox gold inspection and \"other things\". permalink parent award report block reply Lelleck 24 points 3 days ago A list of other things.. permalink parent award report block reply DeportThemAllForever 10 points 3 days ago That list is getting really long now... permalink parent award report block reply view 1 more comments... GodBlessColumbia 21 points 3 days ago He bluffs about a lot of things.  Locking Hillary up for example.  Obamagate will turn out to be a big bluff too I’d wager permalink parent award report block reply Gadsden 9 points 3 days ago He said in a interview that he had the chance to put Hilary in prison, and it was justified to do so. But he didn't, because he thought it was bad for the overall country. Bet he regrets that, now. permalink parent award report block reply Brakesbreaktrains2 4 points 3 days ago Can I assume this was before they shot him then shot at him again? permalink parent award report block reply view 2 more comments... UCantStumpTheTrump 2 points 3 days ago Yeah, I don't see Trump making the same mistake twice, hence why all these federal grand jury indictments are coming down for the people who tried to illegally oust Trump... permalink parent award report block reply cardinaldrones 1 points 3 days ago Maybe that’s his weakness.  A politician that actually listens to him word for word and takes his bluffs seriously. permalink parent award report block reply Burisma 2 points 3 days ago You think this is the end? This was phase 2. You've learned nothing. permalink parent award report block reply Tellman125 2 points 3 days ago The Art of the Semi-Sorta-Shutdown P.R. Campaign? Tens of thousands of people were furloughed though: https://en.wikipedia.org/wiki/2025_United_States_federal_government_shutdown#Furloughed_workers permalink parent award report block reply 1_Badcop -7 points 3 days ago TACO permalink parent award report block reply Shih_Tabed 2 points 2 days ago Trump Always Creates Opportunities permalink parent award report block reply 1_Badcop 0 points 2 days ago To Be Disappointed permalink parent award report block reply view 1 more comments...\nCyer6 47 points 3 days ago I've been wondering WTF happened to all that? Kinda went away with the Fort Knox gold inspection and \"other things\". permalink parent award report block reply Lelleck 24 points 3 days ago A list of other things.. permalink parent award report block reply DeportThemAllForever 10 points 3 days ago That list is getting really long now... permalink parent award report block reply view 1 more comments...\nLelleck 24 points 3 days ago A list of other things.. permalink parent award report block reply DeportThemAllForever 10 points 3 days ago That list is getting really long now... permalink parent award report block reply view 1 more comments...\nDeportThemAllForever 10 points 3 days ago That list is getting really long now... permalink parent award report block reply view 1 more comments...\nGodBlessColumbia 21 points 3 days ago He bluffs about a lot of things.  Locking Hillary up for example.  Obamagate will turn out to be a big bluff too I’d wager permalink parent award report block reply Gadsden 9 points 3 days ago He said in a interview that he had the chance to put Hilary in prison, and it was justified to do so. But he didn't, because he thought it was bad for the overall country. Bet he regrets that, now. permalink parent award report block reply Brakesbreaktrains2 4 points 3 days ago Can I assume this was before they shot him then shot at him again? permalink parent award report block reply view 2 more comments... UCantStumpTheTrump 2 points 3 days ago Yeah, I don't see Trump making the same mistake twice, hence why all these federal grand jury indictments are coming down for the people who tried to illegally oust Trump... permalink parent award report block reply cardinaldrones 1 points 3 days ago Maybe that’s his weakness.  A politician that actually listens to him word for word and takes his bluffs seriously. permalink parent award report block reply\nGadsden 9 points 3 days ago He said in a interview that he had the chance to put Hilary in prison, and it was justified to do so. But he didn't, because he thought it was bad for the overall country. Bet he regrets that, now. permalink parent award report block reply Brakesbreaktrains2 4 points 3 days ago Can I assume this was before they shot him then shot at him again? permalink parent award report block reply view 2 more comments... UCantStumpTheTrump 2 points 3 days ago Yeah, I don't see Trump making the same mistake twice, hence why all these federal grand jury indictments are coming down for the people who tried to illegally oust Trump... permalink parent award report block reply\nBrakesbreaktrains2 4 points 3 days ago Can I assume this was before they shot him then shot at him again? permalink parent award report block reply view 2 more comments...\nUCantStumpTheTrump 2 points 3 days ago Yeah, I don't see Trump making the same mistake twice, hence why all these federal grand jury indictments are coming down for the people who tried to illegally oust Trump... permalink parent award report block reply\ncardinaldrones 1 points 3 days ago Maybe that’s his weakness.  A politician that actually listens to him word for word and takes his bluffs seriously. permalink parent award report block reply\nBurisma 2 points 3 days ago You think this is the end? This was phase 2. You've learned nothing. permalink parent award report block reply\nTellman125 2 points 3 days ago The Art of the Semi-Sorta-Shutdown P.R. Campaign? Tens of thousands of people were furloughed though: https://en.wikipedia.org/wiki/2025_United_States_federal_government_shutdown#Furloughed_workers permalink parent award report block reply\n1_Badcop -7 points 3 days ago TACO permalink parent award report block reply Shih_Tabed 2 points 2 days ago Trump Always Creates Opportunities permalink parent award report block reply 1_Badcop 0 points 2 days ago To Be Disappointed permalink parent award report block reply view 1 more comments...\nShih_Tabed 2 points 2 days ago Trump Always Creates Opportunities permalink parent award report block reply 1_Badcop 0 points 2 days ago To Be Disappointed permalink parent award report block reply view 1 more comments...\n1_Badcop 0 points 2 days ago To Be Disappointed permalink parent award report block reply view 1 more comments...\nSavingPrivateGrace 19 points 3 days ago I wanted the filibuster axed. permalink parent award report block reply\nHikedelics 11 points 3 days ago Any of you guys actually notice any difference at all during the shutdown? I was going to say that I didn’t, but I did just remember in the first week we went to Rocky Mountain National Park and they didn’t give a shit if we had park passes or not. That was it. In 40 days. Should have let the bitch stayed shutdown permanently. permalink parent award report block reply\nUnderpants 3 points 3 days ago Eh... as fun as it is to say that... I need my ATC friends to get paid. permalink parent award report block reply\nMickHigan2 170 points 3 days ago Which way from Sunday are we getting screwed? permalink award report block reply Tryhardneckbeard 136 points 3 days ago The fact that this is a CR at Biden Spending levels... permalink parent award report block reply henri_derelicte 41 points 3 days ago Didn’t multiple GOP votes to reopen the government keep spending at current levels? permalink parent award report block reply Gletkin 22 points 3 days ago GOP is mostly grifting professional political profiteers like everyone else in DC. permalink parent award report block reply Simple_Doot 7 points 3 days ago Republicans are exactly as shitty as Dems when it comes to spending.  There is no way to stop the spending - ever. permalink parent award report block reply lemonparty 18 points 3 days ago Don't the BBB cuts hit Jan 1? permalink parent award report block reply SicSemperTyrannis2 12 points 3 days ago No, they were all \"ruled against\" by the Parliamentarian, and VP who had sole power to axe all that, did nothing. permalink parent award report block reply Hanging_Chad 0 points 3 days ago has he explained why he did nothing? permalink parent award report block reply view 1 more comments... ParmesanCartel 1 points 3 days ago \"cuts\"... Plus 2 trillion permalink parent award report block reply lefty295 15 points 3 days ago Correct, the game was always rigged in the first place. permalink parent award report block reply KernalMustard 2 points 3 days ago House always wins permalink parent award report block reply Tellman125 1 points 3 days ago Is Jeffries the dealer? permalink parent award report block reply DRKMSTR 5 points 3 days ago All this time and they can't do a budget permalink parent award report block reply MastaJoda 4 points 3 days ago We haven't balanced the budget since Bubba was president, and he used Social Security ''surplus'' to achieve that. Clinton's Congress just stole from everyones SS retirement. Lol Fuck this government. permalink parent award report block reply Hellsbells00 3 points 3 days ago Social security was pillaged from day one. It was never really a retirement fund, it was a government operated pyramid scheme. Social security is nothing more than a tax with a giant lying PR campaign. permalink parent award report block reply view 2 more comments... DeportThemAllForever 1 points 3 days ago Correction:  They can, but they won't. permalink parent award report block reply SpeekFreely 11 points 3 days ago Let it cook a couple hours, the commies will be out bragging for their next fundraiser. permalink parent award report block reply Brownwaterboys 5 points 3 days ago every way :D permalink parent award report block reply JesusTheOnlyWay 4 points 3 days ago Muh gibs fully restored. Maybe they'll double snap for Kangs so we have the privilege of working a 2nd or 3rd job and not seeing our wife or children. At least they can get ps5 though permalink parent award report block reply DingleBalls 4 points 3 days ago #6 permalink parent award report block reply load 28 more comments...\nTryhardneckbeard 136 points 3 days ago The fact that this is a CR at Biden Spending levels... permalink parent award report block reply henri_derelicte 41 points 3 days ago Didn’t multiple GOP votes to reopen the government keep spending at current levels? permalink parent award report block reply Gletkin 22 points 3 days ago GOP is mostly grifting professional political profiteers like everyone else in DC. permalink parent award report block reply Simple_Doot 7 points 3 days ago Republicans are exactly as shitty as Dems when it comes to spending.  There is no way to stop the spending - ever. permalink parent award report block reply lemonparty 18 points 3 days ago Don't the BBB cuts hit Jan 1? permalink parent award report block reply SicSemperTyrannis2 12 points 3 days ago No, they were all \"ruled against\" by the Parliamentarian, and VP who had sole power to axe all that, did nothing. permalink parent award report block reply Hanging_Chad 0 points 3 days ago has he explained why he did nothing? permalink parent award report block reply view 1 more comments... ParmesanCartel 1 points 3 days ago \"cuts\"... Plus 2 trillion permalink parent award report block reply lefty295 15 points 3 days ago Correct, the game was always rigged in the first place. permalink parent award report block reply KernalMustard 2 points 3 days ago House always wins permalink parent award report block reply Tellman125 1 points 3 days ago Is Jeffries the dealer? permalink parent award report block reply DRKMSTR 5 points 3 days ago All this time and they can't do a budget permalink parent award report block reply MastaJoda 4 points 3 days ago We haven't balanced the budget since Bubba was president, and he used Social Security ''surplus'' to achieve that. Clinton's Congress just stole from everyones SS retirement. Lol Fuck this government. permalink parent award report block reply Hellsbells00 3 points 3 days ago Social security was pillaged from day one. It was never really a retirement fund, it was a government operated pyramid scheme. Social security is nothing more than a tax with a giant lying PR campaign. permalink parent award report block reply view 2 more comments... DeportThemAllForever 1 points 3 days ago Correction:  They can, but they won't. permalink parent award report block reply\nhenri_derelicte 41 points 3 days ago Didn’t multiple GOP votes to reopen the government keep spending at current levels? permalink parent award report block reply Gletkin 22 points 3 days ago GOP is mostly grifting professional political profiteers like everyone else in DC. permalink parent award report block reply Simple_Doot 7 points 3 days ago Republicans are exactly as shitty as Dems when it comes to spending.  There is no way to stop the spending - ever. permalink parent award report block reply\nGletkin 22 points 3 days ago GOP is mostly grifting professional political profiteers like everyone else in DC. permalink parent award report block reply\nSimple_Doot 7 points 3 days ago Republicans are exactly as shitty as Dems when it comes to spending.  There is no way to stop the spending - ever. permalink parent award report block reply\nlemonparty 18 points 3 days ago Don't the BBB cuts hit Jan 1? permalink parent award report block reply SicSemperTyrannis2 12 points 3 days ago No, they were all \"ruled against\" by the Parliamentarian, and VP who had sole power to axe all that, did nothing. permalink parent award report block reply Hanging_Chad 0 points 3 days ago has he explained why he did nothing? permalink parent award report block reply view 1 more comments... ParmesanCartel 1 points 3 days ago \"cuts\"... Plus 2 trillion permalink parent award report block reply\nSicSemperTyrannis2 12 points 3 days ago No, they were all \"ruled against\" by the Parliamentarian, and VP who had sole power to axe all that, did nothing. permalink parent award report block reply Hanging_Chad 0 points 3 days ago has he explained why he did nothing? permalink parent award report block reply view 1 more comments...\nHanging_Chad 0 points 3 days ago has he explained why he did nothing? permalink parent award report block reply view 1 more comments...\nParmesanCartel 1 points 3 days ago \"cuts\"... Plus 2 trillion permalink parent award report block reply\nlefty295 15 points 3 days ago Correct, the game was always rigged in the first place. permalink parent award report block reply KernalMustard 2 points 3 days ago House always wins permalink parent award report block reply Tellman125 1 points 3 days ago Is Jeffries the dealer? permalink parent award report block reply\nKernalMustard 2 points 3 days ago House always wins permalink parent award report block reply Tellman125 1 points 3 days ago Is Jeffries the dealer? permalink parent award report block reply\nTellman125 1 points 3 days ago Is Jeffries the dealer? permalink parent award report block reply\nDRKMSTR 5 points 3 days ago All this time and they can't do a budget permalink parent award report block reply MastaJoda 4 points 3 days ago We haven't balanced the budget since Bubba was president, and he used Social Security ''surplus'' to achieve that. Clinton's Congress just stole from everyones SS retirement. Lol Fuck this government. permalink parent award report block reply Hellsbells00 3 points 3 days ago Social security was pillaged from day one. It was never really a retirement fund, it was a government operated pyramid scheme. Social security is nothing more than a tax with a giant lying PR campaign. permalink parent award report block reply view 2 more comments... DeportThemAllForever 1 points 3 days ago Correction:  They can, but they won't. permalink parent award report block reply\nMastaJoda 4 points 3 days ago We haven't balanced the budget since Bubba was president, and he used Social Security ''surplus'' to achieve that. Clinton's Congress just stole from everyones SS retirement. Lol Fuck this government. permalink parent award report block reply Hellsbells00 3 points 3 days ago Social security was pillaged from day one. It was never really a retirement fund, it was a government operated pyramid scheme. Social security is nothing more than a tax with a giant lying PR campaign. permalink parent award report block reply view 2 more comments...\nHellsbells00 3 points 3 days ago Social security was pillaged from day one. It was never really a retirement fund, it was a government operated pyramid scheme. Social security is nothing more than a tax with a giant lying PR campaign. permalink parent award report block reply view 2 more comments...\nDeportThemAllForever 1 points 3 days ago Correction:  They can, but they won't. permalink parent award report block reply\nSpeekFreely 11 points 3 days ago Let it cook a couple hours, the commies will be out bragging for their next fundraiser. permalink parent award report block reply\nBrownwaterboys 5 points 3 days ago every way :D permalink parent award report block reply\nJesusTheOnlyWay 4 points 3 days ago Muh gibs fully restored. Maybe they'll double snap for Kangs so we have the privilege of working a 2nd or 3rd job and not seeing our wife or children. At least they can get ps5 though permalink parent award report block reply\nDingleBalls 4 points 3 days ago #6 permalink parent award report block reply\nlemonparty 88 points 3 days ago My initial read here, and I do hope that I am right is this:  the Democrats lost this one, and they needed an \"out\" that made it look like they got something.   Like Iran being able to \"punch back\" and hit a few patches of dirt. I'm aware of rose-colored glasses, and the GOP has stabbed us in the back too many times to trust, but this looks like a pretty big win. permalink award report block reply JohnN 65 points 3 days ago I gotta disagree.  Yes, the Dems caved.  Yes, it's great to see it.  But from now until the midterms... -- \"We had no choice; people were going to starve to death.\" -- \"Your healthcare premiums are going up because of the GOP.\" This will be non-stop.  Many stupid white women will be empathetic. permalink parent award report block reply Trumpwon306 28 points 3 days ago Dems didn't cave to shit. They got what they wanted and the Charlie Brown republicans keep trying to kick the football. They lost nothing. At this point it would have been better for Republicans to keep the shutdown going until the pressure from our side was such that the filibuster was removed or we used the threat of which to demand that democrats vote down filibustering from their side so we could actually pass legislation that might actually help white americans. permalink parent award report block reply Tellman125 4 points 3 days ago It's all about perception as shaped on social media by brief posts from politicians and prominent political accounts; that is THE media now. permalink parent award report block reply Repentnow 2 points 3 days ago Yep, buts exactly why the uniparty wrapped this thing up before there could be a vote to nuke the filibuster. permalink parent award report block reply ForceMultiplier 2 points 2 days ago Any Senator could delay this for at least a couple of days The House will need to be called back into session and pass it before it gets to Trump's desk. Any Dem that tried to delay reopening the Government could be used as a pretext to nuke the Filibuster. Dems will nuke the filibuster, pack the courts, and prosecute anyone not pardoned if we can't fix election fraud and they cheat their way back into power. Fixing election fraud would force Dems back toward the center because that's the only way they could get elected. permalink parent award report block reply MAGA_APN 19 points 3 days ago Yup-I know several permalink parent award report block reply EgregiousPhilbin 16 points 3 days ago Hey here's a thought. Call me crazy. Maybe our side could put up a fight or improve their messaging? Nah, what was I thinking. permalink parent award report block reply ForceMultiplier 2 points 2 days ago The MSM lies and distorts. What are your ideas to improve GOP messaging? permalink parent award report block reply ListenJack 7 points 3 days ago ACA subsidies are a political ticking time bomb. The only way out of that mess is for the Reps to offer something better than what the ACA is right now OR fund the stupid subsidy past 2026. My money is on the later. permalink parent award report block reply KernalMustard 4 points 3 days ago How about not having it. permalink parent award report block reply ListenJack 1 points 3 days ago Lame duck for dinner please! permalink parent award report block reply ForceMultiplier 2 points 2 days ago Republicans don't seem to have a plan to replace the \"Affordable\" Care Act. I would love to hear a comprehensive plan permalink parent award report block reply tired-of-crap 2 points 2 days ago There is discussion about taking the subsidies and the positing it into a health savings account instead of providing ACA insurance. Most people don't get anything back because of the high deductible so this way at least they would get some health care. permalink parent award report block reply ListenJack 1 points 2 days ago Thats definitely an improvement from where it’s currently at. permalink parent award report block reply HunterBidensPC 2 points 3 days ago Hard to do when everyone can just point to trumps multiple tweets in all caps begging Dems to end the shutdown and demanding GOP ends the filibuster permalink parent award report block reply load 13 more comments... genericamerican69 41 points 3 days ago If you think the average person blames the democrats for the snap outages etc.. you are sorely mistaken. Anyway mass deportations would solve every problem permalink parent award report block reply EgregiousPhilbin 25 points 3 days ago “Think about how stupid the average person is, and realize half of them are stupider than that.” permalink parent award report block reply Aambrick 8 points 3 days ago I do know a similar quote: The average person isn't stupid. The average person is gullible. Half of them will always believe the lie because they cannot ever face the truth, otherwise, it will shatter their little shadow theatre. They believe in shadows more than an actual person waving a hand in front of their face. Just the observation in the last 20 years. permalink parent award report block reply Repentnow 5 points 3 days ago Being gullible is literally being stupid. permalink parent award report block reply view 1 more comments... Lib_Women_Have_HSV 2 points 3 days ago I saw protesters in Springfield IL that waved at me when I gave a Nazi salute. permalink parent award report block reply ChinaFlu 1 points 3 days ago Elwood: \"Illinois Nazis\"\nJake: \"I hate Illinois Nazis\" permalink parent award report block reply view 1 more comments... Beachboy1b 5 points 3 days ago Mass deportation would absolutely solve every problem. As to the first part of your comment, we NEED to spread this information far and wide. permalink parent award report block reply MajorClark 9 points 3 days ago Looks can be deceiving.  The time frame isn't good.  This will buy the crooked democrats time to pay off the crooked republican rinos to vote in their favor.  We know there at at least 12 rino's that can't be trusted. permalink parent award report block reply Deplora 15 points 3 days ago If people who rely on SNAP and people who were planning to fly somewhere for Thanksgiving with family all get their Thanksgiving ruined because of the shutdown, Republicans would be screwed in the midterms, meaning Trump would be screwed for the second half of his term.  Absolutely not worth it. u/lemonparty permalink parent award report block reply MajorClark 8 points 3 days ago Again!   Congress did this.   Trump didn't shut anything down and Republicans voted 15 times to leave the govt. open.  What is it that you just don't get?   It's a #SchumerShutDown. permalink parent award report block reply Deplora 25 points 3 days ago It's not that I don't get it, but millions of low-information voters don't get it, and Dem political operatives aggressively \"help\" them to draw the wrong conclusions.  All they get is that their flight is cancelled or their SNAP benefits didn't show up as usual, and Trump is President. permalink parent award report block reply view 2 more comments... Seruna_Kanus 7 points 3 days ago Retards don't know or care how politics work and will blame Trump for not being the dictator that the media claims him to be. permalink parent award report block reply tholinz 5 points 3 days ago Yes but there are a lot of idiots out there who'll believe whatever CNN or their favorite idiot influencer on TikTok says. Reality doesn't matter; perception does. Now the Dems can't blame Trump for ruining Thanksgiving. permalink parent award report block reply KernalMustard 2 points 3 days ago Trump is Republican. Republicans shut it down.  Hence Trump shut it down in the left eyes. permalink parent award report block reply HoganT 1 points 3 days ago Democrats would have voted 15 times to open it too if they had the ability to bring votes to the floor on it. And we would have voted against their methods. permalink parent award report block reply Klaus73 7 points 3 days ago Everyone is gonna claim this is a win; thats just the way it works - they are all telling the truth ironically enough; only the public loses. permalink parent award report block reply Goozmania 3 points 3 days ago They rehired everyone Trump fired for the past 2 months. Republicans caved, despite having no reason to. permalink parent award report block reply load 5 more comments...\nJohnN 65 points 3 days ago I gotta disagree.  Yes, the Dems caved.  Yes, it's great to see it.  But from now until the midterms... -- \"We had no choice; people were going to starve to death.\" -- \"Your healthcare premiums are going up because of the GOP.\" This will be non-stop.  Many stupid white women will be empathetic. permalink parent award report block reply Trumpwon306 28 points 3 days ago Dems didn't cave to shit. They got what they wanted and the Charlie Brown republicans keep trying to kick the football. They lost nothing. At this point it would have been better for Republicans to keep the shutdown going until the pressure from our side was such that the filibuster was removed or we used the threat of which to demand that democrats vote down filibustering from their side so we could actually pass legislation that might actually help white americans. permalink parent award report block reply Tellman125 4 points 3 days ago It's all about perception as shaped on social media by brief posts from politicians and prominent political accounts; that is THE media now. permalink parent award report block reply Repentnow 2 points 3 days ago Yep, buts exactly why the uniparty wrapped this thing up before there could be a vote to nuke the filibuster. permalink parent award report block reply ForceMultiplier 2 points 2 days ago Any Senator could delay this for at least a couple of days The House will need to be called back into session and pass it before it gets to Trump's desk. Any Dem that tried to delay reopening the Government could be used as a pretext to nuke the Filibuster. Dems will nuke the filibuster, pack the courts, and prosecute anyone not pardoned if we can't fix election fraud and they cheat their way back into power. Fixing election fraud would force Dems back toward the center because that's the only way they could get elected. permalink parent award report block reply MAGA_APN 19 points 3 days ago Yup-I know several permalink parent award report block reply EgregiousPhilbin 16 points 3 days ago Hey here's a thought. Call me crazy. Maybe our side could put up a fight or improve their messaging? Nah, what was I thinking. permalink parent award report block reply ForceMultiplier 2 points 2 days ago The MSM lies and distorts. What are your ideas to improve GOP messaging? permalink parent award report block reply ListenJack 7 points 3 days ago ACA subsidies are a political ticking time bomb. The only way out of that mess is for the Reps to offer something better than what the ACA is right now OR fund the stupid subsidy past 2026. My money is on the later. permalink parent award report block reply KernalMustard 4 points 3 days ago How about not having it. permalink parent award report block reply ListenJack 1 points 3 days ago Lame duck for dinner please! permalink parent award report block reply ForceMultiplier 2 points 2 days ago Republicans don't seem to have a plan to replace the \"Affordable\" Care Act. I would love to hear a comprehensive plan permalink parent award report block reply tired-of-crap 2 points 2 days ago There is discussion about taking the subsidies and the positing it into a health savings account instead of providing ACA insurance. Most people don't get anything back because of the high deductible so this way at least they would get some health care. permalink parent award report block reply ListenJack 1 points 2 days ago Thats definitely an improvement from where it’s currently at. permalink parent award report block reply HunterBidensPC 2 points 3 days ago Hard to do when everyone can just point to trumps multiple tweets in all caps begging Dems to end the shutdown and demanding GOP ends the filibuster permalink parent award report block reply load 13 more comments...\nTrumpwon306 28 points 3 days ago Dems didn't cave to shit. They got what they wanted and the Charlie Brown republicans keep trying to kick the football. They lost nothing. At this point it would have been better for Republicans to keep the shutdown going until the pressure from our side was such that the filibuster was removed or we used the threat of which to demand that democrats vote down filibustering from their side so we could actually pass legislation that might actually help white americans. permalink parent award report block reply Tellman125 4 points 3 days ago It's all about perception as shaped on social media by brief posts from politicians and prominent political accounts; that is THE media now. permalink parent award report block reply Repentnow 2 points 3 days ago Yep, buts exactly why the uniparty wrapped this thing up before there could be a vote to nuke the filibuster. permalink parent award report block reply ForceMultiplier 2 points 2 days ago Any Senator could delay this for at least a couple of days The House will need to be called back into session and pass it before it gets to Trump's desk. Any Dem that tried to delay reopening the Government could be used as a pretext to nuke the Filibuster. Dems will nuke the filibuster, pack the courts, and prosecute anyone not pardoned if we can't fix election fraud and they cheat their way back into power. Fixing election fraud would force Dems back toward the center because that's the only way they could get elected. permalink parent award report block reply\nTellman125 4 points 3 days ago It's all about perception as shaped on social media by brief posts from politicians and prominent political accounts; that is THE media now. permalink parent award report block reply\nRepentnow 2 points 3 days ago Yep, buts exactly why the uniparty wrapped this thing up before there could be a vote to nuke the filibuster. permalink parent award report block reply ForceMultiplier 2 points 2 days ago Any Senator could delay this for at least a couple of days The House will need to be called back into session and pass it before it gets to Trump's desk. Any Dem that tried to delay reopening the Government could be used as a pretext to nuke the Filibuster. Dems will nuke the filibuster, pack the courts, and prosecute anyone not pardoned if we can't fix election fraud and they cheat their way back into power. Fixing election fraud would force Dems back toward the center because that's the only way they could get elected. permalink parent award report block reply\nForceMultiplier 2 points 2 days ago Any Senator could delay this for at least a couple of days The House will need to be called back into session and pass it before it gets to Trump's desk. Any Dem that tried to delay reopening the Government could be used as a pretext to nuke the Filibuster. Dems will nuke the filibuster, pack the courts, and prosecute anyone not pardoned if we can't fix election fraud and they cheat their way back into power. Fixing election fraud would force Dems back toward the center because that's the only way they could get elected. permalink parent award report block reply\nMAGA_APN 19 points 3 days ago Yup-I know several permalink parent award report block reply\nEgregiousPhilbin 16 points 3 days ago Hey here's a thought. Call me crazy. Maybe our side could put up a fight or improve their messaging? Nah, what was I thinking. permalink parent award report block reply ForceMultiplier 2 points 2 days ago The MSM lies and distorts. What are your ideas to improve GOP messaging? permalink parent award report block reply\nForceMultiplier 2 points 2 days ago The MSM lies and distorts. What are your ideas to improve GOP messaging? permalink parent award report block reply\nListenJack 7 points 3 days ago ACA subsidies are a political ticking time bomb. The only way out of that mess is for the Reps to offer something better than what the ACA is right now OR fund the stupid subsidy past 2026. My money is on the later. permalink parent award report block reply KernalMustard 4 points 3 days ago How about not having it. permalink parent award report block reply ListenJack 1 points 3 days ago Lame duck for dinner please! permalink parent award report block reply ForceMultiplier 2 points 2 days ago Republicans don't seem to have a plan to replace the \"Affordable\" Care Act. I would love to hear a comprehensive plan permalink parent award report block reply tired-of-crap 2 points 2 days ago There is discussion about taking the subsidies and the positing it into a health savings account instead of providing ACA insurance. Most people don't get anything back because of the high deductible so this way at least they would get some health care. permalink parent award report block reply ListenJack 1 points 2 days ago Thats definitely an improvement from where it’s currently at. permalink parent award report block reply\nKernalMustard 4 points 3 days ago How about not having it. permalink parent award report block reply ListenJack 1 points 3 days ago Lame duck for dinner please! permalink parent award report block reply\nListenJack 1 points 3 days ago Lame duck for dinner please! permalink parent award report block reply\nForceMultiplier 2 points 2 days ago Republicans don't seem to have a plan to replace the \"Affordable\" Care Act. I would love to hear a comprehensive plan permalink parent award report block reply\ntired-of-crap 2 points 2 days ago There is discussion about taking the subsidies and the positing it into a health savings account instead of providing ACA insurance. Most people don't get anything back because of the high deductible so this way at least they would get some health care. permalink parent award report block reply ListenJack 1 points 2 days ago Thats definitely an improvement from where it’s currently at. permalink parent award report block reply\nListenJack 1 points 2 days ago Thats definitely an improvement from where it’s currently at. permalink parent award report block reply\nHunterBidensPC 2 points 3 days ago Hard to do when everyone can just point to trumps multiple tweets in all caps begging Dems to end the shutdown and demanding GOP ends the filibuster permalink parent award report block reply\ngenericamerican69 41 points 3 days ago If you think the average person blames the democrats for the snap outages etc.. you are sorely mistaken. Anyway mass deportations would solve every problem permalink parent award report block reply EgregiousPhilbin 25 points 3 days ago “Think about how stupid the average person is, and realize half of them are stupider than that.” permalink parent award report block reply Aambrick 8 points 3 days ago I do know a similar quote: The average person isn't stupid. The average person is gullible. Half of them will always believe the lie because they cannot ever face the truth, otherwise, it will shatter their little shadow theatre. They believe in shadows more than an actual person waving a hand in front of their face. Just the observation in the last 20 years. permalink parent award report block reply Repentnow 5 points 3 days ago Being gullible is literally being stupid. permalink parent award report block reply view 1 more comments... Lib_Women_Have_HSV 2 points 3 days ago I saw protesters in Springfield IL that waved at me when I gave a Nazi salute. permalink parent award report block reply ChinaFlu 1 points 3 days ago Elwood: \"Illinois Nazis\"\nJake: \"I hate Illinois Nazis\" permalink parent award report block reply view 1 more comments... Beachboy1b 5 points 3 days ago Mass deportation would absolutely solve every problem. As to the first part of your comment, we NEED to spread this information far and wide. permalink parent award report block reply\nEgregiousPhilbin 25 points 3 days ago “Think about how stupid the average person is, and realize half of them are stupider than that.” permalink parent award report block reply Aambrick 8 points 3 days ago I do know a similar quote: The average person isn't stupid. The average person is gullible. Half of them will always believe the lie because they cannot ever face the truth, otherwise, it will shatter their little shadow theatre. They believe in shadows more than an actual person waving a hand in front of their face. Just the observation in the last 20 years. permalink parent award report block reply Repentnow 5 points 3 days ago Being gullible is literally being stupid. permalink parent award report block reply view 1 more comments... Lib_Women_Have_HSV 2 points 3 days ago I saw protesters in Springfield IL that waved at me when I gave a Nazi salute. permalink parent award report block reply ChinaFlu 1 points 3 days ago Elwood: \"Illinois Nazis\"\nJake: \"I hate Illinois Nazis\" permalink parent award report block reply view 1 more comments...\nAambrick 8 points 3 days ago I do know a similar quote: The average person isn't stupid. The average person is gullible. Half of them will always believe the lie because they cannot ever face the truth, otherwise, it will shatter their little shadow theatre. They believe in shadows more than an actual person waving a hand in front of their face. Just the observation in the last 20 years. permalink parent award report block reply Repentnow 5 points 3 days ago Being gullible is literally being stupid. permalink parent award report block reply view 1 more comments...\nRepentnow 5 points 3 days ago Being gullible is literally being stupid. permalink parent award report block reply view 1 more comments...\nLib_Women_Have_HSV 2 points 3 days ago I saw protesters in Springfield IL that waved at me when I gave a Nazi salute. permalink parent award report block reply ChinaFlu 1 points 3 days ago Elwood: \"Illinois Nazis\"\nJake: \"I hate Illinois Nazis\" permalink parent award report block reply view 1 more comments...\nChinaFlu 1 points 3 days ago Elwood: \"Illinois Nazis\"\nJake: \"I hate Illinois Nazis\" permalink parent award report block reply view 1 more comments...\nBeachboy1b 5 points 3 days ago Mass deportation would absolutely solve every problem. As to the first part of your comment, we NEED to spread this information far and wide. permalink parent award report block reply\nMajorClark 9 points 3 days ago Looks can be deceiving.  The time frame isn't good.  This will buy the crooked democrats time to pay off the crooked republican rinos to vote in their favor.  We know there at at least 12 rino's that can't be trusted. permalink parent award report block reply Deplora 15 points 3 days ago If people who rely on SNAP and people who were planning to fly somewhere for Thanksgiving with family all get their Thanksgiving ruined because of the shutdown, Republicans would be screwed in the midterms, meaning Trump would be screwed for the second half of his term.  Absolutely not worth it. u/lemonparty permalink parent award report block reply MajorClark 8 points 3 days ago Again!   Congress did this.   Trump didn't shut anything down and Republicans voted 15 times to leave the govt. open.  What is it that you just don't get?   It's a #SchumerShutDown. permalink parent award report block reply Deplora 25 points 3 days ago It's not that I don't get it, but millions of low-information voters don't get it, and Dem political operatives aggressively \"help\" them to draw the wrong conclusions.  All they get is that their flight is cancelled or their SNAP benefits didn't show up as usual, and Trump is President. permalink parent award report block reply view 2 more comments... Seruna_Kanus 7 points 3 days ago Retards don't know or care how politics work and will blame Trump for not being the dictator that the media claims him to be. permalink parent award report block reply tholinz 5 points 3 days ago Yes but there are a lot of idiots out there who'll believe whatever CNN or their favorite idiot influencer on TikTok says. Reality doesn't matter; perception does. Now the Dems can't blame Trump for ruining Thanksgiving. permalink parent award report block reply KernalMustard 2 points 3 days ago Trump is Republican. Republicans shut it down.  Hence Trump shut it down in the left eyes. permalink parent award report block reply HoganT 1 points 3 days ago Democrats would have voted 15 times to open it too if they had the ability to bring votes to the floor on it. And we would have voted against their methods. permalink parent award report block reply\nDeplora 15 points 3 days ago If people who rely on SNAP and people who were planning to fly somewhere for Thanksgiving with family all get their Thanksgiving ruined because of the shutdown, Republicans would be screwed in the midterms, meaning Trump would be screwed for the second half of his term.  Absolutely not worth it. u/lemonparty permalink parent award report block reply MajorClark 8 points 3 days ago Again!   Congress did this.   Trump didn't shut anything down and Republicans voted 15 times to leave the govt. open.  What is it that you just don't get?   It's a #SchumerShutDown. permalink parent award report block reply Deplora 25 points 3 days ago It's not that I don't get it, but millions of low-information voters don't get it, and Dem political operatives aggressively \"help\" them to draw the wrong conclusions.  All they get is that their flight is cancelled or their SNAP benefits didn't show up as usual, and Trump is President. permalink parent award report block reply view 2 more comments... Seruna_Kanus 7 points 3 days ago Retards don't know or care how politics work and will blame Trump for not being the dictator that the media claims him to be. permalink parent award report block reply tholinz 5 points 3 days ago Yes but there are a lot of idiots out there who'll believe whatever CNN or their favorite idiot influencer on TikTok says. Reality doesn't matter; perception does. Now the Dems can't blame Trump for ruining Thanksgiving. permalink parent award report block reply KernalMustard 2 points 3 days ago Trump is Republican. Republicans shut it down.  Hence Trump shut it down in the left eyes. permalink parent award report block reply HoganT 1 points 3 days ago Democrats would have voted 15 times to open it too if they had the ability to bring votes to the floor on it. And we would have voted against their methods. permalink parent award report block reply\nMajorClark 8 points 3 days ago Again!   Congress did this.   Trump didn't shut anything down and Republicans voted 15 times to leave the govt. open.  What is it that you just don't get?   It's a #SchumerShutDown. permalink parent award report block reply Deplora 25 points 3 days ago It's not that I don't get it, but millions of low-information voters don't get it, and Dem political operatives aggressively \"help\" them to draw the wrong conclusions.  All they get is that their flight is cancelled or their SNAP benefits didn't show up as usual, and Trump is President. permalink parent award report block reply view 2 more comments... Seruna_Kanus 7 points 3 days ago Retards don't know or care how politics work and will blame Trump for not being the dictator that the media claims him to be. permalink parent award report block reply tholinz 5 points 3 days ago Yes but there are a lot of idiots out there who'll believe whatever CNN or their favorite idiot influencer on TikTok says. Reality doesn't matter; perception does. Now the Dems can't blame Trump for ruining Thanksgiving. permalink parent award report block reply KernalMustard 2 points 3 days ago Trump is Republican. Republicans shut it down.  Hence Trump shut it down in the left eyes. permalink parent award report block reply HoganT 1 points 3 days ago Democrats would have voted 15 times to open it too if they had the ability to bring votes to the floor on it. And we would have voted against their methods. permalink parent award report block reply\nDeplora 25 points 3 days ago It's not that I don't get it, but millions of low-information voters don't get it, and Dem political operatives aggressively \"help\" them to draw the wrong conclusions.  All they get is that their flight is cancelled or their SNAP benefits didn't show up as usual, and Trump is President. permalink parent award report block reply view 2 more comments...\nSeruna_Kanus 7 points 3 days ago Retards don't know or care how politics work and will blame Trump for not being the dictator that the media claims him to be. permalink parent award report block reply\ntholinz 5 points 3 days ago Yes but there are a lot of idiots out there who'll believe whatever CNN or their favorite idiot influencer on TikTok says. Reality doesn't matter; perception does. Now the Dems can't blame Trump for ruining Thanksgiving. permalink parent award report block reply\nKernalMustard 2 points 3 days ago Trump is Republican. Republicans shut it down.  Hence Trump shut it down in the left eyes. permalink parent award report block reply\nHoganT 1 points 3 days ago Democrats would have voted 15 times to open it too if they had the ability to bring votes to the floor on it. And we would have voted against their methods. permalink parent award report block reply\nKlaus73 7 points 3 days ago Everyone is gonna claim this is a win; thats just the way it works - they are all telling the truth ironically enough; only the public loses. permalink parent award report block reply\nGoozmania 3 points 3 days ago They rehired everyone Trump fired for the past 2 months. Republicans caved, despite having no reason to. permalink parent award report block reply\nLight_HIV_Effect 56 points 3 days ago I would be shocked if that's the only concession they gave up. We're getting screwed at some point with a christmas omnibus bill. I say don't even give them the ACA vote. Republicans ought to let it lapse and do their own reform with transparent pricing, end of all subsidies, end of drug and care gouging, tort reform and permanent work requirements for medicaid permalink award report block reply goldkeyboardwarrior 8 points 3 days ago I say let them get the vote. They don’t have the votes to pass it without a few Republicans crossing the aisle in both chambers. permalink parent award report block reply ChinaFlu 14 points 3 days ago Just like we heard the screeching over lost EBT benefits, we will next hear the screeching over lost insurance coverage. They'll fold at the next vote and extend ACA. permalink parent award report block reply Strzok 4 points 3 days ago GOP will talk hard on Fox and then fold like rice paper Happens again and again. We keep re-electing the same uniparty rats in the same states permalink parent award report block reply goldkeyboardwarrior 3 points 3 days ago If Trump’s not on board they would still have to get 2/3rds of both chambers to overrride his veto. I don’t see them getting that and if they do then that’s all on Congress and not on Trump. permalink parent award report block reply The_RedWolf 1 points 3 days ago isnt the vote only for extended ACA and not the main subsidy? permalink parent award report block reply Light_HIV_Effect 3 points 3 days ago I don't have any faith in the rinos that are in congress. We already have a few squishy senators with collins and murkowski that love to vote against Trump. The house is mildly better, but not by much. permalink parent award report block reply Viewer01 2 points 3 days ago They punted to the new year. Basically Republicans caved because they didn’t want anyone missing thanksgiving or Christmas. permalink parent award report block reply MAGA_APN 1 points 3 days ago Bend over -you know that old school GOP have never had a back bone-they only know how to screw the voters. permalink parent award report block reply ConfusedAngryArmed 1 points 3 days ago Imo we're getting screwed just by the nature of SNAP being reinstated. permalink parent award report block reply SqRt7744 1 points 3 days ago Well, that and selling out the whole country to foreign interests and pedos. But other than that, no concessions. permalink parent award report block reply\ngoldkeyboardwarrior 8 points 3 days ago I say let them get the vote. They don’t have the votes to pass it without a few Republicans crossing the aisle in both chambers. permalink parent award report block reply ChinaFlu 14 points 3 days ago Just like we heard the screeching over lost EBT benefits, we will next hear the screeching over lost insurance coverage. They'll fold at the next vote and extend ACA. permalink parent award report block reply Strzok 4 points 3 days ago GOP will talk hard on Fox and then fold like rice paper Happens again and again. We keep re-electing the same uniparty rats in the same states permalink parent award report block reply goldkeyboardwarrior 3 points 3 days ago If Trump’s not on board they would still have to get 2/3rds of both chambers to overrride his veto. I don’t see them getting that and if they do then that’s all on Congress and not on Trump. permalink parent award report block reply The_RedWolf 1 points 3 days ago isnt the vote only for extended ACA and not the main subsidy? permalink parent award report block reply Light_HIV_Effect 3 points 3 days ago I don't have any faith in the rinos that are in congress. We already have a few squishy senators with collins and murkowski that love to vote against Trump. The house is mildly better, but not by much. permalink parent award report block reply\nChinaFlu 14 points 3 days ago Just like we heard the screeching over lost EBT benefits, we will next hear the screeching over lost insurance coverage. They'll fold at the next vote and extend ACA. permalink parent award report block reply Strzok 4 points 3 days ago GOP will talk hard on Fox and then fold like rice paper Happens again and again. We keep re-electing the same uniparty rats in the same states permalink parent award report block reply goldkeyboardwarrior 3 points 3 days ago If Trump’s not on board they would still have to get 2/3rds of both chambers to overrride his veto. I don’t see them getting that and if they do then that’s all on Congress and not on Trump. permalink parent award report block reply The_RedWolf 1 points 3 days ago isnt the vote only for extended ACA and not the main subsidy? permalink parent award report block reply\nStrzok 4 points 3 days ago GOP will talk hard on Fox and then fold like rice paper Happens again and again. We keep re-electing the same uniparty rats in the same states permalink parent award report block reply\ngoldkeyboardwarrior 3 points 3 days ago If Trump’s not on board they would still have to get 2/3rds of both chambers to overrride his veto. I don’t see them getting that and if they do then that’s all on Congress and not on Trump. permalink parent award report block reply\nThe_RedWolf 1 points 3 days ago isnt the vote only for extended ACA and not the main subsidy? permalink parent award report block reply\nLight_HIV_Effect 3 points 3 days ago I don't have any faith in the rinos that are in congress. We already have a few squishy senators with collins and murkowski that love to vote against Trump. The house is mildly better, but not by much. permalink parent award report block reply\nViewer01 2 points 3 days ago They punted to the new year. Basically Republicans caved because they didn’t want anyone missing thanksgiving or Christmas. permalink parent award report block reply\nMAGA_APN 1 points 3 days ago Bend over -you know that old school GOP have never had a back bone-they only know how to screw the voters. permalink parent award report block reply\nConfusedAngryArmed 1 points 3 days ago Imo we're getting screwed just by the nature of SNAP being reinstated. permalink parent award report block reply\nSqRt7744 1 points 3 days ago Well, that and selling out the whole country to foreign interests and pedos. But other than that, no concessions. permalink parent award report block reply\nCorse46 42 points 3 days ago Does everyone realize we are STILL using Nancy Pelosi's budget from 2022? We've had the House since 2023 and House, Senate, and WH since Jan 2025, and we are STILL \"continuing\" Nancy's budget from 2025. That's how weak and feckless we are. permalink award report block reply HuggableBear 6 points 2 days ago That's not true. There hasn't been an actual budget passed since 2009. We're still using OBAMA'S stimulus budget, which is why spending is so fucked. It's been nothing but continuing resolutions for 15 years. permalink parent award report block reply JesusTheOnlyWay 2 points 3 days ago They'll revise the budget in just 2 more weeks Or maybe 2 more Trump terms permalink parent award report block reply\nHuggableBear 6 points 2 days ago That's not true. There hasn't been an actual budget passed since 2009. We're still using OBAMA'S stimulus budget, which is why spending is so fucked. It's been nothing but continuing resolutions for 15 years. permalink parent award report block reply\nJesusTheOnlyWay 2 points 3 days ago They'll revise the budget in just 2 more weeks Or maybe 2 more Trump terms permalink parent award report block reply\nMakeAmericaGreat9 29 points 3 days ago They were scared Republicans might actually find some balls and remove the filibuster permalink award report block reply Cyer6 4 points 3 days ago That's a possibility. They got a few R's to go to the D's and say... \"We now have the numbers to do this and if it does, we're going to ram everything Trump has right through before Thanksgiving and he'll sign it the next day.\" permalink parent award report block reply politicsaside 9 points 3 days ago We need to do it anyways. It’s time. This is not a win. Nuking the filibuster would’ve been a win. This is a uniparty win, not us. permalink parent award report block reply The_RedWolf 1 points 3 days ago I'm glad they didnt.  Sure we'd get some wins now, but the moment Dems retook office, it'd be all undone and worse because they are more depraved than we are in general. permalink parent award report block reply\nCyer6 4 points 3 days ago That's a possibility. They got a few R's to go to the D's and say... \"We now have the numbers to do this and if it does, we're going to ram everything Trump has right through before Thanksgiving and he'll sign it the next day.\" permalink parent award report block reply politicsaside 9 points 3 days ago We need to do it anyways. It’s time. This is not a win. Nuking the filibuster would’ve been a win. This is a uniparty win, not us. permalink parent award report block reply\npoliticsaside 9 points 3 days ago We need to do it anyways. It’s time. This is not a win. Nuking the filibuster would’ve been a win. This is a uniparty win, not us. permalink parent award report block reply\nThe_RedWolf 1 points 3 days ago I'm glad they didnt.  Sure we'd get some wins now, but the moment Dems retook office, it'd be all undone and worse because they are more depraved than we are in general. permalink parent award report block reply\nDingleBalls 28 points 3 days ago So, what did we REALLY give up that isn't being officially said yet? permalink award report block reply POTUS_DonnieJ 19 points 3 days ago Heard some rumors about having to rehire federal employees fired since October. I hope that turns out to be just a rumor. EDIT: Confirmed, not a rumor. permalink parent award report block reply DemPanicAtTheDisco 3 points 3 days ago Sauce? permalink parent award report block reply stjimmy92 3 points 2 days ago https://www.msn.com/en-us/news/politics/senate-reaches-deal-on-ending-the-shutdown/ar-AA1Q6Hz0?ocid=BingNewsSerp The shutdown-ending agreement guarantees that federal employees laid off during the shutdown are rehired and gives federal employees back pay. It also would require agencies to give written notice to Congress about the withdrawal of the layoff notices issued during the funding lapse, plus details on the amount of back pay owed. permalink parent award report block reply pollsarefake -6 points 3 days ago Trump never gives an inch This is what happens when you have a powerful alpha like Trump in charge We are winning like never before on all fronts And the best is yet to come permalink parent award report block reply Simple_Doot 3 points 3 days ago Uhhhhh what permalink parent award report block reply\nPOTUS_DonnieJ 19 points 3 days ago Heard some rumors about having to rehire federal employees fired since October. I hope that turns out to be just a rumor. EDIT: Confirmed, not a rumor. permalink parent award report block reply DemPanicAtTheDisco 3 points 3 days ago Sauce? permalink parent award report block reply stjimmy92 3 points 2 days ago https://www.msn.com/en-us/news/politics/senate-reaches-deal-on-ending-the-shutdown/ar-AA1Q6Hz0?ocid=BingNewsSerp The shutdown-ending agreement guarantees that federal employees laid off during the shutdown are rehired and gives federal employees back pay. It also would require agencies to give written notice to Congress about the withdrawal of the layoff notices issued during the funding lapse, plus details on the amount of back pay owed. permalink parent award report block reply\nDemPanicAtTheDisco 3 points 3 days ago Sauce? permalink parent award report block reply stjimmy92 3 points 2 days ago https://www.msn.com/en-us/news/politics/senate-reaches-deal-on-ending-the-shutdown/ar-AA1Q6Hz0?ocid=BingNewsSerp The shutdown-ending agreement guarantees that federal employees laid off during the shutdown are rehired and gives federal employees back pay. It also would require agencies to give written notice to Congress about the withdrawal of the layoff notices issued during the funding lapse, plus details on the amount of back pay owed. permalink parent award report block reply\nstjimmy92 3 points 2 days ago https://www.msn.com/en-us/news/politics/senate-reaches-deal-on-ending-the-shutdown/ar-AA1Q6Hz0?ocid=BingNewsSerp The shutdown-ending agreement guarantees that federal employees laid off during the shutdown are rehired and gives federal employees back pay. It also would require agencies to give written notice to Congress about the withdrawal of the layoff notices issued during the funding lapse, plus details on the amount of back pay owed. permalink parent award report block reply\npollsarefake -6 points 3 days ago Trump never gives an inch This is what happens when you have a powerful alpha like Trump in charge We are winning like never before on all fronts And the best is yet to come permalink parent award report block reply Simple_Doot 3 points 3 days ago Uhhhhh what permalink parent award report block reply\nSimple_Doot 3 points 3 days ago Uhhhhh what permalink parent award report block reply\nVisceroth 28 points 3 days ago that's a loss for our side.\nzero good news lately. no funding cuts, no prosecutions, no codifying MAGA, no mass firings, AND they're letting professional welfare queens steal our tax money again. permalink award report block reply Simple_Doot 12 points 3 days ago I can't find anything to be proud of. permalink parent award report block reply BoomShtick 10 points 3 days ago Same old shit different day permalink parent award report block reply\nSimple_Doot 12 points 3 days ago I can't find anything to be proud of. permalink parent award report block reply\nBoomShtick 10 points 3 days ago Same old shit different day permalink parent award report block reply\nBythrfruitsyknow 27 points 3 days ago So kicking the can down the road again? fucking papermache is more rigid than any Republicans spine. permalink award report block reply\nMOLON-LABE 24 points 3 days ago I would rather the shutdown continue and drain the leftist of every penny they have stolen from us. permalink award report block reply Cyer6 2 points 3 days ago Same here but having air traffic controllers and other critical workers not getting paid would've led to many just walking away. All air traffic could shutdown including commercial cargo which would lead to supply chain disruptions down to the trucks that roll into stores every day. If we could keep the real stuff running, then F 'em, let it all drain out and watch the chimp outs. permalink parent award report block reply realeagle 3 points 3 days ago Commercial cargo has alternative ways of getting to the US. permalink parent award report block reply MOLON-LABE 1 points 2 days ago Well ya see they can be considered essential and funding could be restored to them. Just like they did for the military, find the money so everyone is safe. We must take all the money away from the leftists and then start arresting them all. permalink parent award report block reply\nCyer6 2 points 3 days ago Same here but having air traffic controllers and other critical workers not getting paid would've led to many just walking away. All air traffic could shutdown including commercial cargo which would lead to supply chain disruptions down to the trucks that roll into stores every day. If we could keep the real stuff running, then F 'em, let it all drain out and watch the chimp outs. permalink parent award report block reply realeagle 3 points 3 days ago Commercial cargo has alternative ways of getting to the US. permalink parent award report block reply MOLON-LABE 1 points 2 days ago Well ya see they can be considered essential and funding could be restored to them. Just like they did for the military, find the money so everyone is safe. We must take all the money away from the leftists and then start arresting them all. permalink parent award report block reply\nrealeagle 3 points 3 days ago Commercial cargo has alternative ways of getting to the US. permalink parent award report block reply\nMOLON-LABE 1 points 2 days ago Well ya see they can be considered essential and funding could be restored to them. Just like they did for the military, find the money so everyone is safe. We must take all the money away from the leftists and then start arresting them all. permalink parent award report block reply\nDamaged_Dirk 21 points 3 days ago We are getting fucked I guarantee it permalink award report block reply hilboggins 1 points 2 days ago Difficult to feel the micro peen permalink parent award report block reply Damaged_Dirk 1 points 2 days ago Tell me more. permalink parent award report block reply NancyPeloci -13 points 3 days ago You seem fun. permalink parent award report block reply Damaged_Dirk 12 points 3 days ago I'm not permalink parent award report block reply sully 9 points 3 days ago We honestly need more people like you because far too many people are too busy having “fun” while the USA keeps getting fucked five ways til Sunday. “Fun” to most is just turning a blind eye. Out of sight out of mind isn’t how we fix all the bullshit that’s completely screwed this country up. permalink parent award report block reply\nhilboggins 1 points 2 days ago Difficult to feel the micro peen permalink parent award report block reply Damaged_Dirk 1 points 2 days ago Tell me more. permalink parent award report block reply\nDamaged_Dirk 1 points 2 days ago Tell me more. permalink parent award report block reply\nNancyPeloci -13 points 3 days ago You seem fun. permalink parent award report block reply Damaged_Dirk 12 points 3 days ago I'm not permalink parent award report block reply sully 9 points 3 days ago We honestly need more people like you because far too many people are too busy having “fun” while the USA keeps getting fucked five ways til Sunday. “Fun” to most is just turning a blind eye. Out of sight out of mind isn’t how we fix all the bullshit that’s completely screwed this country up. permalink parent award report block reply\nDamaged_Dirk 12 points 3 days ago I'm not permalink parent award report block reply sully 9 points 3 days ago We honestly need more people like you because far too many people are too busy having “fun” while the USA keeps getting fucked five ways til Sunday. “Fun” to most is just turning a blind eye. Out of sight out of mind isn’t how we fix all the bullshit that’s completely screwed this country up. permalink parent award report block reply\nsully 9 points 3 days ago We honestly need more people like you because far too many people are too busy having “fun” while the USA keeps getting fucked five ways til Sunday. “Fun” to most is just turning a blind eye. Out of sight out of mind isn’t how we fix all the bullshit that’s completely screwed this country up. permalink parent award report block reply\ntuaris 20 points 3 days ago Probably has something to do with this: https://www.rt.com/news/627536-us-shutdown-stalls-arms-ukraine/ permalink award report block reply 24601 11 points 3 days ago The Communists got what they wanted from the shutdown.  That's why it;s over. permalink parent award report block reply Silencedogood76 2 points 3 days ago Good find, $5 Bil is a lot. permalink parent award report block reply FatigueIsReal -3 points 3 days ago I wish I lived in the one dimensional world you live in. permalink parent award report block reply johnqpublic864 20 points 3 days ago I was hoping for a longer shutdown. permalink parent award report block reply McFatty7 5 points 3 days ago Same. I don't see the benefit of ever reopening, except for paying our military. The only headline disruption is air travel. Does anyone really need to travel that much when we have the internet? Nope. It's not like we'll be getting a 40-day reduction in our taxes. Tax obligation x (40/365 days) = Tax credit permalink parent award report block reply goldkeyboardwarrior 9 points 3 days ago Air traffic controllers being out of work affects way more than just leisure air travel. permalink parent award report block reply view 4 more comments... FatigueIsReal 0 points 3 days ago Yes people need to travel that much and more. permalink parent award report block reply\n24601 11 points 3 days ago The Communists got what they wanted from the shutdown.  That's why it;s over. permalink parent award report block reply\nSilencedogood76 2 points 3 days ago Good find, $5 Bil is a lot. permalink parent award report block reply\nFatigueIsReal -3 points 3 days ago I wish I lived in the one dimensional world you live in. permalink parent award report block reply johnqpublic864 20 points 3 days ago I was hoping for a longer shutdown. permalink parent award report block reply McFatty7 5 points 3 days ago Same. I don't see the benefit of ever reopening, except for paying our military. The only headline disruption is air travel. Does anyone really need to travel that much when we have the internet? Nope. It's not like we'll be getting a 40-day reduction in our taxes. Tax obligation x (40/365 days) = Tax credit permalink parent award report block reply goldkeyboardwarrior 9 points 3 days ago Air traffic controllers being out of work affects way more than just leisure air travel. permalink parent award report block reply view 4 more comments... FatigueIsReal 0 points 3 days ago Yes people need to travel that much and more. permalink parent award report block reply\njohnqpublic864 20 points 3 days ago I was hoping for a longer shutdown. permalink parent award report block reply McFatty7 5 points 3 days ago Same. I don't see the benefit of ever reopening, except for paying our military. The only headline disruption is air travel. Does anyone really need to travel that much when we have the internet? Nope. It's not like we'll be getting a 40-day reduction in our taxes. Tax obligation x (40/365 days) = Tax credit permalink parent award report block reply goldkeyboardwarrior 9 points 3 days ago Air traffic controllers being out of work affects way more than just leisure air travel. permalink parent award report block reply view 4 more comments... FatigueIsReal 0 points 3 days ago Yes people need to travel that much and more. permalink parent award report block reply\nMcFatty7 5 points 3 days ago Same. I don't see the benefit of ever reopening, except for paying our military. The only headline disruption is air travel. Does anyone really need to travel that much when we have the internet? Nope. It's not like we'll be getting a 40-day reduction in our taxes. Tax obligation x (40/365 days) = Tax credit permalink parent award report block reply goldkeyboardwarrior 9 points 3 days ago Air traffic controllers being out of work affects way more than just leisure air travel. permalink parent award report block reply view 4 more comments... FatigueIsReal 0 points 3 days ago Yes people need to travel that much and more. permalink parent award report block reply\ngoldkeyboardwarrior 9 points 3 days ago Air traffic controllers being out of work affects way more than just leisure air travel. permalink parent award report block reply view 4 more comments...\nFatigueIsReal 0 points 3 days ago Yes people need to travel that much and more. permalink parent award report block reply\nChinaFlu 20 points 3 days ago Doesn’t a continuing resolution just extend money under the old budget to the illegals and other terrible things? permalink award report block reply ParmesanCartel 7 points 3 days ago Yes. Trump: you believed I was your saviour? permalink parent award report block reply Simple_Doot 9 points 3 days ago Trump is not the protagonist we believed he was for the last 10 years.  Quite a bummer. permalink parent award report block reply\nParmesanCartel 7 points 3 days ago Yes. Trump: you believed I was your saviour? permalink parent award report block reply Simple_Doot 9 points 3 days ago Trump is not the protagonist we believed he was for the last 10 years.  Quite a bummer. permalink parent award report block reply\nSimple_Doot 9 points 3 days ago Trump is not the protagonist we believed he was for the last 10 years.  Quite a bummer. permalink parent award report block reply\nPraetor_Sean 15 points 3 days ago I wanted 61 days so we could fire most of the federal employees.  Guess we are just going back to business as usual, with tiny cuts to unimaginable spending. permalink award report block reply JDVance4President28 5 points 3 days ago Thats politics. Even MAGA politics unfortunately. permalink parent award report block reply\nJDVance4President28 5 points 3 days ago Thats politics. Even MAGA politics unfortunately. permalink parent award report block reply\nBeauHD 14 points 3 days ago G [od] E [mperor] O [f] T [he] U [nited] S [tates] permalink award report block reply Coprolite 10 points 3 days ago G [reatest]\nO [f]\nA [ll]\nT [ime] permalink parent award report block reply BeauHD 1 points 3 days ago Use hash signs to get the big new lines permalink parent award report block reply TooBright 10 points 3 days ago I remember when it was called the pound sign. permalink parent award report block reply Scumbag-reddit 7 points 3 days ago Pound me too permalink parent award report block reply BeauHD -8 points 3 days ago Ok boomer permalink parent award report block reply view 3 more comments... Coprolite 1 points 3 days ago use * permalink parent award report block reply MakeAmericaGreat9 0 points 3 days ago Wrong. Not what it stands for. permalink parent award report block reply TheGreatWhiteNorth -3 points 3 days ago God Emperor Trump : Chosen By Heaven https://www.youtube.com/watch?v=_g8A96RPJDc&list=RD_g8A96RPJDc&start_radio=1 permalink parent award report block reply Dontbeafraid -6 points 3 days ago GEOTIS = God Emperor Of The Israeli State permalink parent award report block reply Klaus73 2 points 3 days ago MAGA - Make Ai Great Again! permalink parent award report block reply BeauHD -2 points 3 days ago I have spotted the Anaconda For Hire account. permalink parent award report block reply ParmesanCartel -4 points 3 days ago I have spotted the offspring of a Jonestown victim permalink parent award report block reply DT170x 1 points 3 days ago Probably Brain Damaged due to not drinking enough of the Jonetown Fruit Punch. permalink parent award report block reply BeauHD -1 points 3 days ago How many containers are in your kube cluster? permalink parent award report block reply Axiom502 -3 points 3 days ago Good one faggot. Get that from Ian Carroll's twitter? permalink parent award report block reply\nCoprolite 10 points 3 days ago G [reatest]\nO [f]\nA [ll]\nT [ime] permalink parent award report block reply BeauHD 1 points 3 days ago Use hash signs to get the big new lines permalink parent award report block reply TooBright 10 points 3 days ago I remember when it was called the pound sign. permalink parent award report block reply Scumbag-reddit 7 points 3 days ago Pound me too permalink parent award report block reply BeauHD -8 points 3 days ago Ok boomer permalink parent award report block reply view 3 more comments... Coprolite 1 points 3 days ago use * permalink parent award report block reply MakeAmericaGreat9 0 points 3 days ago Wrong. Not what it stands for. permalink parent award report block reply\nBeauHD 1 points 3 days ago Use hash signs to get the big new lines permalink parent award report block reply TooBright 10 points 3 days ago I remember when it was called the pound sign. permalink parent award report block reply Scumbag-reddit 7 points 3 days ago Pound me too permalink parent award report block reply BeauHD -8 points 3 days ago Ok boomer permalink parent award report block reply view 3 more comments... Coprolite 1 points 3 days ago use * permalink parent award report block reply\nTooBright 10 points 3 days ago I remember when it was called the pound sign. permalink parent award report block reply Scumbag-reddit 7 points 3 days ago Pound me too permalink parent award report block reply BeauHD -8 points 3 days ago Ok boomer permalink parent award report block reply view 3 more comments...\nScumbag-reddit 7 points 3 days ago Pound me too permalink parent award report block reply\nBeauHD -8 points 3 days ago Ok boomer permalink parent award report block reply view 3 more comments...\nCoprolite 1 points 3 days ago use * permalink parent award report block reply\nMakeAmericaGreat9 0 points 3 days ago Wrong. Not what it stands for. permalink parent award report block reply\nTheGreatWhiteNorth -3 points 3 days ago God Emperor Trump : Chosen By Heaven https://www.youtube.com/watch?v=_g8A96RPJDc&list=RD_g8A96RPJDc&start_radio=1 permalink parent award report block reply\nDontbeafraid -6 points 3 days ago GEOTIS = God Emperor Of The Israeli State permalink parent award report block reply Klaus73 2 points 3 days ago MAGA - Make Ai Great Again! permalink parent award report block reply BeauHD -2 points 3 days ago I have spotted the Anaconda For Hire account. permalink parent award report block reply ParmesanCartel -4 points 3 days ago I have spotted the offspring of a Jonestown victim permalink parent award report block reply DT170x 1 points 3 days ago Probably Brain Damaged due to not drinking enough of the Jonetown Fruit Punch. permalink parent award report block reply BeauHD -1 points 3 days ago How many containers are in your kube cluster? permalink parent award report block reply Axiom502 -3 points 3 days ago Good one faggot. Get that from Ian Carroll's twitter? permalink parent award report block reply\nKlaus73 2 points 3 days ago MAGA - Make Ai Great Again! permalink parent award report block reply\nBeauHD -2 points 3 days ago I have spotted the Anaconda For Hire account. permalink parent award report block reply ParmesanCartel -4 points 3 days ago I have spotted the offspring of a Jonestown victim permalink parent award report block reply DT170x 1 points 3 days ago Probably Brain Damaged due to not drinking enough of the Jonetown Fruit Punch. permalink parent award report block reply BeauHD -1 points 3 days ago How many containers are in your kube cluster? permalink parent award report block reply\nParmesanCartel -4 points 3 days ago I have spotted the offspring of a Jonestown victim permalink parent award report block reply DT170x 1 points 3 days ago Probably Brain Damaged due to not drinking enough of the Jonetown Fruit Punch. permalink parent award report block reply BeauHD -1 points 3 days ago How many containers are in your kube cluster? permalink parent award report block reply\nDT170x 1 points 3 days ago Probably Brain Damaged due to not drinking enough of the Jonetown Fruit Punch. permalink parent award report block reply\nBeauHD -1 points 3 days ago How many containers are in your kube cluster? permalink parent award report block reply\nAxiom502 -3 points 3 days ago Good one faggot. Get that from Ian Carroll's twitter? permalink parent award report block reply\narmyofpedes4usa 14 points 3 days ago I didn't want the shutdown to end. permalink award report block reply\nQuiznos585 14 points 3 days ago I don’t want it reopened. Let the SNAP people starve. GOP caved again didn’t they. permalink award report block reply\nPatriotSam 13 points 3 days ago So all this was just to get a vote on Obamacare? We all know what's going to happen there. permalink award report block reply magamagashii 1 points 3 days ago The subsidys for ACA will expire end of December so at least there's that. Same government funding but ACA will finally break instead of sending good money after bad money. permalink parent award report block reply MajJamesMcFarlane 6 points 3 days ago The subsidys for ACA will expire end of December so at least there's that. I can't wait to watch as Republicans re-up the subsidies and all we get is Trump talking about how necessary and important they are permalink parent award report block reply PatriotSam 0 points 3 days ago The Supreme Court will probably keep the law alive, they've defended the law tooth and nail. permalink parent award report block reply\nmagamagashii 1 points 3 days ago The subsidys for ACA will expire end of December so at least there's that. Same government funding but ACA will finally break instead of sending good money after bad money. permalink parent award report block reply MajJamesMcFarlane 6 points 3 days ago The subsidys for ACA will expire end of December so at least there's that. I can't wait to watch as Republicans re-up the subsidies and all we get is Trump talking about how necessary and important they are permalink parent award report block reply PatriotSam 0 points 3 days ago The Supreme Court will probably keep the law alive, they've defended the law tooth and nail. permalink parent award report block reply\nMajJamesMcFarlane 6 points 3 days ago The subsidys for ACA will expire end of December so at least there's that. I can't wait to watch as Republicans re-up the subsidies and all we get is Trump talking about how necessary and important they are permalink parent award report block reply\nPatriotSam 0 points 3 days ago The Supreme Court will probably keep the law alive, they've defended the law tooth and nail. permalink parent award report block reply\nThePatriotGames2016 12 points 3 days ago bad news. permalink award report block reply\nMemeWarsVet 11 points 3 days ago meh When are the tribunals? permalink award report block reply\nSanityGumby 11 points 3 days ago This is what was always going to happen permalink award report block reply\nMemoryHoleyeO 10 points 3 days ago Then vote no on Obama care. The Republicans don't have McCain this time; who will be the sacrificial rino lamb? permalink award report block reply Nellie_the_Beaut 4 points 3 days ago Program Note: Rand Paul will be playing the role of Traitor McCain in tonight’s performance. No flash photography, thank you. permalink parent award report block reply BaronFalcon 2 points 2 days ago Eyepatch McCain permalink parent award report block reply\nNellie_the_Beaut 4 points 3 days ago Program Note: Rand Paul will be playing the role of Traitor McCain in tonight’s performance. No flash photography, thank you. permalink parent award report block reply\nBaronFalcon 2 points 2 days ago Eyepatch McCain permalink parent award report block reply\nSorosHasBallsackEyes 8 points 3 days ago Reach out to your senators and reps regarding the ACA.\nMy insurance premiums skyrocketed while coverage plummeted.\nI cannot vote for anyone who supports the ACA. permalink award report block reply\nSenaleb 8 points 3 days ago shitass deal, just erased a lot of wins by Trump permalink award report block reply\nparttimefed 8 points 3 days ago \"simply allow aca vote next month\" next month just enough GOP members flip to pass it permalink award report block reply\ngorilla_grip 7 points 3 days ago The house democrats are saying they won’t vote on the revisions without all the stuff the dem senators were holding out for, like another trillion in debt to continue subsidizing Obamacare, passing laws that say no one can be fired in a shutdown, etc etc etc. This isn’t a “deal”. permalink award report block reply\nNYforTrump 7 points 3 days ago This is the same offer the GOP made weeks ago.  Democrats just fucked everyone by waiting until the election. permalink award report block reply\nMajorClark 7 points 3 days ago This will give the rino's time to be paid off by the lunatic democrats and stab the American people in the backs. permalink award report block reply ragnarokrobo 6 points 3 days ago They don't need time for that, they do it for free on a daily basis. permalink parent award report block reply\nragnarokrobo 6 points 3 days ago They don't need time for that, they do it for free on a daily basis. permalink parent award report block reply\nRicky_CIA 6 points 3 days ago Congressional GOP faggotry, like usual. permalink award report block reply\nGrindelwald 6 points 3 days ago Watch the maneuvers in the next month.  On the dead of night on a holiday. permalink award report block reply\nGuerillaYourDreams 6 points 3 days ago The most useless people in the world go back to work now. permalink award report block reply\nfjzappa 6 points 3 days ago H1-b's are gonna rejoice. permalink award report block reply\nSuperUltraMegaMAGA1 6 points 3 days ago As someone who works for a living I didn’t notice a single thing that changed during this “shutdown” permalink award report block reply\nQuiznos585 6 points 3 days ago I don’t want this shit to reopen and I want all of Snap to starve permalink award report block reply DefKon1 3 points 3 days ago I'm for that. But if they end SNAP, I expect my fuckin' Taxes to go down..👇🐸 permalink parent award report block reply\nDefKon1 3 points 3 days ago I'm for that. But if they end SNAP, I expect my fuckin' Taxes to go down..👇🐸 permalink parent award report block reply\nmeanwhileinamerica 5 points 3 days ago The Government was shutdown? permalink award report block reply\nWhatsFappening 5 points 3 days ago Nice month vac for all the Fed workers who will get back pay now. permalink award report block reply\nLordKuroTheGreat 5 points 3 days ago :( permalink award report block reply\nforefatherstanding 5 points 3 days ago Brace yourselves, I'm Shure Thune has sold us out. permalink award report block reply\nutfanx2 4 points 3 days ago Trump promised to never sign another Omnibus. Veto it all. permalink award report block reply\nSickofItall 4 points 3 days ago Fuck...there goes shopping in peace this week. permalink award report block reply\nMAGAnic316 4 points 3 days ago Nuke the filibuster permalink award report block reply JoinTheDiscussion 3 points 3 days ago won't do it now! permalink parent award report block reply\nJoinTheDiscussion 3 points 3 days ago won't do it now! permalink parent award report block reply\nRolandDelacroix 4 points 3 days ago Dems didn't want this to go long enough that Trump can fire deep staters. permalink award report block reply\nTexas_81 4 points 3 days ago At my church they have armed guards but I still carry because my safety is my responsibility. Every day everywhere I go permalink award report block reply\nTwobuck40 4 points 3 days ago Fuck this! KEEP THE SHUTDOWN GOING!! permalink award report block reply MondayCoupleIsDead -4 points 3 days ago Found John Cornyn. Get back to work you old fuck. permalink parent award report block reply\nMondayCoupleIsDead -4 points 3 days ago Found John Cornyn. Get back to work you old fuck. permalink parent award report block reply\nTheAttackTitan 4 points 3 days ago Theres a poison pill in this “deal”. There always is. Democrats agreed to SNAP funding and VA funding until, you guessed it, September 2026. What a CONVENIENT TIME for this continuing resolution to run out of funds for SNAP! Mark my words, there will be another refusal to reach 60 votes on the next spending bill. The Democrats will allow SNAP to expire well into October 2026 and they’ll ride a blue wave in November with their angry legion of cat ladies and minorities who have their hands out for a handout. permalink award report block reply\nAmerica101 4 points 3 days ago It says no Obamacare subsidies, is that no medical for illegals? permalink award report block reply\nchronistus 4 points 3 days ago Watch them do this shit again in a year. permalink award report block reply\nJimster 4 points 3 days ago They need to use this shutdown as leverage to eliminate the fillibuster permalink award report block reply\nRockyBalboa 3 points 3 days ago Nooooooo permalink award report block reply\nHumblePig 3 points 3 days ago No. :< permalink award report block reply\nemorphia 3 points 3 days ago so the government will reopen and there been no mass firings and passing of MAGA agenda ?  so Trump did not take advantage of the shutdown ?. permalink award report block reply\nCMDRConanAAnderson 3 points 3 days ago Quit fucking doing this stopgap bullshit and pass the annual budget like you're supposed to. A shutdown is what's supposed to happen when that isn't achieved. permalink award report block reply\nThan0sIII 3 points 3 days ago Still need to nuke the filibuster to secure our elections. permalink award report block reply\nKholland65 3 points 3 days ago Rinos will probably still vote to keep ACA permalink award report block reply\nWupta PRO 3 points 3 days ago Of course angling to stop the filibuster being taken out and c election integrity codified. permalink award report block reply JoinTheDiscussion 2 points 2 days ago This right here! permalink parent award report block reply\nJoinTheDiscussion 2 points 2 days ago This right here! permalink parent award report block reply\nDefKon1 3 points 3 days ago I still want to end the filibuster. Like, yesterday! 🐸👍 permalink award report block reply\nGnometard 3 points 2 days ago The GOP will vote for it, we'll yell RINO, and things will continue as they have. Pattern recognition is impossible with the social media addiction. permalink award report block reply\nspezisacuckold 3 points 3 days ago Damn permalink award report block reply\nMondayCoupleIsDead 3 points 3 days ago Dammit! All the filet mignon and lobsters will be instantly gone! You can't do this to us! Fuuuuuuuuuuuuuuuu-----. permalink award report block reply\nKungPaoMcChicken 3 points 3 days ago What's the ACA thing? permalink award report block reply\nmcoulton 3 points 3 days ago ACA is screwed and they need to sort out what the issue is and remove noncitezens from getting it paid for permalink award report block reply\nj2daeww 3 points 3 days ago Hahaha bullshit. It will pass with 1 vote because the corrupt republicans that vote yes are getting kickbacks. Just fucking wait. permalink award report block reply\nianpatrick1966 2 points 3 days ago So, we caved. No medications until the gov was reopened.... Then we negotiated while it was closed permalink award report block reply\nMasterChief08 2 points 3 days ago Are air traffic controllers and people doing real work getting paid ? I don't care about courts permalink award report block reply Freeth3usa 1 points 3 days ago With this agreement everyone gets paid. A vote on ACA supsides in a few weeks, and another potential shutdown in January. permalink parent award report block reply MasterChief08 2 points 3 days ago Now that the subsidies will be a separate bill, they are dead. Trump can just veto permalink parent award report block reply\nFreeth3usa 1 points 3 days ago With this agreement everyone gets paid. A vote on ACA supsides in a few weeks, and another potential shutdown in January. permalink parent award report block reply MasterChief08 2 points 3 days ago Now that the subsidies will be a separate bill, they are dead. Trump can just veto permalink parent award report block reply\nMasterChief08 2 points 3 days ago Now that the subsidies will be a separate bill, they are dead. Trump can just veto permalink parent award report block reply\nTrumpOrTreason 2 points 3 days ago Naw dawg... fuck this deal. \"the agreement contains a “minibus” — three full-year appropriations bills that will fund certain departments like Agriculture through the end of the fiscal year next fall — and a continuing resolution to fund the rest of the government at existing spending levels through Jan. 30. It would also fully fund the Supplemental Nutrition Assistance Program, once known as food stamps, through next September, a major flashpoint in the shutdown.\" THREE FULL YEARS OF APPROPRATIONS?! That's the rest of Trump's second term.  Fuck that! permalink award report block reply\nThe_RedWolf 2 points 3 days ago What a giant waste of time for the dems permalink award report block reply\nhenri_derelicte 2 points 3 days ago I think it’s good we have a deal because these air travel disruptions lasting through Thanksgiving would not be good for the Trump administration. Going forward, I think we need to change the rules so that a government shutdown can be averted with only 51 votes permalink award report block reply KernalMustard 2 points 3 days ago You know there trains, buses and cars right permalink parent award report block reply\nKernalMustard 2 points 3 days ago You know there trains, buses and cars right permalink parent award report block reply\ncovok48 2 points 3 days ago I’m done with this admin. permalink award report block reply JoinTheDiscussion 1 points 2 days ago Same! permalink parent award report block reply\nJoinTheDiscussion 1 points 2 days ago Same! permalink parent award report block reply\nDangerous 2 points 3 days ago We lose again it seems permalink award report block reply\nCyberpunkd 2 points 3 days ago Repubs pussy out. What else is new? permalink award report block reply\nSmellyButtFart 2 points 3 days ago There were concessions.  The mass layoffs were were canceled permalink award report block reply\nYodaBannon 2 points 3 days ago Happy Thanksgiving permalink award report block reply\ntiamat 2 points 3 days ago It was over the second there was going to be flight reductions, there's no way the democrats could dodge that permalink award report block reply Freeth3usa 1 points 3 days ago To be honest republicans caved more than the Dems. Dems get what they really want, they want republicans going on record not voting for the aca subsidies. GOP won’t have shit ready to remove it, people will get fucked by insuring vote for Dems in mass at midterms. permalink parent award report block reply\nFreeth3usa 1 points 3 days ago To be honest republicans caved more than the Dems. Dems get what they really want, they want republicans going on record not voting for the aca subsidies. GOP won’t have shit ready to remove it, people will get fucked by insuring vote for Dems in mass at midterms. permalink parent award report block reply\ngrandfather_nurgle 2 points 3 days ago So we do this all again in January. permalink award report block reply clmeachum 3 points 3 days ago Get through Thanksgiving and Christmas. permalink parent award report block reply\nclmeachum 3 points 3 days ago Get through Thanksgiving and Christmas. permalink parent award report block reply\ncanada_is_communist 2 points 3 days ago ITS SNAP TIME!!! permalink award report block reply\ntired-of-crap 2 points 2 days ago Unfortunately the deal also undoes president trump's firing during this time. This means we don't save the money by getting rid of these people but we can pass a budget later without them. The pressure points like snap And WIC have been funded to the end of the year. We need to insist there will be no more CRS after this point By passing the budget bills themselves 1 by 1.  Each budget bill needs to be gone through and have its fat eliminated.  That is where trump can Get rid of the people already identified as not needed during the shutdown. Start passing the bills 1 by 1 and ignore any pressure to pass another CR.  There are only 12 of them, get them done. permalink award report block reply\nTrumpIsMyyPresident 2 points 3 days ago Deal reached does not mean Vote \"Yay'd\" permalink award report block reply\nrocco_saint 2 points 3 days ago What's so special about January 30th? permalink award report block reply AbrahamLincoln 7 points 3 days ago It gives congress time to take 3 more vacations before the budget runs out again. permalink parent award report block reply rocco_saint 2 points 3 days ago True.  But is anyone quitting/retiring?  Something else going on? permalink parent award report block reply\nAbrahamLincoln 7 points 3 days ago It gives congress time to take 3 more vacations before the budget runs out again. permalink parent award report block reply rocco_saint 2 points 3 days ago True.  But is anyone quitting/retiring?  Something else going on? permalink parent award report block reply\nrocco_saint 2 points 3 days ago True.  But is anyone quitting/retiring?  Something else going on? permalink parent award report block reply\ncherokeepeople 2 points 3 days ago they will let the dems have a vote to keep the subsidies,but no way in hell IF it does pass will trump sign it. permalink award report block reply\nWarOfTheFanboys2 1 points 3 days ago LET THE MARKET COME FORTH permalink award report block reply\nPapabravo12 1 points 3 days ago Eh permalink award report block reply\nRizzlieDoodad 1 points 3 days ago Temu version permalink award report block reply\nBusterHyman99 1 points 3 days ago So we will have the 12 separate funding bills on Jan 30th then? Since this was just so they could keep negotiating that permalink award report block reply\nProfessorJagoff 1 points 3 days ago Folks, no, civil war is never the first option. If its meant to be, it will happen, but for god's sake, don't hope for something that very well could ruin the entire nation and have us under a flag of a foreign adversary by the end. permalink award report block reply\nBeardholder 1 points 2 days ago This is not a win. All airports are suffering proving they need to go to a private company not government. permalink award report block reply\nkatsumi27 1 points 3 days ago Is this because Nancy Pelosi is retiring and they don’t have to feel her wrath anymore? I hope Obama care gets nuked from orbit, and then an amendment made to ban it from ever coming back or anything like it permalink award report block reply\nYearninNation 1 points 3 days ago the little faggots in the media are at this moment crafting some bullshit propaganda related to this ACA vote, whatever the fuck that is. permalink award report block reply\nFromseatoshinningsea 1 points 3 days ago He had to pre permalink award report block reply\njohn9985 1 points 3 days ago How bad did us patriots get fucked? permalink award report block reply\nApersonofinterest 1 points 3 days ago I haven’t really noticed anything different. permalink award report block reply\nBrionK 1 points 3 days ago Shocker as soon as emotional terrorism to rally the base is no longer need the swamp gets back to open theft. Americans deserve to get replaced. Fucking faggots. permalink award report block reply\nFromseatoshinningsea 1 points 3 days ago PDJT had to preserve TGiving. permalink award report block reply\nGabeC1997 1 points 3 days ago DAMMIT! permalink award report block reply\nGhost_Soul167 1 points 2 days ago Not the only GOP concession, they have to rehire everyone who was fired or took retirements.... permalink award report block reply\nBarneyFrank 1 points 3 days ago Hooray!…errr I think permalink award report block reply\nWallllllllllllllllll 1 points 2 days ago I think this was preemptive caving by the Democrats. The last thing they want is the Republicans using the nuclear option and being able to pass Trump's agenda. That would allow Trump to fix a lot of problems in America. They don't want that. permalink award report block reply\nMondayCoupleIsDead 1 points 3 days ago Of course Cornyn is fucking around just to hurt Trump. Scumbag fuck. permalink award report block reply\nridge3z 1 points 3 days ago Republicans can maximize their political and public relations (PR) advantage from the end of the government shutdown by focusing their messaging, legislative strategy, and grassroots engagement. This approach involves both highlighting GOP achievements and proactively countering Democratic narratives about the shutdown and healthcare. Here’s a detailed breakdown of how Republicans and their supporters can pull this into their favor: Strategic GOP Messaging Emphasize Responsibility and Stability: Republicans should consistently frame themselves as the party that prioritized the national interest, restoring government services, paychecks for federal workers, and critical programs for families and veterans after weeks of Democratic obstruction. They can stress that they worked across the aisle, while Democrats eventually relented to public pressure.[1][2] Highlight Concessions Won: Reiterate that Democrats failed in their attempt to force through immediate ACA subsidy extensions—these were postponed in favor of a promise for a future Senate vote, not a done deal. Republicans can credit their negotiating strategy for avoiding a costly expansion of government entitlements “forced” by Democrats during a crisis.[3][1] Underscore Economic Impact: Make the case that ending the shutdown limited further economic damage, and warn voters about the dangers of partisan brinkmanship tied to unpopular or costly Democratic demands. Point to restored federal operations, normalizing travel and economic activity before Thanksgiving, as examples of Republican responsiveness.[1] PR and Media Tactics Leverage Social and Conservative Media: Republican officeholders, influencers, and grassroots supporters should flood social media and conservative outlets with concise, repeated talking points about Democratic “hostage-taking,” the hardship caused by the shutdown fight, and the GOP’s solution-oriented approach. Use Testimonials: Spotlight stories of workers and families hurt by the prolonged shutdown, blaming Democratic intransigence. Feature business owners, federal employees, travelers, and beneficiaries of restored programs thanking GOP leaders for reopening the government. Contrast Leadership Styles: Frame President Trump and GOP Senate leaders as “tough negotiators” who forced the opposition to compromise, compared to Democrats who were “divided and unrealistic.” Legislative and Voting Strategy Demand Accountability: Call for hearings, town halls, and investigations into the effects of the Democratic shutdown, using them as campaign platforms to energize conservative voters and independents frustrated by the gridlock. Prepare for ACA Vote: Position the upcoming December vote on ACA subsidies as a chance for Republicans to hold Democrats to account for costly health care proposals—launch educational campaigns about the fiscal downsides of enhanced subsidies and promote alternatives like health savings accounts or private options. Keep Unity: Encourage all wings of the GOP, including more populist (MAGA) factions, to unite behind the narrative that Republican persistence delivered results for ordinary Americans. Grassroots and Regular Citizen Engagement Mobilize Local Activists: Encourage conservatives, MAGA supporters, and regular citizens to call into talk radio, attend local GOP events, and share stories online amplifying the Republican version of events. Use Letter-Writing and Opinion Pieces: Submit op-eds and letters to editors in local newspapers blaming Democrats for the hardship, praising Republican efforts, and warning about future Democratic spending proposals. Challenge Opposing Narratives: Actively push back on Democratic claims that they “protected health care,” emphasizing instead the delays, disruptions, and economic harm their stance created. Counteracting Democrat Narratives Refocus Debate: When Democrats argue that they won a future vote or protected the ACA, Republicans should respond that they forced Democrats to drop their immediate demands, prevented a massive increase in spending, and extracted key concessions on layoffs and SNAP funding. Fact-Check in Real-Time: Use social media graphics, talk shows, and independent fact-checkers to challenge any Democratic claims of overall “victory,” pointing out what was left out or postponed. Engage Independent and Swing Voters: Stress the bipartisan nature of the final deal and frame it as commonsense governance after weeks of unnecessary Democratic-driven pain. By relentlessly repeating these themes and encouraging broad-based participation, the GOP can position the shutdown’s end as a Republican win for order, responsibility, and economic stability, while putting Democrats on the defensive about their strategy and motivations.[2][3][1] 1 2 3 permalink award report block reply\nhere2red 1 points 3 days ago blegh permalink award report block reply\nGetelectedordietryin 1 points 3 days ago Fucking bull shit I wanted at least a year of the shutdown permalink award report block reply\nmass55th 1 points 3 days ago Great deal for the RATS so they have three months to get their strategy together for the next continuing resolution. Kick the can down the road again, and there's no guarantee that the next CR will pass so easily in the House next time. permalink award report block reply\ndres3 1 points 3 days ago \"next month\" that leaves around 30 days for lefty violence in the viscinity of R house members and R Senate members. permalink award report block reply\nSavingPrivateGrace 1 points 3 days ago Welcome back ya filthy animals. permalink award report block reply\njdemarco2014 1 points 3 days ago Great now these disgusting fucking parasites can go back to spending my stolen money permalink award report block reply\nuniformist 1 points 3 days ago Classic negotiation technique by Trump ... invent something which is nothing, then bargain it away. permalink award report block reply\nmediweevil 1 points 3 days ago dimmocrats caved as expected.  now vote that shit down once and forever. permalink award report block reply\nVanDeKoik 0 points 3 days ago Fine agreement. But then again I see things in the real world and not as some clown behind a keyboard that can demand and damn fool thing because doing that is easy. permalink award report block reply\nYesImWhite 0 points 3 days ago Guess dems realized we shouldnt end the fillibuster after all. Nice leverage play Trump. permalink award report block reply\nJoinTheDiscussion 0 points 3 days ago there goes republicans chance to remove the filibuster.. country is for sure fucked now.. only thing that will bring it around is watering some trees permalink award report block reply\nJoinTheDiscussion 0 points 3 days ago great.. now we can pay for the illegals and freeloaders FUCKING SNAP GIBMEDATS AGAIN!!! permalink award report block reply\nUpvoteBot 0 points 2 days ago I was REALLLLLLYYYYYY hoping the shut down would continue through the holidays so the EBT Americans wouldn’t have their ill gotten monies for Christmas shopping. permalink award report block reply\nTrumpchoochoo -1 points 3 days ago Doomers incoming permalink award report block reply DT170x -1 points 3 days ago They already here. permalink parent award report block reply\nDT170x -1 points 3 days ago They already here. permalink parent award report block reply\nfbiizassshoe -2 points 3 days ago Im a veteran who refused the vax and I'm about to call trump a fucking taco president. permalink award report block reply\nSickOfNeoPolitics -2 points 3 days ago Saw cloud seeding chemtrails in the sky earlier for the first time since the shutdown so I saw this coming. permalink award report block reply\ntooanalytical -2 points 3 days ago THIS IS HOW YOU WIN. FUCK THESE TERRORISTS HOLDING OUR COUNTRY HOSTAGE. WE DO NOT NEGOTIATE WITH TERRORISTS! permalink award report block reply Kickass2001 2 points 3 days ago Wtf are you talking about? Dems just won the midterms permalink parent award report block reply tooanalytical 1 points 2 days ago What midterms? The midterms that haven’t happened yet? Dems got nothing but a meaningless vote on the floor within 90 days on the extensions, which won’t pass Trump. They got nothing except for the optics they think they got in their delusional minds. permalink parent award report block reply\nKickass2001 2 points 3 days ago Wtf are you talking about? Dems just won the midterms permalink parent award report block reply tooanalytical 1 points 2 days ago What midterms? The midterms that haven’t happened yet? Dems got nothing but a meaningless vote on the floor within 90 days on the extensions, which won’t pass Trump. They got nothing except for the optics they think they got in their delusional minds. permalink parent award report block reply\ntooanalytical 1 points 2 days ago What midterms? The midterms that haven’t happened yet? Dems got nothing but a meaningless vote on the floor within 90 days on the extensions, which won’t pass Trump. They got nothing except for the optics they think they got in their delusional minds. permalink parent award report block reply\nnew_guy2 1 points 3 days ago Comment removed by community moderators. permalink award report block reply\nEyesSewnShut 0 points 2 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T21:19:13.745233Z"
}