{
  "id": "1ARK55a4P3",
  "url": "https://patriots.win/p/1ARK55a4P3/im-sick-of-these-traitors-/c",
  "content": "1479 I'm SICK of these TRAITORS! posted 5 days ago by ncswicn 272 comments award share download report block\n272 comments Sort by Top Top New Worst Old Save Be_The_Change 298 points 5 days ago Let me guess; I will again be forced to pay insurance premiums for individuals who should not be in my country and do not pay taxes.  In other words, slavery. I think not this time. permalink award report block reply ZacPetkanas 89 points 5 days ago You'll also be forced to subsidize the health-insurance cost of people who have retired early.  God bless them for having enough to choose to stop working, but doing it on the back of the working people is gross. permalink parent award report block reply Websitesdown 57 points 5 days ago Don't forget higher auto insurance and higher food cost again.. permalink parent award report block reply Govtizbad 52 points 5 days ago Why is the govt shutdown so bad? Leave it closed Republicans are giant pussies who can't wrangle CNN permalink parent award report block reply The_Return_of_User_x 12 points 5 days ago Stop doing deals... Wait for the dems to call them to the floor. Vote on what's been proposed or stay home. permalink parent award report block reply superdelegate 5 points 5 days ago I wrote to Thune to tell him to go nuclear.  The response wasn't even \"No I don't want to\" it was \"fuck off you don't live in my state\" permalink parent award report block reply view 2 more comments... Taylor3006 5 points 5 days ago Because when the government is closed down, elected representatives realize that we don't need them. They lose power and prestige. We need to keep it shut down, fuck them all. Figure a way to pay the military and shut everything else down. permalink parent award report block reply view 4 more comments... Sig229 1 points 5 days ago Thune should be fucking arrested for treason. Fucking giant cocksucking commie cunt. permalink parent award report block reply 1True-translation -6 points 5 days ago How are you back after being banned? permalink parent award report block reply view 1 more comments... cptkloss5 26 points 5 days ago don't forget higher property taxes, to educate anchor babies with your money permalink parent award report block reply chickeninoven 14 points 5 days ago Are you still posting here? Get back to work, people who hate you need your money. permalink parent award report block reply view 1 more comments... KekistanPM 15 points 5 days ago Unless you're a white male, then you're completely on your own when you retire. permalink parent award report block reply mohel 4 points 5 days ago Well, it is just fair in case of somebody who lived their live full of white privilege. permalink parent award report block reply Shih_Tabed 3 points 5 days ago Being responsible shouldn't be considered a privilege. permalink parent award report block reply EggsBennydict 6 points 5 days ago Subsidies and handouts are the problem for everything. Healthcare and food is not a right. As fucked up as it seems today,  home prices, groceries, traffic, healthcare, etc would not be a problem if govt didn’t reappropriate our money. Survival of the fittest would’ve played out and a vast majority of people would be contributing to society and living a good life. Instead we’re work slaves to fund the lazy leeches of society. What I don’t get is why or how healthcare got this fucked. Why isn’t health insurance like other insurance? Why can’t medical care just be affordable for everyone.. without insurance? Get rid of the law that makes it illegal to refuse to treat anyone who can’t pay.. hospitals are allowed to deny treatment if you deny a tetanus shot, but not if you can’t pay? Clown world permalink parent award report block reply ThisTrainHasNoBrakes 5 points 5 days ago If they aren’t paying for their own shit, they DO NOT HAVE ENOUGH TO CHOOSE TO STOP WORKING and retire early. FFS. permalink parent award report block reply load 1 more comments... AVeryNakedMan 29 points 5 days ago All taxes are slavery, just in varying degrees. permalink parent award report block reply Ch3f4554551n 1 points 5 days ago There aren't really degrees of freedom. Either a man is free or he isn't... permalink parent award report block reply MaoHadOnly1Testicle 1 points 4 days ago There's free, and then there's varying degrees of slavery. The same way something is either not on fire, or some degree of burnt. permalink parent award report block reply NotYourMan 14 points 5 days ago X/Twitter is incredible; every democrat just lying about how its Trump's fault using poor families and government workers as a reason that Trump is bad.  Democrats really are just evil, hateful people.  They hate the poor and the middle class. permalink parent award report block reply LaVaughnRobinson 6 points 5 days ago They love the poor, its their pawns they manipulate.  They do hate the middle class and want them gone. permalink parent award report block reply BlackLabsMatter 7 points 5 days ago Read the words.  Fake post again. permalink parent award report block reply That_Which_Lurks 2 points 5 days ago I think not this time. It will go through like every other time in the last 30+ years. Nothing will change and all of this has been theater to keep the plebes at each other's throats. permalink parent award report block reply load 8 more comments... ncswicn OP 98 points 5 days ago Bet that is what they want, so when President Trump vetoes their decision, they can put the full blame on him. permalink award report block reply Magma_Biscuit 38 points 5 days ago Probably right permalink parent award report block reply kekranger 18 points 5 days ago Do it. F these guys. permalink parent award report block reply PROCIsAsshoe 6 points 5 days ago Just read on a BB terminal that Senator Daines (R-MT) is shooting down the ACA subsidy 1yr-extension proposal. only mentioning it because I have great trust in the rumor mill on that platform they tend to get that sort of DC/Wall Street rumor mill scoop correct. Come on Senator Daines! permalink parent award report block reply America_No_1 6 points 5 days ago That's a bingo permalink parent award report block reply Bastard 1 points 5 days ago That's what I voted for. permalink parent award report block reply load 2 more comments... Magma_Biscuit 92 points 5 days ago We the people are not represented in government, only illegals and the gibmethats permalink award report block reply GentleSlayer 18 points 5 days ago Don't forget bankers and megacorpos. permalink parent award report block reply IncredibleMrE1 12 points 5 days ago \"gibmethats\" permalink parent award report block reply Prussian_Pepe 2 points 5 days ago The original dinnadu nuffins. Who do people think taught the pavement apes the grift? They didn't learn it on their own ~chirp~ but I DID eat brekfast! permalink parent award report block reply True_Curmudgeon 4 points 5 days ago No those people aren't really represented they're just being used as weapons against us. Only the truly powerful globalist bankers and globalist businessmen are represented permalink parent award report block reply MastaJoda 2 points 4 days ago A Tax Revolt is due. permalink parent award report block reply HoganT -22 points 5 days ago I always love when people use \"we the people\" and only think that it is made up of people who think and feel exactly like them. permalink parent award report block reply noPTSDforMePlease 23 points 5 days ago \"we the people\" is made up of American citizens, not foreigners. permalink parent award report block reply HoganT -13 points 5 days ago Did I mention foreigners? permalink parent award report block reply noPTSDforMePlease 13 points 5 days ago The person you replied to did. Learn how context works you butter butt. permalink parent award report block reply AerialRush 11 points 5 days ago Illegals are not a part of \"we the people\" permalink parent award report block reply HoganT -9 points 5 days ago Did I mention illegals? permalink parent award report block reply 45fan 1 points 5 days ago Ah we forgot there are also faggots and losers. What ever would we do without them? permalink parent award report block reply view 1 more comments... BlackPilledMAGA 6 points 5 days ago Those who want to give OTHER PEOPLE'S MONEY away to illegal aliens can fuck off and die. I don't care about opinions that when acted upon would subject Americans to slavery. If YOU want to fund them, go ahead. If you intend to force others to do the same then get ready for a problem. permalink parent award report block reply HoganT -5 points 5 days ago Go on, give us their demand that is about funding illegals and not about making sure that millions of people's healthcare premiums don't go up by literally 100's of percent. They've got us by the balls on this one friend, I'm sorry. Not funding the aca is a 100% death sentence in the midterms. And we've never not intended to fund it. We were always going to give this up, we just hoped to paint them in the worst light possible on the way. In the end, President Trump will be on truth social touting how he/we just saved the American people 1000's of dollars a year on the health insurance. permalink parent award report block reply justicein2020 5 points 5 days ago the aca subsidization was always going to run out. it can't support itself. it failed. kicking the can down the road AGAIN is stupid. handing over ANYTHING to illegals is a death sentence in the midterms and next general.   and forever. republicans will never get another vote again. this is the hill to die on. NOT funding the world. permalink parent award report block reply view 1 more comments... Klaus73 1 points 5 days ago I think folks are getting high on their own supply. Its not about common sense or tactics; merely being \"alpha\" and winning...its just about ego at this point. Republicans tried to paint this as the democrat shutdown and that has failed over and over despite what they say - especially when they say \"we don't want to fire people\" and post blue oyster reaper song remixes; \"We don't want to starve folks.\" then fight like hell in the courts to avoid having stuff like SNAP go through. Its a steadily worsening war of optics. Fact is the ACA is a drop in the bucket as far as what it costs vs what its worth and if ACA is willing to be given up thats less then 30% of what the democrats wanted in their demands and then if they refuse it pulls that card from their hand - but folks are so hell bent on trying to dominate the dems that they would rather fuck the entire republic for decades then actually work with the party that still does actually ALSO have American voters...whom the president is also supposed to serve. The stock market is great but generally the gains of it mean little for the average Joe who's closest interaction is going to be a 401k; I cannot recall the last time prices of shit went down because someones stock was skyrocketing. permalink parent award report block reply deleted 1 points 5 days ago HoganT 2 points 5 days ago I feel like there’s not enough of us to even win fucking primaries. There 10-15 or so MAGA reps in Congress is starting to seem just about proportionate. permalink parent award report block reply Klaus73 2 points 5 days ago MAGA has shifted since the election. I remember \"I haven't read anything about project 2025\" and felt \"Oh ok he has his own plan\" and now its basically a bunch of them. I remember him working at McDonalds to show he gave a shit about folks that were just having a hard time getting by. Now the only thing he points to is stock markets. Anything thus far he has \"checked off\" on the MAGA agenda is only because it was also on the 2025 agenda - which seems to be where his priorities lie. permalink parent award report block reply HoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply HockeyMom4Trump 75 points 5 days ago Republicans only know how to lose. permalink award report block reply EgregiousPhilbin 14 points 5 days ago But you better vote for them anyway, according to the groupthink in here. permalink parent award report block reply makersmarx 20 points 5 days ago Oh fuck off. We are forced to vote for the lesser of two evils. Giant douche or turd sandwich, or dont vote. Those are the options. permalink parent award report block reply DT170x 4 points 5 days ago Acceleratist Are the most dumbest people on this forum. What will happen when Democrats get into power. It almost impossible to remove them(out side of a civil war) from power. Picking a lesser of 2 evils is better because it gives us some time. Also I doubt u/EgregiousPhilbin partake in a primary. permalink parent award report block reply anotherthing 6 points 5 days ago They really are. Had Kamala won, she'd let in 10 million more illegals, the Democrats would vote for amnesty, and it'd be game over. They wouldn't have to cheat ever again. Every state would be like Post 1986 California. permalink parent award report block reply view 2 more comments... joggin_noggin 2 points 5 days ago We should be purging a single RINO cuck each election. We can afford to lose one race, and the rest of the party would shape up when they see the full wrath of their voting base descend on on of their colleagues. Can you imagine how much it would make Conryn piss his Depends to see us purge Graham in an 80-20 blowout? The next election, we toss Murkowski to the Dems if we can't oust her in the primary. They'd get the message. We're not going to toss power in the bin entirely, but we're going to focus all of our energy on removing the least conservative member of the Republican Senate every two years, so you need to make sure nobody confuses you for the least conservative one of the ~50. If we get with the plan and redistrict the House appropriately, we'll hold enough control there to make sure they can keep the government from doing anything outrageous while we work on the Senate. permalink parent award report block reply Kpak76 1 points 5 days ago Well honest question here.  Hypothetically speaking, if your choice was fetterman or liz Cheney, who had your vote? permalink parent award report block reply makersmarx 1 points 5 days ago Neither, wouldn't vote. Same puppet master. permalink parent award report block reply Appeal2Heaven98 2 points 5 days ago \"Well, what else do we have? Would you rather a communist win? We have to expose the cheating somehow! What are you doing to change things anyway, faggot?\" -Someone on this forum, probably permalink parent award report block reply Spicy_cat 2 points 5 days ago Primary them with people who aren't RINO cucks permalink parent award report block reply DontTreadOnLego 1 points 5 days ago Unfortunately better than the other choice.  THIS is why our country is screwed up.  We have not have a functional government for a very long time. permalink parent award report block reply That_Which_Lurks 6 points 5 days ago Of course. It's one big act. Just to string you along. They know nothing will be done about it, or to them. permalink parent award report block reply Papabravo12 2 points 5 days ago Fortunately they told the Dems to go fuck themselves after all (for now) permalink parent award report block reply blueeyephoto 55 points 5 days ago and this is why the Dems win, Republicans cave to their whims, but when the Dems are in control, they give the Republicans nothing permalink award report block reply Appeal2Heaven98 22 points 5 days ago Republicans think they're taking the moral high ground by \"compromising.\" Democrats don't give a shit about morals as long as they get what they want. At some point, \"compromise\" for the sake of it leads to the compromise of our founding principles. permalink parent award report block reply GentleSlayer 10 points 5 days ago At some point? permalink parent award report block reply Rakkasan91b 4 points 5 days ago Right?  That point happened a good century or more ago. permalink parent award report block reply GentleSlayer 3 points 5 days ago Probably started  in earnest with Wilson. permalink parent award report block reply anotherthing 7 points 5 days ago What compromise? The GOP starting position was Biden Era spending levels. They didn't start off with an actual conservative level of spending, just more of the same. That's like walking on to a car lot, seeing a car for $5000, say you'll pay $5500, and then letting the dealer haggle you higher. permalink parent award report block reply RagnarD 2 points 5 days ago In any compromise between food and poison, it is only death that can win. In any compromise between good and evil, it is only evil that can profit. --Ayn Rand permalink parent award report block reply PeaceMakerDJT 2 points 5 days ago One thing i give them is respect for always sticking together permalink parent award report block reply PeaceMakerDJT 43 points 5 days ago Not sure how Trump is planning on defeating the deep state when he has rinos going against him and nothing we need will pass permalink award report block reply grenades_and_ham 24 points 5 days ago Republicans - Snatching defeat from the jaws of victory. permalink parent award report block reply Appeal2Heaven98 11 points 5 days ago I'm currently preparing for the fallout and focusing on building local connections. It might be a Doomer way of thinking to some people, but I'm done giving time and emotional energy to shit that ultimately I have no control over anyway. permalink parent award report block reply Ikon 1 points 5 days ago He endorses half of them as well. There is no true winning, shit will never change. permalink parent award report block reply covok48 41 points 5 days ago This second term has been…less than stellar. permalink award report block reply grenades_and_ham 33 points 5 days ago All EO’s that will be wiped away. permalink parent award report block reply superdelegate 14 points 5 days ago The southern border is closed, with zero releases into the  interior.  Compare to Biden's fifteen million. Trump ended Biden's war on Crypto and terminated Operation Chokepoint 2.0.   CDBCs are banned, and the lawsuits against the exchanges have been dropped. Inflation is down, not perfect, but a shadow of what it was under Biden. The J6 political prisoners are free and no longer being tortured to death. Trump has protected us from being debanked.  Countries fucking us over with their own tariffs are being reciprocated against.  The guard has been deployed to bring down crime.  Trump is working to end cashless bail, he's using federal pressure to end pediatric gender transitions.  He's defunded NPR and PBS.  The dept of education has been slashed. USAID is no longer a slush fund for Democrat NGOs to destroy the country The mRNA vaccines are off the childhood schedule.   Trump is working to protect girls' sports. He's secured hundreds of billions of foreign investments into our own manufacturing and high tech base. You guys need to keep aiming high, but enjoy some of the wins FFS permalink parent award report block reply NebraskanPatriot 4 points 5 days ago It's been OK.  A bit better than Jimmy Carter, but worse that Gerald Ford.  Not horrible for a middling performance destined to be forgotten by history.. permalink parent award report block reply Appeal2Heaven98 10 points 5 days ago History books will try to mark Trump as the wannabe dictator who wanted to take over the country by channeling Hitler and was thwarted by the all-good Democrats and brave Republicans who dared to step over the party line to stop tyranny. permalink parent award report block reply wharfthrowaway 3 points 5 days ago They bravely sodomized each other in the senate hearing rooms before voting against the bad man permalink parent award report block reply Ch3f4554551n 2 points 5 days ago Lol \"history\" books... permalink parent award report block reply Appeal2Heaven98 2 points 4 days ago We can laugh about it, but 90% of what we learn comes from history books, AKA written history. And the history that's written is decided by the victors. permalink parent award report block reply Magma_Biscuit 4 points 5 days ago Judicial branch brick wall, that’s a lot of the damn problem permalink parent award report block reply Schroeder09 5 points 5 days ago Is it the problem, or is obeying the illegal edicts of these communist judges the problem? permalink parent award report block reply Rakkasan91b 1 points 5 days ago Both permalink parent award report block reply TrumpLandslide20201 28 points 5 days ago Thune is a Deep State CUCK and so are the majority of them. We didn't replace them with MAGA candidates. They still run the show and by the looks of it they are going to win. permalink award report block reply 556x45mm 13 points 5 days ago I fear that when Trumps term is up the Republicans will back their own candidate and try to push JD and others out. In fact, im sure they (the Republicans) will do everything they can to destroy MAGA permalink parent award report block reply AerialRush 10 points 5 days ago They already are attacking JD for listening to what young conservative voters are saying instead of purely foreign donors permalink parent award report block reply InJailOutSoon 4 points 5 days ago It wont work. With or without Trump there is something brewing and all they have left to push their narratives are a dying media that their constituents dont trust -- the ones who do are aging out of the pool. The RINO's will go extinct, its just a matter of time. Hell, Trump has helped some of these RINO's get elected time and time again. He helped put them in some of these positions. permalink parent award report block reply Appeal2Heaven98 2 points 5 days ago If JD Vance isn't the presidential candidate in 2028, I'm not sure if I will bother voting. Very few others with the R are worthy of running this country. permalink parent award report block reply modded 15 points 5 days ago Keep it shut down permalink award report block reply Mega_MAGA 11 points 5 days ago It's all about stopping Trump. permalink award report block reply FerkenBlerkin 9 points 5 days ago Media is already saying \"the longest shutdown in American history occurred under Donald Trump\".   They'll always blame it on him permalink parent award report block reply terribletwos 11 points 5 days ago I hadn't heard anyone before Elon talking about how the whole system of fraud in all those democrat states revolved around funding for illegal aliens. If I remember correctly, since we caught their fraud and stopped it, now they're asking for it directly. Otherwise their states will go bankrupt. They don't have any leverage here if that's true. We should force them to do all the things we want in order to bail out their states. Who else is talking about this in more detail? permalink award report block reply HoganT -5 points 5 days ago Despite all our narrative, this shutdown has nothing to do with illegals. It's about not making people's insurance premiums skyrocket by literally 100's of percent. permalink parent award report block reply xanaxagoras 2 points 5 days ago Correct, by socializing the costs. Where do you think you are? permalink parent award report block reply HoganT -1 points 5 days ago I’m sorry, has President Trump or our party presented an alternative to the ACA? Any alternative? Have we tried to reform health care? permalink parent award report block reply Trollasaurus 1 points 5 days ago No it’s about timing subsidies to expire right before midterms. permalink parent award report block reply HoganT -1 points 5 days ago Pretty easy way to avoid that. Fund the fucking subsidies. We pay for welfare to every god damn corporation on the planet, farmers to grow food no one’s buying, every damn soldier I’ve ever met who’s fully able and working full time while collecting full disability with no physical issues. It’s a drop in the bucket. permalink parent award report block reply Alldayeveryday 9 points 5 days ago It's all a dog and pony show. They are all traitors permalink award report block reply Ghostphaez 8 points 5 days ago I mean, there are remedies for traitors such as - but no one wants to man up. permalink award report block reply HoganT -3 points 5 days ago Oh we like and approve of the Charlie Kirk treatment when it's people we don't like? permalink parent award report block reply AliveIn3 6 points 5 days ago Notice how he said \"I\" and not \"the constituents I represent\". permalink award report block reply ncswicn OP 2 points 5 days ago Narcissists only ever represent themselves! permalink parent award report block reply TearsAficionado 6 points 5 days ago Tar n' feather and hang this fuck in front of the DC Obelisk. permalink award report block reply Frenchie619 6 points 5 days ago Cave now and use reconciliation early next year to nullify everything that was passed that they didn't want.  It's brilliant Jerry! permalink award report block reply BannedAccount 11 points 5 days ago No they'd find a way to fuck us on that too permalink parent award report block reply Frenchie619 3 points 5 days ago Good point.  They are a bunch of spineless fvcktards after all,  right? permalink parent award report block reply Treefiddydiddy 6 points 5 days ago yet another useless cunt in there for one reason only , to scupper Trump permalink award report block reply Speedgraphic69 5 points 5 days ago This bastard needs to be changed permalink award report block reply henri_derelicte 5 points 5 days ago I did not vote for Obamacare subsidies being extended. The amount of an annual subsidy for a single taxpayer is more than I pay in income tax. Let those fuckers pay for their own healthcare permalink award report block reply Skywise 4 points 5 days ago Turtle’s progeny bites us in the ass again. permalink award report block reply Fuck_commies_2024 4 points 5 days ago Guy is such a mega faggot. I love GEOTUS but I wonder how he can’t see through this fake faggot, Lady Lindsay, etc. permalink award report block reply Lurker404 1 points 5 days ago So basically Dems won the elections and are now willing to accept what had been offered before? They got what they wanted. permalink parent award report block reply ncswicn OP 4 points 5 days ago https://truthsocial.com/@PepeDeluxe/posts/115510139344902710 permalink award report block reply CruzControl 4 points 5 days ago The narrative is on our side and the dems spilled the beans that the shutdown is their leverage. The dems are getting heat over the shutdown. They will cave. The only reason GOP is doing this is because they are negotiating their portion of the kickbacks from the subsidies. permalink award report block reply Klaus73 0 points 5 days ago I disagree; general opinion is that the dems do not have the power and there's a frequently ran clip of Trump himself saying a shutdown is the fault of a president in power. That said it is the dems that triggered the shutdown;  however they aren't the only ones helping to make this one particularly bad. permalink parent award report block reply Gadsden 3 points 5 days ago If they do this..... What the actual fuck? permalink award report block reply RocksCanOnlyWait 3 points 5 days ago Need to open a shop next to Capitol Hill selling spines... permalink award report block reply Helly 3 points 5 days ago What a fucking faggot. Much more of a faggot than any dem permalink award report block reply BlackLabsMatter 3 points 5 days ago Yay!!!  The illiterate knee-jerk headline readers and faggot engagement farming are here again!!! If you would bother to read the actual words in the actual picture,  you would see that faggot Thune has offered VOTES on the things, NOT concessions.  Those votes were going to happen anyway.  This changes nothing. \"post-shutdown votes on ACA and tax credits\" It's even in bold type. Stop being retarded faggots. permalink award report block reply HKFan 3 points 5 days ago Why is this stickied?  It's taken way out of context He's already offered them up or down votes on what they want.  THose things STILL have to get 60 votes themselves, which they won't. This is what the dems have been balking at all along becuase they want these things rolled up into the CR. Thune is pretty spineless, but this is misleading from everything I understand about the situation permalink award report block reply deleted 3 points 5 days ago BlackLabsMatter 0 points 5 days ago Read the text that is clearly visible in the picture. Focus on the bold type. Know that your are still right, but this is not an example of that. permalink parent award report block reply CommanderOfCheese 3 points 5 days ago Fuck you Thune! permalink award report block reply groomofthestool 3 points 5 days ago Have the Republicans EVER  won a Shutdown fight? permalink award report block reply ncswicn OP 2 points 4 days ago Not that I recall. permalink parent award report block reply vongregormench 2 points 5 days ago Fucking veto it. permalink award report block reply JetJocky 2 points 5 days ago Schumer wants the GOP to agree to a 1 year extension on ACA funding ahead of reopening. While I don't trust Thune, in this case, he is only offering Schumer a \"vote\" on it. permalink award report block reply RealmanPwns 2 points 5 days ago First of all they offered \"Post Shutdown Votes\".\nSecond, the \"I'm willing to give the Democrats...\" could be \"all the things they want as far as a vote on these things post shutdown, not necessarily the yes votes themselves but just having the votes take place. permalink award report block reply ncswicn OP 1 points 5 days ago Here is an update: https://www.zerohedge.com/political/thune-willing-give-democrats-all-things-they-want-friday-shutdown-vote-looms permalink parent award report block reply Datamancer 2 points 5 days ago But it didn't happen.  Someone reattached the GOPs testicles and spiked their weak-ass tea with a shot or two of testosterone. permalink award report block reply 5DchessWatch 2 points 5 days ago We got two weaklings.  Thune and Johnson permalink award report block reply Will_Not_Comply 2 points 4 days ago Fuck that. I'd rather Trump veto it than give them $0.01 to reward their antics. Go. Pound. Sand. Losers. permalink award report block reply NeverInterruptEnemy 2 points 5 days ago There better be more to that fucking sentence like… Well give them everything they want in exchange for prohibiting all illegals from social services, and 50 state reciprocity”. permalink award report block reply TGNX 2 points 5 days ago End the \"filibuster\" and you don't have to give them anything. permalink award report block reply infinitysupreme 2 points 4 days ago Democrats want your head on a pike while they bathe in your blood, Thune.   Go ahead, let them have it permalink award report block reply MAGAnic316 2 points 5 days ago This is their “get out of terminating the filibuster” free card permalink award report block reply 2016TrumpMAGA 2 points 5 days ago Thune is an evangelical Christian There's your fucking problem. I'm sick of these 'lose with honor,' 'turn the other cheek,' 'Israel is our greatest ally' assholes.  As a non-denominational Christian, they disgust me. permalink award report block reply llirrem 2 points 5 days ago The only way to \"lose with honor\" is to die in battle, there's no honor in surrender or retreat. permalink parent award report block reply iSignedUpForThis 2 points 5 days ago losers! permalink award report block reply Oodles 2 points 5 days ago Fuck Thune Fuck all traitorous RINOs permalink award report block reply IAmDisappoint 2 points 5 days ago Ah so the leftists throw a tantrum, and get what they want? Fuck these un-American republican traitors if they cave. permalink award report block reply OldBark2 2 points 5 days ago So Thune is a democrat?? Why doesn't he just \"come out\". permalink award report block reply RememberCharlieKirk 2 points 5 days ago And, to think, Thune was ready to retire in 2022. Blame Governor Noem who was supposed to primary him in the 2022 election; her backing down ensured his re-election. (If even a relatively popular governor will not challenge him, then what chance does some other South Dakotian have?) Also, I believe he sought re-election because he was under the impression that the \"Era of Trump\" was over and that the pre-Trump Republican times had returned. permalink award report block reply Oracle 2 points 5 days ago If I read the quote correctly, he’s saying the same thing as always.  They can have a vote, which they’ll lose, AFTER the shutdown. permalink award report block reply KekistanPM 2 points 5 days ago That was their plan all along. permalink award report block reply ACActual 2 points 5 days ago We may as well just start hanging politicians that don't understand where the country is.   Let it fail you stupid mother fuckers. permalink award report block reply 24601 2 points 5 days ago If RINOs cave, 2026 is going to be 400 D in the House and 75 D in the Senate. RINOs hate America. permalink award report block reply GhostOfTheRepublic 2 points 5 days ago Thiune is on the side of the Democrats.  He is a traitorous sgit-bag. permalink award report block reply auntjemima 2 points 5 days ago folding RINOs???? gtfo where's my shocked face emoji permalink award report block reply HisShadow 2 points 5 days ago These subsidies will never go away and just adds 25 million more to the Medicare program… that is the goal permalink award report block reply Undying 2 points 5 days ago Can these faggots not stick to their guns? permalink award report block reply ncswicn OP 1 points 4 days ago I don't think they have guns, balls, or spines! permalink parent award report block reply MAGA-Fett 2 points 5 days ago He said he was willing to have separate votes on the ACA shit. Big deal, it won’t pass. permalink award report block reply emorphia 2 points 5 days ago and again the GOP bends the knee to the dems.  not ending the filibuster to pass the MAGA agenda and now caving again and giving money to illegals.  this is 100% the opposite of the MAGA agenda.  Thun is part of the problem.  Time for Trump to use as much power as possible (but to be honest i dont know what) to replace the personel that opposes the MAGA agenda. permalink award report block reply patriot_based 2 points 5 days ago No, no, no - hold firm! permalink award report block reply TheSonOfGadsden 2 points 5 days ago RINO fags at it again permalink award report block reply 2016TrumpMAGA 1 points 5 days ago Thune looks like that high school bully that was secretly gay. permalink award report block reply SanityGumby 1 points 5 days ago I highly doubt he said that. Prove it with video. permalink award report block reply ncswicn OP 1 points 5 days ago Here is an update: https://www.zerohedge.com/political/thune-willing-give-democrats-all-things-they-want-friday-shutdown-vote-looms permalink parent award report block reply bluewhiteandred 1 points 5 days ago We have the leverage! This is the Schumer Shutdown! All he has to do is create more sobrero memes, instead just speaks like a total sellout lol permalink award report block reply akai_ferret 1 points 5 days ago I've said since the very beginning: Thune and the rest are traitors.\nAnd Trump has been A WEAK FOOL for working with and even supporting these backstabbers. permalink award report block reply DudeNoOne 1 points 5 days ago I don’t understand why this is such a big issue? The vast majority of people who receive these benefits aren’t voting for Republicans, so who cares? permalink award report block reply L74ge9wr 1 points 5 days ago Follow the money (FTM), my guess is he has a payday coming. permalink award report block reply hansgruber7 1 points 5 days ago What is the source for this quote? permalink award report block reply anotherrandomname 1 points 5 days ago Didn't actually think the RINO faggots were actually going to let Trump fire everyone, did you? This horse shit is all completely performative. permalink award report block reply PhantomShield72 1 points 5 days ago How \"surprising\" permalink award report block reply 603taco 1 points 5 days ago I would rather us face some serious hard times, than capitulate with these ass holes. permalink award report block reply Crappydatum 1 points 5 days ago Spineless permalink award report block reply Hikedelics 1 points 5 days ago Not that Thune deserves anyone coming to his defense, but read what he said again very carefully. Politicians are slick and this could have multiple meanings. He is offering a vote on those things after the government reopens, which is actually what they’ve been offering since the beginning. Him saying “ I am willing the give them all the things they want.” doesn’t mean the rest of the senate will. If things reopen without the ACA subsidies built in, they won’t pass separately. permalink award report block reply Dem_slayer 1 points 5 days ago This is the reason out country is declining so fast... stop giving in... permalink award report block reply roadrunner0 1 points 5 days ago Trump will never sign a bill giving free stuff to illegals and those with fake refugee status.. permalink award report block reply Silentbutdeadly 1 points 5 days ago Not surprised- he’s just a Democrat in a republican suit. permalink award report block reply RedWave26 1 points 5 days ago Snake. We knew that when we let him in. permalink award report block reply dtrap 1 points 5 days ago Bloody hell... Is it now when people start posting how [insert other group] is the problem? permalink award report block reply suckmycorona 1 points 5 days ago Faggots permalink award report block reply BadBrainsBuzzcocks 1 points 5 days ago Who didn't see this coming? See my shocked face.... permalink award report block reply Justjayce 1 points 5 days ago Trump won't permalink award report block reply JohnMiller2020 1 points 5 days ago They're holding out for a better bribe, the illegals are getting healthcare. RIP USA permalink award report block reply GuerillaYourDreams 1 points 5 days ago I really do believe that my original plan is the only possible plan going forward. We need to fire all of Congress and start over all new! permalink award report block reply TheSwampThang 1 points 5 days ago How about they pass the bill, then a week later pass another bill largely nullifing the bad stuff? permalink award report block reply hairless_ap3 1 points 5 days ago WHAT A FUCKING FAGGOT Rope + Tree = addition by subtraction permalink award report block reply itspancakees 1 points 5 days ago This guy is a complete cuck. We need to get rid of these scrubs before doing anything else permalink award report block reply Light_HIV_Effect 1 points 5 days ago Every time they play by the democrats rules and demands they get burned. Rather, WE get burned. Tell them to fuck off permalink award report block reply jonnyuno 1 points 5 days ago And short term again. Lovely. POS. permalink award report block reply ILoveSilk 1 points 5 days ago He always looks evil to me. Establishment is playing with Trump and MAGA. permalink award report block reply True_Curmudgeon 1 points 5 days ago We're not voting our way out of this permalink award report block reply UNfreeNewZealand 1 points 5 days ago ….and the spotlight shines on another ‘roach. permalink award report block reply MemeLawd 1 points 5 days ago Fucking Faggot permalink award report block reply cryptoapebot 1 points 5 days ago hopefully that's just a negotiation tactic, as what they want is pure evil. permalink award report block reply Throwingway22 1 points 5 days ago What he wants is the excuse to avoid ending the filibuster. Trump should not go along with any patchwork bullshit that sleepwalks us into the Democrats removing the filibuster and legislating the death of America. permalink award report block reply Choomguy 1 points 5 days ago Trump should use the nuclear nuclear option and veto the fucking thing…. permalink parent award report block reply Throwingway22 2 points 5 days ago The Nuclear Option for Trump is the unitary executive. permalink parent award report block reply throttlejohnson 1 points 5 days ago fucking POS dickless motherfuckers...hold the line permalink award report block reply SteelDriver 1 points 5 days ago Jesus guys.  Grow a fucking spine.  If the Dems want to keep the government shut down to get illegal aliens free healthcare, keep that bitch shut down.  Make sure everyone knows they are the reason for the shutdown and why. I’d rather nuke the filibuster than cave to socialist obstructionists. permalink award report block reply Counterwhat 1 points 5 days ago They lost the election for nothing. What a bunch of nothing, jelly fish.  They are the Washington generals watching the globetrotters dribble up and down the court before being embarrassingly tea bag dunked on. LOOOSSSSEEEEEERRRRRR!🤬🤬🤬🤬🤬🤬🤬😡😠 permalink award report block reply politicsaside 1 points 5 days ago Don’t give them shit. Nuclear option and pass OUR bills. permalink award report block reply MiltonThomasX 1 points 5 days ago Thune is a  Fing Bitch permalink award report block reply OG_BACONndEGGs 1 points 5 days ago I am not voting for any republicans in the midterms or 2028. Dont care. Let it burn at this point. They want to lose? Good lets go for broke fuck the GOP permalink award report block reply spinometer2 1 points 5 days ago ridiculous permalink award report block reply tjohnson107 1 points 5 days ago Trunp, please just be a dictator at this point. The country is lost at this rate. permalink award report block reply 1787_1789 1 points 5 days ago Thune is DESTROYING the party ON PURPOSE. He is caving SPECIFICALLY to DESTROY Trump, his agenda, his legacy, and MAGA. NO ONE will vote for GOP in 2026 if he does this (and he knows it). This ENSURES Dems take the House AND the Senate and THEY WILL successfully impeach Trump, effectively UNDOING every single fucking thing that we all went through to get him into office a second time. 4 years was just reduced to 2 years with this one move, save this post. permalink award report block reply It_takes_10_years 1 points 5 days ago Remember if you do not keep voting for this party and they lose and democrats win its 100% YOUR FAULT! Keep voting for the they did it again party. America First. America ALWAYS. AF as FUCK permalink award report block reply My2SonsAreMarines 1 points 5 days ago (R)'s did not and do not intend to cave.  Update your feed. permalink award report block reply Chickensaurus 1 points 5 days ago Not sick enough.... permalink award report block reply madisonmaga 1 points 5 days ago Fuck these faggot pussies. permalink award report block reply Goozmania 1 points 5 days ago The answer rhymes with \"silence\" and starts with a V. permalink award report block reply HoganT 1 points 5 days ago Never cared at all about people being assassinated, huh? Just that it was someone we liked instead of someone we didn't. permalink parent award report block reply cherbui 1 points 5 days ago whats the kickbacks permalink award report block reply Silentson- 1 points 5 days ago Massively increasing everyone's insurance payments right before the midterms is a guaranteed way to lose the house and get 2 years of impeachments. permalink award report block reply Eddie_LeBec 1 points 5 days ago Sorry Fuentes is right\nWhy are you even showing up to vote.\nThis is a red state incumbent Senator and he only has things for Dem votes, he doesn't even think of you. permalink award report block reply GuerillaYourDreams 1 points 5 days ago Do you also date a man named Destiny? Like Nick Fuentes does?? permalink parent award report block reply yurimodin 1 points 5 days ago VETO permalink award report block reply OTher55 1 points 5 days ago Guaranteeing to vote on ACA and tax credits is a nothingburger. ACA and tax credits won't pass. Dems know they won't pass. What Dems want is to be able to run ads against Republicans in the midterms saying they voted down the ACA and tax credits. permalink award report block reply MyNameIsTaxpayer 1 points 5 days ago Thune will let democunts reprise fines for those who refused to sign up for health insurance. Tax them into oblivion. -uniparty permalink award report block reply MythArcana 1 points 5 days ago Just like clockwork. permalink award report block reply Dangerous 1 points 5 days ago He isn't a \"turncoat\", this is what he always was and why everyone with a brain on here kept rejecting the BBB. You think since Trump loves telling the snake story he would know a snake when he sees one permalink award report block reply DontTreadOnLego 1 points 5 days ago I'd like to see Thune Thunk at the end of a rope if he wants to be a traitor. permalink award report block reply DrVSGGEOTUSPhD 1 points 5 days ago Is this about paying for Healthcare for illegals again? permalink award report block reply Choomguy 1 points 5 days ago Uniparty…. permalink award report block reply Handshake_Shmanshake 1 points 5 days ago How about you just go around every city with flyers, listing the politicians addresses who are holding up peoples EBT... Simple solution to a modern problem permalink award report block reply MasterChief08 1 points 5 days ago Leftwing judges too permalink parent award report block reply Mythnutbill 1 points 5 days ago Honestly, I think this is a bit overblown. Zero hedge, while a fun site, does have a habit of being on the alarmist amd inaccuarte side of things The 2nd paragraph says Thune is offering POST-shutdown votes on extending ACA subsidies.  While I agree they should not do so and that the ACA just needs to be gotten rid of, it could also be a bit of a bluff, as it requires the Dems to trust the Reps would actually follow through. Given the Dems' propensity for making a promise to pass legislation and then renegeing (Reagan's amnesty says, \"Hi\") and their habit of projecting their own behavior to others, I wouldn't be surprised if they decline and demand it be added to the legislation to open the government.  Which, so far, the R's have actually held pretty strong on.  And, IIRC, if they do amend the CR legislation, it would have to go back to the House, and I get the sense that Johnson is doing better than Thune when it comes to not giving the Dems what they want. permalink award report block reply TheArchAngel 1 points 5 days ago keep the government shut. permalink award report block reply alucard13mmfmj 1 points 5 days ago Caving just makes all this pointless lol. permalink award report block reply MemeWarsVet 1 points 5 days ago rope intensifies permalink award report block reply kjj9 1 points 5 days ago He's talking about votes, not laws. The Democrats want the Senate to vote on things so that they can fundraise:  \"I voted for X, but the evil mean nasty GOP voted no\" permalink award report block reply Goozmania 1 points 5 days ago Well, he didn't. Instead he talked shit about democrats for a while. But still won't actually do anything. So was this fake news? permalink award report block reply MatterThatMetals 1 points 5 days ago Look. They're ALL corrupt. Even that dear, sweet, comment-machine Kennedy. permalink award report block reply utfanx2 1 points 5 days ago The largest industry in the country does not need corporate subsidies disguised as \"welfare\". permalink award report block reply MAGARondonmonson 1 points 5 days ago Giving them votes doesn't mean they can get to 51. They need to stop selling out the Majority given unto them, the 60 vote rule is a rule that protects either side in power so they can do THEIR WILL, not the peoples will. The have an excuse, we need 60 votes. permalink award report block reply MasterChief08 1 points 5 days ago There's going to be 3-4 cucked Republicans permalink parent award report block reply MAGARondonmonson 1 points 5 days ago Naaa, he would not hold the vote if he did not have the votes, lol. Its all a bs illusion up there in DC permalink parent award report block reply Dev404 1 points 5 days ago Sure he is, and he should be in line for his trial for treason. permalink award report block reply asiatrails 1 points 5 days ago An overboiled piece of spaghetti has more spine than this so-called leader permalink award report block reply CharlieMike 1 points 5 days ago Because of the election results, the RINOs are panicking and this is what Schumer was waiting for. permalink award report block reply rivetjoint2 0 points 5 days ago He said he would give them a vote but could not guarantee the outcome.  So it's not as bad as the headline suggests. permalink award report block reply MasterChief08 1 points 5 days ago There's going to be at least 3 Republicans that vote for it permalink parent award report block reply AlmostFullyDilated -2 points 5 days ago Trump freed the ultimate swamp creature kwame kilpatrick permalink award report block reply dukeofdoorcounty -3 points 5 days ago A lot of the people that will get screwed by ending the Biden subsidies are self-employed and business owners that should be MAGA people.  You don't want them pissed off going into 2026.  Keep the subsidies, but run a campaign on how bad Obamacare is and force the Dems to come up with something better. permalink award report block reply Aquamine-Amarine 3 points 5 days ago I don't want something better. I want it gone. permalink parent award report block reply HoganT 2 points 5 days ago Uhhh, why is it on the dems to come up with something better? Shouldn't WE be doing that? permalink parent award report block reply MasterChief08 1 points 5 days ago Fuck that. Abolish Obamacare permalink parent award report block reply dukeofdoorcounty 1 points 4 days ago Obamacare was designed to implode in 10 years and here we are.  President Hillary was supposed to sign Medicare for all about this time. permalink parent award report block reply TheGoyimWhisperer 3 points 5 days ago Comment removed upon the user being banned. permalink award report block reply EyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nBe_The_Change 298 points 5 days ago Let me guess; I will again be forced to pay insurance premiums for individuals who should not be in my country and do not pay taxes.  In other words, slavery. I think not this time. permalink award report block reply ZacPetkanas 89 points 5 days ago You'll also be forced to subsidize the health-insurance cost of people who have retired early.  God bless them for having enough to choose to stop working, but doing it on the back of the working people is gross. permalink parent award report block reply Websitesdown 57 points 5 days ago Don't forget higher auto insurance and higher food cost again.. permalink parent award report block reply Govtizbad 52 points 5 days ago Why is the govt shutdown so bad? Leave it closed Republicans are giant pussies who can't wrangle CNN permalink parent award report block reply The_Return_of_User_x 12 points 5 days ago Stop doing deals... Wait for the dems to call them to the floor. Vote on what's been proposed or stay home. permalink parent award report block reply superdelegate 5 points 5 days ago I wrote to Thune to tell him to go nuclear.  The response wasn't even \"No I don't want to\" it was \"fuck off you don't live in my state\" permalink parent award report block reply view 2 more comments... Taylor3006 5 points 5 days ago Because when the government is closed down, elected representatives realize that we don't need them. They lose power and prestige. We need to keep it shut down, fuck them all. Figure a way to pay the military and shut everything else down. permalink parent award report block reply view 4 more comments... Sig229 1 points 5 days ago Thune should be fucking arrested for treason. Fucking giant cocksucking commie cunt. permalink parent award report block reply 1True-translation -6 points 5 days ago How are you back after being banned? permalink parent award report block reply view 1 more comments... cptkloss5 26 points 5 days ago don't forget higher property taxes, to educate anchor babies with your money permalink parent award report block reply chickeninoven 14 points 5 days ago Are you still posting here? Get back to work, people who hate you need your money. permalink parent award report block reply view 1 more comments... KekistanPM 15 points 5 days ago Unless you're a white male, then you're completely on your own when you retire. permalink parent award report block reply mohel 4 points 5 days ago Well, it is just fair in case of somebody who lived their live full of white privilege. permalink parent award report block reply Shih_Tabed 3 points 5 days ago Being responsible shouldn't be considered a privilege. permalink parent award report block reply EggsBennydict 6 points 5 days ago Subsidies and handouts are the problem for everything. Healthcare and food is not a right. As fucked up as it seems today,  home prices, groceries, traffic, healthcare, etc would not be a problem if govt didn’t reappropriate our money. Survival of the fittest would’ve played out and a vast majority of people would be contributing to society and living a good life. Instead we’re work slaves to fund the lazy leeches of society. What I don’t get is why or how healthcare got this fucked. Why isn’t health insurance like other insurance? Why can’t medical care just be affordable for everyone.. without insurance? Get rid of the law that makes it illegal to refuse to treat anyone who can’t pay.. hospitals are allowed to deny treatment if you deny a tetanus shot, but not if you can’t pay? Clown world permalink parent award report block reply ThisTrainHasNoBrakes 5 points 5 days ago If they aren’t paying for their own shit, they DO NOT HAVE ENOUGH TO CHOOSE TO STOP WORKING and retire early. FFS. permalink parent award report block reply load 1 more comments... AVeryNakedMan 29 points 5 days ago All taxes are slavery, just in varying degrees. permalink parent award report block reply Ch3f4554551n 1 points 5 days ago There aren't really degrees of freedom. Either a man is free or he isn't... permalink parent award report block reply MaoHadOnly1Testicle 1 points 4 days ago There's free, and then there's varying degrees of slavery. The same way something is either not on fire, or some degree of burnt. permalink parent award report block reply NotYourMan 14 points 5 days ago X/Twitter is incredible; every democrat just lying about how its Trump's fault using poor families and government workers as a reason that Trump is bad.  Democrats really are just evil, hateful people.  They hate the poor and the middle class. permalink parent award report block reply LaVaughnRobinson 6 points 5 days ago They love the poor, its their pawns they manipulate.  They do hate the middle class and want them gone. permalink parent award report block reply BlackLabsMatter 7 points 5 days ago Read the words.  Fake post again. permalink parent award report block reply That_Which_Lurks 2 points 5 days ago I think not this time. It will go through like every other time in the last 30+ years. Nothing will change and all of this has been theater to keep the plebes at each other's throats. permalink parent award report block reply load 8 more comments...\nZacPetkanas 89 points 5 days ago You'll also be forced to subsidize the health-insurance cost of people who have retired early.  God bless them for having enough to choose to stop working, but doing it on the back of the working people is gross. permalink parent award report block reply Websitesdown 57 points 5 days ago Don't forget higher auto insurance and higher food cost again.. permalink parent award report block reply Govtizbad 52 points 5 days ago Why is the govt shutdown so bad? Leave it closed Republicans are giant pussies who can't wrangle CNN permalink parent award report block reply The_Return_of_User_x 12 points 5 days ago Stop doing deals... Wait for the dems to call them to the floor. Vote on what's been proposed or stay home. permalink parent award report block reply superdelegate 5 points 5 days ago I wrote to Thune to tell him to go nuclear.  The response wasn't even \"No I don't want to\" it was \"fuck off you don't live in my state\" permalink parent award report block reply view 2 more comments... Taylor3006 5 points 5 days ago Because when the government is closed down, elected representatives realize that we don't need them. They lose power and prestige. We need to keep it shut down, fuck them all. Figure a way to pay the military and shut everything else down. permalink parent award report block reply view 4 more comments... Sig229 1 points 5 days ago Thune should be fucking arrested for treason. Fucking giant cocksucking commie cunt. permalink parent award report block reply 1True-translation -6 points 5 days ago How are you back after being banned? permalink parent award report block reply view 1 more comments... cptkloss5 26 points 5 days ago don't forget higher property taxes, to educate anchor babies with your money permalink parent award report block reply chickeninoven 14 points 5 days ago Are you still posting here? Get back to work, people who hate you need your money. permalink parent award report block reply view 1 more comments... KekistanPM 15 points 5 days ago Unless you're a white male, then you're completely on your own when you retire. permalink parent award report block reply mohel 4 points 5 days ago Well, it is just fair in case of somebody who lived their live full of white privilege. permalink parent award report block reply Shih_Tabed 3 points 5 days ago Being responsible shouldn't be considered a privilege. permalink parent award report block reply EggsBennydict 6 points 5 days ago Subsidies and handouts are the problem for everything. Healthcare and food is not a right. As fucked up as it seems today,  home prices, groceries, traffic, healthcare, etc would not be a problem if govt didn’t reappropriate our money. Survival of the fittest would’ve played out and a vast majority of people would be contributing to society and living a good life. Instead we’re work slaves to fund the lazy leeches of society. What I don’t get is why or how healthcare got this fucked. Why isn’t health insurance like other insurance? Why can’t medical care just be affordable for everyone.. without insurance? Get rid of the law that makes it illegal to refuse to treat anyone who can’t pay.. hospitals are allowed to deny treatment if you deny a tetanus shot, but not if you can’t pay? Clown world permalink parent award report block reply ThisTrainHasNoBrakes 5 points 5 days ago If they aren’t paying for their own shit, they DO NOT HAVE ENOUGH TO CHOOSE TO STOP WORKING and retire early. FFS. permalink parent award report block reply load 1 more comments...\nWebsitesdown 57 points 5 days ago Don't forget higher auto insurance and higher food cost again.. permalink parent award report block reply Govtizbad 52 points 5 days ago Why is the govt shutdown so bad? Leave it closed Republicans are giant pussies who can't wrangle CNN permalink parent award report block reply The_Return_of_User_x 12 points 5 days ago Stop doing deals... Wait for the dems to call them to the floor. Vote on what's been proposed or stay home. permalink parent award report block reply superdelegate 5 points 5 days ago I wrote to Thune to tell him to go nuclear.  The response wasn't even \"No I don't want to\" it was \"fuck off you don't live in my state\" permalink parent award report block reply view 2 more comments... Taylor3006 5 points 5 days ago Because when the government is closed down, elected representatives realize that we don't need them. They lose power and prestige. We need to keep it shut down, fuck them all. Figure a way to pay the military and shut everything else down. permalink parent award report block reply view 4 more comments... Sig229 1 points 5 days ago Thune should be fucking arrested for treason. Fucking giant cocksucking commie cunt. permalink parent award report block reply 1True-translation -6 points 5 days ago How are you back after being banned? permalink parent award report block reply view 1 more comments... cptkloss5 26 points 5 days ago don't forget higher property taxes, to educate anchor babies with your money permalink parent award report block reply chickeninoven 14 points 5 days ago Are you still posting here? Get back to work, people who hate you need your money. permalink parent award report block reply view 1 more comments...\nGovtizbad 52 points 5 days ago Why is the govt shutdown so bad? Leave it closed Republicans are giant pussies who can't wrangle CNN permalink parent award report block reply The_Return_of_User_x 12 points 5 days ago Stop doing deals... Wait for the dems to call them to the floor. Vote on what's been proposed or stay home. permalink parent award report block reply superdelegate 5 points 5 days ago I wrote to Thune to tell him to go nuclear.  The response wasn't even \"No I don't want to\" it was \"fuck off you don't live in my state\" permalink parent award report block reply view 2 more comments... Taylor3006 5 points 5 days ago Because when the government is closed down, elected representatives realize that we don't need them. They lose power and prestige. We need to keep it shut down, fuck them all. Figure a way to pay the military and shut everything else down. permalink parent award report block reply view 4 more comments... Sig229 1 points 5 days ago Thune should be fucking arrested for treason. Fucking giant cocksucking commie cunt. permalink parent award report block reply 1True-translation -6 points 5 days ago How are you back after being banned? permalink parent award report block reply view 1 more comments...\nThe_Return_of_User_x 12 points 5 days ago Stop doing deals... Wait for the dems to call them to the floor. Vote on what's been proposed or stay home. permalink parent award report block reply\nsuperdelegate 5 points 5 days ago I wrote to Thune to tell him to go nuclear.  The response wasn't even \"No I don't want to\" it was \"fuck off you don't live in my state\" permalink parent award report block reply view 2 more comments...\nTaylor3006 5 points 5 days ago Because when the government is closed down, elected representatives realize that we don't need them. They lose power and prestige. We need to keep it shut down, fuck them all. Figure a way to pay the military and shut everything else down. permalink parent award report block reply view 4 more comments...\nSig229 1 points 5 days ago Thune should be fucking arrested for treason. Fucking giant cocksucking commie cunt. permalink parent award report block reply\n1True-translation -6 points 5 days ago How are you back after being banned? permalink parent award report block reply view 1 more comments...\ncptkloss5 26 points 5 days ago don't forget higher property taxes, to educate anchor babies with your money permalink parent award report block reply chickeninoven 14 points 5 days ago Are you still posting here? Get back to work, people who hate you need your money. permalink parent award report block reply view 1 more comments...\nchickeninoven 14 points 5 days ago Are you still posting here? Get back to work, people who hate you need your money. permalink parent award report block reply view 1 more comments...\nKekistanPM 15 points 5 days ago Unless you're a white male, then you're completely on your own when you retire. permalink parent award report block reply mohel 4 points 5 days ago Well, it is just fair in case of somebody who lived their live full of white privilege. permalink parent award report block reply Shih_Tabed 3 points 5 days ago Being responsible shouldn't be considered a privilege. permalink parent award report block reply\nmohel 4 points 5 days ago Well, it is just fair in case of somebody who lived their live full of white privilege. permalink parent award report block reply Shih_Tabed 3 points 5 days ago Being responsible shouldn't be considered a privilege. permalink parent award report block reply\nShih_Tabed 3 points 5 days ago Being responsible shouldn't be considered a privilege. permalink parent award report block reply\nEggsBennydict 6 points 5 days ago Subsidies and handouts are the problem for everything. Healthcare and food is not a right. As fucked up as it seems today,  home prices, groceries, traffic, healthcare, etc would not be a problem if govt didn’t reappropriate our money. Survival of the fittest would’ve played out and a vast majority of people would be contributing to society and living a good life. Instead we’re work slaves to fund the lazy leeches of society. What I don’t get is why or how healthcare got this fucked. Why isn’t health insurance like other insurance? Why can’t medical care just be affordable for everyone.. without insurance? Get rid of the law that makes it illegal to refuse to treat anyone who can’t pay.. hospitals are allowed to deny treatment if you deny a tetanus shot, but not if you can’t pay? Clown world permalink parent award report block reply\nThisTrainHasNoBrakes 5 points 5 days ago If they aren’t paying for their own shit, they DO NOT HAVE ENOUGH TO CHOOSE TO STOP WORKING and retire early. FFS. permalink parent award report block reply\nAVeryNakedMan 29 points 5 days ago All taxes are slavery, just in varying degrees. permalink parent award report block reply Ch3f4554551n 1 points 5 days ago There aren't really degrees of freedom. Either a man is free or he isn't... permalink parent award report block reply MaoHadOnly1Testicle 1 points 4 days ago There's free, and then there's varying degrees of slavery. The same way something is either not on fire, or some degree of burnt. permalink parent award report block reply\nCh3f4554551n 1 points 5 days ago There aren't really degrees of freedom. Either a man is free or he isn't... permalink parent award report block reply MaoHadOnly1Testicle 1 points 4 days ago There's free, and then there's varying degrees of slavery. The same way something is either not on fire, or some degree of burnt. permalink parent award report block reply\nMaoHadOnly1Testicle 1 points 4 days ago There's free, and then there's varying degrees of slavery. The same way something is either not on fire, or some degree of burnt. permalink parent award report block reply\nNotYourMan 14 points 5 days ago X/Twitter is incredible; every democrat just lying about how its Trump's fault using poor families and government workers as a reason that Trump is bad.  Democrats really are just evil, hateful people.  They hate the poor and the middle class. permalink parent award report block reply LaVaughnRobinson 6 points 5 days ago They love the poor, its their pawns they manipulate.  They do hate the middle class and want them gone. permalink parent award report block reply\nLaVaughnRobinson 6 points 5 days ago They love the poor, its their pawns they manipulate.  They do hate the middle class and want them gone. permalink parent award report block reply\nBlackLabsMatter 7 points 5 days ago Read the words.  Fake post again. permalink parent award report block reply\nThat_Which_Lurks 2 points 5 days ago I think not this time. It will go through like every other time in the last 30+ years. Nothing will change and all of this has been theater to keep the plebes at each other's throats. permalink parent award report block reply\nncswicn OP 98 points 5 days ago Bet that is what they want, so when President Trump vetoes their decision, they can put the full blame on him. permalink award report block reply Magma_Biscuit 38 points 5 days ago Probably right permalink parent award report block reply kekranger 18 points 5 days ago Do it. F these guys. permalink parent award report block reply PROCIsAsshoe 6 points 5 days ago Just read on a BB terminal that Senator Daines (R-MT) is shooting down the ACA subsidy 1yr-extension proposal. only mentioning it because I have great trust in the rumor mill on that platform they tend to get that sort of DC/Wall Street rumor mill scoop correct. Come on Senator Daines! permalink parent award report block reply America_No_1 6 points 5 days ago That's a bingo permalink parent award report block reply Bastard 1 points 5 days ago That's what I voted for. permalink parent award report block reply load 2 more comments...\nMagma_Biscuit 38 points 5 days ago Probably right permalink parent award report block reply\nkekranger 18 points 5 days ago Do it. F these guys. permalink parent award report block reply\nPROCIsAsshoe 6 points 5 days ago Just read on a BB terminal that Senator Daines (R-MT) is shooting down the ACA subsidy 1yr-extension proposal. only mentioning it because I have great trust in the rumor mill on that platform they tend to get that sort of DC/Wall Street rumor mill scoop correct. Come on Senator Daines! permalink parent award report block reply\nAmerica_No_1 6 points 5 days ago That's a bingo permalink parent award report block reply\nBastard 1 points 5 days ago That's what I voted for. permalink parent award report block reply\nMagma_Biscuit 92 points 5 days ago We the people are not represented in government, only illegals and the gibmethats permalink award report block reply GentleSlayer 18 points 5 days ago Don't forget bankers and megacorpos. permalink parent award report block reply IncredibleMrE1 12 points 5 days ago \"gibmethats\" permalink parent award report block reply Prussian_Pepe 2 points 5 days ago The original dinnadu nuffins. Who do people think taught the pavement apes the grift? They didn't learn it on their own ~chirp~ but I DID eat brekfast! permalink parent award report block reply True_Curmudgeon 4 points 5 days ago No those people aren't really represented they're just being used as weapons against us. Only the truly powerful globalist bankers and globalist businessmen are represented permalink parent award report block reply MastaJoda 2 points 4 days ago A Tax Revolt is due. permalink parent award report block reply HoganT -22 points 5 days ago I always love when people use \"we the people\" and only think that it is made up of people who think and feel exactly like them. permalink parent award report block reply noPTSDforMePlease 23 points 5 days ago \"we the people\" is made up of American citizens, not foreigners. permalink parent award report block reply HoganT -13 points 5 days ago Did I mention foreigners? permalink parent award report block reply noPTSDforMePlease 13 points 5 days ago The person you replied to did. Learn how context works you butter butt. permalink parent award report block reply AerialRush 11 points 5 days ago Illegals are not a part of \"we the people\" permalink parent award report block reply HoganT -9 points 5 days ago Did I mention illegals? permalink parent award report block reply 45fan 1 points 5 days ago Ah we forgot there are also faggots and losers. What ever would we do without them? permalink parent award report block reply view 1 more comments... BlackPilledMAGA 6 points 5 days ago Those who want to give OTHER PEOPLE'S MONEY away to illegal aliens can fuck off and die. I don't care about opinions that when acted upon would subject Americans to slavery. If YOU want to fund them, go ahead. If you intend to force others to do the same then get ready for a problem. permalink parent award report block reply HoganT -5 points 5 days ago Go on, give us their demand that is about funding illegals and not about making sure that millions of people's healthcare premiums don't go up by literally 100's of percent. They've got us by the balls on this one friend, I'm sorry. Not funding the aca is a 100% death sentence in the midterms. And we've never not intended to fund it. We were always going to give this up, we just hoped to paint them in the worst light possible on the way. In the end, President Trump will be on truth social touting how he/we just saved the American people 1000's of dollars a year on the health insurance. permalink parent award report block reply justicein2020 5 points 5 days ago the aca subsidization was always going to run out. it can't support itself. it failed. kicking the can down the road AGAIN is stupid. handing over ANYTHING to illegals is a death sentence in the midterms and next general.   and forever. republicans will never get another vote again. this is the hill to die on. NOT funding the world. permalink parent award report block reply view 1 more comments... Klaus73 1 points 5 days ago I think folks are getting high on their own supply. Its not about common sense or tactics; merely being \"alpha\" and winning...its just about ego at this point. Republicans tried to paint this as the democrat shutdown and that has failed over and over despite what they say - especially when they say \"we don't want to fire people\" and post blue oyster reaper song remixes; \"We don't want to starve folks.\" then fight like hell in the courts to avoid having stuff like SNAP go through. Its a steadily worsening war of optics. Fact is the ACA is a drop in the bucket as far as what it costs vs what its worth and if ACA is willing to be given up thats less then 30% of what the democrats wanted in their demands and then if they refuse it pulls that card from their hand - but folks are so hell bent on trying to dominate the dems that they would rather fuck the entire republic for decades then actually work with the party that still does actually ALSO have American voters...whom the president is also supposed to serve. The stock market is great but generally the gains of it mean little for the average Joe who's closest interaction is going to be a 401k; I cannot recall the last time prices of shit went down because someones stock was skyrocketing. permalink parent award report block reply deleted 1 points 5 days ago HoganT 2 points 5 days ago I feel like there’s not enough of us to even win fucking primaries. There 10-15 or so MAGA reps in Congress is starting to seem just about proportionate. permalink parent award report block reply Klaus73 2 points 5 days ago MAGA has shifted since the election. I remember \"I haven't read anything about project 2025\" and felt \"Oh ok he has his own plan\" and now its basically a bunch of them. I remember him working at McDonalds to show he gave a shit about folks that were just having a hard time getting by. Now the only thing he points to is stock markets. Anything thus far he has \"checked off\" on the MAGA agenda is only because it was also on the 2025 agenda - which seems to be where his priorities lie. permalink parent award report block reply HoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nGentleSlayer 18 points 5 days ago Don't forget bankers and megacorpos. permalink parent award report block reply IncredibleMrE1 12 points 5 days ago \"gibmethats\" permalink parent award report block reply Prussian_Pepe 2 points 5 days ago The original dinnadu nuffins. Who do people think taught the pavement apes the grift? They didn't learn it on their own ~chirp~ but I DID eat brekfast! permalink parent award report block reply\nIncredibleMrE1 12 points 5 days ago \"gibmethats\" permalink parent award report block reply Prussian_Pepe 2 points 5 days ago The original dinnadu nuffins. Who do people think taught the pavement apes the grift? They didn't learn it on their own ~chirp~ but I DID eat brekfast! permalink parent award report block reply\nPrussian_Pepe 2 points 5 days ago The original dinnadu nuffins. Who do people think taught the pavement apes the grift? They didn't learn it on their own ~chirp~ but I DID eat brekfast! permalink parent award report block reply\nTrue_Curmudgeon 4 points 5 days ago No those people aren't really represented they're just being used as weapons against us. Only the truly powerful globalist bankers and globalist businessmen are represented permalink parent award report block reply\nMastaJoda 2 points 4 days ago A Tax Revolt is due. permalink parent award report block reply\nHoganT -22 points 5 days ago I always love when people use \"we the people\" and only think that it is made up of people who think and feel exactly like them. permalink parent award report block reply noPTSDforMePlease 23 points 5 days ago \"we the people\" is made up of American citizens, not foreigners. permalink parent award report block reply HoganT -13 points 5 days ago Did I mention foreigners? permalink parent award report block reply noPTSDforMePlease 13 points 5 days ago The person you replied to did. Learn how context works you butter butt. permalink parent award report block reply AerialRush 11 points 5 days ago Illegals are not a part of \"we the people\" permalink parent award report block reply HoganT -9 points 5 days ago Did I mention illegals? permalink parent award report block reply 45fan 1 points 5 days ago Ah we forgot there are also faggots and losers. What ever would we do without them? permalink parent award report block reply view 1 more comments... BlackPilledMAGA 6 points 5 days ago Those who want to give OTHER PEOPLE'S MONEY away to illegal aliens can fuck off and die. I don't care about opinions that when acted upon would subject Americans to slavery. If YOU want to fund them, go ahead. If you intend to force others to do the same then get ready for a problem. permalink parent award report block reply HoganT -5 points 5 days ago Go on, give us their demand that is about funding illegals and not about making sure that millions of people's healthcare premiums don't go up by literally 100's of percent. They've got us by the balls on this one friend, I'm sorry. Not funding the aca is a 100% death sentence in the midterms. And we've never not intended to fund it. We were always going to give this up, we just hoped to paint them in the worst light possible on the way. In the end, President Trump will be on truth social touting how he/we just saved the American people 1000's of dollars a year on the health insurance. permalink parent award report block reply justicein2020 5 points 5 days ago the aca subsidization was always going to run out. it can't support itself. it failed. kicking the can down the road AGAIN is stupid. handing over ANYTHING to illegals is a death sentence in the midterms and next general.   and forever. republicans will never get another vote again. this is the hill to die on. NOT funding the world. permalink parent award report block reply view 1 more comments... Klaus73 1 points 5 days ago I think folks are getting high on their own supply. Its not about common sense or tactics; merely being \"alpha\" and winning...its just about ego at this point. Republicans tried to paint this as the democrat shutdown and that has failed over and over despite what they say - especially when they say \"we don't want to fire people\" and post blue oyster reaper song remixes; \"We don't want to starve folks.\" then fight like hell in the courts to avoid having stuff like SNAP go through. Its a steadily worsening war of optics. Fact is the ACA is a drop in the bucket as far as what it costs vs what its worth and if ACA is willing to be given up thats less then 30% of what the democrats wanted in their demands and then if they refuse it pulls that card from their hand - but folks are so hell bent on trying to dominate the dems that they would rather fuck the entire republic for decades then actually work with the party that still does actually ALSO have American voters...whom the president is also supposed to serve. The stock market is great but generally the gains of it mean little for the average Joe who's closest interaction is going to be a 401k; I cannot recall the last time prices of shit went down because someones stock was skyrocketing. permalink parent award report block reply deleted 1 points 5 days ago HoganT 2 points 5 days ago I feel like there’s not enough of us to even win fucking primaries. There 10-15 or so MAGA reps in Congress is starting to seem just about proportionate. permalink parent award report block reply Klaus73 2 points 5 days ago MAGA has shifted since the election. I remember \"I haven't read anything about project 2025\" and felt \"Oh ok he has his own plan\" and now its basically a bunch of them. I remember him working at McDonalds to show he gave a shit about folks that were just having a hard time getting by. Now the only thing he points to is stock markets. Anything thus far he has \"checked off\" on the MAGA agenda is only because it was also on the 2025 agenda - which seems to be where his priorities lie. permalink parent award report block reply\nnoPTSDforMePlease 23 points 5 days ago \"we the people\" is made up of American citizens, not foreigners. permalink parent award report block reply HoganT -13 points 5 days ago Did I mention foreigners? permalink parent award report block reply noPTSDforMePlease 13 points 5 days ago The person you replied to did. Learn how context works you butter butt. permalink parent award report block reply\nHoganT -13 points 5 days ago Did I mention foreigners? permalink parent award report block reply noPTSDforMePlease 13 points 5 days ago The person you replied to did. Learn how context works you butter butt. permalink parent award report block reply\nnoPTSDforMePlease 13 points 5 days ago The person you replied to did. Learn how context works you butter butt. permalink parent award report block reply\nAerialRush 11 points 5 days ago Illegals are not a part of \"we the people\" permalink parent award report block reply HoganT -9 points 5 days ago Did I mention illegals? permalink parent award report block reply 45fan 1 points 5 days ago Ah we forgot there are also faggots and losers. What ever would we do without them? permalink parent award report block reply view 1 more comments...\nHoganT -9 points 5 days ago Did I mention illegals? permalink parent award report block reply 45fan 1 points 5 days ago Ah we forgot there are also faggots and losers. What ever would we do without them? permalink parent award report block reply view 1 more comments...\n45fan 1 points 5 days ago Ah we forgot there are also faggots and losers. What ever would we do without them? permalink parent award report block reply view 1 more comments...\nBlackPilledMAGA 6 points 5 days ago Those who want to give OTHER PEOPLE'S MONEY away to illegal aliens can fuck off and die. I don't care about opinions that when acted upon would subject Americans to slavery. If YOU want to fund them, go ahead. If you intend to force others to do the same then get ready for a problem. permalink parent award report block reply HoganT -5 points 5 days ago Go on, give us their demand that is about funding illegals and not about making sure that millions of people's healthcare premiums don't go up by literally 100's of percent. They've got us by the balls on this one friend, I'm sorry. Not funding the aca is a 100% death sentence in the midterms. And we've never not intended to fund it. We were always going to give this up, we just hoped to paint them in the worst light possible on the way. In the end, President Trump will be on truth social touting how he/we just saved the American people 1000's of dollars a year on the health insurance. permalink parent award report block reply justicein2020 5 points 5 days ago the aca subsidization was always going to run out. it can't support itself. it failed. kicking the can down the road AGAIN is stupid. handing over ANYTHING to illegals is a death sentence in the midterms and next general.   and forever. republicans will never get another vote again. this is the hill to die on. NOT funding the world. permalink parent award report block reply view 1 more comments... Klaus73 1 points 5 days ago I think folks are getting high on their own supply. Its not about common sense or tactics; merely being \"alpha\" and winning...its just about ego at this point. Republicans tried to paint this as the democrat shutdown and that has failed over and over despite what they say - especially when they say \"we don't want to fire people\" and post blue oyster reaper song remixes; \"We don't want to starve folks.\" then fight like hell in the courts to avoid having stuff like SNAP go through. Its a steadily worsening war of optics. Fact is the ACA is a drop in the bucket as far as what it costs vs what its worth and if ACA is willing to be given up thats less then 30% of what the democrats wanted in their demands and then if they refuse it pulls that card from their hand - but folks are so hell bent on trying to dominate the dems that they would rather fuck the entire republic for decades then actually work with the party that still does actually ALSO have American voters...whom the president is also supposed to serve. The stock market is great but generally the gains of it mean little for the average Joe who's closest interaction is going to be a 401k; I cannot recall the last time prices of shit went down because someones stock was skyrocketing. permalink parent award report block reply\nHoganT -5 points 5 days ago Go on, give us their demand that is about funding illegals and not about making sure that millions of people's healthcare premiums don't go up by literally 100's of percent. They've got us by the balls on this one friend, I'm sorry. Not funding the aca is a 100% death sentence in the midterms. And we've never not intended to fund it. We were always going to give this up, we just hoped to paint them in the worst light possible on the way. In the end, President Trump will be on truth social touting how he/we just saved the American people 1000's of dollars a year on the health insurance. permalink parent award report block reply justicein2020 5 points 5 days ago the aca subsidization was always going to run out. it can't support itself. it failed. kicking the can down the road AGAIN is stupid. handing over ANYTHING to illegals is a death sentence in the midterms and next general.   and forever. republicans will never get another vote again. this is the hill to die on. NOT funding the world. permalink parent award report block reply view 1 more comments... Klaus73 1 points 5 days ago I think folks are getting high on their own supply. Its not about common sense or tactics; merely being \"alpha\" and winning...its just about ego at this point. Republicans tried to paint this as the democrat shutdown and that has failed over and over despite what they say - especially when they say \"we don't want to fire people\" and post blue oyster reaper song remixes; \"We don't want to starve folks.\" then fight like hell in the courts to avoid having stuff like SNAP go through. Its a steadily worsening war of optics. Fact is the ACA is a drop in the bucket as far as what it costs vs what its worth and if ACA is willing to be given up thats less then 30% of what the democrats wanted in their demands and then if they refuse it pulls that card from their hand - but folks are so hell bent on trying to dominate the dems that they would rather fuck the entire republic for decades then actually work with the party that still does actually ALSO have American voters...whom the president is also supposed to serve. The stock market is great but generally the gains of it mean little for the average Joe who's closest interaction is going to be a 401k; I cannot recall the last time prices of shit went down because someones stock was skyrocketing. permalink parent award report block reply\njusticein2020 5 points 5 days ago the aca subsidization was always going to run out. it can't support itself. it failed. kicking the can down the road AGAIN is stupid. handing over ANYTHING to illegals is a death sentence in the midterms and next general.   and forever. republicans will never get another vote again. this is the hill to die on. NOT funding the world. permalink parent award report block reply view 1 more comments...\nKlaus73 1 points 5 days ago I think folks are getting high on their own supply. Its not about common sense or tactics; merely being \"alpha\" and winning...its just about ego at this point. Republicans tried to paint this as the democrat shutdown and that has failed over and over despite what they say - especially when they say \"we don't want to fire people\" and post blue oyster reaper song remixes; \"We don't want to starve folks.\" then fight like hell in the courts to avoid having stuff like SNAP go through. Its a steadily worsening war of optics. Fact is the ACA is a drop in the bucket as far as what it costs vs what its worth and if ACA is willing to be given up thats less then 30% of what the democrats wanted in their demands and then if they refuse it pulls that card from their hand - but folks are so hell bent on trying to dominate the dems that they would rather fuck the entire republic for decades then actually work with the party that still does actually ALSO have American voters...whom the president is also supposed to serve. The stock market is great but generally the gains of it mean little for the average Joe who's closest interaction is going to be a 401k; I cannot recall the last time prices of shit went down because someones stock was skyrocketing. permalink parent award report block reply\ndeleted 1 points 5 days ago HoganT 2 points 5 days ago I feel like there’s not enough of us to even win fucking primaries. There 10-15 or so MAGA reps in Congress is starting to seem just about proportionate. permalink parent award report block reply Klaus73 2 points 5 days ago MAGA has shifted since the election. I remember \"I haven't read anything about project 2025\" and felt \"Oh ok he has his own plan\" and now its basically a bunch of them. I remember him working at McDonalds to show he gave a shit about folks that were just having a hard time getting by. Now the only thing he points to is stock markets. Anything thus far he has \"checked off\" on the MAGA agenda is only because it was also on the 2025 agenda - which seems to be where his priorities lie. permalink parent award report block reply\nHoganT 2 points 5 days ago I feel like there’s not enough of us to even win fucking primaries. There 10-15 or so MAGA reps in Congress is starting to seem just about proportionate. permalink parent award report block reply Klaus73 2 points 5 days ago MAGA has shifted since the election. I remember \"I haven't read anything about project 2025\" and felt \"Oh ok he has his own plan\" and now its basically a bunch of them. I remember him working at McDonalds to show he gave a shit about folks that were just having a hard time getting by. Now the only thing he points to is stock markets. Anything thus far he has \"checked off\" on the MAGA agenda is only because it was also on the 2025 agenda - which seems to be where his priorities lie. permalink parent award report block reply\nKlaus73 2 points 5 days ago MAGA has shifted since the election. I remember \"I haven't read anything about project 2025\" and felt \"Oh ok he has his own plan\" and now its basically a bunch of them. I remember him working at McDonalds to show he gave a shit about folks that were just having a hard time getting by. Now the only thing he points to is stock markets. Anything thus far he has \"checked off\" on the MAGA agenda is only because it was also on the 2025 agenda - which seems to be where his priorities lie. permalink parent award report block reply\nHoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nHockeyMom4Trump 75 points 5 days ago Republicans only know how to lose. permalink award report block reply EgregiousPhilbin 14 points 5 days ago But you better vote for them anyway, according to the groupthink in here. permalink parent award report block reply makersmarx 20 points 5 days ago Oh fuck off. We are forced to vote for the lesser of two evils. Giant douche or turd sandwich, or dont vote. Those are the options. permalink parent award report block reply DT170x 4 points 5 days ago Acceleratist Are the most dumbest people on this forum. What will happen when Democrats get into power. It almost impossible to remove them(out side of a civil war) from power. Picking a lesser of 2 evils is better because it gives us some time. Also I doubt u/EgregiousPhilbin partake in a primary. permalink parent award report block reply anotherthing 6 points 5 days ago They really are. Had Kamala won, she'd let in 10 million more illegals, the Democrats would vote for amnesty, and it'd be game over. They wouldn't have to cheat ever again. Every state would be like Post 1986 California. permalink parent award report block reply view 2 more comments... joggin_noggin 2 points 5 days ago We should be purging a single RINO cuck each election. We can afford to lose one race, and the rest of the party would shape up when they see the full wrath of their voting base descend on on of their colleagues. Can you imagine how much it would make Conryn piss his Depends to see us purge Graham in an 80-20 blowout? The next election, we toss Murkowski to the Dems if we can't oust her in the primary. They'd get the message. We're not going to toss power in the bin entirely, but we're going to focus all of our energy on removing the least conservative member of the Republican Senate every two years, so you need to make sure nobody confuses you for the least conservative one of the ~50. If we get with the plan and redistrict the House appropriately, we'll hold enough control there to make sure they can keep the government from doing anything outrageous while we work on the Senate. permalink parent award report block reply Kpak76 1 points 5 days ago Well honest question here.  Hypothetically speaking, if your choice was fetterman or liz Cheney, who had your vote? permalink parent award report block reply makersmarx 1 points 5 days ago Neither, wouldn't vote. Same puppet master. permalink parent award report block reply Appeal2Heaven98 2 points 5 days ago \"Well, what else do we have? Would you rather a communist win? We have to expose the cheating somehow! What are you doing to change things anyway, faggot?\" -Someone on this forum, probably permalink parent award report block reply Spicy_cat 2 points 5 days ago Primary them with people who aren't RINO cucks permalink parent award report block reply DontTreadOnLego 1 points 5 days ago Unfortunately better than the other choice.  THIS is why our country is screwed up.  We have not have a functional government for a very long time. permalink parent award report block reply That_Which_Lurks 6 points 5 days ago Of course. It's one big act. Just to string you along. They know nothing will be done about it, or to them. permalink parent award report block reply Papabravo12 2 points 5 days ago Fortunately they told the Dems to go fuck themselves after all (for now) permalink parent award report block reply\nEgregiousPhilbin 14 points 5 days ago But you better vote for them anyway, according to the groupthink in here. permalink parent award report block reply makersmarx 20 points 5 days ago Oh fuck off. We are forced to vote for the lesser of two evils. Giant douche or turd sandwich, or dont vote. Those are the options. permalink parent award report block reply DT170x 4 points 5 days ago Acceleratist Are the most dumbest people on this forum. What will happen when Democrats get into power. It almost impossible to remove them(out side of a civil war) from power. Picking a lesser of 2 evils is better because it gives us some time. Also I doubt u/EgregiousPhilbin partake in a primary. permalink parent award report block reply anotherthing 6 points 5 days ago They really are. Had Kamala won, she'd let in 10 million more illegals, the Democrats would vote for amnesty, and it'd be game over. They wouldn't have to cheat ever again. Every state would be like Post 1986 California. permalink parent award report block reply view 2 more comments... joggin_noggin 2 points 5 days ago We should be purging a single RINO cuck each election. We can afford to lose one race, and the rest of the party would shape up when they see the full wrath of their voting base descend on on of their colleagues. Can you imagine how much it would make Conryn piss his Depends to see us purge Graham in an 80-20 blowout? The next election, we toss Murkowski to the Dems if we can't oust her in the primary. They'd get the message. We're not going to toss power in the bin entirely, but we're going to focus all of our energy on removing the least conservative member of the Republican Senate every two years, so you need to make sure nobody confuses you for the least conservative one of the ~50. If we get with the plan and redistrict the House appropriately, we'll hold enough control there to make sure they can keep the government from doing anything outrageous while we work on the Senate. permalink parent award report block reply Kpak76 1 points 5 days ago Well honest question here.  Hypothetically speaking, if your choice was fetterman or liz Cheney, who had your vote? permalink parent award report block reply makersmarx 1 points 5 days ago Neither, wouldn't vote. Same puppet master. permalink parent award report block reply Appeal2Heaven98 2 points 5 days ago \"Well, what else do we have? Would you rather a communist win? We have to expose the cheating somehow! What are you doing to change things anyway, faggot?\" -Someone on this forum, probably permalink parent award report block reply Spicy_cat 2 points 5 days ago Primary them with people who aren't RINO cucks permalink parent award report block reply DontTreadOnLego 1 points 5 days ago Unfortunately better than the other choice.  THIS is why our country is screwed up.  We have not have a functional government for a very long time. permalink parent award report block reply\nmakersmarx 20 points 5 days ago Oh fuck off. We are forced to vote for the lesser of two evils. Giant douche or turd sandwich, or dont vote. Those are the options. permalink parent award report block reply DT170x 4 points 5 days ago Acceleratist Are the most dumbest people on this forum. What will happen when Democrats get into power. It almost impossible to remove them(out side of a civil war) from power. Picking a lesser of 2 evils is better because it gives us some time. Also I doubt u/EgregiousPhilbin partake in a primary. permalink parent award report block reply anotherthing 6 points 5 days ago They really are. Had Kamala won, she'd let in 10 million more illegals, the Democrats would vote for amnesty, and it'd be game over. They wouldn't have to cheat ever again. Every state would be like Post 1986 California. permalink parent award report block reply view 2 more comments... joggin_noggin 2 points 5 days ago We should be purging a single RINO cuck each election. We can afford to lose one race, and the rest of the party would shape up when they see the full wrath of their voting base descend on on of their colleagues. Can you imagine how much it would make Conryn piss his Depends to see us purge Graham in an 80-20 blowout? The next election, we toss Murkowski to the Dems if we can't oust her in the primary. They'd get the message. We're not going to toss power in the bin entirely, but we're going to focus all of our energy on removing the least conservative member of the Republican Senate every two years, so you need to make sure nobody confuses you for the least conservative one of the ~50. If we get with the plan and redistrict the House appropriately, we'll hold enough control there to make sure they can keep the government from doing anything outrageous while we work on the Senate. permalink parent award report block reply Kpak76 1 points 5 days ago Well honest question here.  Hypothetically speaking, if your choice was fetterman or liz Cheney, who had your vote? permalink parent award report block reply makersmarx 1 points 5 days ago Neither, wouldn't vote. Same puppet master. permalink parent award report block reply\nDT170x 4 points 5 days ago Acceleratist Are the most dumbest people on this forum. What will happen when Democrats get into power. It almost impossible to remove them(out side of a civil war) from power. Picking a lesser of 2 evils is better because it gives us some time. Also I doubt u/EgregiousPhilbin partake in a primary. permalink parent award report block reply anotherthing 6 points 5 days ago They really are. Had Kamala won, she'd let in 10 million more illegals, the Democrats would vote for amnesty, and it'd be game over. They wouldn't have to cheat ever again. Every state would be like Post 1986 California. permalink parent award report block reply view 2 more comments...\nanotherthing 6 points 5 days ago They really are. Had Kamala won, she'd let in 10 million more illegals, the Democrats would vote for amnesty, and it'd be game over. They wouldn't have to cheat ever again. Every state would be like Post 1986 California. permalink parent award report block reply view 2 more comments...\njoggin_noggin 2 points 5 days ago We should be purging a single RINO cuck each election. We can afford to lose one race, and the rest of the party would shape up when they see the full wrath of their voting base descend on on of their colleagues. Can you imagine how much it would make Conryn piss his Depends to see us purge Graham in an 80-20 blowout? The next election, we toss Murkowski to the Dems if we can't oust her in the primary. They'd get the message. We're not going to toss power in the bin entirely, but we're going to focus all of our energy on removing the least conservative member of the Republican Senate every two years, so you need to make sure nobody confuses you for the least conservative one of the ~50. If we get with the plan and redistrict the House appropriately, we'll hold enough control there to make sure they can keep the government from doing anything outrageous while we work on the Senate. permalink parent award report block reply\nKpak76 1 points 5 days ago Well honest question here.  Hypothetically speaking, if your choice was fetterman or liz Cheney, who had your vote? permalink parent award report block reply makersmarx 1 points 5 days ago Neither, wouldn't vote. Same puppet master. permalink parent award report block reply\nmakersmarx 1 points 5 days ago Neither, wouldn't vote. Same puppet master. permalink parent award report block reply\nAppeal2Heaven98 2 points 5 days ago \"Well, what else do we have? Would you rather a communist win? We have to expose the cheating somehow! What are you doing to change things anyway, faggot?\" -Someone on this forum, probably permalink parent award report block reply\nSpicy_cat 2 points 5 days ago Primary them with people who aren't RINO cucks permalink parent award report block reply\nDontTreadOnLego 1 points 5 days ago Unfortunately better than the other choice.  THIS is why our country is screwed up.  We have not have a functional government for a very long time. permalink parent award report block reply\nThat_Which_Lurks 6 points 5 days ago Of course. It's one big act. Just to string you along. They know nothing will be done about it, or to them. permalink parent award report block reply\nPapabravo12 2 points 5 days ago Fortunately they told the Dems to go fuck themselves after all (for now) permalink parent award report block reply\nblueeyephoto 55 points 5 days ago and this is why the Dems win, Republicans cave to their whims, but when the Dems are in control, they give the Republicans nothing permalink award report block reply Appeal2Heaven98 22 points 5 days ago Republicans think they're taking the moral high ground by \"compromising.\" Democrats don't give a shit about morals as long as they get what they want. At some point, \"compromise\" for the sake of it leads to the compromise of our founding principles. permalink parent award report block reply GentleSlayer 10 points 5 days ago At some point? permalink parent award report block reply Rakkasan91b 4 points 5 days ago Right?  That point happened a good century or more ago. permalink parent award report block reply GentleSlayer 3 points 5 days ago Probably started  in earnest with Wilson. permalink parent award report block reply anotherthing 7 points 5 days ago What compromise? The GOP starting position was Biden Era spending levels. They didn't start off with an actual conservative level of spending, just more of the same. That's like walking on to a car lot, seeing a car for $5000, say you'll pay $5500, and then letting the dealer haggle you higher. permalink parent award report block reply RagnarD 2 points 5 days ago In any compromise between food and poison, it is only death that can win. In any compromise between good and evil, it is only evil that can profit. --Ayn Rand permalink parent award report block reply PeaceMakerDJT 2 points 5 days ago One thing i give them is respect for always sticking together permalink parent award report block reply\nAppeal2Heaven98 22 points 5 days ago Republicans think they're taking the moral high ground by \"compromising.\" Democrats don't give a shit about morals as long as they get what they want. At some point, \"compromise\" for the sake of it leads to the compromise of our founding principles. permalink parent award report block reply GentleSlayer 10 points 5 days ago At some point? permalink parent award report block reply Rakkasan91b 4 points 5 days ago Right?  That point happened a good century or more ago. permalink parent award report block reply GentleSlayer 3 points 5 days ago Probably started  in earnest with Wilson. permalink parent award report block reply anotherthing 7 points 5 days ago What compromise? The GOP starting position was Biden Era spending levels. They didn't start off with an actual conservative level of spending, just more of the same. That's like walking on to a car lot, seeing a car for $5000, say you'll pay $5500, and then letting the dealer haggle you higher. permalink parent award report block reply RagnarD 2 points 5 days ago In any compromise between food and poison, it is only death that can win. In any compromise between good and evil, it is only evil that can profit. --Ayn Rand permalink parent award report block reply\nGentleSlayer 10 points 5 days ago At some point? permalink parent award report block reply Rakkasan91b 4 points 5 days ago Right?  That point happened a good century or more ago. permalink parent award report block reply GentleSlayer 3 points 5 days ago Probably started  in earnest with Wilson. permalink parent award report block reply\nRakkasan91b 4 points 5 days ago Right?  That point happened a good century or more ago. permalink parent award report block reply GentleSlayer 3 points 5 days ago Probably started  in earnest with Wilson. permalink parent award report block reply\nGentleSlayer 3 points 5 days ago Probably started  in earnest with Wilson. permalink parent award report block reply\nanotherthing 7 points 5 days ago What compromise? The GOP starting position was Biden Era spending levels. They didn't start off with an actual conservative level of spending, just more of the same. That's like walking on to a car lot, seeing a car for $5000, say you'll pay $5500, and then letting the dealer haggle you higher. permalink parent award report block reply\nRagnarD 2 points 5 days ago In any compromise between food and poison, it is only death that can win. In any compromise between good and evil, it is only evil that can profit. --Ayn Rand permalink parent award report block reply\nPeaceMakerDJT 2 points 5 days ago One thing i give them is respect for always sticking together permalink parent award report block reply\nPeaceMakerDJT 43 points 5 days ago Not sure how Trump is planning on defeating the deep state when he has rinos going against him and nothing we need will pass permalink award report block reply grenades_and_ham 24 points 5 days ago Republicans - Snatching defeat from the jaws of victory. permalink parent award report block reply Appeal2Heaven98 11 points 5 days ago I'm currently preparing for the fallout and focusing on building local connections. It might be a Doomer way of thinking to some people, but I'm done giving time and emotional energy to shit that ultimately I have no control over anyway. permalink parent award report block reply Ikon 1 points 5 days ago He endorses half of them as well. There is no true winning, shit will never change. permalink parent award report block reply\ngrenades_and_ham 24 points 5 days ago Republicans - Snatching defeat from the jaws of victory. permalink parent award report block reply\nAppeal2Heaven98 11 points 5 days ago I'm currently preparing for the fallout and focusing on building local connections. It might be a Doomer way of thinking to some people, but I'm done giving time and emotional energy to shit that ultimately I have no control over anyway. permalink parent award report block reply\nIkon 1 points 5 days ago He endorses half of them as well. There is no true winning, shit will never change. permalink parent award report block reply\ncovok48 41 points 5 days ago This second term has been…less than stellar. permalink award report block reply grenades_and_ham 33 points 5 days ago All EO’s that will be wiped away. permalink parent award report block reply superdelegate 14 points 5 days ago The southern border is closed, with zero releases into the  interior.  Compare to Biden's fifteen million. Trump ended Biden's war on Crypto and terminated Operation Chokepoint 2.0.   CDBCs are banned, and the lawsuits against the exchanges have been dropped. Inflation is down, not perfect, but a shadow of what it was under Biden. The J6 political prisoners are free and no longer being tortured to death. Trump has protected us from being debanked.  Countries fucking us over with their own tariffs are being reciprocated against.  The guard has been deployed to bring down crime.  Trump is working to end cashless bail, he's using federal pressure to end pediatric gender transitions.  He's defunded NPR and PBS.  The dept of education has been slashed. USAID is no longer a slush fund for Democrat NGOs to destroy the country The mRNA vaccines are off the childhood schedule.   Trump is working to protect girls' sports. He's secured hundreds of billions of foreign investments into our own manufacturing and high tech base. You guys need to keep aiming high, but enjoy some of the wins FFS permalink parent award report block reply NebraskanPatriot 4 points 5 days ago It's been OK.  A bit better than Jimmy Carter, but worse that Gerald Ford.  Not horrible for a middling performance destined to be forgotten by history.. permalink parent award report block reply Appeal2Heaven98 10 points 5 days ago History books will try to mark Trump as the wannabe dictator who wanted to take over the country by channeling Hitler and was thwarted by the all-good Democrats and brave Republicans who dared to step over the party line to stop tyranny. permalink parent award report block reply wharfthrowaway 3 points 5 days ago They bravely sodomized each other in the senate hearing rooms before voting against the bad man permalink parent award report block reply Ch3f4554551n 2 points 5 days ago Lol \"history\" books... permalink parent award report block reply Appeal2Heaven98 2 points 4 days ago We can laugh about it, but 90% of what we learn comes from history books, AKA written history. And the history that's written is decided by the victors. permalink parent award report block reply Magma_Biscuit 4 points 5 days ago Judicial branch brick wall, that’s a lot of the damn problem permalink parent award report block reply Schroeder09 5 points 5 days ago Is it the problem, or is obeying the illegal edicts of these communist judges the problem? permalink parent award report block reply Rakkasan91b 1 points 5 days ago Both permalink parent award report block reply\ngrenades_and_ham 33 points 5 days ago All EO’s that will be wiped away. permalink parent award report block reply\nsuperdelegate 14 points 5 days ago The southern border is closed, with zero releases into the  interior.  Compare to Biden's fifteen million. Trump ended Biden's war on Crypto and terminated Operation Chokepoint 2.0.   CDBCs are banned, and the lawsuits against the exchanges have been dropped. Inflation is down, not perfect, but a shadow of what it was under Biden. The J6 political prisoners are free and no longer being tortured to death. Trump has protected us from being debanked.  Countries fucking us over with their own tariffs are being reciprocated against.  The guard has been deployed to bring down crime.  Trump is working to end cashless bail, he's using federal pressure to end pediatric gender transitions.  He's defunded NPR and PBS.  The dept of education has been slashed. USAID is no longer a slush fund for Democrat NGOs to destroy the country The mRNA vaccines are off the childhood schedule.   Trump is working to protect girls' sports. He's secured hundreds of billions of foreign investments into our own manufacturing and high tech base. You guys need to keep aiming high, but enjoy some of the wins FFS permalink parent award report block reply\nNebraskanPatriot 4 points 5 days ago It's been OK.  A bit better than Jimmy Carter, but worse that Gerald Ford.  Not horrible for a middling performance destined to be forgotten by history.. permalink parent award report block reply Appeal2Heaven98 10 points 5 days ago History books will try to mark Trump as the wannabe dictator who wanted to take over the country by channeling Hitler and was thwarted by the all-good Democrats and brave Republicans who dared to step over the party line to stop tyranny. permalink parent award report block reply wharfthrowaway 3 points 5 days ago They bravely sodomized each other in the senate hearing rooms before voting against the bad man permalink parent award report block reply Ch3f4554551n 2 points 5 days ago Lol \"history\" books... permalink parent award report block reply Appeal2Heaven98 2 points 4 days ago We can laugh about it, but 90% of what we learn comes from history books, AKA written history. And the history that's written is decided by the victors. permalink parent award report block reply\nAppeal2Heaven98 10 points 5 days ago History books will try to mark Trump as the wannabe dictator who wanted to take over the country by channeling Hitler and was thwarted by the all-good Democrats and brave Republicans who dared to step over the party line to stop tyranny. permalink parent award report block reply wharfthrowaway 3 points 5 days ago They bravely sodomized each other in the senate hearing rooms before voting against the bad man permalink parent award report block reply Ch3f4554551n 2 points 5 days ago Lol \"history\" books... permalink parent award report block reply Appeal2Heaven98 2 points 4 days ago We can laugh about it, but 90% of what we learn comes from history books, AKA written history. And the history that's written is decided by the victors. permalink parent award report block reply\nwharfthrowaway 3 points 5 days ago They bravely sodomized each other in the senate hearing rooms before voting against the bad man permalink parent award report block reply\nCh3f4554551n 2 points 5 days ago Lol \"history\" books... permalink parent award report block reply Appeal2Heaven98 2 points 4 days ago We can laugh about it, but 90% of what we learn comes from history books, AKA written history. And the history that's written is decided by the victors. permalink parent award report block reply\nAppeal2Heaven98 2 points 4 days ago We can laugh about it, but 90% of what we learn comes from history books, AKA written history. And the history that's written is decided by the victors. permalink parent award report block reply\nMagma_Biscuit 4 points 5 days ago Judicial branch brick wall, that’s a lot of the damn problem permalink parent award report block reply Schroeder09 5 points 5 days ago Is it the problem, or is obeying the illegal edicts of these communist judges the problem? permalink parent award report block reply Rakkasan91b 1 points 5 days ago Both permalink parent award report block reply\nSchroeder09 5 points 5 days ago Is it the problem, or is obeying the illegal edicts of these communist judges the problem? permalink parent award report block reply Rakkasan91b 1 points 5 days ago Both permalink parent award report block reply\nRakkasan91b 1 points 5 days ago Both permalink parent award report block reply\nTrumpLandslide20201 28 points 5 days ago Thune is a Deep State CUCK and so are the majority of them. We didn't replace them with MAGA candidates. They still run the show and by the looks of it they are going to win. permalink award report block reply 556x45mm 13 points 5 days ago I fear that when Trumps term is up the Republicans will back their own candidate and try to push JD and others out. In fact, im sure they (the Republicans) will do everything they can to destroy MAGA permalink parent award report block reply AerialRush 10 points 5 days ago They already are attacking JD for listening to what young conservative voters are saying instead of purely foreign donors permalink parent award report block reply InJailOutSoon 4 points 5 days ago It wont work. With or without Trump there is something brewing and all they have left to push their narratives are a dying media that their constituents dont trust -- the ones who do are aging out of the pool. The RINO's will go extinct, its just a matter of time. Hell, Trump has helped some of these RINO's get elected time and time again. He helped put them in some of these positions. permalink parent award report block reply Appeal2Heaven98 2 points 5 days ago If JD Vance isn't the presidential candidate in 2028, I'm not sure if I will bother voting. Very few others with the R are worthy of running this country. permalink parent award report block reply\n556x45mm 13 points 5 days ago I fear that when Trumps term is up the Republicans will back their own candidate and try to push JD and others out. In fact, im sure they (the Republicans) will do everything they can to destroy MAGA permalink parent award report block reply AerialRush 10 points 5 days ago They already are attacking JD for listening to what young conservative voters are saying instead of purely foreign donors permalink parent award report block reply InJailOutSoon 4 points 5 days ago It wont work. With or without Trump there is something brewing and all they have left to push their narratives are a dying media that their constituents dont trust -- the ones who do are aging out of the pool. The RINO's will go extinct, its just a matter of time. Hell, Trump has helped some of these RINO's get elected time and time again. He helped put them in some of these positions. permalink parent award report block reply Appeal2Heaven98 2 points 5 days ago If JD Vance isn't the presidential candidate in 2028, I'm not sure if I will bother voting. Very few others with the R are worthy of running this country. permalink parent award report block reply\nAerialRush 10 points 5 days ago They already are attacking JD for listening to what young conservative voters are saying instead of purely foreign donors permalink parent award report block reply\nInJailOutSoon 4 points 5 days ago It wont work. With or without Trump there is something brewing and all they have left to push their narratives are a dying media that their constituents dont trust -- the ones who do are aging out of the pool. The RINO's will go extinct, its just a matter of time. Hell, Trump has helped some of these RINO's get elected time and time again. He helped put them in some of these positions. permalink parent award report block reply\nAppeal2Heaven98 2 points 5 days ago If JD Vance isn't the presidential candidate in 2028, I'm not sure if I will bother voting. Very few others with the R are worthy of running this country. permalink parent award report block reply\nmodded 15 points 5 days ago Keep it shut down permalink award report block reply\nMega_MAGA 11 points 5 days ago It's all about stopping Trump. permalink award report block reply FerkenBlerkin 9 points 5 days ago Media is already saying \"the longest shutdown in American history occurred under Donald Trump\".   They'll always blame it on him permalink parent award report block reply\nFerkenBlerkin 9 points 5 days ago Media is already saying \"the longest shutdown in American history occurred under Donald Trump\".   They'll always blame it on him permalink parent award report block reply\nterribletwos 11 points 5 days ago I hadn't heard anyone before Elon talking about how the whole system of fraud in all those democrat states revolved around funding for illegal aliens. If I remember correctly, since we caught their fraud and stopped it, now they're asking for it directly. Otherwise their states will go bankrupt. They don't have any leverage here if that's true. We should force them to do all the things we want in order to bail out their states. Who else is talking about this in more detail? permalink award report block reply HoganT -5 points 5 days ago Despite all our narrative, this shutdown has nothing to do with illegals. It's about not making people's insurance premiums skyrocket by literally 100's of percent. permalink parent award report block reply xanaxagoras 2 points 5 days ago Correct, by socializing the costs. Where do you think you are? permalink parent award report block reply HoganT -1 points 5 days ago I’m sorry, has President Trump or our party presented an alternative to the ACA? Any alternative? Have we tried to reform health care? permalink parent award report block reply Trollasaurus 1 points 5 days ago No it’s about timing subsidies to expire right before midterms. permalink parent award report block reply HoganT -1 points 5 days ago Pretty easy way to avoid that. Fund the fucking subsidies. We pay for welfare to every god damn corporation on the planet, farmers to grow food no one’s buying, every damn soldier I’ve ever met who’s fully able and working full time while collecting full disability with no physical issues. It’s a drop in the bucket. permalink parent award report block reply\nHoganT -5 points 5 days ago Despite all our narrative, this shutdown has nothing to do with illegals. It's about not making people's insurance premiums skyrocket by literally 100's of percent. permalink parent award report block reply xanaxagoras 2 points 5 days ago Correct, by socializing the costs. Where do you think you are? permalink parent award report block reply HoganT -1 points 5 days ago I’m sorry, has President Trump or our party presented an alternative to the ACA? Any alternative? Have we tried to reform health care? permalink parent award report block reply Trollasaurus 1 points 5 days ago No it’s about timing subsidies to expire right before midterms. permalink parent award report block reply HoganT -1 points 5 days ago Pretty easy way to avoid that. Fund the fucking subsidies. We pay for welfare to every god damn corporation on the planet, farmers to grow food no one’s buying, every damn soldier I’ve ever met who’s fully able and working full time while collecting full disability with no physical issues. It’s a drop in the bucket. permalink parent award report block reply\nxanaxagoras 2 points 5 days ago Correct, by socializing the costs. Where do you think you are? permalink parent award report block reply HoganT -1 points 5 days ago I’m sorry, has President Trump or our party presented an alternative to the ACA? Any alternative? Have we tried to reform health care? permalink parent award report block reply\nHoganT -1 points 5 days ago I’m sorry, has President Trump or our party presented an alternative to the ACA? Any alternative? Have we tried to reform health care? permalink parent award report block reply\nTrollasaurus 1 points 5 days ago No it’s about timing subsidies to expire right before midterms. permalink parent award report block reply HoganT -1 points 5 days ago Pretty easy way to avoid that. Fund the fucking subsidies. We pay for welfare to every god damn corporation on the planet, farmers to grow food no one’s buying, every damn soldier I’ve ever met who’s fully able and working full time while collecting full disability with no physical issues. It’s a drop in the bucket. permalink parent award report block reply\nHoganT -1 points 5 days ago Pretty easy way to avoid that. Fund the fucking subsidies. We pay for welfare to every god damn corporation on the planet, farmers to grow food no one’s buying, every damn soldier I’ve ever met who’s fully able and working full time while collecting full disability with no physical issues. It’s a drop in the bucket. permalink parent award report block reply\nAlldayeveryday 9 points 5 days ago It's all a dog and pony show. They are all traitors permalink award report block reply\nGhostphaez 8 points 5 days ago I mean, there are remedies for traitors such as - but no one wants to man up. permalink award report block reply HoganT -3 points 5 days ago Oh we like and approve of the Charlie Kirk treatment when it's people we don't like? permalink parent award report block reply\nHoganT -3 points 5 days ago Oh we like and approve of the Charlie Kirk treatment when it's people we don't like? permalink parent award report block reply\nAliveIn3 6 points 5 days ago Notice how he said \"I\" and not \"the constituents I represent\". permalink award report block reply ncswicn OP 2 points 5 days ago Narcissists only ever represent themselves! permalink parent award report block reply\nncswicn OP 2 points 5 days ago Narcissists only ever represent themselves! permalink parent award report block reply\nTearsAficionado 6 points 5 days ago Tar n' feather and hang this fuck in front of the DC Obelisk. permalink award report block reply\nFrenchie619 6 points 5 days ago Cave now and use reconciliation early next year to nullify everything that was passed that they didn't want.  It's brilliant Jerry! permalink award report block reply BannedAccount 11 points 5 days ago No they'd find a way to fuck us on that too permalink parent award report block reply Frenchie619 3 points 5 days ago Good point.  They are a bunch of spineless fvcktards after all,  right? permalink parent award report block reply\nBannedAccount 11 points 5 days ago No they'd find a way to fuck us on that too permalink parent award report block reply Frenchie619 3 points 5 days ago Good point.  They are a bunch of spineless fvcktards after all,  right? permalink parent award report block reply\nFrenchie619 3 points 5 days ago Good point.  They are a bunch of spineless fvcktards after all,  right? permalink parent award report block reply\nTreefiddydiddy 6 points 5 days ago yet another useless cunt in there for one reason only , to scupper Trump permalink award report block reply\nSpeedgraphic69 5 points 5 days ago This bastard needs to be changed permalink award report block reply\nhenri_derelicte 5 points 5 days ago I did not vote for Obamacare subsidies being extended. The amount of an annual subsidy for a single taxpayer is more than I pay in income tax. Let those fuckers pay for their own healthcare permalink award report block reply\nSkywise 4 points 5 days ago Turtle’s progeny bites us in the ass again. permalink award report block reply\nFuck_commies_2024 4 points 5 days ago Guy is such a mega faggot. I love GEOTUS but I wonder how he can’t see through this fake faggot, Lady Lindsay, etc. permalink award report block reply Lurker404 1 points 5 days ago So basically Dems won the elections and are now willing to accept what had been offered before? They got what they wanted. permalink parent award report block reply\nLurker404 1 points 5 days ago So basically Dems won the elections and are now willing to accept what had been offered before? They got what they wanted. permalink parent award report block reply\nncswicn OP 4 points 5 days ago https://truthsocial.com/@PepeDeluxe/posts/115510139344902710 permalink award report block reply\nCruzControl 4 points 5 days ago The narrative is on our side and the dems spilled the beans that the shutdown is their leverage. The dems are getting heat over the shutdown. They will cave. The only reason GOP is doing this is because they are negotiating their portion of the kickbacks from the subsidies. permalink award report block reply Klaus73 0 points 5 days ago I disagree; general opinion is that the dems do not have the power and there's a frequently ran clip of Trump himself saying a shutdown is the fault of a president in power. That said it is the dems that triggered the shutdown;  however they aren't the only ones helping to make this one particularly bad. permalink parent award report block reply\nKlaus73 0 points 5 days ago I disagree; general opinion is that the dems do not have the power and there's a frequently ran clip of Trump himself saying a shutdown is the fault of a president in power. That said it is the dems that triggered the shutdown;  however they aren't the only ones helping to make this one particularly bad. permalink parent award report block reply\nGadsden 3 points 5 days ago If they do this..... What the actual fuck? permalink award report block reply\nRocksCanOnlyWait 3 points 5 days ago Need to open a shop next to Capitol Hill selling spines... permalink award report block reply\nHelly 3 points 5 days ago What a fucking faggot. Much more of a faggot than any dem permalink award report block reply\nBlackLabsMatter 3 points 5 days ago Yay!!!  The illiterate knee-jerk headline readers and faggot engagement farming are here again!!! If you would bother to read the actual words in the actual picture,  you would see that faggot Thune has offered VOTES on the things, NOT concessions.  Those votes were going to happen anyway.  This changes nothing. \"post-shutdown votes on ACA and tax credits\" It's even in bold type. Stop being retarded faggots. permalink award report block reply\nHKFan 3 points 5 days ago Why is this stickied?  It's taken way out of context He's already offered them up or down votes on what they want.  THose things STILL have to get 60 votes themselves, which they won't. This is what the dems have been balking at all along becuase they want these things rolled up into the CR. Thune is pretty spineless, but this is misleading from everything I understand about the situation permalink award report block reply\ndeleted 3 points 5 days ago BlackLabsMatter 0 points 5 days ago Read the text that is clearly visible in the picture. Focus on the bold type. Know that your are still right, but this is not an example of that. permalink parent award report block reply\nBlackLabsMatter 0 points 5 days ago Read the text that is clearly visible in the picture. Focus on the bold type. Know that your are still right, but this is not an example of that. permalink parent award report block reply\nCommanderOfCheese 3 points 5 days ago Fuck you Thune! permalink award report block reply\ngroomofthestool 3 points 5 days ago Have the Republicans EVER  won a Shutdown fight? permalink award report block reply ncswicn OP 2 points 4 days ago Not that I recall. permalink parent award report block reply\nncswicn OP 2 points 4 days ago Not that I recall. permalink parent award report block reply\nvongregormench 2 points 5 days ago Fucking veto it. permalink award report block reply\nJetJocky 2 points 5 days ago Schumer wants the GOP to agree to a 1 year extension on ACA funding ahead of reopening. While I don't trust Thune, in this case, he is only offering Schumer a \"vote\" on it. permalink award report block reply\nRealmanPwns 2 points 5 days ago First of all they offered \"Post Shutdown Votes\".\nSecond, the \"I'm willing to give the Democrats...\" could be \"all the things they want as far as a vote on these things post shutdown, not necessarily the yes votes themselves but just having the votes take place. permalink award report block reply ncswicn OP 1 points 5 days ago Here is an update: https://www.zerohedge.com/political/thune-willing-give-democrats-all-things-they-want-friday-shutdown-vote-looms permalink parent award report block reply\nncswicn OP 1 points 5 days ago Here is an update: https://www.zerohedge.com/political/thune-willing-give-democrats-all-things-they-want-friday-shutdown-vote-looms permalink parent award report block reply\nDatamancer 2 points 5 days ago But it didn't happen.  Someone reattached the GOPs testicles and spiked their weak-ass tea with a shot or two of testosterone. permalink award report block reply\n5DchessWatch 2 points 5 days ago We got two weaklings.  Thune and Johnson permalink award report block reply\nWill_Not_Comply 2 points 4 days ago Fuck that. I'd rather Trump veto it than give them $0.01 to reward their antics. Go. Pound. Sand. Losers. permalink award report block reply\nNeverInterruptEnemy 2 points 5 days ago There better be more to that fucking sentence like… Well give them everything they want in exchange for prohibiting all illegals from social services, and 50 state reciprocity”. permalink award report block reply\nTGNX 2 points 5 days ago End the \"filibuster\" and you don't have to give them anything. permalink award report block reply\ninfinitysupreme 2 points 4 days ago Democrats want your head on a pike while they bathe in your blood, Thune.   Go ahead, let them have it permalink award report block reply\nMAGAnic316 2 points 5 days ago This is their “get out of terminating the filibuster” free card permalink award report block reply\n2016TrumpMAGA 2 points 5 days ago Thune is an evangelical Christian There's your fucking problem. I'm sick of these 'lose with honor,' 'turn the other cheek,' 'Israel is our greatest ally' assholes.  As a non-denominational Christian, they disgust me. permalink award report block reply llirrem 2 points 5 days ago The only way to \"lose with honor\" is to die in battle, there's no honor in surrender or retreat. permalink parent award report block reply\nllirrem 2 points 5 days ago The only way to \"lose with honor\" is to die in battle, there's no honor in surrender or retreat. permalink parent award report block reply\niSignedUpForThis 2 points 5 days ago losers! permalink award report block reply\nOodles 2 points 5 days ago Fuck Thune Fuck all traitorous RINOs permalink award report block reply\nIAmDisappoint 2 points 5 days ago Ah so the leftists throw a tantrum, and get what they want? Fuck these un-American republican traitors if they cave. permalink award report block reply\nOldBark2 2 points 5 days ago So Thune is a democrat?? Why doesn't he just \"come out\". permalink award report block reply\nRememberCharlieKirk 2 points 5 days ago And, to think, Thune was ready to retire in 2022. Blame Governor Noem who was supposed to primary him in the 2022 election; her backing down ensured his re-election. (If even a relatively popular governor will not challenge him, then what chance does some other South Dakotian have?) Also, I believe he sought re-election because he was under the impression that the \"Era of Trump\" was over and that the pre-Trump Republican times had returned. permalink award report block reply\nOracle 2 points 5 days ago If I read the quote correctly, he’s saying the same thing as always.  They can have a vote, which they’ll lose, AFTER the shutdown. permalink award report block reply\nKekistanPM 2 points 5 days ago That was their plan all along. permalink award report block reply\nACActual 2 points 5 days ago We may as well just start hanging politicians that don't understand where the country is.   Let it fail you stupid mother fuckers. permalink award report block reply\n24601 2 points 5 days ago If RINOs cave, 2026 is going to be 400 D in the House and 75 D in the Senate. RINOs hate America. permalink award report block reply\nGhostOfTheRepublic 2 points 5 days ago Thiune is on the side of the Democrats.  He is a traitorous sgit-bag. permalink award report block reply\nauntjemima 2 points 5 days ago folding RINOs???? gtfo where's my shocked face emoji permalink award report block reply\nHisShadow 2 points 5 days ago These subsidies will never go away and just adds 25 million more to the Medicare program… that is the goal permalink award report block reply\nUndying 2 points 5 days ago Can these faggots not stick to their guns? permalink award report block reply ncswicn OP 1 points 4 days ago I don't think they have guns, balls, or spines! permalink parent award report block reply\nncswicn OP 1 points 4 days ago I don't think they have guns, balls, or spines! permalink parent award report block reply\nMAGA-Fett 2 points 5 days ago He said he was willing to have separate votes on the ACA shit. Big deal, it won’t pass. permalink award report block reply\nemorphia 2 points 5 days ago and again the GOP bends the knee to the dems.  not ending the filibuster to pass the MAGA agenda and now caving again and giving money to illegals.  this is 100% the opposite of the MAGA agenda.  Thun is part of the problem.  Time for Trump to use as much power as possible (but to be honest i dont know what) to replace the personel that opposes the MAGA agenda. permalink award report block reply\npatriot_based 2 points 5 days ago No, no, no - hold firm! permalink award report block reply\nTheSonOfGadsden 2 points 5 days ago RINO fags at it again permalink award report block reply\n2016TrumpMAGA 1 points 5 days ago Thune looks like that high school bully that was secretly gay. permalink award report block reply\nSanityGumby 1 points 5 days ago I highly doubt he said that. Prove it with video. permalink award report block reply ncswicn OP 1 points 5 days ago Here is an update: https://www.zerohedge.com/political/thune-willing-give-democrats-all-things-they-want-friday-shutdown-vote-looms permalink parent award report block reply\nncswicn OP 1 points 5 days ago Here is an update: https://www.zerohedge.com/political/thune-willing-give-democrats-all-things-they-want-friday-shutdown-vote-looms permalink parent award report block reply\nbluewhiteandred 1 points 5 days ago We have the leverage! This is the Schumer Shutdown! All he has to do is create more sobrero memes, instead just speaks like a total sellout lol permalink award report block reply\nakai_ferret 1 points 5 days ago I've said since the very beginning: Thune and the rest are traitors.\nAnd Trump has been A WEAK FOOL for working with and even supporting these backstabbers. permalink award report block reply\nDudeNoOne 1 points 5 days ago I don’t understand why this is such a big issue? The vast majority of people who receive these benefits aren’t voting for Republicans, so who cares? permalink award report block reply\nL74ge9wr 1 points 5 days ago Follow the money (FTM), my guess is he has a payday coming. permalink award report block reply\nhansgruber7 1 points 5 days ago What is the source for this quote? permalink award report block reply\nanotherrandomname 1 points 5 days ago Didn't actually think the RINO faggots were actually going to let Trump fire everyone, did you? This horse shit is all completely performative. permalink award report block reply\nPhantomShield72 1 points 5 days ago How \"surprising\" permalink award report block reply\n603taco 1 points 5 days ago I would rather us face some serious hard times, than capitulate with these ass holes. permalink award report block reply\nCrappydatum 1 points 5 days ago Spineless permalink award report block reply\nHikedelics 1 points 5 days ago Not that Thune deserves anyone coming to his defense, but read what he said again very carefully. Politicians are slick and this could have multiple meanings. He is offering a vote on those things after the government reopens, which is actually what they’ve been offering since the beginning. Him saying “ I am willing the give them all the things they want.” doesn’t mean the rest of the senate will. If things reopen without the ACA subsidies built in, they won’t pass separately. permalink award report block reply\nDem_slayer 1 points 5 days ago This is the reason out country is declining so fast... stop giving in... permalink award report block reply\nroadrunner0 1 points 5 days ago Trump will never sign a bill giving free stuff to illegals and those with fake refugee status.. permalink award report block reply\nSilentbutdeadly 1 points 5 days ago Not surprised- he’s just a Democrat in a republican suit. permalink award report block reply\nRedWave26 1 points 5 days ago Snake. We knew that when we let him in. permalink award report block reply\ndtrap 1 points 5 days ago Bloody hell... Is it now when people start posting how [insert other group] is the problem? permalink award report block reply\nsuckmycorona 1 points 5 days ago Faggots permalink award report block reply\nBadBrainsBuzzcocks 1 points 5 days ago Who didn't see this coming? See my shocked face.... permalink award report block reply\nJustjayce 1 points 5 days ago Trump won't permalink award report block reply\nJohnMiller2020 1 points 5 days ago They're holding out for a better bribe, the illegals are getting healthcare. RIP USA permalink award report block reply\nGuerillaYourDreams 1 points 5 days ago I really do believe that my original plan is the only possible plan going forward. We need to fire all of Congress and start over all new! permalink award report block reply\nTheSwampThang 1 points 5 days ago How about they pass the bill, then a week later pass another bill largely nullifing the bad stuff? permalink award report block reply\nhairless_ap3 1 points 5 days ago WHAT A FUCKING FAGGOT Rope + Tree = addition by subtraction permalink award report block reply\nitspancakees 1 points 5 days ago This guy is a complete cuck. We need to get rid of these scrubs before doing anything else permalink award report block reply\nLight_HIV_Effect 1 points 5 days ago Every time they play by the democrats rules and demands they get burned. Rather, WE get burned. Tell them to fuck off permalink award report block reply\njonnyuno 1 points 5 days ago And short term again. Lovely. POS. permalink award report block reply\nILoveSilk 1 points 5 days ago He always looks evil to me. Establishment is playing with Trump and MAGA. permalink award report block reply\nTrue_Curmudgeon 1 points 5 days ago We're not voting our way out of this permalink award report block reply\nUNfreeNewZealand 1 points 5 days ago ….and the spotlight shines on another ‘roach. permalink award report block reply\nMemeLawd 1 points 5 days ago Fucking Faggot permalink award report block reply\ncryptoapebot 1 points 5 days ago hopefully that's just a negotiation tactic, as what they want is pure evil. permalink award report block reply\nThrowingway22 1 points 5 days ago What he wants is the excuse to avoid ending the filibuster. Trump should not go along with any patchwork bullshit that sleepwalks us into the Democrats removing the filibuster and legislating the death of America. permalink award report block reply Choomguy 1 points 5 days ago Trump should use the nuclear nuclear option and veto the fucking thing…. permalink parent award report block reply Throwingway22 2 points 5 days ago The Nuclear Option for Trump is the unitary executive. permalink parent award report block reply\nChoomguy 1 points 5 days ago Trump should use the nuclear nuclear option and veto the fucking thing…. permalink parent award report block reply Throwingway22 2 points 5 days ago The Nuclear Option for Trump is the unitary executive. permalink parent award report block reply\nThrowingway22 2 points 5 days ago The Nuclear Option for Trump is the unitary executive. permalink parent award report block reply\nthrottlejohnson 1 points 5 days ago fucking POS dickless motherfuckers...hold the line permalink award report block reply\nSteelDriver 1 points 5 days ago Jesus guys.  Grow a fucking spine.  If the Dems want to keep the government shut down to get illegal aliens free healthcare, keep that bitch shut down.  Make sure everyone knows they are the reason for the shutdown and why. I’d rather nuke the filibuster than cave to socialist obstructionists. permalink award report block reply\nCounterwhat 1 points 5 days ago They lost the election for nothing. What a bunch of nothing, jelly fish.  They are the Washington generals watching the globetrotters dribble up and down the court before being embarrassingly tea bag dunked on. LOOOSSSSEEEEEERRRRRR!🤬🤬🤬🤬🤬🤬🤬😡😠 permalink award report block reply\npoliticsaside 1 points 5 days ago Don’t give them shit. Nuclear option and pass OUR bills. permalink award report block reply\nMiltonThomasX 1 points 5 days ago Thune is a  Fing Bitch permalink award report block reply\nOG_BACONndEGGs 1 points 5 days ago I am not voting for any republicans in the midterms or 2028. Dont care. Let it burn at this point. They want to lose? Good lets go for broke fuck the GOP permalink award report block reply\nspinometer2 1 points 5 days ago ridiculous permalink award report block reply\ntjohnson107 1 points 5 days ago Trunp, please just be a dictator at this point. The country is lost at this rate. permalink award report block reply\n1787_1789 1 points 5 days ago Thune is DESTROYING the party ON PURPOSE. He is caving SPECIFICALLY to DESTROY Trump, his agenda, his legacy, and MAGA. NO ONE will vote for GOP in 2026 if he does this (and he knows it). This ENSURES Dems take the House AND the Senate and THEY WILL successfully impeach Trump, effectively UNDOING every single fucking thing that we all went through to get him into office a second time. 4 years was just reduced to 2 years with this one move, save this post. permalink award report block reply\nIt_takes_10_years 1 points 5 days ago Remember if you do not keep voting for this party and they lose and democrats win its 100% YOUR FAULT! Keep voting for the they did it again party. America First. America ALWAYS. AF as FUCK permalink award report block reply\nMy2SonsAreMarines 1 points 5 days ago (R)'s did not and do not intend to cave.  Update your feed. permalink award report block reply\nChickensaurus 1 points 5 days ago Not sick enough.... permalink award report block reply\nmadisonmaga 1 points 5 days ago Fuck these faggot pussies. permalink award report block reply\nGoozmania 1 points 5 days ago The answer rhymes with \"silence\" and starts with a V. permalink award report block reply HoganT 1 points 5 days ago Never cared at all about people being assassinated, huh? Just that it was someone we liked instead of someone we didn't. permalink parent award report block reply\nHoganT 1 points 5 days ago Never cared at all about people being assassinated, huh? Just that it was someone we liked instead of someone we didn't. permalink parent award report block reply\ncherbui 1 points 5 days ago whats the kickbacks permalink award report block reply\nSilentson- 1 points 5 days ago Massively increasing everyone's insurance payments right before the midterms is a guaranteed way to lose the house and get 2 years of impeachments. permalink award report block reply\nEddie_LeBec 1 points 5 days ago Sorry Fuentes is right\nWhy are you even showing up to vote.\nThis is a red state incumbent Senator and he only has things for Dem votes, he doesn't even think of you. permalink award report block reply GuerillaYourDreams 1 points 5 days ago Do you also date a man named Destiny? Like Nick Fuentes does?? permalink parent award report block reply\nGuerillaYourDreams 1 points 5 days ago Do you also date a man named Destiny? Like Nick Fuentes does?? permalink parent award report block reply\nyurimodin 1 points 5 days ago VETO permalink award report block reply\nOTher55 1 points 5 days ago Guaranteeing to vote on ACA and tax credits is a nothingburger. ACA and tax credits won't pass. Dems know they won't pass. What Dems want is to be able to run ads against Republicans in the midterms saying they voted down the ACA and tax credits. permalink award report block reply\nMyNameIsTaxpayer 1 points 5 days ago Thune will let democunts reprise fines for those who refused to sign up for health insurance. Tax them into oblivion. -uniparty permalink award report block reply\nMythArcana 1 points 5 days ago Just like clockwork. permalink award report block reply\nDangerous 1 points 5 days ago He isn't a \"turncoat\", this is what he always was and why everyone with a brain on here kept rejecting the BBB. You think since Trump loves telling the snake story he would know a snake when he sees one permalink award report block reply\nDontTreadOnLego 1 points 5 days ago I'd like to see Thune Thunk at the end of a rope if he wants to be a traitor. permalink award report block reply\nDrVSGGEOTUSPhD 1 points 5 days ago Is this about paying for Healthcare for illegals again? permalink award report block reply\nChoomguy 1 points 5 days ago Uniparty…. permalink award report block reply\nHandshake_Shmanshake 1 points 5 days ago How about you just go around every city with flyers, listing the politicians addresses who are holding up peoples EBT... Simple solution to a modern problem permalink award report block reply MasterChief08 1 points 5 days ago Leftwing judges too permalink parent award report block reply\nMasterChief08 1 points 5 days ago Leftwing judges too permalink parent award report block reply\nMythnutbill 1 points 5 days ago Honestly, I think this is a bit overblown. Zero hedge, while a fun site, does have a habit of being on the alarmist amd inaccuarte side of things The 2nd paragraph says Thune is offering POST-shutdown votes on extending ACA subsidies.  While I agree they should not do so and that the ACA just needs to be gotten rid of, it could also be a bit of a bluff, as it requires the Dems to trust the Reps would actually follow through. Given the Dems' propensity for making a promise to pass legislation and then renegeing (Reagan's amnesty says, \"Hi\") and their habit of projecting their own behavior to others, I wouldn't be surprised if they decline and demand it be added to the legislation to open the government.  Which, so far, the R's have actually held pretty strong on.  And, IIRC, if they do amend the CR legislation, it would have to go back to the House, and I get the sense that Johnson is doing better than Thune when it comes to not giving the Dems what they want. permalink award report block reply\nTheArchAngel 1 points 5 days ago keep the government shut. permalink award report block reply\nalucard13mmfmj 1 points 5 days ago Caving just makes all this pointless lol. permalink award report block reply\nMemeWarsVet 1 points 5 days ago rope intensifies permalink award report block reply\nkjj9 1 points 5 days ago He's talking about votes, not laws. The Democrats want the Senate to vote on things so that they can fundraise:  \"I voted for X, but the evil mean nasty GOP voted no\" permalink award report block reply\nGoozmania 1 points 5 days ago Well, he didn't. Instead he talked shit about democrats for a while. But still won't actually do anything. So was this fake news? permalink award report block reply\nMatterThatMetals 1 points 5 days ago Look. They're ALL corrupt. Even that dear, sweet, comment-machine Kennedy. permalink award report block reply\nutfanx2 1 points 5 days ago The largest industry in the country does not need corporate subsidies disguised as \"welfare\". permalink award report block reply\nMAGARondonmonson 1 points 5 days ago Giving them votes doesn't mean they can get to 51. They need to stop selling out the Majority given unto them, the 60 vote rule is a rule that protects either side in power so they can do THEIR WILL, not the peoples will. The have an excuse, we need 60 votes. permalink award report block reply MasterChief08 1 points 5 days ago There's going to be 3-4 cucked Republicans permalink parent award report block reply MAGARondonmonson 1 points 5 days ago Naaa, he would not hold the vote if he did not have the votes, lol. Its all a bs illusion up there in DC permalink parent award report block reply\nMasterChief08 1 points 5 days ago There's going to be 3-4 cucked Republicans permalink parent award report block reply MAGARondonmonson 1 points 5 days ago Naaa, he would not hold the vote if he did not have the votes, lol. Its all a bs illusion up there in DC permalink parent award report block reply\nMAGARondonmonson 1 points 5 days ago Naaa, he would not hold the vote if he did not have the votes, lol. Its all a bs illusion up there in DC permalink parent award report block reply\nDev404 1 points 5 days ago Sure he is, and he should be in line for his trial for treason. permalink award report block reply\nasiatrails 1 points 5 days ago An overboiled piece of spaghetti has more spine than this so-called leader permalink award report block reply\nCharlieMike 1 points 5 days ago Because of the election results, the RINOs are panicking and this is what Schumer was waiting for. permalink award report block reply\nrivetjoint2 0 points 5 days ago He said he would give them a vote but could not guarantee the outcome.  So it's not as bad as the headline suggests. permalink award report block reply MasterChief08 1 points 5 days ago There's going to be at least 3 Republicans that vote for it permalink parent award report block reply\nMasterChief08 1 points 5 days ago There's going to be at least 3 Republicans that vote for it permalink parent award report block reply\nAlmostFullyDilated -2 points 5 days ago Trump freed the ultimate swamp creature kwame kilpatrick permalink award report block reply\ndukeofdoorcounty -3 points 5 days ago A lot of the people that will get screwed by ending the Biden subsidies are self-employed and business owners that should be MAGA people.  You don't want them pissed off going into 2026.  Keep the subsidies, but run a campaign on how bad Obamacare is and force the Dems to come up with something better. permalink award report block reply Aquamine-Amarine 3 points 5 days ago I don't want something better. I want it gone. permalink parent award report block reply HoganT 2 points 5 days ago Uhhh, why is it on the dems to come up with something better? Shouldn't WE be doing that? permalink parent award report block reply MasterChief08 1 points 5 days ago Fuck that. Abolish Obamacare permalink parent award report block reply dukeofdoorcounty 1 points 4 days ago Obamacare was designed to implode in 10 years and here we are.  President Hillary was supposed to sign Medicare for all about this time. permalink parent award report block reply\nAquamine-Amarine 3 points 5 days ago I don't want something better. I want it gone. permalink parent award report block reply\nHoganT 2 points 5 days ago Uhhh, why is it on the dems to come up with something better? Shouldn't WE be doing that? permalink parent award report block reply\nMasterChief08 1 points 5 days ago Fuck that. Abolish Obamacare permalink parent award report block reply dukeofdoorcounty 1 points 4 days ago Obamacare was designed to implode in 10 years and here we are.  President Hillary was supposed to sign Medicare for all about this time. permalink parent award report block reply\ndukeofdoorcounty 1 points 4 days ago Obamacare was designed to implode in 10 years and here we are.  President Hillary was supposed to sign Medicare for all about this time. permalink parent award report block reply\nTheGoyimWhisperer 3 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nEyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:37:59.445527Z"
}