{
  "id": "1ARK54Slc1",
  "url": "https://patriots.win/p/1ARK54Slc1/americans-can-somebody-please-ex/c",
  "content": "273 “Americans, can somebody please explain to me what is going on over here in the south? Everybody is so friendly, so welcoming, so calming.”\n\nWhat is the secret? I bloody love people from the south.”\n\nBrits love the south! This is God’s country 🇺🇸🙏🏼 posted 5 days ago by blue5707 41 comments award share report block TONY™ @TONYxTWO • 6d “Americans, can somebody please explain to me what is going on over here in the south? Everybody is so friendly, so welcoming, so calming.” What is the secret? I bloody love people from the south.” Brits love the south! This is God’s country 🇺🇸🙏🏼\n41 comments Sort by Top Top New Worst Old Save Greenhills 31 points 5 days ago One word, racism. In these parts, you’ll still get your ass beat by three sixty year old white men built like refrigerators if you harass a woman in a parking lot. And the sheriff will tell you you had it coming. permalink award report block reply Maxdady01 14 points 5 days ago I was gonna say, \"Sweet Tea\" but yours works too.  :) permalink parent award report block reply Eatinglue 5 points 5 days ago I love tea. On a special occasion, I might even put sugar in it. But HOLY JESUS FUCK southern sweet tea is SWEET. That’s literally the reason we’re the fattest nation. Everyone in the south drinking sweet tea drives up the stats for the whole country. permalink parent award report block reply TGNX 3 points 5 days ago Fun fact: We've had sweet tea longer than I've been alive. It's only recently that it's become an issue. permalink parent award report block reply NotYourMan 9 points 5 days ago Well there is natural segregation in the south.  About 80% of the black population lives in black only neighborhoods.  Its natural segregation that humans do. permalink parent award report block reply SedimentTrap -3 points 5 days ago what does racism have to do with standing up for a woman? permalink parent award report block reply HillarysBeaverMunch 9 points 5 days ago It means confronting violent blacks, obviously. permalink parent award report block reply SteelyEyedTroglodyte 21 points 5 days ago Guns, God, and the Bible. permalink award report block reply Lol_Garrus 20 points 5 days ago Because we have God. permalink award report block reply DrVSGGEOTUSPhD 5 points 5 days ago Dude what's it like out there in the boonies where most people are Bible believing baptists or pentecostal? (Am I right about that?) Seriously gotta wonder if you are protected and blessed by God at a regional level? permalink parent award report block reply basedboston 11 points 5 days ago We also make all the food, so the meat is FREEEEEESSSSSSSSSSHHHHHHHHHH. I drive by living steaks all morning and think \"can't wait to eat you!\" permalink parent award report block reply SedimentTrap 10 points 5 days ago what's it like? Peaceful mostly, b/c most of us \"bible beaters\" believe in being kind to your neighbor permalink parent award report block reply Lol_Garrus 4 points 5 days ago Yes. Think of Sodim and Gamorrah. These two cities were beset by such wickedness that the Lord destroyed them but the rest of Canaanite territory at that moment was left untouched. On the inverse, the Lord will bless areas within an existing nation/kingdom that show favor to Him over others areas of the same nation. This is why, as repeated explicitly and implicitly throughout the Bible, flee from places that have become dens of wickedness, let the Lord deal with them and He doesn't want the righteous as collateral. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 5 days ago Are there areas down there where it's mostly TurboChristians? I'm recently saved up in the secular north,  pretty much the only Christians I know are from my tiny church.. feels_bad_man.jpg permalink parent award report block reply Lol_Garrus 5 points 5 days ago Yes, it's called the Bible belt for a reason. Just make sure you avoid areas where blacks are the majority of the population. That said, rural blacks are much nicer and more pleasant than urban blacks. permalink parent award report block reply view 1 more comments... basedboston 2 points 5 days ago Look for one thing: Families. permalink parent award report block reply walls4america 1 points 5 days ago <Admah and Zeboiim enter the chat> permalink parent award report block reply Reefay 2 points 5 days ago God helps those that help themselves permalink parent award report block reply ChyNahAzzWhole1 14 points 5 days ago Biscuits and Gravy... bacon drippings, fried chicken, sweet tea... its the Food. permalink award report block reply 1True-translation 13 points 5 days ago Small midwest towns too. permalink award report block reply hdcochran 9 points 5 days ago I believe the people in the (mostly rural) south wish to live independently and self-sufficiently and still outnumber the large urban areas that dominate many other states. Sadly, this situation is gradually disappearing. permalink award report block reply Whiteemo 7 points 5 days ago We’re country AF that’s why 😃 permalink award report block reply sir_rockness 2 points 5 days ago Fellow Paul Cauthen listener... permalink parent award report block reply GA_Logic 5 points 5 days ago The point is that there is less fear mongering and exposure to globalist agenda trying to pry your hard earned money and time away. The only thing you should be is a god fearing American that loves your community, friends and family. permalink award report block reply basedboston 6 points 5 days ago If it wasn't for Dixie, the globalists would have won with COVID. The day Alabama announced it was going to full stadium attendance in 2020, I knew it was over for Klaus and the gang. permalink parent award report block reply HillarysBeaverMunch 5 points 5 days ago I've traveled to the UK a few times, mostly Scotland,  and when queried I  and my wife always made it a point to say we were Texans. Folks there seemed to like that. permalink award report block reply sir_rockness 4 points 5 days ago It's cause we love Jesus... glad you like it. permalink award report block reply NotYourMan 4 points 5 days ago It hasn't been invaded by illegal democrat voters yet.  All blue cities have been sold a huge lie by the democrat party.  That lie is that diversity by other cultures will mix together and work towards a common goal.  This is wrong.  Its a lie.  The democrat sponsored invasion of the US causes chaos, violence, crime, and terror in the people while democrat politicians get fabulously rich (the real goal).  So far, most of the South (outside the obvious democrat cities like Memphis and Atlanta) have been saved from this invasion. permalink award report block reply Nomolies 4 points 5 days ago Christianity. It really is that simple.  Even people who are not Christian are influenced in some positive ways by the higher percentage of Christians & churches in the south. It's not perfect - there are some very imperfect denominations, churches, and pastors out there (of course, none of us - with the exception of Christ - is perfect). The historical basis for Southerners' neighborliness towards even people they do not know stems in particular from growing up hearing this passage of Scripture in the New Testament (the money quotes are in vv. 29, 36, & 37): Luke 10:25   And behold, a lawyer stood up to put him to the test, saying, “Teacher, what shall I do to inherit eternal life?” 26 He said to him, “What is written in the Law? How do you read it?” 27 And he answered, “You shall love the Lord your God with all your heart and with all your soul and with all your strength and with all your mind, and your neighbor as yourself.” 28 And he said to him, “You have answered correctly; do this, and you will live.” Luke 10:29   But he, desiring to justify himself, said to Jesus, “And who is my neighbor?” Luke 10:30 Jesus replied, “A man was going down from Jerusalem to Jericho, and he fell among robbers, who stripped him and beat him and departed, leaving him half dead. 31 Now by chance a priest was going down that road, and when he saw him he passed by on the other side. 32 So likewise a Levite, when he came to the place and saw him, passed by on the other side. 33 But a Samaritan, as he journeyed, came to where he was, and when he saw him, he had compassion. 34 He went to him and bound up his wounds, pouring on oil and wine. Then he set him on his own animal and brought him to an inn and took care of him. 35 And the next day he took out two denarii and gave them to the innkeeper, saying, ‘Take care of him, and whatever more you spend, I will repay you when I come back.’ Luke 10:36 Which of these three, do you think, proved to be a neighbor to the man who fell among the robbers?” Luke 10:37 He said, “The one who showed him mercy.” And Jesus said to him, “You go, and do likewise.” In the early church, the traditional interpretation of this passage was that Jesus is the Good Samaritan (whom we should emulate), the church is the inn, the oil and wine represent the sacraments of baptism (the water of baptism was followed by the application of chrism in the early church) and the Eucharist, and the Samaritan's return is Judgment Day. Post-Christian cultures devolve into tribalism - e.g., people are less likely to help a young woman being stabbed on a metro if that person is outside of their subgroup within the larger society. In contrast, I have known Christians in the south from many backgrounds - whether white, black, yellow or brown - who have shown great kindness to people outside of their group because they love and follow the One who is truly the \"Good Samaritan.\" Church attendance, of course, declines in southern cities when they grow beyond a certain point and the local culture is replaced by people from many regions (leaving no shared sense of right and wrong, virtues to inculcate, and vices to avoid). The ultimate solution to this is not political (although the world is a better place when we vote for virtuous policies and oppose bad policies).  That is because politics is downstream from the culture, and the culture is downstream from religion. permalink award report block reply Xahnel 3 points 5 days ago It's called \"heat\" It's too fucking hot to spend the energy on being a rude cunt. So we just bless your heart and move on with our lives. permalink award report block reply HockeyMom4Trump 3 points 5 days ago Keep quiet! Remember the south is hot and humid and there is no electricity and it is just the worst!!!! NYC is great! Stay there! permalink award report block reply basedboston 2 points 5 days ago \"The South's Gonna Do It Again\" -- https://www.youtube.com/watch?v=tEKMED-_2QQ It already did. Federalism FTW. permalink award report block reply moscowjade 1 points 5 days ago Because we love Jesus permalink award report block reply Dway 1 points 5 days ago Simply put, we better than yankees permalink award report block reply SedimentTrap 1 points 5 days ago that's nice, now go back to where you came from. permalink award report block reply feelips 1 points 5 days ago An armed society is a polite society. permalink award report block reply Transparency 1 points 5 days ago If they know that you are just passing through, they will often be the sweetest, kindest people you've ever met... 1) to get your ass on down the road, because they do not want you there, and 2) so you won't go \"out-there\" and talk shit(truth) about them. Set down stakes and see for yourself what low-rent hateful trash they really are. Fortunately, \"The South\" has been flooded with \"outsiders\" so it's much easier today than it was even 20 yrs ago. Stay away from the bred, born and raised trash and stick with other outsiders. 👍👍 LowIQ from culture and inbreeding. permalink award report block reply A10_BRAAP 1 points 5 days ago There's nothing quite  like the \"Hey Buddy\" you receive when entering any establishment in the South. They are not tainted with cold hearts like the \"Northern City Folk\". permalink award report block reply\nGreenhills 31 points 5 days ago One word, racism. In these parts, you’ll still get your ass beat by three sixty year old white men built like refrigerators if you harass a woman in a parking lot. And the sheriff will tell you you had it coming. permalink award report block reply Maxdady01 14 points 5 days ago I was gonna say, \"Sweet Tea\" but yours works too.  :) permalink parent award report block reply Eatinglue 5 points 5 days ago I love tea. On a special occasion, I might even put sugar in it. But HOLY JESUS FUCK southern sweet tea is SWEET. That’s literally the reason we’re the fattest nation. Everyone in the south drinking sweet tea drives up the stats for the whole country. permalink parent award report block reply TGNX 3 points 5 days ago Fun fact: We've had sweet tea longer than I've been alive. It's only recently that it's become an issue. permalink parent award report block reply NotYourMan 9 points 5 days ago Well there is natural segregation in the south.  About 80% of the black population lives in black only neighborhoods.  Its natural segregation that humans do. permalink parent award report block reply SedimentTrap -3 points 5 days ago what does racism have to do with standing up for a woman? permalink parent award report block reply HillarysBeaverMunch 9 points 5 days ago It means confronting violent blacks, obviously. permalink parent award report block reply\nMaxdady01 14 points 5 days ago I was gonna say, \"Sweet Tea\" but yours works too.  :) permalink parent award report block reply Eatinglue 5 points 5 days ago I love tea. On a special occasion, I might even put sugar in it. But HOLY JESUS FUCK southern sweet tea is SWEET. That’s literally the reason we’re the fattest nation. Everyone in the south drinking sweet tea drives up the stats for the whole country. permalink parent award report block reply TGNX 3 points 5 days ago Fun fact: We've had sweet tea longer than I've been alive. It's only recently that it's become an issue. permalink parent award report block reply\nEatinglue 5 points 5 days ago I love tea. On a special occasion, I might even put sugar in it. But HOLY JESUS FUCK southern sweet tea is SWEET. That’s literally the reason we’re the fattest nation. Everyone in the south drinking sweet tea drives up the stats for the whole country. permalink parent award report block reply TGNX 3 points 5 days ago Fun fact: We've had sweet tea longer than I've been alive. It's only recently that it's become an issue. permalink parent award report block reply\nTGNX 3 points 5 days ago Fun fact: We've had sweet tea longer than I've been alive. It's only recently that it's become an issue. permalink parent award report block reply\nNotYourMan 9 points 5 days ago Well there is natural segregation in the south.  About 80% of the black population lives in black only neighborhoods.  Its natural segregation that humans do. permalink parent award report block reply\nSedimentTrap -3 points 5 days ago what does racism have to do with standing up for a woman? permalink parent award report block reply HillarysBeaverMunch 9 points 5 days ago It means confronting violent blacks, obviously. permalink parent award report block reply\nHillarysBeaverMunch 9 points 5 days ago It means confronting violent blacks, obviously. permalink parent award report block reply\nSteelyEyedTroglodyte 21 points 5 days ago Guns, God, and the Bible. permalink award report block reply\nLol_Garrus 20 points 5 days ago Because we have God. permalink award report block reply DrVSGGEOTUSPhD 5 points 5 days ago Dude what's it like out there in the boonies where most people are Bible believing baptists or pentecostal? (Am I right about that?) Seriously gotta wonder if you are protected and blessed by God at a regional level? permalink parent award report block reply basedboston 11 points 5 days ago We also make all the food, so the meat is FREEEEEESSSSSSSSSSHHHHHHHHHH. I drive by living steaks all morning and think \"can't wait to eat you!\" permalink parent award report block reply SedimentTrap 10 points 5 days ago what's it like? Peaceful mostly, b/c most of us \"bible beaters\" believe in being kind to your neighbor permalink parent award report block reply Lol_Garrus 4 points 5 days ago Yes. Think of Sodim and Gamorrah. These two cities were beset by such wickedness that the Lord destroyed them but the rest of Canaanite territory at that moment was left untouched. On the inverse, the Lord will bless areas within an existing nation/kingdom that show favor to Him over others areas of the same nation. This is why, as repeated explicitly and implicitly throughout the Bible, flee from places that have become dens of wickedness, let the Lord deal with them and He doesn't want the righteous as collateral. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 5 days ago Are there areas down there where it's mostly TurboChristians? I'm recently saved up in the secular north,  pretty much the only Christians I know are from my tiny church.. feels_bad_man.jpg permalink parent award report block reply Lol_Garrus 5 points 5 days ago Yes, it's called the Bible belt for a reason. Just make sure you avoid areas where blacks are the majority of the population. That said, rural blacks are much nicer and more pleasant than urban blacks. permalink parent award report block reply view 1 more comments... basedboston 2 points 5 days ago Look for one thing: Families. permalink parent award report block reply walls4america 1 points 5 days ago <Admah and Zeboiim enter the chat> permalink parent award report block reply Reefay 2 points 5 days ago God helps those that help themselves permalink parent award report block reply\nDrVSGGEOTUSPhD 5 points 5 days ago Dude what's it like out there in the boonies where most people are Bible believing baptists or pentecostal? (Am I right about that?) Seriously gotta wonder if you are protected and blessed by God at a regional level? permalink parent award report block reply basedboston 11 points 5 days ago We also make all the food, so the meat is FREEEEEESSSSSSSSSSHHHHHHHHHH. I drive by living steaks all morning and think \"can't wait to eat you!\" permalink parent award report block reply SedimentTrap 10 points 5 days ago what's it like? Peaceful mostly, b/c most of us \"bible beaters\" believe in being kind to your neighbor permalink parent award report block reply Lol_Garrus 4 points 5 days ago Yes. Think of Sodim and Gamorrah. These two cities were beset by such wickedness that the Lord destroyed them but the rest of Canaanite territory at that moment was left untouched. On the inverse, the Lord will bless areas within an existing nation/kingdom that show favor to Him over others areas of the same nation. This is why, as repeated explicitly and implicitly throughout the Bible, flee from places that have become dens of wickedness, let the Lord deal with them and He doesn't want the righteous as collateral. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 5 days ago Are there areas down there where it's mostly TurboChristians? I'm recently saved up in the secular north,  pretty much the only Christians I know are from my tiny church.. feels_bad_man.jpg permalink parent award report block reply Lol_Garrus 5 points 5 days ago Yes, it's called the Bible belt for a reason. Just make sure you avoid areas where blacks are the majority of the population. That said, rural blacks are much nicer and more pleasant than urban blacks. permalink parent award report block reply view 1 more comments... basedboston 2 points 5 days ago Look for one thing: Families. permalink parent award report block reply walls4america 1 points 5 days ago <Admah and Zeboiim enter the chat> permalink parent award report block reply Reefay 2 points 5 days ago God helps those that help themselves permalink parent award report block reply\nbasedboston 11 points 5 days ago We also make all the food, so the meat is FREEEEEESSSSSSSSSSHHHHHHHHHH. I drive by living steaks all morning and think \"can't wait to eat you!\" permalink parent award report block reply\nSedimentTrap 10 points 5 days ago what's it like? Peaceful mostly, b/c most of us \"bible beaters\" believe in being kind to your neighbor permalink parent award report block reply\nLol_Garrus 4 points 5 days ago Yes. Think of Sodim and Gamorrah. These two cities were beset by such wickedness that the Lord destroyed them but the rest of Canaanite territory at that moment was left untouched. On the inverse, the Lord will bless areas within an existing nation/kingdom that show favor to Him over others areas of the same nation. This is why, as repeated explicitly and implicitly throughout the Bible, flee from places that have become dens of wickedness, let the Lord deal with them and He doesn't want the righteous as collateral. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 5 days ago Are there areas down there where it's mostly TurboChristians? I'm recently saved up in the secular north,  pretty much the only Christians I know are from my tiny church.. feels_bad_man.jpg permalink parent award report block reply Lol_Garrus 5 points 5 days ago Yes, it's called the Bible belt for a reason. Just make sure you avoid areas where blacks are the majority of the population. That said, rural blacks are much nicer and more pleasant than urban blacks. permalink parent award report block reply view 1 more comments... basedboston 2 points 5 days ago Look for one thing: Families. permalink parent award report block reply walls4america 1 points 5 days ago <Admah and Zeboiim enter the chat> permalink parent award report block reply\nDrVSGGEOTUSPhD 2 points 5 days ago Are there areas down there where it's mostly TurboChristians? I'm recently saved up in the secular north,  pretty much the only Christians I know are from my tiny church.. feels_bad_man.jpg permalink parent award report block reply Lol_Garrus 5 points 5 days ago Yes, it's called the Bible belt for a reason. Just make sure you avoid areas where blacks are the majority of the population. That said, rural blacks are much nicer and more pleasant than urban blacks. permalink parent award report block reply view 1 more comments... basedboston 2 points 5 days ago Look for one thing: Families. permalink parent award report block reply\nLol_Garrus 5 points 5 days ago Yes, it's called the Bible belt for a reason. Just make sure you avoid areas where blacks are the majority of the population. That said, rural blacks are much nicer and more pleasant than urban blacks. permalink parent award report block reply view 1 more comments...\nbasedboston 2 points 5 days ago Look for one thing: Families. permalink parent award report block reply\nwalls4america 1 points 5 days ago <Admah and Zeboiim enter the chat> permalink parent award report block reply\nReefay 2 points 5 days ago God helps those that help themselves permalink parent award report block reply\nChyNahAzzWhole1 14 points 5 days ago Biscuits and Gravy... bacon drippings, fried chicken, sweet tea... its the Food. permalink award report block reply\n1True-translation 13 points 5 days ago Small midwest towns too. permalink award report block reply\nhdcochran 9 points 5 days ago I believe the people in the (mostly rural) south wish to live independently and self-sufficiently and still outnumber the large urban areas that dominate many other states. Sadly, this situation is gradually disappearing. permalink award report block reply\nWhiteemo 7 points 5 days ago We’re country AF that’s why 😃 permalink award report block reply sir_rockness 2 points 5 days ago Fellow Paul Cauthen listener... permalink parent award report block reply\nsir_rockness 2 points 5 days ago Fellow Paul Cauthen listener... permalink parent award report block reply\nGA_Logic 5 points 5 days ago The point is that there is less fear mongering and exposure to globalist agenda trying to pry your hard earned money and time away. The only thing you should be is a god fearing American that loves your community, friends and family. permalink award report block reply basedboston 6 points 5 days ago If it wasn't for Dixie, the globalists would have won with COVID. The day Alabama announced it was going to full stadium attendance in 2020, I knew it was over for Klaus and the gang. permalink parent award report block reply\nbasedboston 6 points 5 days ago If it wasn't for Dixie, the globalists would have won with COVID. The day Alabama announced it was going to full stadium attendance in 2020, I knew it was over for Klaus and the gang. permalink parent award report block reply\nHillarysBeaverMunch 5 points 5 days ago I've traveled to the UK a few times, mostly Scotland,  and when queried I  and my wife always made it a point to say we were Texans. Folks there seemed to like that. permalink award report block reply\nsir_rockness 4 points 5 days ago It's cause we love Jesus... glad you like it. permalink award report block reply\nNotYourMan 4 points 5 days ago It hasn't been invaded by illegal democrat voters yet.  All blue cities have been sold a huge lie by the democrat party.  That lie is that diversity by other cultures will mix together and work towards a common goal.  This is wrong.  Its a lie.  The democrat sponsored invasion of the US causes chaos, violence, crime, and terror in the people while democrat politicians get fabulously rich (the real goal).  So far, most of the South (outside the obvious democrat cities like Memphis and Atlanta) have been saved from this invasion. permalink award report block reply\nNomolies 4 points 5 days ago Christianity. It really is that simple.  Even people who are not Christian are influenced in some positive ways by the higher percentage of Christians & churches in the south. It's not perfect - there are some very imperfect denominations, churches, and pastors out there (of course, none of us - with the exception of Christ - is perfect). The historical basis for Southerners' neighborliness towards even people they do not know stems in particular from growing up hearing this passage of Scripture in the New Testament (the money quotes are in vv. 29, 36, & 37): Luke 10:25   And behold, a lawyer stood up to put him to the test, saying, “Teacher, what shall I do to inherit eternal life?” 26 He said to him, “What is written in the Law? How do you read it?” 27 And he answered, “You shall love the Lord your God with all your heart and with all your soul and with all your strength and with all your mind, and your neighbor as yourself.” 28 And he said to him, “You have answered correctly; do this, and you will live.” Luke 10:29   But he, desiring to justify himself, said to Jesus, “And who is my neighbor?” Luke 10:30 Jesus replied, “A man was going down from Jerusalem to Jericho, and he fell among robbers, who stripped him and beat him and departed, leaving him half dead. 31 Now by chance a priest was going down that road, and when he saw him he passed by on the other side. 32 So likewise a Levite, when he came to the place and saw him, passed by on the other side. 33 But a Samaritan, as he journeyed, came to where he was, and when he saw him, he had compassion. 34 He went to him and bound up his wounds, pouring on oil and wine. Then he set him on his own animal and brought him to an inn and took care of him. 35 And the next day he took out two denarii and gave them to the innkeeper, saying, ‘Take care of him, and whatever more you spend, I will repay you when I come back.’ Luke 10:36 Which of these three, do you think, proved to be a neighbor to the man who fell among the robbers?” Luke 10:37 He said, “The one who showed him mercy.” And Jesus said to him, “You go, and do likewise.” In the early church, the traditional interpretation of this passage was that Jesus is the Good Samaritan (whom we should emulate), the church is the inn, the oil and wine represent the sacraments of baptism (the water of baptism was followed by the application of chrism in the early church) and the Eucharist, and the Samaritan's return is Judgment Day. Post-Christian cultures devolve into tribalism - e.g., people are less likely to help a young woman being stabbed on a metro if that person is outside of their subgroup within the larger society. In contrast, I have known Christians in the south from many backgrounds - whether white, black, yellow or brown - who have shown great kindness to people outside of their group because they love and follow the One who is truly the \"Good Samaritan.\" Church attendance, of course, declines in southern cities when they grow beyond a certain point and the local culture is replaced by people from many regions (leaving no shared sense of right and wrong, virtues to inculcate, and vices to avoid). The ultimate solution to this is not political (although the world is a better place when we vote for virtuous policies and oppose bad policies).  That is because politics is downstream from the culture, and the culture is downstream from religion. permalink award report block reply\nXahnel 3 points 5 days ago It's called \"heat\" It's too fucking hot to spend the energy on being a rude cunt. So we just bless your heart and move on with our lives. permalink award report block reply\nHockeyMom4Trump 3 points 5 days ago Keep quiet! Remember the south is hot and humid and there is no electricity and it is just the worst!!!! NYC is great! Stay there! permalink award report block reply\nbasedboston 2 points 5 days ago \"The South's Gonna Do It Again\" -- https://www.youtube.com/watch?v=tEKMED-_2QQ It already did. Federalism FTW. permalink award report block reply\nmoscowjade 1 points 5 days ago Because we love Jesus permalink award report block reply\nDway 1 points 5 days ago Simply put, we better than yankees permalink award report block reply\nSedimentTrap 1 points 5 days ago that's nice, now go back to where you came from. permalink award report block reply\nfeelips 1 points 5 days ago An armed society is a polite society. permalink award report block reply\nTransparency 1 points 5 days ago If they know that you are just passing through, they will often be the sweetest, kindest people you've ever met... 1) to get your ass on down the road, because they do not want you there, and 2) so you won't go \"out-there\" and talk shit(truth) about them. Set down stakes and see for yourself what low-rent hateful trash they really are. Fortunately, \"The South\" has been flooded with \"outsiders\" so it's much easier today than it was even 20 yrs ago. Stay away from the bred, born and raised trash and stick with other outsiders. 👍👍 LowIQ from culture and inbreeding. permalink award report block reply\nA10_BRAAP 1 points 5 days ago There's nothing quite  like the \"Hey Buddy\" you receive when entering any establishment in the South. They are not tainted with cold hearts like the \"Northern City Folk\". permalink award report block reply",
  "fetched_at": "2025-11-12T23:03:19.832053Z"
}