{
  "id": "1ARK54TK2j",
  "url": "https://patriots.win/p/1ARK54TK2j/oogabooga-tribe-no-like-boogaoog/c",
  "content": "597 Ooga-booga tribe no like Booga-ooga tribe posted 5 days ago by RINO_fatigue 77 comments award share download report block\n77 comments Sort by Top Top New Worst Old Save The Real Story Behind His Exit No One Saw Coming Read More Ads by Ad.Style LostElf 77 points 5 days ago It's amazing how, as an American, I do not want to have to know any of these things. Fucking tribes. permalink award report block reply NazisWereSocialist 50 points 5 days ago Somalian tribal politics are swinging elections in America, what the fuck. permalink parent award report block reply LostElf 20 points 5 days ago Widen the scope of deportations. permalink parent award report block reply sixfingerdildo 8 points 5 days ago Sell spears and forks to both sides permalink parent award report block reply Reefay 6 points 5 days ago They won't know what to do with the dinglehoppers permalink parent award report block reply view 1 more comments... rkwittem 2 points 7 hours ago And ban NGOs from bringing them back permalink parent award report block reply LostElf 1 points 6 hours ago You had me at ban NGOs. permalink parent award report block reply SpellingContable 5 points 5 days ago If you're moving to Minneapolis be sure you do not accidently move to the Daarood part of Minneapolis. permalink parent award report block reply glow-operator-2-0 6 points 5 days ago Daarood Sandstorm? permalink parent award report block reply D__1 1 points 5 days ago Daa very rood to whitey. permalink parent award report block reply RagnarD 1 points 5 days ago Hawiye shill. May your next cat taste sour. permalink parent award report block reply SpellingContable 2 points 4 days ago Curse you. You speak like the offspring of the ancient Daarood dark goat rapers. My Hawiye cat will piss in your eye. permalink parent award report block reply HockeyMom4Trump 1 points 5 days ago Linden Hills is nice. Kenwood. permalink parent award report block reply mikethemarine 8 points 5 days ago truly, is one Somalian Muslim tribe any different than the other? I say deport them all, they both want Sharia law for this country and hate all Christians. Sharia Law in the US: The implementation of Sharia law as a legal system in the U.S. has been a topic in political discourse, primarily driven by concerns from some conservative pundits and politicians. However, these concerns focus on the perceived threat of its adoption rather than any actual widespread movement to replace U.S. law with Sharia. The U.S. legal system is based on the U.S. Constitution, which establishes a secular government and the separation of church and state, making the implementation of a religious legal system like Sharia unfeasible and unconstitutional. this IS why they want our constitution GONE permalink parent award report block reply SorosHasBallsackEyes 1 points 5 days ago The only way to find out may be via post-mortems permalink parent award report block reply Psarg 0 points 5 days ago Somalia has clans, which are groupings based on ancestry, not tribes, which are based on territory. permalink parent award report block reply henri_derelicte 38 points 5 days ago Import the third world, become the third world. permalink award report block reply Bullet_Tooth_Tony 8 points 5 days ago Americans have clans on SOCOM and Call of Duty. They have clans that bang goats. Quite the contrast. permalink parent award report block reply MurphyPDicsak 2 points 5 days ago SOCOM was an awesome game. Too bad they stopped making them over a decade ago lol permalink parent award report block reply NazisWereSocialist 24 points 5 days ago The fact that this is a relevant political discussion in the US is disgusting. permalink award report block reply BigPanda71 23 points 5 days ago How long until one clan decides to ethnically cleanse the other? permalink award report block reply henri_derelicte 12 points 5 days ago Let Allah sort them out permalink parent award report block reply Im_RickSteves_bitch 16 points 5 days ago Let Allah sort it out on their own soil. permalink parent award report block reply Mintap 7 points 5 days ago Bario 18 vs MS-13 is so bad, judges are ruling that illegal alien MS-13 members from El Salvador can't even be deported back to El Salvador. permalink parent award report block reply HumblePepe 7 points 5 days ago This happened briefly in Charlotte North Carolina. A riot broke out as two rival refugee tribes faced each other and open combat. permalink parent award report block reply MediaBro 4 points 5 days ago Anyone who knows about refugee camps is well aware that amongst Muslim refugees, the Syrian refugees, at first, were some of the best but the worst were the Afghans. The Afghans, pretty much all men, were so bad the Syrians had to keep their women, in particular, away from them and their children. These men would otherwise straight up target the Syrians and pretty much anyone in the camps. There is a YouTuber called Lubna, who is a Pakistani-Brit and she has literally spoken to a Pakistani woman living in one of these refugee camps in Germany, filled to the brim with Afghan and Pakistani men and they're all moaning about when they get to participate in their jihad and begin their wars. They know what they're there for. permalink parent award report block reply BlokeyMcBlokeFace 3 points 5 days ago In the case of Eritreans, it's been happening in Germany for a few years already... Police in the southwestern German city of Stuttgart on Sunday said dozens of people, including at least 26 officers were injured amid unrest surrounding an Eritrean cultural festival. Along with 26 officers, four people participating in the event and two protesting it were injured, police said in a statement. Six of the injured officers were being treated at the hospital. The clash was the latest in a string of incidents at such events in Germany and elsewhere, with fights breaking out between Eritrean government supporters and opponents. Police said they took 228 people into custody with police citing \"massive violence\" between the two groups. https://www.dw.com/en/germany-dozens-injured-in-unrest-at-eritrean-event/a-66837449 permalink parent award report block reply anotherthing 1 points 5 days ago Soon, I hope. permalink parent award report block reply ebuy123 10 points 5 days ago thanks obama permalink award report block reply notatallimsure 10 points 5 days ago Great, I'm super glad this dumb ass african tribal bullshit is happening in OUR COUNTRY. permalink award report block reply CleanUpPhillyTrump24 9 points 5 days ago Now I know how to spell these two names: Hawiye and Daarood. You hear people talking about this in Philly. I'm like do what now? The tribes and clans are coming with the illegals/quasi-legal foreign born. permalink award report block reply Abovethefray 8 points 5 days ago Those clans should fight. permalink award report block reply Reefay 6 points 5 days ago To the death! And then winner kills themselves permalink parent award report block reply FoKiT 6 points 5 days ago Everything is fine. permalink award report block reply Lurker404 6 points 5 days ago Something something ... Sandstorm permalink award report block reply RedFoxOnFire 5 points 5 days ago Okay, so get the Daarood clan to vote for expelling the Hawiye clan at the same time the Hawiye clan votes to expelled the Daarood clan. permalink award report block reply RINO_fatigue OP 6 points 5 days ago Using a Daarood hound dog to sniff out the illegal Hawiyes and vice versa was my first thought after reading this. permalink parent award report block reply jsphere256 5 points 5 days ago Somalian tribal politics is the backbone of our democracy permalink award report block reply Pede 5 points 5 days ago I question the personal integrity of that X account that is unironically posting political squabbles of Somalian invaders as if they belong here. permalink award report block reply Lol_Garrus 4 points 5 days ago Import third-world clan war boogaloos Become a third-world clan war boogaloo permalink award report block reply HumblePepe 4 points 5 days ago This is great for America. Isn't this? African tribal warfare in the streets? permalink award report block reply MakingArrowsOrange 4 points 5 days ago No Daarood sandstorm. permalink award report block reply MediaBro 4 points 5 days ago You mass import the third world, you get third world politics. This will get even worse, by the way. The Hindu v Muslim v Sikh wars are coming to your local neighborhood very soon. Your country will become a blend of South African, Indian and Pakistani politics. I genuinely do see Civil Wars within 5 to 6 yrs and I said, Civil Wars, not Civil War because it's going to be Balkanized wars happening between multiple different communities pitching themselves against each other. A different kind of horror is then having multiple countries across the planet try and either fund their community's side or worse, send in troops to allow their side to win or bring back the balance and keep the truce. Whatever happens, it's not going to go well for the US or the world in the next coming decade. permalink award report block reply NewBurner04 3 points 5 days ago Nig no like Nog! permalink award report block reply KeepingAmericaGreat 3 points 5 days ago Oh, brother! permalink award report block reply Weneverleft 3 points 5 days ago X, Balkanization is the process by which a country or region breaks apart into smaller, often unfriendly political units, typically along ethnic, cultural, or religious lines. The term originated from the fragmentation of the Balkan Peninsula in the early 20th century following the breakup of empires like the Ottoman Empire. This fragmentation can result in ethnic conflict and political instability within the newly divided areas. permalink award report block reply Weneverleft 2 points 5 days ago All by design,  Destroy America from within. We have huge cancerous tumors metastasising in our country.  These tumors need to be removed. permalink parent award report block reply gaijin_ronin 3 points 5 days ago Don't worry, after sorting all the tribal business the community will move on to building Minnekanda. permalink award report block reply blockchain-the-vote 3 points 5 days ago Look at me, I am the mayor now -Jacob Frey permalink award report block reply noPTSDforMePlease 3 points 5 days ago It's a key example of political leverage. The Somalians control Minnesota district 5 because that's where they all are. And by controlling that one district, now the entire state is blue. Seriously, look at the electoral maps. The rest of Minnesota is either red or leans red. But district 5 is big enough (it's the core of the twin cities) to move the entire state solidly blue. thats why there is so much fraud and it's tolerated: Somalians give Minnesota to the Democrats. Without them, Minnesota goes Republican. permalink award report block reply booblitchutz 3 points 5 days ago Good to know there is at least ONE functional division on the left that can result in electoral losses. They caucus together even when half of them want to kill all Jews and the other half ARE Jews. permalink award report block reply PhantomShield72 3 points 5 days ago Darude Sandstorm Tribe permalink award report block reply Pappy_Gunn 3 points 5 days ago I say build a fence around it and dump 500 machetes in there.  Let them sort it out in thier own diverse way. permalink award report block reply D__1 2 points 5 days ago \"Two tribes enter! One tribe leaves!\" (And then gets deported...) permalink parent award report block reply Im_RickSteves_bitch 3 points 5 days ago Death…by Ooga-Booga! permalink award report block reply SorosHasBallsackEyes 2 points 5 days ago I appreciated the idea that intelligence agencies helped to pit the Sunni and Shia against each other. So long as they were slaughtering each other, things were relatively peaceful elsewhere. Is there a lesson for us here? permalink award report block reply goatnuts 2 points 5 days ago Hey man, at least they know who their people are and where their loyalties lie. We had that once too. permalink award report block reply ak83 2 points 5 days ago Someone slap a CD in their mouth and go claim you support that tribe so we can win it back then boot ek all out. permalink award report block reply Fourtyandfourtyfive 2 points 5 days ago The Daaaibxnood and the Hewiteey disagree one some very important issues. The largest is can you (halal) consume goat meat after the divorce. permalink award report block reply 2016TrumpMAGA 2 points 5 days ago Maybe we can get them to kill each other off. permalink award report block reply patrioticwinning3 2 points 5 days ago The only hope is to find.... SHAKAKA! :p permalink award report block reply ApathySK 2 points 5 days ago Imagine living a first world country, and elections are determined by some backwater 3rd worlders who can't read or write in their own native language. permalink award report block reply RagnarD 2 points 5 days ago They imported the third world and became the third world. permalink award report block reply DudeNoOne 2 points 5 days ago The Hart-Celler Act strikes again. permalink award report block reply uniformist 2 points 5 days ago Unga bunga! https://youtu.be/WVzWeq_sfA8?si=EM2fI3grR2PTCMpS permalink award report block reply KilroyJCNJ 2 points 5 days ago https://youtu.be/WVzWeq_sfA8?si=QjUd4i73Zh_96Uxf Still applicable permalink award report block reply vongregormench 2 points 5 days ago By the way this is how Europe took over Africa with very little manpower. permalink award report block reply RINO_fatigue OP 2 points 5 days ago Every successful American colony was founded with the assistance of redskins who wanted to ally with Whites so that Whites would use their superior weapons against the redskins' enemy tribes further inland or up the coast permalink parent award report block reply FirstOrLast 2 points 5 days ago Deport both tribes. Let them fight on their own soil. Idgaf about any of them. permalink award report block reply boomerbutnotOKBoomer 2 points 5 days ago Love it. permalink award report block reply cryptoapebot 2 points 5 days ago \"The idea used to be that terrible countries were terrible because good, decent, innocent people were being oppressed by evil, thuggish leaders.  Somalia changed that.  Here you have a country where just about everybody is caught up in hatried and fighting.  You stop and old lady on the street and ask her if she wants peace, and she'll say, yes, of course, I pray for it daily.  All the things you'd expect her to say.  Then ask her if she would be willing for her clan to share power with another in order to have that pease, and she'll say, 'With those muderers and thieves?  I'd die first.'  -- Blackhawk Down. permalink award report block reply tdee3000 1 points 5 days ago skinny on skinny violence permalink award report block reply Gtsx 1 points 5 days ago Welcome to the old world. Chechens and Arabs have fought with automatic weapons in France. https://en.wikipedia.org/wiki/2020_Dijon_riots permalink award report block reply 2016TrumpMAGA 1 points 5 days ago The history of Africa in one headline. permalink award report block reply TheGoyimWhisperer 4 points 5 days ago Comment removed upon the user being banned. permalink award report block reply HoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply corporateshizer 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nLostElf 77 points 5 days ago It's amazing how, as an American, I do not want to have to know any of these things. Fucking tribes. permalink award report block reply NazisWereSocialist 50 points 5 days ago Somalian tribal politics are swinging elections in America, what the fuck. permalink parent award report block reply LostElf 20 points 5 days ago Widen the scope of deportations. permalink parent award report block reply sixfingerdildo 8 points 5 days ago Sell spears and forks to both sides permalink parent award report block reply Reefay 6 points 5 days ago They won't know what to do with the dinglehoppers permalink parent award report block reply view 1 more comments... rkwittem 2 points 7 hours ago And ban NGOs from bringing them back permalink parent award report block reply LostElf 1 points 6 hours ago You had me at ban NGOs. permalink parent award report block reply SpellingContable 5 points 5 days ago If you're moving to Minneapolis be sure you do not accidently move to the Daarood part of Minneapolis. permalink parent award report block reply glow-operator-2-0 6 points 5 days ago Daarood Sandstorm? permalink parent award report block reply D__1 1 points 5 days ago Daa very rood to whitey. permalink parent award report block reply RagnarD 1 points 5 days ago Hawiye shill. May your next cat taste sour. permalink parent award report block reply SpellingContable 2 points 4 days ago Curse you. You speak like the offspring of the ancient Daarood dark goat rapers. My Hawiye cat will piss in your eye. permalink parent award report block reply HockeyMom4Trump 1 points 5 days ago Linden Hills is nice. Kenwood. permalink parent award report block reply mikethemarine 8 points 5 days ago truly, is one Somalian Muslim tribe any different than the other? I say deport them all, they both want Sharia law for this country and hate all Christians. Sharia Law in the US: The implementation of Sharia law as a legal system in the U.S. has been a topic in political discourse, primarily driven by concerns from some conservative pundits and politicians. However, these concerns focus on the perceived threat of its adoption rather than any actual widespread movement to replace U.S. law with Sharia. The U.S. legal system is based on the U.S. Constitution, which establishes a secular government and the separation of church and state, making the implementation of a religious legal system like Sharia unfeasible and unconstitutional. this IS why they want our constitution GONE permalink parent award report block reply SorosHasBallsackEyes 1 points 5 days ago The only way to find out may be via post-mortems permalink parent award report block reply Psarg 0 points 5 days ago Somalia has clans, which are groupings based on ancestry, not tribes, which are based on territory. permalink parent award report block reply\nNazisWereSocialist 50 points 5 days ago Somalian tribal politics are swinging elections in America, what the fuck. permalink parent award report block reply LostElf 20 points 5 days ago Widen the scope of deportations. permalink parent award report block reply sixfingerdildo 8 points 5 days ago Sell spears and forks to both sides permalink parent award report block reply Reefay 6 points 5 days ago They won't know what to do with the dinglehoppers permalink parent award report block reply view 1 more comments... rkwittem 2 points 7 hours ago And ban NGOs from bringing them back permalink parent award report block reply LostElf 1 points 6 hours ago You had me at ban NGOs. permalink parent award report block reply SpellingContable 5 points 5 days ago If you're moving to Minneapolis be sure you do not accidently move to the Daarood part of Minneapolis. permalink parent award report block reply glow-operator-2-0 6 points 5 days ago Daarood Sandstorm? permalink parent award report block reply D__1 1 points 5 days ago Daa very rood to whitey. permalink parent award report block reply RagnarD 1 points 5 days ago Hawiye shill. May your next cat taste sour. permalink parent award report block reply SpellingContable 2 points 4 days ago Curse you. You speak like the offspring of the ancient Daarood dark goat rapers. My Hawiye cat will piss in your eye. permalink parent award report block reply HockeyMom4Trump 1 points 5 days ago Linden Hills is nice. Kenwood. permalink parent award report block reply\nLostElf 20 points 5 days ago Widen the scope of deportations. permalink parent award report block reply sixfingerdildo 8 points 5 days ago Sell spears and forks to both sides permalink parent award report block reply Reefay 6 points 5 days ago They won't know what to do with the dinglehoppers permalink parent award report block reply view 1 more comments... rkwittem 2 points 7 hours ago And ban NGOs from bringing them back permalink parent award report block reply LostElf 1 points 6 hours ago You had me at ban NGOs. permalink parent award report block reply\nsixfingerdildo 8 points 5 days ago Sell spears and forks to both sides permalink parent award report block reply Reefay 6 points 5 days ago They won't know what to do with the dinglehoppers permalink parent award report block reply view 1 more comments...\nReefay 6 points 5 days ago They won't know what to do with the dinglehoppers permalink parent award report block reply view 1 more comments...\nrkwittem 2 points 7 hours ago And ban NGOs from bringing them back permalink parent award report block reply LostElf 1 points 6 hours ago You had me at ban NGOs. permalink parent award report block reply\nLostElf 1 points 6 hours ago You had me at ban NGOs. permalink parent award report block reply\nSpellingContable 5 points 5 days ago If you're moving to Minneapolis be sure you do not accidently move to the Daarood part of Minneapolis. permalink parent award report block reply glow-operator-2-0 6 points 5 days ago Daarood Sandstorm? permalink parent award report block reply D__1 1 points 5 days ago Daa very rood to whitey. permalink parent award report block reply RagnarD 1 points 5 days ago Hawiye shill. May your next cat taste sour. permalink parent award report block reply SpellingContable 2 points 4 days ago Curse you. You speak like the offspring of the ancient Daarood dark goat rapers. My Hawiye cat will piss in your eye. permalink parent award report block reply HockeyMom4Trump 1 points 5 days ago Linden Hills is nice. Kenwood. permalink parent award report block reply\nglow-operator-2-0 6 points 5 days ago Daarood Sandstorm? permalink parent award report block reply D__1 1 points 5 days ago Daa very rood to whitey. permalink parent award report block reply\nD__1 1 points 5 days ago Daa very rood to whitey. permalink parent award report block reply\nRagnarD 1 points 5 days ago Hawiye shill. May your next cat taste sour. permalink parent award report block reply SpellingContable 2 points 4 days ago Curse you. You speak like the offspring of the ancient Daarood dark goat rapers. My Hawiye cat will piss in your eye. permalink parent award report block reply\nSpellingContable 2 points 4 days ago Curse you. You speak like the offspring of the ancient Daarood dark goat rapers. My Hawiye cat will piss in your eye. permalink parent award report block reply\nHockeyMom4Trump 1 points 5 days ago Linden Hills is nice. Kenwood. permalink parent award report block reply\nmikethemarine 8 points 5 days ago truly, is one Somalian Muslim tribe any different than the other? I say deport them all, they both want Sharia law for this country and hate all Christians. Sharia Law in the US: The implementation of Sharia law as a legal system in the U.S. has been a topic in political discourse, primarily driven by concerns from some conservative pundits and politicians. However, these concerns focus on the perceived threat of its adoption rather than any actual widespread movement to replace U.S. law with Sharia. The U.S. legal system is based on the U.S. Constitution, which establishes a secular government and the separation of church and state, making the implementation of a religious legal system like Sharia unfeasible and unconstitutional. this IS why they want our constitution GONE permalink parent award report block reply SorosHasBallsackEyes 1 points 5 days ago The only way to find out may be via post-mortems permalink parent award report block reply\nSorosHasBallsackEyes 1 points 5 days ago The only way to find out may be via post-mortems permalink parent award report block reply\nPsarg 0 points 5 days ago Somalia has clans, which are groupings based on ancestry, not tribes, which are based on territory. permalink parent award report block reply\nhenri_derelicte 38 points 5 days ago Import the third world, become the third world. permalink award report block reply Bullet_Tooth_Tony 8 points 5 days ago Americans have clans on SOCOM and Call of Duty. They have clans that bang goats. Quite the contrast. permalink parent award report block reply MurphyPDicsak 2 points 5 days ago SOCOM was an awesome game. Too bad they stopped making them over a decade ago lol permalink parent award report block reply\nBullet_Tooth_Tony 8 points 5 days ago Americans have clans on SOCOM and Call of Duty. They have clans that bang goats. Quite the contrast. permalink parent award report block reply MurphyPDicsak 2 points 5 days ago SOCOM was an awesome game. Too bad they stopped making them over a decade ago lol permalink parent award report block reply\nMurphyPDicsak 2 points 5 days ago SOCOM was an awesome game. Too bad they stopped making them over a decade ago lol permalink parent award report block reply\nNazisWereSocialist 24 points 5 days ago The fact that this is a relevant political discussion in the US is disgusting. permalink award report block reply\nBigPanda71 23 points 5 days ago How long until one clan decides to ethnically cleanse the other? permalink award report block reply henri_derelicte 12 points 5 days ago Let Allah sort them out permalink parent award report block reply Im_RickSteves_bitch 16 points 5 days ago Let Allah sort it out on their own soil. permalink parent award report block reply Mintap 7 points 5 days ago Bario 18 vs MS-13 is so bad, judges are ruling that illegal alien MS-13 members from El Salvador can't even be deported back to El Salvador. permalink parent award report block reply HumblePepe 7 points 5 days ago This happened briefly in Charlotte North Carolina. A riot broke out as two rival refugee tribes faced each other and open combat. permalink parent award report block reply MediaBro 4 points 5 days ago Anyone who knows about refugee camps is well aware that amongst Muslim refugees, the Syrian refugees, at first, were some of the best but the worst were the Afghans. The Afghans, pretty much all men, were so bad the Syrians had to keep their women, in particular, away from them and their children. These men would otherwise straight up target the Syrians and pretty much anyone in the camps. There is a YouTuber called Lubna, who is a Pakistani-Brit and she has literally spoken to a Pakistani woman living in one of these refugee camps in Germany, filled to the brim with Afghan and Pakistani men and they're all moaning about when they get to participate in their jihad and begin their wars. They know what they're there for. permalink parent award report block reply BlokeyMcBlokeFace 3 points 5 days ago In the case of Eritreans, it's been happening in Germany for a few years already... Police in the southwestern German city of Stuttgart on Sunday said dozens of people, including at least 26 officers were injured amid unrest surrounding an Eritrean cultural festival. Along with 26 officers, four people participating in the event and two protesting it were injured, police said in a statement. Six of the injured officers were being treated at the hospital. The clash was the latest in a string of incidents at such events in Germany and elsewhere, with fights breaking out between Eritrean government supporters and opponents. Police said they took 228 people into custody with police citing \"massive violence\" between the two groups. https://www.dw.com/en/germany-dozens-injured-in-unrest-at-eritrean-event/a-66837449 permalink parent award report block reply anotherthing 1 points 5 days ago Soon, I hope. permalink parent award report block reply\nhenri_derelicte 12 points 5 days ago Let Allah sort them out permalink parent award report block reply Im_RickSteves_bitch 16 points 5 days ago Let Allah sort it out on their own soil. permalink parent award report block reply\nIm_RickSteves_bitch 16 points 5 days ago Let Allah sort it out on their own soil. permalink parent award report block reply\nMintap 7 points 5 days ago Bario 18 vs MS-13 is so bad, judges are ruling that illegal alien MS-13 members from El Salvador can't even be deported back to El Salvador. permalink parent award report block reply\nHumblePepe 7 points 5 days ago This happened briefly in Charlotte North Carolina. A riot broke out as two rival refugee tribes faced each other and open combat. permalink parent award report block reply MediaBro 4 points 5 days ago Anyone who knows about refugee camps is well aware that amongst Muslim refugees, the Syrian refugees, at first, were some of the best but the worst were the Afghans. The Afghans, pretty much all men, were so bad the Syrians had to keep their women, in particular, away from them and their children. These men would otherwise straight up target the Syrians and pretty much anyone in the camps. There is a YouTuber called Lubna, who is a Pakistani-Brit and she has literally spoken to a Pakistani woman living in one of these refugee camps in Germany, filled to the brim with Afghan and Pakistani men and they're all moaning about when they get to participate in their jihad and begin their wars. They know what they're there for. permalink parent award report block reply\nMediaBro 4 points 5 days ago Anyone who knows about refugee camps is well aware that amongst Muslim refugees, the Syrian refugees, at first, were some of the best but the worst were the Afghans. The Afghans, pretty much all men, were so bad the Syrians had to keep their women, in particular, away from them and their children. These men would otherwise straight up target the Syrians and pretty much anyone in the camps. There is a YouTuber called Lubna, who is a Pakistani-Brit and she has literally spoken to a Pakistani woman living in one of these refugee camps in Germany, filled to the brim with Afghan and Pakistani men and they're all moaning about when they get to participate in their jihad and begin their wars. They know what they're there for. permalink parent award report block reply\nBlokeyMcBlokeFace 3 points 5 days ago In the case of Eritreans, it's been happening in Germany for a few years already... Police in the southwestern German city of Stuttgart on Sunday said dozens of people, including at least 26 officers were injured amid unrest surrounding an Eritrean cultural festival. Along with 26 officers, four people participating in the event and two protesting it were injured, police said in a statement. Six of the injured officers were being treated at the hospital. The clash was the latest in a string of incidents at such events in Germany and elsewhere, with fights breaking out between Eritrean government supporters and opponents. Police said they took 228 people into custody with police citing \"massive violence\" between the two groups. https://www.dw.com/en/germany-dozens-injured-in-unrest-at-eritrean-event/a-66837449 permalink parent award report block reply\nanotherthing 1 points 5 days ago Soon, I hope. permalink parent award report block reply\nebuy123 10 points 5 days ago thanks obama permalink award report block reply\nnotatallimsure 10 points 5 days ago Great, I'm super glad this dumb ass african tribal bullshit is happening in OUR COUNTRY. permalink award report block reply\nCleanUpPhillyTrump24 9 points 5 days ago Now I know how to spell these two names: Hawiye and Daarood. You hear people talking about this in Philly. I'm like do what now? The tribes and clans are coming with the illegals/quasi-legal foreign born. permalink award report block reply\nAbovethefray 8 points 5 days ago Those clans should fight. permalink award report block reply Reefay 6 points 5 days ago To the death! And then winner kills themselves permalink parent award report block reply\nReefay 6 points 5 days ago To the death! And then winner kills themselves permalink parent award report block reply\nFoKiT 6 points 5 days ago Everything is fine. permalink award report block reply\nLurker404 6 points 5 days ago Something something ... Sandstorm permalink award report block reply\nRedFoxOnFire 5 points 5 days ago Okay, so get the Daarood clan to vote for expelling the Hawiye clan at the same time the Hawiye clan votes to expelled the Daarood clan. permalink award report block reply RINO_fatigue OP 6 points 5 days ago Using a Daarood hound dog to sniff out the illegal Hawiyes and vice versa was my first thought after reading this. permalink parent award report block reply\nRINO_fatigue OP 6 points 5 days ago Using a Daarood hound dog to sniff out the illegal Hawiyes and vice versa was my first thought after reading this. permalink parent award report block reply\njsphere256 5 points 5 days ago Somalian tribal politics is the backbone of our democracy permalink award report block reply\nPede 5 points 5 days ago I question the personal integrity of that X account that is unironically posting political squabbles of Somalian invaders as if they belong here. permalink award report block reply\nLol_Garrus 4 points 5 days ago Import third-world clan war boogaloos Become a third-world clan war boogaloo permalink award report block reply\nHumblePepe 4 points 5 days ago This is great for America. Isn't this? African tribal warfare in the streets? permalink award report block reply\nMakingArrowsOrange 4 points 5 days ago No Daarood sandstorm. permalink award report block reply\nMediaBro 4 points 5 days ago You mass import the third world, you get third world politics. This will get even worse, by the way. The Hindu v Muslim v Sikh wars are coming to your local neighborhood very soon. Your country will become a blend of South African, Indian and Pakistani politics. I genuinely do see Civil Wars within 5 to 6 yrs and I said, Civil Wars, not Civil War because it's going to be Balkanized wars happening between multiple different communities pitching themselves against each other. A different kind of horror is then having multiple countries across the planet try and either fund their community's side or worse, send in troops to allow their side to win or bring back the balance and keep the truce. Whatever happens, it's not going to go well for the US or the world in the next coming decade. permalink award report block reply\nNewBurner04 3 points 5 days ago Nig no like Nog! permalink award report block reply\nKeepingAmericaGreat 3 points 5 days ago Oh, brother! permalink award report block reply\nWeneverleft 3 points 5 days ago X, Balkanization is the process by which a country or region breaks apart into smaller, often unfriendly political units, typically along ethnic, cultural, or religious lines. The term originated from the fragmentation of the Balkan Peninsula in the early 20th century following the breakup of empires like the Ottoman Empire. This fragmentation can result in ethnic conflict and political instability within the newly divided areas. permalink award report block reply Weneverleft 2 points 5 days ago All by design,  Destroy America from within. We have huge cancerous tumors metastasising in our country.  These tumors need to be removed. permalink parent award report block reply\nWeneverleft 2 points 5 days ago All by design,  Destroy America from within. We have huge cancerous tumors metastasising in our country.  These tumors need to be removed. permalink parent award report block reply\ngaijin_ronin 3 points 5 days ago Don't worry, after sorting all the tribal business the community will move on to building Minnekanda. permalink award report block reply\nblockchain-the-vote 3 points 5 days ago Look at me, I am the mayor now -Jacob Frey permalink award report block reply\nnoPTSDforMePlease 3 points 5 days ago It's a key example of political leverage. The Somalians control Minnesota district 5 because that's where they all are. And by controlling that one district, now the entire state is blue. Seriously, look at the electoral maps. The rest of Minnesota is either red or leans red. But district 5 is big enough (it's the core of the twin cities) to move the entire state solidly blue. thats why there is so much fraud and it's tolerated: Somalians give Minnesota to the Democrats. Without them, Minnesota goes Republican. permalink award report block reply\nbooblitchutz 3 points 5 days ago Good to know there is at least ONE functional division on the left that can result in electoral losses. They caucus together even when half of them want to kill all Jews and the other half ARE Jews. permalink award report block reply\nPhantomShield72 3 points 5 days ago Darude Sandstorm Tribe permalink award report block reply\nPappy_Gunn 3 points 5 days ago I say build a fence around it and dump 500 machetes in there.  Let them sort it out in thier own diverse way. permalink award report block reply D__1 2 points 5 days ago \"Two tribes enter! One tribe leaves!\" (And then gets deported...) permalink parent award report block reply\nD__1 2 points 5 days ago \"Two tribes enter! One tribe leaves!\" (And then gets deported...) permalink parent award report block reply\nIm_RickSteves_bitch 3 points 5 days ago Death…by Ooga-Booga! permalink award report block reply\nSorosHasBallsackEyes 2 points 5 days ago I appreciated the idea that intelligence agencies helped to pit the Sunni and Shia against each other. So long as they were slaughtering each other, things were relatively peaceful elsewhere. Is there a lesson for us here? permalink award report block reply\ngoatnuts 2 points 5 days ago Hey man, at least they know who their people are and where their loyalties lie. We had that once too. permalink award report block reply\nak83 2 points 5 days ago Someone slap a CD in their mouth and go claim you support that tribe so we can win it back then boot ek all out. permalink award report block reply\nFourtyandfourtyfive 2 points 5 days ago The Daaaibxnood and the Hewiteey disagree one some very important issues. The largest is can you (halal) consume goat meat after the divorce. permalink award report block reply\n2016TrumpMAGA 2 points 5 days ago Maybe we can get them to kill each other off. permalink award report block reply\npatrioticwinning3 2 points 5 days ago The only hope is to find.... SHAKAKA! :p permalink award report block reply\nApathySK 2 points 5 days ago Imagine living a first world country, and elections are determined by some backwater 3rd worlders who can't read or write in their own native language. permalink award report block reply\nRagnarD 2 points 5 days ago They imported the third world and became the third world. permalink award report block reply\nDudeNoOne 2 points 5 days ago The Hart-Celler Act strikes again. permalink award report block reply\nuniformist 2 points 5 days ago Unga bunga! https://youtu.be/WVzWeq_sfA8?si=EM2fI3grR2PTCMpS permalink award report block reply\nKilroyJCNJ 2 points 5 days ago https://youtu.be/WVzWeq_sfA8?si=QjUd4i73Zh_96Uxf Still applicable permalink award report block reply\nvongregormench 2 points 5 days ago By the way this is how Europe took over Africa with very little manpower. permalink award report block reply RINO_fatigue OP 2 points 5 days ago Every successful American colony was founded with the assistance of redskins who wanted to ally with Whites so that Whites would use their superior weapons against the redskins' enemy tribes further inland or up the coast permalink parent award report block reply\nRINO_fatigue OP 2 points 5 days ago Every successful American colony was founded with the assistance of redskins who wanted to ally with Whites so that Whites would use their superior weapons against the redskins' enemy tribes further inland or up the coast permalink parent award report block reply\nFirstOrLast 2 points 5 days ago Deport both tribes. Let them fight on their own soil. Idgaf about any of them. permalink award report block reply\nboomerbutnotOKBoomer 2 points 5 days ago Love it. permalink award report block reply\ncryptoapebot 2 points 5 days ago \"The idea used to be that terrible countries were terrible because good, decent, innocent people were being oppressed by evil, thuggish leaders.  Somalia changed that.  Here you have a country where just about everybody is caught up in hatried and fighting.  You stop and old lady on the street and ask her if she wants peace, and she'll say, yes, of course, I pray for it daily.  All the things you'd expect her to say.  Then ask her if she would be willing for her clan to share power with another in order to have that pease, and she'll say, 'With those muderers and thieves?  I'd die first.'  -- Blackhawk Down. permalink award report block reply\ntdee3000 1 points 5 days ago skinny on skinny violence permalink award report block reply\nGtsx 1 points 5 days ago Welcome to the old world. Chechens and Arabs have fought with automatic weapons in France. https://en.wikipedia.org/wiki/2020_Dijon_riots permalink award report block reply\n2016TrumpMAGA 1 points 5 days ago The history of Africa in one headline. permalink award report block reply\nTheGoyimWhisperer 4 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nHoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\ncorporateshizer 1 points 5 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T21:08:52.461788Z"
}