{
  "id": "8185024",
  "title": "345Please do the needfulposted6 hours agobyHappyFunBall17 commentsawardsharedownloadreportblock",
  "url": "https://patriots.win/p/1ARK9nNhie/please-do-the-needful/c",
  "content": "345 Please do the needful posted 6 hours ago by HappyFunBall 17 comments award share download report block\n17 comments Sort by Top Top New Worst Old Save 19American62Woman 25 points 6 hours ago My small Texas town was 99% white. It changed literally overnight. Now our stores all look ransacked, things under lock and key. Gangs of vandals, and can’t get a job unless you are dark. permalink award report block reply mty_green_go 11 points 5 hours ago sounds like you have been culturally enriched! Embrace your \"divershitty is out strength\"!! permalink parent award report block reply Rydanovich 5 points 4 hours ago It's funny seeing what is or isn't under lock and key. Bars of soap? Nope. Candy? Yep. permalink parent award report block reply iamherefortheluls 2 points 2 hours ago and can’t get a job unless you are dark white libs refuse to get this. Literally no one else, anywhere in the world, thinks racial discrimination is bad when its done for their in-group's preference. Everyone except 'white' people wants to hire only 'their own kind' permalink parent award report block reply BenDoverAssho 16 points 6 hours ago The Kalergi Plan is working. White replacement is a real phenomenon. The solution: 1- Our borders need to be shut, 2- legal immigration needs to be greatly reduced and limited to White Western people only, and 3- mass deportations of illegal foreigners need to be ramped up a hundred fold. Currently, I'm not sure that any of this is happening. permalink award report block reply someguy7738 12 points 6 hours ago And White people need to entirely eschew birth control and have as many children as possible. permalink parent award report block reply greatpumpkin 5 points 1 hour ago That'll never happen unless all divorce laws (& associated drek) going back 106 years are voided. permalink parent award report block reply PatriotSkorzeny 5 points 6 hours ago NC is Yemen and Mexico. It’s a tragic shame. The admins legacy. 😒 permalink award report block reply Thune 4 points 4 hours ago This is every bit the invasion and threat that has conquered other peoples throughout history.  This must be repelled.  This is not their home.  They need to go home. permalink award report block reply BenDoverAssho 3 points 4 hours ago The people facilitating this need to be,\n\" removed\" as well. permalink parent award report block reply greatpumpkin 4 points 1 hour ago Lyndon Johnson screwed us in ways he could never imagine in 1960 ..... permalink award report block reply Dev404 2 points 3 hours ago Obama, and Congress, were happy to replace the white people there with third world goatfuckers. permalink award report block reply TD_Covfefe_Crusader 1 points 31 minutes ago I had a old high school friend who moved to Minneapolis many years ago and became a Democrat. He loved 0bama and he used to mock the people in Minneapolis who were \"having a hard time\" with all the Somalis being imported. I wonder if he feels any remorse now that it has been completely overrun with Somalis and become an absolute shit hole. permalink award report block reply CleanUpPhillyTrump24 1 points 3 minutes ago It''s up to the patriots in Minn. to REPORT to ICE those who are illegal. Just do a little research to make the case. The ICE online tip line is for ANY SUSPICIOUS ACTIVITY, per their own website: https://www.ice.gov/webform/ice-tip-form Don't be shy. Don't be lazy. Take your nation back. permalink award report block reply Shitsbrokeyo 1 points 1 hour ago Deport permalink award report block reply\n19American62Woman 25 points 6 hours ago My small Texas town was 99% white. It changed literally overnight. Now our stores all look ransacked, things under lock and key. Gangs of vandals, and can’t get a job unless you are dark. permalink award report block reply mty_green_go 11 points 5 hours ago sounds like you have been culturally enriched! Embrace your \"divershitty is out strength\"!! permalink parent award report block reply Rydanovich 5 points 4 hours ago It's funny seeing what is or isn't under lock and key. Bars of soap? Nope. Candy? Yep. permalink parent award report block reply iamherefortheluls 2 points 2 hours ago and can’t get a job unless you are dark white libs refuse to get this. Literally no one else, anywhere in the world, thinks racial discrimination is bad when its done for their in-group's preference. Everyone except 'white' people wants to hire only 'their own kind' permalink parent award report block reply\nmty_green_go 11 points 5 hours ago sounds like you have been culturally enriched! Embrace your \"divershitty is out strength\"!! permalink parent award report block reply\nRydanovich 5 points 4 hours ago It's funny seeing what is or isn't under lock and key. Bars of soap? Nope. Candy? Yep. permalink parent award report block reply\niamherefortheluls 2 points 2 hours ago and can’t get a job unless you are dark white libs refuse to get this. Literally no one else, anywhere in the world, thinks racial discrimination is bad when its done for their in-group's preference. Everyone except 'white' people wants to hire only 'their own kind' permalink parent award report block reply\nBenDoverAssho 16 points 6 hours ago The Kalergi Plan is working. White replacement is a real phenomenon. The solution: 1- Our borders need to be shut, 2- legal immigration needs to be greatly reduced and limited to White Western people only, and 3- mass deportations of illegal foreigners need to be ramped up a hundred fold. Currently, I'm not sure that any of this is happening. permalink award report block reply someguy7738 12 points 6 hours ago And White people need to entirely eschew birth control and have as many children as possible. permalink parent award report block reply greatpumpkin 5 points 1 hour ago That'll never happen unless all divorce laws (& associated drek) going back 106 years are voided. permalink parent award report block reply\nsomeguy7738 12 points 6 hours ago And White people need to entirely eschew birth control and have as many children as possible. permalink parent award report block reply greatpumpkin 5 points 1 hour ago That'll never happen unless all divorce laws (& associated drek) going back 106 years are voided. permalink parent award report block reply\ngreatpumpkin 5 points 1 hour ago That'll never happen unless all divorce laws (& associated drek) going back 106 years are voided. permalink parent award report block reply\nPatriotSkorzeny 5 points 6 hours ago NC is Yemen and Mexico. It’s a tragic shame. The admins legacy. 😒 permalink award report block reply\nThune 4 points 4 hours ago This is every bit the invasion and threat that has conquered other peoples throughout history.  This must be repelled.  This is not their home.  They need to go home. permalink award report block reply BenDoverAssho 3 points 4 hours ago The people facilitating this need to be,\n\" removed\" as well. permalink parent award report block reply\nBenDoverAssho 3 points 4 hours ago The people facilitating this need to be,\n\" removed\" as well. permalink parent award report block reply\ngreatpumpkin 4 points 1 hour ago Lyndon Johnson screwed us in ways he could never imagine in 1960 ..... permalink award report block reply\nDev404 2 points 3 hours ago Obama, and Congress, were happy to replace the white people there with third world goatfuckers. permalink award report block reply\nTD_Covfefe_Crusader 1 points 31 minutes ago I had a old high school friend who moved to Minneapolis many years ago and became a Democrat. He loved 0bama and he used to mock the people in Minneapolis who were \"having a hard time\" with all the Somalis being imported. I wonder if he feels any remorse now that it has been completely overrun with Somalis and become an absolute shit hole. permalink award report block reply\nCleanUpPhillyTrump24 1 points 3 minutes ago It''s up to the patriots in Minn. to REPORT to ICE those who are illegal. Just do a little research to make the case. The ICE online tip line is for ANY SUSPICIOUS ACTIVITY, per their own website: https://www.ice.gov/webform/ice-tip-form Don't be shy. Don't be lazy. Take your nation back. permalink award report block reply\nShitsbrokeyo 1 points 1 hour ago Deport permalink award report block reply"
}