{
  "id": "1ARK9iqwqq",
  "url": "https://patriots.win/p/1ARK9iqwqq/they-tell-white-people-its-bad-t/c",
  "content": "366 They tell white people its bad to have more children, then they turn around and tell them they need to import the third world because birthrates are falling. posted 2 days ago by EthnoEuro 23 comments award share download report block\n23 comments Sort by Top Top New Worst Old Save Greenhills 16 points 2 days ago I can’t believe they actually published this. Gross. permalink award report block reply deleted 2 points 2 days ago Nat4Pat 15 points 2 days ago Nothing pisses off the jews more than white christian families starting to make as many kids as possible. Only two or three basically means facilitating the replacement by them. permalink award report block reply kekapoo1 11 points 2 days ago how ''insidious'' for a White nation to aspire to be a White nation.  ''this must be stopped'' do i sense planning here? permalink award report block reply EthnoEuro OP 2 points 2 days ago Didn't an ADL guy write down the yearly % decline of white americans on a board in his office? permalink parent award report block reply MeMargie 6 points 2 days ago A Whiter America in a country founded for the Freed White man is Logical :) permalink award report block reply perma-maga 4 points 2 days ago A psyop to destroy the United States. Fuck England permalink award report block reply TrumpAndGodWin 1 points 2 days ago MI6 is behind a lot of the tranny attacks on our children. permalink parent award report block reply SpeekFreely 3 points 2 days ago Red hats on the kids, that’s pretty good right there. permalink award report block reply SubmarineGuy 3 points 2 days ago Imagine a decline because you were too successful! Notice there is no hurry to migrate to Africa. permalink award report block reply Covfefe_And_Justice 3 points 2 days ago \"A whiter America\", so basically a high trust society? I see nothing wrong with that. permalink award report block reply Formerlurker92 3 points 2 days ago Yes, the author is. permalink award report block reply Say_what_again 3 points 2 days ago I'm 51, retired, single, debt-free, and worth more than a couple bones... I think I'm going to find a young, pretty girl, and have a couple more children. permalink award report block reply deleted 2 points 2 days ago kekapoo1 4 points 2 days ago some brackets missing permalink parent award report block reply Fuck_reddit34 1 points 2 days ago Why is ok to laud the browning of America?? permalink award report block reply Idontevenknow 1 points 2 days ago It's insidious to make more Whites, but not to gradually exterminate them, hmmm permalink award report block reply RedStoneDeepState -1 points 2 days ago Yes, we need more women from 3rd world countries to increase the birth rate. American women can go be the boss bitch, I don't want to associate with them though. permalink award report block reply Idontevenknow 1 points 2 days ago You have my upvote. You are getting downvotes from the people who don't recognize that current women have been turned to garbage. permalink parent award report block reply\nGreenhills 16 points 2 days ago I can’t believe they actually published this. Gross. permalink award report block reply deleted 2 points 2 days ago\ndeleted 2 points 2 days ago\nNat4Pat 15 points 2 days ago Nothing pisses off the jews more than white christian families starting to make as many kids as possible. Only two or three basically means facilitating the replacement by them. permalink award report block reply\nkekapoo1 11 points 2 days ago how ''insidious'' for a White nation to aspire to be a White nation.  ''this must be stopped'' do i sense planning here? permalink award report block reply EthnoEuro OP 2 points 2 days ago Didn't an ADL guy write down the yearly % decline of white americans on a board in his office? permalink parent award report block reply\nEthnoEuro OP 2 points 2 days ago Didn't an ADL guy write down the yearly % decline of white americans on a board in his office? permalink parent award report block reply\nMeMargie 6 points 2 days ago A Whiter America in a country founded for the Freed White man is Logical :) permalink award report block reply\nperma-maga 4 points 2 days ago A psyop to destroy the United States. Fuck England permalink award report block reply TrumpAndGodWin 1 points 2 days ago MI6 is behind a lot of the tranny attacks on our children. permalink parent award report block reply\nTrumpAndGodWin 1 points 2 days ago MI6 is behind a lot of the tranny attacks on our children. permalink parent award report block reply\nSpeekFreely 3 points 2 days ago Red hats on the kids, that’s pretty good right there. permalink award report block reply\nSubmarineGuy 3 points 2 days ago Imagine a decline because you were too successful! Notice there is no hurry to migrate to Africa. permalink award report block reply\nCovfefe_And_Justice 3 points 2 days ago \"A whiter America\", so basically a high trust society? I see nothing wrong with that. permalink award report block reply\nFormerlurker92 3 points 2 days ago Yes, the author is. permalink award report block reply\nSay_what_again 3 points 2 days ago I'm 51, retired, single, debt-free, and worth more than a couple bones... I think I'm going to find a young, pretty girl, and have a couple more children. permalink award report block reply\ndeleted 2 points 2 days ago kekapoo1 4 points 2 days ago some brackets missing permalink parent award report block reply\nkekapoo1 4 points 2 days ago some brackets missing permalink parent award report block reply\nFuck_reddit34 1 points 2 days ago Why is ok to laud the browning of America?? permalink award report block reply\nIdontevenknow 1 points 2 days ago It's insidious to make more Whites, but not to gradually exterminate them, hmmm permalink award report block reply\nRedStoneDeepState -1 points 2 days ago Yes, we need more women from 3rd world countries to increase the birth rate. American women can go be the boss bitch, I don't want to associate with them though. permalink award report block reply Idontevenknow 1 points 2 days ago You have my upvote. You are getting downvotes from the people who don't recognize that current women have been turned to garbage. permalink parent award report block reply\nIdontevenknow 1 points 2 days ago You have my upvote. You are getting downvotes from the people who don't recognize that current women have been turned to garbage. permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:37:50.730643Z"
}