{
  "id": "1ARK56kO08",
  "url": "https://patriots.win/p/1ARK56kO08/this-isnt-prayer-its-a-show-of-f/c",
  "content": "930 This isn't prayer. It's a show of force. posted 5 days ago by MickHigan2 84 comments award share report block RadioGenoa @RadioGenoa • 5d Even in Melbourne. Incredible.\n84 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget friarfox 78 points 5 days ago Exactly that. Islam is not a religion. It's a blueprint for conquest and subjugation. permalink award report block reply atrix 44 points 5 days ago Islam is a religion... Of conquest and subjugation. It's in the name. permalink parent award report block reply TerrorAndSlaughter 13 points 4 days ago So is Progressivism.  Progressives thought that since they had conquered most of the world through subversion that they could convert or tame anyone.  Their unique tactic is to pretend they aren't a religion so that people can convert at heart while staying among the faithful to influence them.  But the theological foundation of Islam is irrational and they can always overrule any argument.  Now the Islamo-Progressive political alliance is shifting as White people wake up from the Progressive stupor.  Like a poorly tamed attack dog turning on its owner the Islamic Umma senses the weakness of the Progressives controlling institutions. permalink parent award report block reply ClaytonMagnet 1 points 4 days ago Great observations. permalink parent award report block reply snoopy3210 0 points 4 days ago Meanwhile the deepstate modified Charlie Kirk’ battery pack to shoot him in the neck because he was promoting Christian values and bringing a generation to prayer permalink parent award report block reply MegoThor 3 points 4 days ago Tell me more about modified battery pack. permalink parent award report block reply XpatDemocrat -2 points 4 days ago There is no more, pretty stupid conspiracy theory to explain why round had no exit. permalink parent award report block reply foom 4 points 4 days ago Organization and coordination win. The guys who are coordinating are going to conquer the guys on their phones. permalink parent award report block reply MastaJoda 4 points 4 days ago FRAG OUT!! permalink parent award report block reply mikethemarine 4 points 4 days ago this would have been a good time to surround them and do what needs to be done, or just calling in a air strike permalink parent award report block reply tentigers99 1 points 4 days ago THIS,EXACTLY. Coordinate \"payer times\" through out the globe, strike and destroy completely via air, send in ground troops for any survivors. permalink parent award report block reply ConfusedAngryArmed 2 points 4 days ago It's why the only solution is to kill them. Anyone uncomfortable with that idea needs to pick up a history book. permalink parent award report block reply load 1 more comments... deleted 30 points 5 days ago Tiredofstupidpeople 22 points 4 days ago They can't defeat major western nations with head to head outright war so they figured out another way of conquest - exploit the weakness in the west due to the woke left and misplaced compassion, spread propaganda about Islamophobia, get people into political positions and the police. The western governments and media are so leftist dominated they will do nothing except villify anyone who criticizes Muslims or open door policies. Jihadis can even regularly rape and murder and this is all that happens. So called \"civilized\" nations are now easy prey for them and they know it. They speak openly about it. permalink parent award report block reply BlippiIsAPedo 4 points 4 days ago These people figured nothing out. Jews did permalink parent award report block reply Doubleu1992 2 points 4 days ago We can call them dumb and low IQ all day but they are the one taking over whole states lol we are way more low IQ for allowing it. permalink parent award report block reply BlippiIsAPedo 1 points 3 days ago Agreed permalink parent award report block reply Tiredofstupidpeople 1 points 4 days ago Yes they don't actually have any religious zeal to spread Islam. It's really jews forcing them to pray five times a day. Jews are telling the Muslims to elect Muslim politicians, otherwise they would vote for Christians. No Muslims believe in jihad unless jews tell them to. Those videos of thousands of Muslims marching in places like Canada and the UK, bowing their heads to the mat in unison? They are doing that because jews told them to or maybe just a bunch of jews in disguise. The millions of Muslims don't actually believe in their religion or try to spread it on their own, it's all just the jews. Also, you are not an idiot lmao. Now to get real. Islam is a real thing, it's the fastest growing religion in the world and the people in it believe in it. Wake the fuck up before your one track mind turns you into a complete moron. Not every single nefarious thing in the world is because of jews. There's a lot of evil people out in the world that don't need any help in choosing to be evil. permalink parent award report block reply Metal4Freedom 11 points 5 days ago Yet...maybe Whitey can wake up swiftly. permalink parent award report block reply TrumpForPresident 8 points 4 days ago Here's a simple to-do list for those who can do something about it: Deport Impose a travel ban permalink parent award report block reply gaijin_ronin 3 points 4 days ago Ban practice of this cult. Strip citizenship of cult members. Treat as enemy combatants.  Those that refuse to leave are physically removed or executed for being terrorists. permalink parent award report block reply KennyKetchem 4 points 4 days ago Make them feel unwelcome. permalink parent award report block reply rattleS -1 points 4 days ago Why should western men do anything about it? To protect western women which betrayed us? To protect homosexuals? lol permalink parent award report block reply Saxonlady 3 points 4 days ago Don't care. Do nothing then. It's you who'll have to live through decades of the result of your inaction, not me. That'll teach those pesky women a lesson eh! permalink parent award report block reply Gofuys 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply 2Fangz 23 points 5 days ago How about a volume warning? You just ran off all of my goats! permalink award report block reply Deplorable556 11 points 4 days ago under rated kek comment of the day permalink parent award report block reply emorphia 19 points 4 days ago you know that they never do these prayers in the middle east.\nnot so open in public in mass.\nthey do this in every country they want to conquer. and the west lets them do it because they are afraid to be called racist. permalink award report block reply I-am-Orlando PRO 3 points 4 days ago Can verify. Been to the middle east. Nobody prays outside. It's viewed as disrespectful. permalink parent award report block reply infinitysupreme 13 points 4 days ago Honest first thought:   what a convenient formation for napalming permalink award report block reply localhost 7 points 4 days ago I was like, one MOAB would fix all that. permalink parent award report block reply EDDIT_IS_CUCKED 4 points 4 days ago I was thinking a mortar, but to each his own. permalink parent award report block reply Brundlefly78 3 points 4 days ago I love the smell of napalmed Muslims in the morning. permalink parent award report block reply Toobin247 3 points 4 days ago First thing I thought was they are pretty easy to find in a large gathering. permalink parent award report block reply RuprechtThaMonkeyBoy 10 points 5 days ago Disgusting permalink award report block reply CheeseAndOnion 8 points 4 days ago Time to start eliminating the invaders permalink award report block reply GuerillaYourDreams 1 points 4 days ago All one billion of them??!! permalink parent award report block reply CheeseAndOnion 7 points 4 days ago Gotta start somewhere permalink parent award report block reply BillGateCanSuckIt 6 points 4 days ago If they gather in mass, really easy to wipe out a group all at once in Minecraft permalink parent award report block reply XpatDemocrat 1 points 4 days ago Make drones that target people facing east at prayer time. Either you can stop praying and live, or kiss tge ground and die like a dog permalink parent award report block reply Klown_Kutz 4 points 4 days ago Yes. permalink parent award report block reply Counterwhat 6 points 4 days ago If you don't defend your religion they will impose theirs permalink award report block reply TrumpYouMagaFrenner 4 points 5 days ago Retards assembling permalink award report block reply Deplorable556 4 points 5 days ago ...can suck my white christian nutsac permalink award report block reply The_Morrow_Outlander 3 points 4 days ago Ew, gross! You'll catch something nasty from them, don't risk your health like that. permalink parent award report block reply The_Morrow_Outlander 3 points 4 days ago Repulsive mudslimes. permalink award report block reply RetainedByLucifer 3 points 4 days ago These should be met with people holding huge pictures of retard-Muhammad with a bomb in his turban. Hold them in the direction they are bowing. permalink award report block reply Bramage 3 points 4 days ago Yes, on your knees, bitches...stay there. permalink award report block reply katsumi27 3 points 4 days ago Crazy thing is that youll blame a woman for letting this happen. permalink award report block reply 1MonkeyJr 0 points 4 days ago If the shoe fits, Cinderella… permalink parent award report block reply katsumi27 3 points 4 days ago Liberal women and liberal men are the most dangerous people on the planet.  Excuse me., joooooos are too permalink parent award report block reply shaaarbucks 3 points 4 days ago This is exactly why I started going to church. permalink award report block reply airborne3502 3 points 4 days ago These fuckers can pray anywhere. A mosque, for example. permalink award report block reply KennyKetchem 3 points 4 days ago If you don't make them feel uncomfortable when they are in public then you are a fucking coward leaving it up to everyone one day having to kill these fucking drones. It is why we are where we are now. Call them pigs and tell them they worship a pedophile in front of everyone. It is the least you can do. permalink award report block reply AFPede 2 points 4 days ago Target rich environment. permalink award report block reply Zippitydoodah 2 points 4 days ago CRUSADES NOW permalink award report block reply IlhansBrother 2 points 4 days ago native populations are powerless against organized mass invasions permalink award report block reply QSWO1 4 points 4 days ago You sure about that? permalink parent award report block reply foom -1 points 4 days ago Ya permalink parent award report block reply QSWO1 2 points 4 days ago To a point. It has yet to be proven in the US. permalink parent award report block reply rattleS 2 points 4 days ago I am gonna watch and laugh as they put women back into the kitchen and slaughter the homosexuals. permalink award report block reply MediaBro 2 points 4 days ago Even in Melbourne? Dude, Melbourne is the epicentre of wokery in Australia. It's mosques have literally sent terrorists to ISIS. But this isn't also as bad on you guys think it is. Most Aussies give zero fks about these guys and mostly laugh them off. permalink award report block reply Fusion360 1 points 4 days ago They will rue the day! permalink parent award report block reply MediaBro 1 points 3 days ago They're mostly a nuisance permalink parent award report block reply XpatDemocrat 2 points 4 days ago An Mg42 would solve this right quick permalink award report block reply Lochnessmonster1 2 points 4 days ago Truth is desert people are brought in by the Ferengi. Never forget that. permalink award report block reply MiltonThomasX 1 points 4 days ago Hmmm.  A place where only men meet? Out in the countryside?  Giving homage to the man they follow.. A military leader who conquered western culture in the past?  Looks like  a militia to me.... permalink award report block reply SaltyTitties4 1 points 4 days ago Also- gross. permalink award report block reply Oodles 1 points 4 days ago Caliphate Deus vult permalink award report block reply progressives4Trump 1 points 4 days ago And we let them because we are freedom loving individuals.  We sow the seeds of our own demise by not being ruthless cut-throats. permalink award report block reply Dwoj 1 points 4 days ago I thought they had buildings to do all of this. Why do they have to do this out and open? permalink award report block reply phro 1 points 4 days ago Get sober. Get fit. Get ready. permalink award report block reply GrizzlyT55 1 points 4 days ago How is this incredible? More like predictable? permalink award report block reply greatpumpkin 1 points 4 days ago If you ever needed a herd of rampaging feral pigs, it was right then .... permalink award report block reply Keep_on_winning_kag 1 points 4 days ago Drop a bomb on these shit stains. permalink award report block reply Constitution_1788 1 points 4 days ago I tend to really, really agree with the headline here… permalink award report block reply Riehlpissed 1 points 4 days ago They are giving us warning of what’s to come. permalink award report block reply PepesJusticeBoner 1 points 4 days ago Where's a huge swarm of drones to drop raw bacon when you need one? permalink award report block reply knnbccb 1 points 4 days ago Pedo Warlord cultists doing pedo warlord things. (Surprised Pikachu face) permalink award report block reply QSWO1 1 points 4 days ago I look forward to seeing that. permalink award report block reply RememberCharlieKirk 1 points 4 days ago Comment removed by community moderators. permalink award report block reply corporateshizer 1 points 5 days ago Comment removed by community moderators. permalink award report block reply HoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nfriarfox 78 points 5 days ago Exactly that. Islam is not a religion. It's a blueprint for conquest and subjugation. permalink award report block reply atrix 44 points 5 days ago Islam is a religion... Of conquest and subjugation. It's in the name. permalink parent award report block reply TerrorAndSlaughter 13 points 4 days ago So is Progressivism.  Progressives thought that since they had conquered most of the world through subversion that they could convert or tame anyone.  Their unique tactic is to pretend they aren't a religion so that people can convert at heart while staying among the faithful to influence them.  But the theological foundation of Islam is irrational and they can always overrule any argument.  Now the Islamo-Progressive political alliance is shifting as White people wake up from the Progressive stupor.  Like a poorly tamed attack dog turning on its owner the Islamic Umma senses the weakness of the Progressives controlling institutions. permalink parent award report block reply ClaytonMagnet 1 points 4 days ago Great observations. permalink parent award report block reply snoopy3210 0 points 4 days ago Meanwhile the deepstate modified Charlie Kirk’ battery pack to shoot him in the neck because he was promoting Christian values and bringing a generation to prayer permalink parent award report block reply MegoThor 3 points 4 days ago Tell me more about modified battery pack. permalink parent award report block reply XpatDemocrat -2 points 4 days ago There is no more, pretty stupid conspiracy theory to explain why round had no exit. permalink parent award report block reply foom 4 points 4 days ago Organization and coordination win. The guys who are coordinating are going to conquer the guys on their phones. permalink parent award report block reply MastaJoda 4 points 4 days ago FRAG OUT!! permalink parent award report block reply mikethemarine 4 points 4 days ago this would have been a good time to surround them and do what needs to be done, or just calling in a air strike permalink parent award report block reply tentigers99 1 points 4 days ago THIS,EXACTLY. Coordinate \"payer times\" through out the globe, strike and destroy completely via air, send in ground troops for any survivors. permalink parent award report block reply ConfusedAngryArmed 2 points 4 days ago It's why the only solution is to kill them. Anyone uncomfortable with that idea needs to pick up a history book. permalink parent award report block reply load 1 more comments...\natrix 44 points 5 days ago Islam is a religion... Of conquest and subjugation. It's in the name. permalink parent award report block reply TerrorAndSlaughter 13 points 4 days ago So is Progressivism.  Progressives thought that since they had conquered most of the world through subversion that they could convert or tame anyone.  Their unique tactic is to pretend they aren't a religion so that people can convert at heart while staying among the faithful to influence them.  But the theological foundation of Islam is irrational and they can always overrule any argument.  Now the Islamo-Progressive political alliance is shifting as White people wake up from the Progressive stupor.  Like a poorly tamed attack dog turning on its owner the Islamic Umma senses the weakness of the Progressives controlling institutions. permalink parent award report block reply ClaytonMagnet 1 points 4 days ago Great observations. permalink parent award report block reply snoopy3210 0 points 4 days ago Meanwhile the deepstate modified Charlie Kirk’ battery pack to shoot him in the neck because he was promoting Christian values and bringing a generation to prayer permalink parent award report block reply MegoThor 3 points 4 days ago Tell me more about modified battery pack. permalink parent award report block reply XpatDemocrat -2 points 4 days ago There is no more, pretty stupid conspiracy theory to explain why round had no exit. permalink parent award report block reply\nTerrorAndSlaughter 13 points 4 days ago So is Progressivism.  Progressives thought that since they had conquered most of the world through subversion that they could convert or tame anyone.  Their unique tactic is to pretend they aren't a religion so that people can convert at heart while staying among the faithful to influence them.  But the theological foundation of Islam is irrational and they can always overrule any argument.  Now the Islamo-Progressive political alliance is shifting as White people wake up from the Progressive stupor.  Like a poorly tamed attack dog turning on its owner the Islamic Umma senses the weakness of the Progressives controlling institutions. permalink parent award report block reply ClaytonMagnet 1 points 4 days ago Great observations. permalink parent award report block reply\nClaytonMagnet 1 points 4 days ago Great observations. permalink parent award report block reply\nsnoopy3210 0 points 4 days ago Meanwhile the deepstate modified Charlie Kirk’ battery pack to shoot him in the neck because he was promoting Christian values and bringing a generation to prayer permalink parent award report block reply MegoThor 3 points 4 days ago Tell me more about modified battery pack. permalink parent award report block reply XpatDemocrat -2 points 4 days ago There is no more, pretty stupid conspiracy theory to explain why round had no exit. permalink parent award report block reply\nMegoThor 3 points 4 days ago Tell me more about modified battery pack. permalink parent award report block reply XpatDemocrat -2 points 4 days ago There is no more, pretty stupid conspiracy theory to explain why round had no exit. permalink parent award report block reply\nXpatDemocrat -2 points 4 days ago There is no more, pretty stupid conspiracy theory to explain why round had no exit. permalink parent award report block reply\nfoom 4 points 4 days ago Organization and coordination win. The guys who are coordinating are going to conquer the guys on their phones. permalink parent award report block reply\nMastaJoda 4 points 4 days ago FRAG OUT!! permalink parent award report block reply\nmikethemarine 4 points 4 days ago this would have been a good time to surround them and do what needs to be done, or just calling in a air strike permalink parent award report block reply tentigers99 1 points 4 days ago THIS,EXACTLY. Coordinate \"payer times\" through out the globe, strike and destroy completely via air, send in ground troops for any survivors. permalink parent award report block reply\ntentigers99 1 points 4 days ago THIS,EXACTLY. Coordinate \"payer times\" through out the globe, strike and destroy completely via air, send in ground troops for any survivors. permalink parent award report block reply\nConfusedAngryArmed 2 points 4 days ago It's why the only solution is to kill them. Anyone uncomfortable with that idea needs to pick up a history book. permalink parent award report block reply\ndeleted 30 points 5 days ago Tiredofstupidpeople 22 points 4 days ago They can't defeat major western nations with head to head outright war so they figured out another way of conquest - exploit the weakness in the west due to the woke left and misplaced compassion, spread propaganda about Islamophobia, get people into political positions and the police. The western governments and media are so leftist dominated they will do nothing except villify anyone who criticizes Muslims or open door policies. Jihadis can even regularly rape and murder and this is all that happens. So called \"civilized\" nations are now easy prey for them and they know it. They speak openly about it. permalink parent award report block reply BlippiIsAPedo 4 points 4 days ago These people figured nothing out. Jews did permalink parent award report block reply Doubleu1992 2 points 4 days ago We can call them dumb and low IQ all day but they are the one taking over whole states lol we are way more low IQ for allowing it. permalink parent award report block reply BlippiIsAPedo 1 points 3 days ago Agreed permalink parent award report block reply Tiredofstupidpeople 1 points 4 days ago Yes they don't actually have any religious zeal to spread Islam. It's really jews forcing them to pray five times a day. Jews are telling the Muslims to elect Muslim politicians, otherwise they would vote for Christians. No Muslims believe in jihad unless jews tell them to. Those videos of thousands of Muslims marching in places like Canada and the UK, bowing their heads to the mat in unison? They are doing that because jews told them to or maybe just a bunch of jews in disguise. The millions of Muslims don't actually believe in their religion or try to spread it on their own, it's all just the jews. Also, you are not an idiot lmao. Now to get real. Islam is a real thing, it's the fastest growing religion in the world and the people in it believe in it. Wake the fuck up before your one track mind turns you into a complete moron. Not every single nefarious thing in the world is because of jews. There's a lot of evil people out in the world that don't need any help in choosing to be evil. permalink parent award report block reply Metal4Freedom 11 points 5 days ago Yet...maybe Whitey can wake up swiftly. permalink parent award report block reply TrumpForPresident 8 points 4 days ago Here's a simple to-do list for those who can do something about it: Deport Impose a travel ban permalink parent award report block reply gaijin_ronin 3 points 4 days ago Ban practice of this cult. Strip citizenship of cult members. Treat as enemy combatants.  Those that refuse to leave are physically removed or executed for being terrorists. permalink parent award report block reply KennyKetchem 4 points 4 days ago Make them feel unwelcome. permalink parent award report block reply rattleS -1 points 4 days ago Why should western men do anything about it? To protect western women which betrayed us? To protect homosexuals? lol permalink parent award report block reply Saxonlady 3 points 4 days ago Don't care. Do nothing then. It's you who'll have to live through decades of the result of your inaction, not me. That'll teach those pesky women a lesson eh! permalink parent award report block reply Gofuys 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nTiredofstupidpeople 22 points 4 days ago They can't defeat major western nations with head to head outright war so they figured out another way of conquest - exploit the weakness in the west due to the woke left and misplaced compassion, spread propaganda about Islamophobia, get people into political positions and the police. The western governments and media are so leftist dominated they will do nothing except villify anyone who criticizes Muslims or open door policies. Jihadis can even regularly rape and murder and this is all that happens. So called \"civilized\" nations are now easy prey for them and they know it. They speak openly about it. permalink parent award report block reply BlippiIsAPedo 4 points 4 days ago These people figured nothing out. Jews did permalink parent award report block reply Doubleu1992 2 points 4 days ago We can call them dumb and low IQ all day but they are the one taking over whole states lol we are way more low IQ for allowing it. permalink parent award report block reply BlippiIsAPedo 1 points 3 days ago Agreed permalink parent award report block reply Tiredofstupidpeople 1 points 4 days ago Yes they don't actually have any religious zeal to spread Islam. It's really jews forcing them to pray five times a day. Jews are telling the Muslims to elect Muslim politicians, otherwise they would vote for Christians. No Muslims believe in jihad unless jews tell them to. Those videos of thousands of Muslims marching in places like Canada and the UK, bowing their heads to the mat in unison? They are doing that because jews told them to or maybe just a bunch of jews in disguise. The millions of Muslims don't actually believe in their religion or try to spread it on their own, it's all just the jews. Also, you are not an idiot lmao. Now to get real. Islam is a real thing, it's the fastest growing religion in the world and the people in it believe in it. Wake the fuck up before your one track mind turns you into a complete moron. Not every single nefarious thing in the world is because of jews. There's a lot of evil people out in the world that don't need any help in choosing to be evil. permalink parent award report block reply\nBlippiIsAPedo 4 points 4 days ago These people figured nothing out. Jews did permalink parent award report block reply Doubleu1992 2 points 4 days ago We can call them dumb and low IQ all day but they are the one taking over whole states lol we are way more low IQ for allowing it. permalink parent award report block reply BlippiIsAPedo 1 points 3 days ago Agreed permalink parent award report block reply Tiredofstupidpeople 1 points 4 days ago Yes they don't actually have any religious zeal to spread Islam. It's really jews forcing them to pray five times a day. Jews are telling the Muslims to elect Muslim politicians, otherwise they would vote for Christians. No Muslims believe in jihad unless jews tell them to. Those videos of thousands of Muslims marching in places like Canada and the UK, bowing their heads to the mat in unison? They are doing that because jews told them to or maybe just a bunch of jews in disguise. The millions of Muslims don't actually believe in their religion or try to spread it on their own, it's all just the jews. Also, you are not an idiot lmao. Now to get real. Islam is a real thing, it's the fastest growing religion in the world and the people in it believe in it. Wake the fuck up before your one track mind turns you into a complete moron. Not every single nefarious thing in the world is because of jews. There's a lot of evil people out in the world that don't need any help in choosing to be evil. permalink parent award report block reply\nDoubleu1992 2 points 4 days ago We can call them dumb and low IQ all day but they are the one taking over whole states lol we are way more low IQ for allowing it. permalink parent award report block reply BlippiIsAPedo 1 points 3 days ago Agreed permalink parent award report block reply\nBlippiIsAPedo 1 points 3 days ago Agreed permalink parent award report block reply\nTiredofstupidpeople 1 points 4 days ago Yes they don't actually have any religious zeal to spread Islam. It's really jews forcing them to pray five times a day. Jews are telling the Muslims to elect Muslim politicians, otherwise they would vote for Christians. No Muslims believe in jihad unless jews tell them to. Those videos of thousands of Muslims marching in places like Canada and the UK, bowing their heads to the mat in unison? They are doing that because jews told them to or maybe just a bunch of jews in disguise. The millions of Muslims don't actually believe in their religion or try to spread it on their own, it's all just the jews. Also, you are not an idiot lmao. Now to get real. Islam is a real thing, it's the fastest growing religion in the world and the people in it believe in it. Wake the fuck up before your one track mind turns you into a complete moron. Not every single nefarious thing in the world is because of jews. There's a lot of evil people out in the world that don't need any help in choosing to be evil. permalink parent award report block reply\nMetal4Freedom 11 points 5 days ago Yet...maybe Whitey can wake up swiftly. permalink parent award report block reply\nTrumpForPresident 8 points 4 days ago Here's a simple to-do list for those who can do something about it: Deport Impose a travel ban permalink parent award report block reply gaijin_ronin 3 points 4 days ago Ban practice of this cult. Strip citizenship of cult members. Treat as enemy combatants.  Those that refuse to leave are physically removed or executed for being terrorists. permalink parent award report block reply\ngaijin_ronin 3 points 4 days ago Ban practice of this cult. Strip citizenship of cult members. Treat as enemy combatants.  Those that refuse to leave are physically removed or executed for being terrorists. permalink parent award report block reply\nKennyKetchem 4 points 4 days ago Make them feel unwelcome. permalink parent award report block reply\nrattleS -1 points 4 days ago Why should western men do anything about it? To protect western women which betrayed us? To protect homosexuals? lol permalink parent award report block reply Saxonlady 3 points 4 days ago Don't care. Do nothing then. It's you who'll have to live through decades of the result of your inaction, not me. That'll teach those pesky women a lesson eh! permalink parent award report block reply Gofuys 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nSaxonlady 3 points 4 days ago Don't care. Do nothing then. It's you who'll have to live through decades of the result of your inaction, not me. That'll teach those pesky women a lesson eh! permalink parent award report block reply Gofuys 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nGofuys 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\n2Fangz 23 points 5 days ago How about a volume warning? You just ran off all of my goats! permalink award report block reply Deplorable556 11 points 4 days ago under rated kek comment of the day permalink parent award report block reply\nDeplorable556 11 points 4 days ago under rated kek comment of the day permalink parent award report block reply\nemorphia 19 points 4 days ago you know that they never do these prayers in the middle east.\nnot so open in public in mass.\nthey do this in every country they want to conquer. and the west lets them do it because they are afraid to be called racist. permalink award report block reply I-am-Orlando PRO 3 points 4 days ago Can verify. Been to the middle east. Nobody prays outside. It's viewed as disrespectful. permalink parent award report block reply\nI-am-Orlando PRO 3 points 4 days ago Can verify. Been to the middle east. Nobody prays outside. It's viewed as disrespectful. permalink parent award report block reply\ninfinitysupreme 13 points 4 days ago Honest first thought:   what a convenient formation for napalming permalink award report block reply localhost 7 points 4 days ago I was like, one MOAB would fix all that. permalink parent award report block reply EDDIT_IS_CUCKED 4 points 4 days ago I was thinking a mortar, but to each his own. permalink parent award report block reply Brundlefly78 3 points 4 days ago I love the smell of napalmed Muslims in the morning. permalink parent award report block reply Toobin247 3 points 4 days ago First thing I thought was they are pretty easy to find in a large gathering. permalink parent award report block reply\nlocalhost 7 points 4 days ago I was like, one MOAB would fix all that. permalink parent award report block reply\nEDDIT_IS_CUCKED 4 points 4 days ago I was thinking a mortar, but to each his own. permalink parent award report block reply\nBrundlefly78 3 points 4 days ago I love the smell of napalmed Muslims in the morning. permalink parent award report block reply\nToobin247 3 points 4 days ago First thing I thought was they are pretty easy to find in a large gathering. permalink parent award report block reply\nRuprechtThaMonkeyBoy 10 points 5 days ago Disgusting permalink award report block reply\nCheeseAndOnion 8 points 4 days ago Time to start eliminating the invaders permalink award report block reply GuerillaYourDreams 1 points 4 days ago All one billion of them??!! permalink parent award report block reply CheeseAndOnion 7 points 4 days ago Gotta start somewhere permalink parent award report block reply BillGateCanSuckIt 6 points 4 days ago If they gather in mass, really easy to wipe out a group all at once in Minecraft permalink parent award report block reply XpatDemocrat 1 points 4 days ago Make drones that target people facing east at prayer time. Either you can stop praying and live, or kiss tge ground and die like a dog permalink parent award report block reply Klown_Kutz 4 points 4 days ago Yes. permalink parent award report block reply\nGuerillaYourDreams 1 points 4 days ago All one billion of them??!! permalink parent award report block reply CheeseAndOnion 7 points 4 days ago Gotta start somewhere permalink parent award report block reply BillGateCanSuckIt 6 points 4 days ago If they gather in mass, really easy to wipe out a group all at once in Minecraft permalink parent award report block reply XpatDemocrat 1 points 4 days ago Make drones that target people facing east at prayer time. Either you can stop praying and live, or kiss tge ground and die like a dog permalink parent award report block reply Klown_Kutz 4 points 4 days ago Yes. permalink parent award report block reply\nCheeseAndOnion 7 points 4 days ago Gotta start somewhere permalink parent award report block reply BillGateCanSuckIt 6 points 4 days ago If they gather in mass, really easy to wipe out a group all at once in Minecraft permalink parent award report block reply XpatDemocrat 1 points 4 days ago Make drones that target people facing east at prayer time. Either you can stop praying and live, or kiss tge ground and die like a dog permalink parent award report block reply\nBillGateCanSuckIt 6 points 4 days ago If they gather in mass, really easy to wipe out a group all at once in Minecraft permalink parent award report block reply XpatDemocrat 1 points 4 days ago Make drones that target people facing east at prayer time. Either you can stop praying and live, or kiss tge ground and die like a dog permalink parent award report block reply\nXpatDemocrat 1 points 4 days ago Make drones that target people facing east at prayer time. Either you can stop praying and live, or kiss tge ground and die like a dog permalink parent award report block reply\nKlown_Kutz 4 points 4 days ago Yes. permalink parent award report block reply\nCounterwhat 6 points 4 days ago If you don't defend your religion they will impose theirs permalink award report block reply\nTrumpYouMagaFrenner 4 points 5 days ago Retards assembling permalink award report block reply\nDeplorable556 4 points 5 days ago ...can suck my white christian nutsac permalink award report block reply The_Morrow_Outlander 3 points 4 days ago Ew, gross! You'll catch something nasty from them, don't risk your health like that. permalink parent award report block reply\nThe_Morrow_Outlander 3 points 4 days ago Ew, gross! You'll catch something nasty from them, don't risk your health like that. permalink parent award report block reply\nThe_Morrow_Outlander 3 points 4 days ago Repulsive mudslimes. permalink award report block reply\nRetainedByLucifer 3 points 4 days ago These should be met with people holding huge pictures of retard-Muhammad with a bomb in his turban. Hold them in the direction they are bowing. permalink award report block reply\nBramage 3 points 4 days ago Yes, on your knees, bitches...stay there. permalink award report block reply\nkatsumi27 3 points 4 days ago Crazy thing is that youll blame a woman for letting this happen. permalink award report block reply 1MonkeyJr 0 points 4 days ago If the shoe fits, Cinderella… permalink parent award report block reply katsumi27 3 points 4 days ago Liberal women and liberal men are the most dangerous people on the planet.  Excuse me., joooooos are too permalink parent award report block reply\n1MonkeyJr 0 points 4 days ago If the shoe fits, Cinderella… permalink parent award report block reply katsumi27 3 points 4 days ago Liberal women and liberal men are the most dangerous people on the planet.  Excuse me., joooooos are too permalink parent award report block reply\nkatsumi27 3 points 4 days ago Liberal women and liberal men are the most dangerous people on the planet.  Excuse me., joooooos are too permalink parent award report block reply\nshaaarbucks 3 points 4 days ago This is exactly why I started going to church. permalink award report block reply\nairborne3502 3 points 4 days ago These fuckers can pray anywhere. A mosque, for example. permalink award report block reply\nKennyKetchem 3 points 4 days ago If you don't make them feel uncomfortable when they are in public then you are a fucking coward leaving it up to everyone one day having to kill these fucking drones. It is why we are where we are now. Call them pigs and tell them they worship a pedophile in front of everyone. It is the least you can do. permalink award report block reply\nAFPede 2 points 4 days ago Target rich environment. permalink award report block reply\nZippitydoodah 2 points 4 days ago CRUSADES NOW permalink award report block reply\nIlhansBrother 2 points 4 days ago native populations are powerless against organized mass invasions permalink award report block reply QSWO1 4 points 4 days ago You sure about that? permalink parent award report block reply foom -1 points 4 days ago Ya permalink parent award report block reply QSWO1 2 points 4 days ago To a point. It has yet to be proven in the US. permalink parent award report block reply\nQSWO1 4 points 4 days ago You sure about that? permalink parent award report block reply foom -1 points 4 days ago Ya permalink parent award report block reply QSWO1 2 points 4 days ago To a point. It has yet to be proven in the US. permalink parent award report block reply\nfoom -1 points 4 days ago Ya permalink parent award report block reply QSWO1 2 points 4 days ago To a point. It has yet to be proven in the US. permalink parent award report block reply\nQSWO1 2 points 4 days ago To a point. It has yet to be proven in the US. permalink parent award report block reply\nrattleS 2 points 4 days ago I am gonna watch and laugh as they put women back into the kitchen and slaughter the homosexuals. permalink award report block reply\nMediaBro 2 points 4 days ago Even in Melbourne? Dude, Melbourne is the epicentre of wokery in Australia. It's mosques have literally sent terrorists to ISIS. But this isn't also as bad on you guys think it is. Most Aussies give zero fks about these guys and mostly laugh them off. permalink award report block reply Fusion360 1 points 4 days ago They will rue the day! permalink parent award report block reply MediaBro 1 points 3 days ago They're mostly a nuisance permalink parent award report block reply\nFusion360 1 points 4 days ago They will rue the day! permalink parent award report block reply MediaBro 1 points 3 days ago They're mostly a nuisance permalink parent award report block reply\nMediaBro 1 points 3 days ago They're mostly a nuisance permalink parent award report block reply\nXpatDemocrat 2 points 4 days ago An Mg42 would solve this right quick permalink award report block reply\nLochnessmonster1 2 points 4 days ago Truth is desert people are brought in by the Ferengi. Never forget that. permalink award report block reply\nMiltonThomasX 1 points 4 days ago Hmmm.  A place where only men meet? Out in the countryside?  Giving homage to the man they follow.. A military leader who conquered western culture in the past?  Looks like  a militia to me.... permalink award report block reply\nSaltyTitties4 1 points 4 days ago Also- gross. permalink award report block reply\nOodles 1 points 4 days ago Caliphate Deus vult permalink award report block reply\nprogressives4Trump 1 points 4 days ago And we let them because we are freedom loving individuals.  We sow the seeds of our own demise by not being ruthless cut-throats. permalink award report block reply\nDwoj 1 points 4 days ago I thought they had buildings to do all of this. Why do they have to do this out and open? permalink award report block reply\nphro 1 points 4 days ago Get sober. Get fit. Get ready. permalink award report block reply\nGrizzlyT55 1 points 4 days ago How is this incredible? More like predictable? permalink award report block reply\ngreatpumpkin 1 points 4 days ago If you ever needed a herd of rampaging feral pigs, it was right then .... permalink award report block reply\nKeep_on_winning_kag 1 points 4 days ago Drop a bomb on these shit stains. permalink award report block reply\nConstitution_1788 1 points 4 days ago I tend to really, really agree with the headline here… permalink award report block reply\nRiehlpissed 1 points 4 days ago They are giving us warning of what’s to come. permalink award report block reply\nPepesJusticeBoner 1 points 4 days ago Where's a huge swarm of drones to drop raw bacon when you need one? permalink award report block reply\nknnbccb 1 points 4 days ago Pedo Warlord cultists doing pedo warlord things. (Surprised Pikachu face) permalink award report block reply\nQSWO1 1 points 4 days ago I look forward to seeing that. permalink award report block reply\nRememberCharlieKirk 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\ncorporateshizer 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nHoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T22:53:44.649470Z"
}