{
  "id": "1ARK513aS2",
  "url": "https://patriots.win/p/1ARK513aS2/kansas-mayor-charged-with-allege/c",
  "content": "1437 Kansas mayor charged with allegedly voting as non-citizen in elections (justthenews.com) posted 6 days ago by Sea_Still 73 comments award share report block Kansas mayor charged with allegedly voting as non-citizen in elections Coldwater Mayor Joe Ceballos, who is a lawful permanent resident from Mexico, allegedly voted in elections in 2022, 2023, and 2024 justthenews.com\n73 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style TooTrue-translation 59 points 6 days ago This raises the question, what did the Biden regime do in terms of \"federal oversight\" of elections that meant anything? We need election integrity overhaul big time, and Trump is really good at enforcing laws/policies already in place. permalink award report block reply Chickensaurus 42 points 6 days ago They made sure illegals could vote. permalink parent award report block reply IForgotToAddAnEmail 15 points 6 days ago Was the whole 'Mail in Ballot' scam taking care of or are they all still doing that? Maybe some states made laws to stop it but, doubt any blues did. permalink parent award report block reply Chickensaurus 6 points 6 days ago Trump is simply a \"dead cat bounce\" for our nation. We're all too weak and comfortable to do what strong men before us did. permalink parent award report block reply Steve56775 4 points 6 days ago They are still doing it. Nevada has both motor-voter and cheat by mail and five days post election to count “ballots” for the “winner”! permalink parent award report block reply mohel 1 points 6 days ago Now do all the west coast states  - California, Oregon and Washington permalink parent award report block reply jml1997 6 points 6 days ago Could or let?\nCould means they changed laws to allow illegals to vote. Let means they didn't change any laws and can give plausible deniability when confronted about illegals voting in our elections. permalink parent award report block reply Chickensaurus 3 points 6 days ago They made sure that the mechanism is in place so that an I'll can vote if that illegal so chooses to. Or, in some cases, the ballots get generated and the illegal votes whether they know it or not. permalink parent award report block reply Steve56775 2 points 6 days ago Otherwise they have no purpose. permalink parent award report block reply Malfunction 53 points 6 days ago How the fuck is a non-citizen elected mayor? permalink award report block reply Krat 40 points 6 days ago We arent a country anymore... just a market to be conquered by others permalink parent award report block reply NonbinaryPotatohead 8 points 6 days ago those on the hill all know by now that we are a Corporation with a PRESIDENT. permalink parent award report block reply XlDEN 7 points 6 days ago Yes, consider that the new mayor has had absolutely NO fears of being deported. permalink parent award report block reply HoganT 1 points 6 days ago Because he’s… Legal? permalink parent award report block reply MocksFordComma 3 points 6 days ago We aren't a country - just a marketplace of borrowers from the individual right straight up to the federal government. permalink parent award report block reply Spiritof2015 9 points 6 days ago He can't vote for mayor but he can be the mayor? Fucked. permalink parent award report block reply MikeTruk 6 points 6 days ago Thank you. permalink parent award report block reply Patriot4TN 4 points 6 days ago Ask Obama how he became President. permalink parent award report block reply rebuildingMyself 4 points 6 days ago Liberal women, their soyboy beta orbiters, fellow illegals, and first generation foreigners who are technically legal on paper but have zero allegiance to their new home. permalink parent award report block reply load 1 more comments... socal_maga 29 points 6 days ago A resident from Mexico...holding public office...voting in our elections. Am I a retarded, or is this shit pretty fuckin simple to resolve? permalink award report block reply killedmytv 7 points 6 days ago The only thing keeping so many problems from getting resolved is our own justice system that is just as, or more likely to punish its own subjects for doing what needs to be done than punishing the invaders among us for breaking the law. permalink parent award report block reply deleted 5 points 6 days ago Recken 5 points 6 days ago and the other party sitting idly by twittering their thumbs. permalink parent award report block reply AlohaChris 1 points 6 days ago There is only one party, the Uniparty, and MAGA. permalink parent award report block reply Filo76 4 points 6 days ago Deportation would work quite well. Where’s ice? permalink parent award report block reply mailinvoter 18 points 6 days ago The Secretary of State in Kansas, who ironically(?) has the last name Schwab, is a fucking pathetic globalhomo retard. He said he felt Kansas elections are secure, but this shit happens under his watch. permalink award report block reply NY2KCMO1776 7 points 6 days ago When I had to switch to a kansas drivers license in 2024, I went to THE DMV in Johnson County.   I was one of the few people that spoke English in the office.  After I got my license I looked at the paperwork.  There it was written in big bold letters that you don't have to be a citizen or prove citizenship to vote in elections.  Yes that's right.  I went to the ks attorney general website and it said the same thing.  You could sign an affidavit allowing you to vote without providing any documents to verify who you are. I reached Out to Kris Kobach personally and Info wars.  I got the info out about this.  I was trying to sound the alarm before the election. Now the info about the affidavit is gone off their website.  Hopefully this stopped illegals from voting permalink parent award report block reply N14205ST205 1 points 6 days ago Fellow JoCo resident here. Respect! Thanks for standing up for what's right and getting the word out there. permalink parent award report block reply OldGreg 13 points 6 days ago My question is:  how?  We have voting ID to the point that you have to scan your state ID for ballot eligibility.  What the fuck were they doing? permalink award report block reply Krat 12 points 6 days ago Rigging and enslaving you... 0 arrests so far permalink parent award report block reply UCantStumpTheTrump 1 points 6 days ago Comey, Bolton and Letitia James would like a word permalink parent award report block reply NY2KCMO1776 5 points 6 days ago When I had to switch to a kansas drivers license in 2024, I went to THE DMV in Johnson County.   I was one of the few people that spoke English in the office.  After I got my license I looked at the paperwork.  There it was written in big bold letters that you don't have to be a citizen or prove citizenship to vote in elections.  Yes that's right.  I went to the ks attorney general website and it said the same thing.  You could sign an affidavit allowing you to vote without providing any documents to verify who you are. I reached Out to Kris Kobach personally and Info wars.  I got the info out about this.  I was trying to sound the alarm before the election. Now the info about the affidavit is gone off their website.  Hopefully this stopped illegals from voting permalink parent award report block reply OldGreg 1 points 6 days ago That explains Laura Kelly permalink parent award report block reply drmrboy 11 points 6 days ago Sounds illegal.  Maybe an arrest might be in order.  Two weeks?  🤔🤓 permalink award report block reply jml1997 3 points 6 days ago Sorry the best I can do is a strongly..... nevermind just going to go on fox and talk about it. See ya!!! permalink parent award report block reply drmrboy 1 points 6 days ago 😄!  Read it out aloud in an annoyed voice.  It'll make you smile at the end. permalink parent award report block reply Cali_kid 1 points 6 days ago Maybe after he finishes his term in office permalink parent award report block reply Beat_to_Quarters 8 points 6 days ago A non citizen is the mayor... In Kansas. Deep red state. permalink award report block reply S11houette 3 points 6 days ago Not the mayor of Kansas. A mayor of a small town in Kansas. Deport deport deport permalink parent award report block reply ragnarokrobo 3 points 6 days ago So deep red they have a democrat governor. permalink parent award report block reply PhantomShield72 6 points 6 days ago Illegal to vote - Legal to be Mayor??? So FUCKING SICK of this gay & retarded ass clown world... permalink award report block reply stjimmy92 2 points 6 days ago It’s even worse. “[The Attorney General] said that city officials are legally required to be U.S. citizens, adding that it was “worth noting” but not a criminal offense.“ They literally said it’s a legal requirement to be a citizen but it’s not illegal to break that law. 🤡 permalink parent award report block reply PhantomShield72 2 points 6 days ago Oh... Well, at least they applied good linear thinking and logic to their explanations... permalink parent award report block reply mymymyTuckerface 2 points 6 days ago Thank you for this; what I came here to say. Have we lost the ability to think clearly? permalink parent award report block reply Rock9Head 5 points 6 days ago All of NYC is guilty of this. permalink award report block reply Odyssey 4 points 6 days ago Hurray, one mule got caught. This will definitely fix mail-in ballot fraud for the midterm. Do they realise how he was able to vote multiple times is the real elephant in the room? permalink award report block reply Sunnybats2 3 points 6 days ago DEPORT DEPORT DEPORT permalink award report block reply OSmash 3 points 6 days ago Deport permalink award report block reply posedgeclk 3 points 6 days ago Arrest and put in solitary first. Slow roll the prosecution J6 style. Remember that it is (or will be) in power. permalink parent award report block reply BasedMillennial 3 points 6 days ago There will be no perp walk, there will be no consequence, and the fraud will continue until morale improves. permalink award report block reply MocksFordComma 3 points 6 days ago I think there are millions of lawfuls and illegals who have been here for a long time that believe they can just vote. And they cannot. permalink award report block reply roadrunner0 3 points 6 days ago Deport his ass and his family permalink award report block reply laneybelle 2 points 6 days ago This reads like a Babylon Bee headline. A mayor of a US city is an illegal. 😒 permalink award report block reply RogueLeaderX 2 points 6 days ago There are a RIDICULOUS number of third world foreigners in this country. permalink award report block reply Hello_rojo 2 points 6 days ago If you take a step back and analyze the situation, the reality is pretty clear- to preserve the party, the democratic party has become the party of immigrants. It is going to come down to this in the coming days- the democratic party (Immigrants, foreigners, minorities) wrestling with Republicans (traditional American Citizens) for control of the federal government. Its...... not a great path for us to be on and has some very clearly possible destinations (civil war being the big one). In short, the democrats are traitors, once again. The quicker people realize this, accept this, and act accordingly, the less violent the ultimate outcome will be. permalink award report block reply Retard_Strength 2 points 6 days ago Democrat Party 2025: Immigrants, Foreigners, Minorities, Fags & Cat Ladies permalink parent award report block reply DoMagnum 1 points 6 days ago Then to be deported with max drama to rub their nose in it and carve it into their micro-psyche's. permalink award report block reply Retardloserimsogay 1 points 6 days ago What did I read? permalink award report block reply HunterBidensPC 1 points 6 days ago Illegal to vote but not illegal to be mayor… Faggot ass retards in charge that all deserve death. permalink award report block reply DaemonKrog 1 points 6 days ago Cant vote....but can become mayor.. got it.. nothing's wrong here... permalink award report block reply dtrap 1 points 6 days ago So as a non-citizen voting is the problem versus being a candidate, getting elected, and having jurisdiction over a city full of citizens? Make it make sense. permalink award report block reply CleanUpPhillyTrump24 1 points 6 days ago Problem: NOT A CRIME for illegals to hold political office - make this a federal felony NOW. The honor system won't work when there are dishonorable illegals exploiting the system for personal gain. permalink award report block reply hey_spike 1 points 6 days ago Physically remove from the building to start deportation,  and then loudly say, \"Stop resisting, stop resisting.\" permalink parent award report block reply HoganT 1 points 6 days ago He’s not illegal. Shouldn’t be voting. But still. He’s not illegal. permalink parent award report block reply glasscrawler 1 points 6 days ago What is KS state law regarding the holding of offices by non-citizens? permalink parent award report block reply HoganT 1 points 6 days ago No idea. Presumably it isn’t allowed. But I don’t know for sure on that one. He isn’t being charged with false representation for election though, just the voting, from what I understand, so I could be wrong. Otherwise they’d be charging him for that too. permalink parent award report block reply 2025WhatIsTrue 1 points 6 days ago Arrest the criminal! permalink award report block reply Datamancer 1 points 6 days ago Election fraud needs to be a capital offense. permalink award report block reply asiatrails 1 points 6 days ago Arrest and deport with a ten year ban from reapplying permalink award report block reply hey_spike 1 points 6 days ago Jose Ceballos. permalink award report block reply patrioticwinning3 1 points 6 days ago Paging Tom Homan... permalink award report block reply SERP-SERP 0 points 6 days ago \"Person\" why doesn't that sign say \"American citizen\" permalink award report block reply RememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nTooTrue-translation 59 points 6 days ago This raises the question, what did the Biden regime do in terms of \"federal oversight\" of elections that meant anything? We need election integrity overhaul big time, and Trump is really good at enforcing laws/policies already in place. permalink award report block reply Chickensaurus 42 points 6 days ago They made sure illegals could vote. permalink parent award report block reply IForgotToAddAnEmail 15 points 6 days ago Was the whole 'Mail in Ballot' scam taking care of or are they all still doing that? Maybe some states made laws to stop it but, doubt any blues did. permalink parent award report block reply Chickensaurus 6 points 6 days ago Trump is simply a \"dead cat bounce\" for our nation. We're all too weak and comfortable to do what strong men before us did. permalink parent award report block reply Steve56775 4 points 6 days ago They are still doing it. Nevada has both motor-voter and cheat by mail and five days post election to count “ballots” for the “winner”! permalink parent award report block reply mohel 1 points 6 days ago Now do all the west coast states  - California, Oregon and Washington permalink parent award report block reply jml1997 6 points 6 days ago Could or let?\nCould means they changed laws to allow illegals to vote. Let means they didn't change any laws and can give plausible deniability when confronted about illegals voting in our elections. permalink parent award report block reply Chickensaurus 3 points 6 days ago They made sure that the mechanism is in place so that an I'll can vote if that illegal so chooses to. Or, in some cases, the ballots get generated and the illegal votes whether they know it or not. permalink parent award report block reply Steve56775 2 points 6 days ago Otherwise they have no purpose. permalink parent award report block reply\nChickensaurus 42 points 6 days ago They made sure illegals could vote. permalink parent award report block reply IForgotToAddAnEmail 15 points 6 days ago Was the whole 'Mail in Ballot' scam taking care of or are they all still doing that? Maybe some states made laws to stop it but, doubt any blues did. permalink parent award report block reply Chickensaurus 6 points 6 days ago Trump is simply a \"dead cat bounce\" for our nation. We're all too weak and comfortable to do what strong men before us did. permalink parent award report block reply Steve56775 4 points 6 days ago They are still doing it. Nevada has both motor-voter and cheat by mail and five days post election to count “ballots” for the “winner”! permalink parent award report block reply mohel 1 points 6 days ago Now do all the west coast states  - California, Oregon and Washington permalink parent award report block reply jml1997 6 points 6 days ago Could or let?\nCould means they changed laws to allow illegals to vote. Let means they didn't change any laws and can give plausible deniability when confronted about illegals voting in our elections. permalink parent award report block reply Chickensaurus 3 points 6 days ago They made sure that the mechanism is in place so that an I'll can vote if that illegal so chooses to. Or, in some cases, the ballots get generated and the illegal votes whether they know it or not. permalink parent award report block reply Steve56775 2 points 6 days ago Otherwise they have no purpose. permalink parent award report block reply\nIForgotToAddAnEmail 15 points 6 days ago Was the whole 'Mail in Ballot' scam taking care of or are they all still doing that? Maybe some states made laws to stop it but, doubt any blues did. permalink parent award report block reply Chickensaurus 6 points 6 days ago Trump is simply a \"dead cat bounce\" for our nation. We're all too weak and comfortable to do what strong men before us did. permalink parent award report block reply Steve56775 4 points 6 days ago They are still doing it. Nevada has both motor-voter and cheat by mail and five days post election to count “ballots” for the “winner”! permalink parent award report block reply mohel 1 points 6 days ago Now do all the west coast states  - California, Oregon and Washington permalink parent award report block reply\nChickensaurus 6 points 6 days ago Trump is simply a \"dead cat bounce\" for our nation. We're all too weak and comfortable to do what strong men before us did. permalink parent award report block reply\nSteve56775 4 points 6 days ago They are still doing it. Nevada has both motor-voter and cheat by mail and five days post election to count “ballots” for the “winner”! permalink parent award report block reply mohel 1 points 6 days ago Now do all the west coast states  - California, Oregon and Washington permalink parent award report block reply\nmohel 1 points 6 days ago Now do all the west coast states  - California, Oregon and Washington permalink parent award report block reply\njml1997 6 points 6 days ago Could or let?\nCould means they changed laws to allow illegals to vote. Let means they didn't change any laws and can give plausible deniability when confronted about illegals voting in our elections. permalink parent award report block reply Chickensaurus 3 points 6 days ago They made sure that the mechanism is in place so that an I'll can vote if that illegal so chooses to. Or, in some cases, the ballots get generated and the illegal votes whether they know it or not. permalink parent award report block reply\nChickensaurus 3 points 6 days ago They made sure that the mechanism is in place so that an I'll can vote if that illegal so chooses to. Or, in some cases, the ballots get generated and the illegal votes whether they know it or not. permalink parent award report block reply\nSteve56775 2 points 6 days ago Otherwise they have no purpose. permalink parent award report block reply\nMalfunction 53 points 6 days ago How the fuck is a non-citizen elected mayor? permalink award report block reply Krat 40 points 6 days ago We arent a country anymore... just a market to be conquered by others permalink parent award report block reply NonbinaryPotatohead 8 points 6 days ago those on the hill all know by now that we are a Corporation with a PRESIDENT. permalink parent award report block reply XlDEN 7 points 6 days ago Yes, consider that the new mayor has had absolutely NO fears of being deported. permalink parent award report block reply HoganT 1 points 6 days ago Because he’s… Legal? permalink parent award report block reply MocksFordComma 3 points 6 days ago We aren't a country - just a marketplace of borrowers from the individual right straight up to the federal government. permalink parent award report block reply Spiritof2015 9 points 6 days ago He can't vote for mayor but he can be the mayor? Fucked. permalink parent award report block reply MikeTruk 6 points 6 days ago Thank you. permalink parent award report block reply Patriot4TN 4 points 6 days ago Ask Obama how he became President. permalink parent award report block reply rebuildingMyself 4 points 6 days ago Liberal women, their soyboy beta orbiters, fellow illegals, and first generation foreigners who are technically legal on paper but have zero allegiance to their new home. permalink parent award report block reply load 1 more comments...\nKrat 40 points 6 days ago We arent a country anymore... just a market to be conquered by others permalink parent award report block reply NonbinaryPotatohead 8 points 6 days ago those on the hill all know by now that we are a Corporation with a PRESIDENT. permalink parent award report block reply XlDEN 7 points 6 days ago Yes, consider that the new mayor has had absolutely NO fears of being deported. permalink parent award report block reply HoganT 1 points 6 days ago Because he’s… Legal? permalink parent award report block reply MocksFordComma 3 points 6 days ago We aren't a country - just a marketplace of borrowers from the individual right straight up to the federal government. permalink parent award report block reply\nNonbinaryPotatohead 8 points 6 days ago those on the hill all know by now that we are a Corporation with a PRESIDENT. permalink parent award report block reply\nXlDEN 7 points 6 days ago Yes, consider that the new mayor has had absolutely NO fears of being deported. permalink parent award report block reply HoganT 1 points 6 days ago Because he’s… Legal? permalink parent award report block reply\nHoganT 1 points 6 days ago Because he’s… Legal? permalink parent award report block reply\nMocksFordComma 3 points 6 days ago We aren't a country - just a marketplace of borrowers from the individual right straight up to the federal government. permalink parent award report block reply\nSpiritof2015 9 points 6 days ago He can't vote for mayor but he can be the mayor? Fucked. permalink parent award report block reply\nMikeTruk 6 points 6 days ago Thank you. permalink parent award report block reply\nPatriot4TN 4 points 6 days ago Ask Obama how he became President. permalink parent award report block reply\nrebuildingMyself 4 points 6 days ago Liberal women, their soyboy beta orbiters, fellow illegals, and first generation foreigners who are technically legal on paper but have zero allegiance to their new home. permalink parent award report block reply\nsocal_maga 29 points 6 days ago A resident from Mexico...holding public office...voting in our elections. Am I a retarded, or is this shit pretty fuckin simple to resolve? permalink award report block reply killedmytv 7 points 6 days ago The only thing keeping so many problems from getting resolved is our own justice system that is just as, or more likely to punish its own subjects for doing what needs to be done than punishing the invaders among us for breaking the law. permalink parent award report block reply deleted 5 points 6 days ago Recken 5 points 6 days ago and the other party sitting idly by twittering their thumbs. permalink parent award report block reply AlohaChris 1 points 6 days ago There is only one party, the Uniparty, and MAGA. permalink parent award report block reply Filo76 4 points 6 days ago Deportation would work quite well. Where’s ice? permalink parent award report block reply\nkilledmytv 7 points 6 days ago The only thing keeping so many problems from getting resolved is our own justice system that is just as, or more likely to punish its own subjects for doing what needs to be done than punishing the invaders among us for breaking the law. permalink parent award report block reply\ndeleted 5 points 6 days ago Recken 5 points 6 days ago and the other party sitting idly by twittering their thumbs. permalink parent award report block reply AlohaChris 1 points 6 days ago There is only one party, the Uniparty, and MAGA. permalink parent award report block reply\nRecken 5 points 6 days ago and the other party sitting idly by twittering their thumbs. permalink parent award report block reply AlohaChris 1 points 6 days ago There is only one party, the Uniparty, and MAGA. permalink parent award report block reply\nAlohaChris 1 points 6 days ago There is only one party, the Uniparty, and MAGA. permalink parent award report block reply\nFilo76 4 points 6 days ago Deportation would work quite well. Where’s ice? permalink parent award report block reply\nmailinvoter 18 points 6 days ago The Secretary of State in Kansas, who ironically(?) has the last name Schwab, is a fucking pathetic globalhomo retard. He said he felt Kansas elections are secure, but this shit happens under his watch. permalink award report block reply NY2KCMO1776 7 points 6 days ago When I had to switch to a kansas drivers license in 2024, I went to THE DMV in Johnson County.   I was one of the few people that spoke English in the office.  After I got my license I looked at the paperwork.  There it was written in big bold letters that you don't have to be a citizen or prove citizenship to vote in elections.  Yes that's right.  I went to the ks attorney general website and it said the same thing.  You could sign an affidavit allowing you to vote without providing any documents to verify who you are. I reached Out to Kris Kobach personally and Info wars.  I got the info out about this.  I was trying to sound the alarm before the election. Now the info about the affidavit is gone off their website.  Hopefully this stopped illegals from voting permalink parent award report block reply N14205ST205 1 points 6 days ago Fellow JoCo resident here. Respect! Thanks for standing up for what's right and getting the word out there. permalink parent award report block reply\nNY2KCMO1776 7 points 6 days ago When I had to switch to a kansas drivers license in 2024, I went to THE DMV in Johnson County.   I was one of the few people that spoke English in the office.  After I got my license I looked at the paperwork.  There it was written in big bold letters that you don't have to be a citizen or prove citizenship to vote in elections.  Yes that's right.  I went to the ks attorney general website and it said the same thing.  You could sign an affidavit allowing you to vote without providing any documents to verify who you are. I reached Out to Kris Kobach personally and Info wars.  I got the info out about this.  I was trying to sound the alarm before the election. Now the info about the affidavit is gone off their website.  Hopefully this stopped illegals from voting permalink parent award report block reply N14205ST205 1 points 6 days ago Fellow JoCo resident here. Respect! Thanks for standing up for what's right and getting the word out there. permalink parent award report block reply\nN14205ST205 1 points 6 days ago Fellow JoCo resident here. Respect! Thanks for standing up for what's right and getting the word out there. permalink parent award report block reply\nOldGreg 13 points 6 days ago My question is:  how?  We have voting ID to the point that you have to scan your state ID for ballot eligibility.  What the fuck were they doing? permalink award report block reply Krat 12 points 6 days ago Rigging and enslaving you... 0 arrests so far permalink parent award report block reply UCantStumpTheTrump 1 points 6 days ago Comey, Bolton and Letitia James would like a word permalink parent award report block reply NY2KCMO1776 5 points 6 days ago When I had to switch to a kansas drivers license in 2024, I went to THE DMV in Johnson County.   I was one of the few people that spoke English in the office.  After I got my license I looked at the paperwork.  There it was written in big bold letters that you don't have to be a citizen or prove citizenship to vote in elections.  Yes that's right.  I went to the ks attorney general website and it said the same thing.  You could sign an affidavit allowing you to vote without providing any documents to verify who you are. I reached Out to Kris Kobach personally and Info wars.  I got the info out about this.  I was trying to sound the alarm before the election. Now the info about the affidavit is gone off their website.  Hopefully this stopped illegals from voting permalink parent award report block reply OldGreg 1 points 6 days ago That explains Laura Kelly permalink parent award report block reply\nKrat 12 points 6 days ago Rigging and enslaving you... 0 arrests so far permalink parent award report block reply UCantStumpTheTrump 1 points 6 days ago Comey, Bolton and Letitia James would like a word permalink parent award report block reply\nUCantStumpTheTrump 1 points 6 days ago Comey, Bolton and Letitia James would like a word permalink parent award report block reply\nNY2KCMO1776 5 points 6 days ago When I had to switch to a kansas drivers license in 2024, I went to THE DMV in Johnson County.   I was one of the few people that spoke English in the office.  After I got my license I looked at the paperwork.  There it was written in big bold letters that you don't have to be a citizen or prove citizenship to vote in elections.  Yes that's right.  I went to the ks attorney general website and it said the same thing.  You could sign an affidavit allowing you to vote without providing any documents to verify who you are. I reached Out to Kris Kobach personally and Info wars.  I got the info out about this.  I was trying to sound the alarm before the election. Now the info about the affidavit is gone off their website.  Hopefully this stopped illegals from voting permalink parent award report block reply OldGreg 1 points 6 days ago That explains Laura Kelly permalink parent award report block reply\nOldGreg 1 points 6 days ago That explains Laura Kelly permalink parent award report block reply\ndrmrboy 11 points 6 days ago Sounds illegal.  Maybe an arrest might be in order.  Two weeks?  🤔🤓 permalink award report block reply jml1997 3 points 6 days ago Sorry the best I can do is a strongly..... nevermind just going to go on fox and talk about it. See ya!!! permalink parent award report block reply drmrboy 1 points 6 days ago 😄!  Read it out aloud in an annoyed voice.  It'll make you smile at the end. permalink parent award report block reply Cali_kid 1 points 6 days ago Maybe after he finishes his term in office permalink parent award report block reply\njml1997 3 points 6 days ago Sorry the best I can do is a strongly..... nevermind just going to go on fox and talk about it. See ya!!! permalink parent award report block reply drmrboy 1 points 6 days ago 😄!  Read it out aloud in an annoyed voice.  It'll make you smile at the end. permalink parent award report block reply\ndrmrboy 1 points 6 days ago 😄!  Read it out aloud in an annoyed voice.  It'll make you smile at the end. permalink parent award report block reply\nCali_kid 1 points 6 days ago Maybe after he finishes his term in office permalink parent award report block reply\nBeat_to_Quarters 8 points 6 days ago A non citizen is the mayor... In Kansas. Deep red state. permalink award report block reply S11houette 3 points 6 days ago Not the mayor of Kansas. A mayor of a small town in Kansas. Deport deport deport permalink parent award report block reply ragnarokrobo 3 points 6 days ago So deep red they have a democrat governor. permalink parent award report block reply\nS11houette 3 points 6 days ago Not the mayor of Kansas. A mayor of a small town in Kansas. Deport deport deport permalink parent award report block reply\nragnarokrobo 3 points 6 days ago So deep red they have a democrat governor. permalink parent award report block reply\nPhantomShield72 6 points 6 days ago Illegal to vote - Legal to be Mayor??? So FUCKING SICK of this gay & retarded ass clown world... permalink award report block reply stjimmy92 2 points 6 days ago It’s even worse. “[The Attorney General] said that city officials are legally required to be U.S. citizens, adding that it was “worth noting” but not a criminal offense.“ They literally said it’s a legal requirement to be a citizen but it’s not illegal to break that law. 🤡 permalink parent award report block reply PhantomShield72 2 points 6 days ago Oh... Well, at least they applied good linear thinking and logic to their explanations... permalink parent award report block reply mymymyTuckerface 2 points 6 days ago Thank you for this; what I came here to say. Have we lost the ability to think clearly? permalink parent award report block reply\nstjimmy92 2 points 6 days ago It’s even worse. “[The Attorney General] said that city officials are legally required to be U.S. citizens, adding that it was “worth noting” but not a criminal offense.“ They literally said it’s a legal requirement to be a citizen but it’s not illegal to break that law. 🤡 permalink parent award report block reply PhantomShield72 2 points 6 days ago Oh... Well, at least they applied good linear thinking and logic to their explanations... permalink parent award report block reply\nPhantomShield72 2 points 6 days ago Oh... Well, at least they applied good linear thinking and logic to their explanations... permalink parent award report block reply\nmymymyTuckerface 2 points 6 days ago Thank you for this; what I came here to say. Have we lost the ability to think clearly? permalink parent award report block reply\nRock9Head 5 points 6 days ago All of NYC is guilty of this. permalink award report block reply\nOdyssey 4 points 6 days ago Hurray, one mule got caught. This will definitely fix mail-in ballot fraud for the midterm. Do they realise how he was able to vote multiple times is the real elephant in the room? permalink award report block reply\nSunnybats2 3 points 6 days ago DEPORT DEPORT DEPORT permalink award report block reply\nOSmash 3 points 6 days ago Deport permalink award report block reply posedgeclk 3 points 6 days ago Arrest and put in solitary first. Slow roll the prosecution J6 style. Remember that it is (or will be) in power. permalink parent award report block reply\nposedgeclk 3 points 6 days ago Arrest and put in solitary first. Slow roll the prosecution J6 style. Remember that it is (or will be) in power. permalink parent award report block reply\nBasedMillennial 3 points 6 days ago There will be no perp walk, there will be no consequence, and the fraud will continue until morale improves. permalink award report block reply\nMocksFordComma 3 points 6 days ago I think there are millions of lawfuls and illegals who have been here for a long time that believe they can just vote. And they cannot. permalink award report block reply\nroadrunner0 3 points 6 days ago Deport his ass and his family permalink award report block reply\nlaneybelle 2 points 6 days ago This reads like a Babylon Bee headline. A mayor of a US city is an illegal. 😒 permalink award report block reply\nRogueLeaderX 2 points 6 days ago There are a RIDICULOUS number of third world foreigners in this country. permalink award report block reply\nHello_rojo 2 points 6 days ago If you take a step back and analyze the situation, the reality is pretty clear- to preserve the party, the democratic party has become the party of immigrants. It is going to come down to this in the coming days- the democratic party (Immigrants, foreigners, minorities) wrestling with Republicans (traditional American Citizens) for control of the federal government. Its...... not a great path for us to be on and has some very clearly possible destinations (civil war being the big one). In short, the democrats are traitors, once again. The quicker people realize this, accept this, and act accordingly, the less violent the ultimate outcome will be. permalink award report block reply Retard_Strength 2 points 6 days ago Democrat Party 2025: Immigrants, Foreigners, Minorities, Fags & Cat Ladies permalink parent award report block reply\nRetard_Strength 2 points 6 days ago Democrat Party 2025: Immigrants, Foreigners, Minorities, Fags & Cat Ladies permalink parent award report block reply\nDoMagnum 1 points 6 days ago Then to be deported with max drama to rub their nose in it and carve it into their micro-psyche's. permalink award report block reply\nRetardloserimsogay 1 points 6 days ago What did I read? permalink award report block reply\nHunterBidensPC 1 points 6 days ago Illegal to vote but not illegal to be mayor… Faggot ass retards in charge that all deserve death. permalink award report block reply\nDaemonKrog 1 points 6 days ago Cant vote....but can become mayor.. got it.. nothing's wrong here... permalink award report block reply\ndtrap 1 points 6 days ago So as a non-citizen voting is the problem versus being a candidate, getting elected, and having jurisdiction over a city full of citizens? Make it make sense. permalink award report block reply\nCleanUpPhillyTrump24 1 points 6 days ago Problem: NOT A CRIME for illegals to hold political office - make this a federal felony NOW. The honor system won't work when there are dishonorable illegals exploiting the system for personal gain. permalink award report block reply hey_spike 1 points 6 days ago Physically remove from the building to start deportation,  and then loudly say, \"Stop resisting, stop resisting.\" permalink parent award report block reply HoganT 1 points 6 days ago He’s not illegal. Shouldn’t be voting. But still. He’s not illegal. permalink parent award report block reply glasscrawler 1 points 6 days ago What is KS state law regarding the holding of offices by non-citizens? permalink parent award report block reply HoganT 1 points 6 days ago No idea. Presumably it isn’t allowed. But I don’t know for sure on that one. He isn’t being charged with false representation for election though, just the voting, from what I understand, so I could be wrong. Otherwise they’d be charging him for that too. permalink parent award report block reply\nhey_spike 1 points 6 days ago Physically remove from the building to start deportation,  and then loudly say, \"Stop resisting, stop resisting.\" permalink parent award report block reply\nHoganT 1 points 6 days ago He’s not illegal. Shouldn’t be voting. But still. He’s not illegal. permalink parent award report block reply glasscrawler 1 points 6 days ago What is KS state law regarding the holding of offices by non-citizens? permalink parent award report block reply HoganT 1 points 6 days ago No idea. Presumably it isn’t allowed. But I don’t know for sure on that one. He isn’t being charged with false representation for election though, just the voting, from what I understand, so I could be wrong. Otherwise they’d be charging him for that too. permalink parent award report block reply\nglasscrawler 1 points 6 days ago What is KS state law regarding the holding of offices by non-citizens? permalink parent award report block reply HoganT 1 points 6 days ago No idea. Presumably it isn’t allowed. But I don’t know for sure on that one. He isn’t being charged with false representation for election though, just the voting, from what I understand, so I could be wrong. Otherwise they’d be charging him for that too. permalink parent award report block reply\nHoganT 1 points 6 days ago No idea. Presumably it isn’t allowed. But I don’t know for sure on that one. He isn’t being charged with false representation for election though, just the voting, from what I understand, so I could be wrong. Otherwise they’d be charging him for that too. permalink parent award report block reply\n2025WhatIsTrue 1 points 6 days ago Arrest the criminal! permalink award report block reply\nDatamancer 1 points 6 days ago Election fraud needs to be a capital offense. permalink award report block reply\nasiatrails 1 points 6 days ago Arrest and deport with a ten year ban from reapplying permalink award report block reply\nhey_spike 1 points 6 days ago Jose Ceballos. permalink award report block reply\npatrioticwinning3 1 points 6 days ago Paging Tom Homan... permalink award report block reply\nSERP-SERP 0 points 6 days ago \"Person\" why doesn't that sign say \"American citizen\" permalink award report block reply\nRememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T21:22:09.395354Z"
}