{
  "id": "8184917",
  "title": "288Abe had to bite his tongueposted7 hours agobywst45 commentsawardsharedownloadreportblock",
  "url": "https://patriots.win/p/1ARK9mHmZb/abe-had-to-bite-his-tongue-/c",
  "content": "347 Abe had to bite his tongue posted 12 hours ago by wst4 6 comments award share download report block\n6 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style kyle6969 8 points 11 hours ago Needs wayyyyyyy bigger juggs permalink award report block reply Side_o_beef_curtains 6 points 9 hours ago Obvious fake AI. Needs more tiddies. https://share.google/2l84iuGShXngsKXBk permalink parent award report block reply RolandDelacroix 2 points 8 hours ago Her tits were bigger back then permalink award report block reply AncientRomeEveryDay 2 points 7 hours ago Nancy: \"I knew Abraham Lincoln and you Sir are no Abraham Lincoln.\" permalink award report block reply SpellingContable 1 points 3 hours ago Was her dad really her pimp? permalink award report block reply hey_spike 1 points 6 hours ago Abe, does this dress make my butt look fat? permalink award report block reply\nkyle6969 8 points 11 hours ago Needs wayyyyyyy bigger juggs permalink award report block reply Side_o_beef_curtains 6 points 9 hours ago Obvious fake AI. Needs more tiddies. https://share.google/2l84iuGShXngsKXBk permalink parent award report block reply\nSide_o_beef_curtains 6 points 9 hours ago Obvious fake AI. Needs more tiddies. https://share.google/2l84iuGShXngsKXBk permalink parent award report block reply\nRolandDelacroix 2 points 8 hours ago Her tits were bigger back then permalink award report block reply\nAncientRomeEveryDay 2 points 7 hours ago Nancy: \"I knew Abraham Lincoln and you Sir are no Abraham Lincoln.\" permalink award report block reply\nSpellingContable 1 points 3 hours ago Was her dad really her pimp? permalink award report block reply\nhey_spike 1 points 6 hours ago Abe, does this dress make my butt look fat? permalink award report block reply",
  "fetched_at": "2025-11-12T23:43:25.188421Z"
}