{
  "id": "1ARK55bRJe",
  "url": "https://patriots.win/p/1ARK55bRJe/federal-law-mandates-an-election/c",
  "content": "269 Federal law mandates an Election Day, not an election week posted 5 days ago by Tailgunnerjoe 6 comments award share report block 🇺🇸RealRobert🇺🇸 @Real_RobN • 5d This is: 3 U.S. Code § 1: \"The electors of President and Vice President shall be appointed, in each State, on the Tuesday next after the first Monday in Nov...\" Meaning: Federer law states the United States government was overthrown on November 4, 2020, EVIDENCE CONFIRMS Tom Fitton @TomFitton • 1y Federal law sets an Election Day, not an Election Week or Election Month or Election Winter. On Election Day, 2020, @realDonaldTrump had the votes to win the presidency. These vote totals were changed because of unprecedented and extraordinary counting after Election Day.\n6 comments Sort by Top Top New Worst Old Save Grindelwald 3 points 5 days ago What a mess permalink award report block reply Reefay 2 points 5 days ago Federer? permalink award report block reply RagnarD 2 points 5 days ago I think it's like Federal but pronounced by a Chinaman. permalink parent award report block reply UntakenUsername 1 points 5 days ago Give the Dems a break here. How else are they supposed to know how many votes to add to win until AFTER the election? permalink award report block reply Goozmania 1 points 5 days ago This is not accurate. The ELECTORS are, indeed, appointed on that one day. States are determining how electors are selected. Like most Americans, this guy doesn't understand how the process works. We do not vote for the president. permalink award report block reply tired-of-crap 1 points 4 days ago However since the elector vote wasn't completed timely they are not properly appointed. permalink parent award report block reply\nGrindelwald 3 points 5 days ago What a mess permalink award report block reply\nReefay 2 points 5 days ago Federer? permalink award report block reply RagnarD 2 points 5 days ago I think it's like Federal but pronounced by a Chinaman. permalink parent award report block reply\nRagnarD 2 points 5 days ago I think it's like Federal but pronounced by a Chinaman. permalink parent award report block reply\nUntakenUsername 1 points 5 days ago Give the Dems a break here. How else are they supposed to know how many votes to add to win until AFTER the election? permalink award report block reply\nGoozmania 1 points 5 days ago This is not accurate. The ELECTORS are, indeed, appointed on that one day. States are determining how electors are selected. Like most Americans, this guy doesn't understand how the process works. We do not vote for the president. permalink award report block reply tired-of-crap 1 points 4 days ago However since the elector vote wasn't completed timely they are not properly appointed. permalink parent award report block reply\ntired-of-crap 1 points 4 days ago However since the elector vote wasn't completed timely they are not properly appointed. permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:41:08.010397Z"
}