{
  "id": "1ARK9irUoj",
  "url": "https://patriots.win/p/1ARK9irUoj/40-of-people-enrolled-in-obamaca/c",
  "content": "319 40% of People Enrolled in Obamacare Never File A Claim, But The Government Pays The Full Premium To The Insurance Companies. posted 2 days ago by rdvs34283 14 comments award share report block Dr. Roger Marshall @RogerMarshallMD • 3d Up to 40% of Obamacare enrollees never file a claim. That’s billions in taxpayer dollars flowing to insurance companies for people who don’t even use the system. Republicans are committed to ending the fraud and making healthcare truly affordable.\n14 comments Sort by Top Top New Worst Old Save Around the Web One Piece Kills All Parasites in Your Body! Paratoxil GentleSlayer 6 points 2 days ago It's by design over 55s are the cash crop, everyone else is subsidizing them. Obamacare radically lowered premiums for boomers and was passed before they were 65. Now they're on Medicare. The cost for premiums should be going straight down. permalink award report block reply T471 6 points 2 days ago its because the out of pocket is insane. permalink award report block reply zooty 4 points 2 days ago That's, uh, how insurance works. Obamacare is bullshit though. permalink award report block reply Th0mas_Paine 4 points 2 days ago Had to scroll way to far to see this. And here I thought insurance was just a magical give everybody money machine. permalink parent award report block reply Awakened 4 points 2 days ago If Trump pulls off fixing medical insurance he will win the midterms. So the GOP will fight him every step. Especially the usual suspects like Rand and Massie. permalink award report block reply Greenhills 3 points 2 days ago People who pay nothing into the system and only take, don’t give a shit. permalink award report block reply contender 2 points 2 days ago fuck them,  just fuck them I pay $1400/mo plus $85 co pay and 8k deductable just fuck them permalink award report block reply SaturnMan 1 points 2 days ago We've got to sort out the fraud and hold these insurance companies responsible permalink parent award report block reply America_No_1 2 points 2 days ago Our whole system is corrupt permalink award report block reply RoughBoy 1 points 2 days ago Can we end this shit once and for good? permalink award report block reply Herheartbeats 1 points 2 days ago My husband is self-employed, and , unfortunately, the marketplace insurance is our best option.   Republicans are failures when it comes to solutions for fixing the system.   I keep hoping, but . . . permalink award report block reply\nGentleSlayer 6 points 2 days ago It's by design over 55s are the cash crop, everyone else is subsidizing them. Obamacare radically lowered premiums for boomers and was passed before they were 65. Now they're on Medicare. The cost for premiums should be going straight down. permalink award report block reply\nT471 6 points 2 days ago its because the out of pocket is insane. permalink award report block reply\nzooty 4 points 2 days ago That's, uh, how insurance works. Obamacare is bullshit though. permalink award report block reply Th0mas_Paine 4 points 2 days ago Had to scroll way to far to see this. And here I thought insurance was just a magical give everybody money machine. permalink parent award report block reply\nTh0mas_Paine 4 points 2 days ago Had to scroll way to far to see this. And here I thought insurance was just a magical give everybody money machine. permalink parent award report block reply\nAwakened 4 points 2 days ago If Trump pulls off fixing medical insurance he will win the midterms. So the GOP will fight him every step. Especially the usual suspects like Rand and Massie. permalink award report block reply\nGreenhills 3 points 2 days ago People who pay nothing into the system and only take, don’t give a shit. permalink award report block reply\ncontender 2 points 2 days ago fuck them,  just fuck them I pay $1400/mo plus $85 co pay and 8k deductable just fuck them permalink award report block reply SaturnMan 1 points 2 days ago We've got to sort out the fraud and hold these insurance companies responsible permalink parent award report block reply\nSaturnMan 1 points 2 days ago We've got to sort out the fraud and hold these insurance companies responsible permalink parent award report block reply\nAmerica_No_1 2 points 2 days ago Our whole system is corrupt permalink award report block reply\nRoughBoy 1 points 2 days ago Can we end this shit once and for good? permalink award report block reply\nHerheartbeats 1 points 2 days ago My husband is self-employed, and , unfortunately, the marketplace insurance is our best option.   Republicans are failures when it comes to solutions for fixing the system.   I keep hoping, but . . . permalink award report block reply",
  "fetched_at": "2025-11-12T23:08:50.884783Z"
}