{
  "id": "1ARK9nPuFE",
  "url": "https://patriots.win/p/1ARK9nPuFE/redhanded-sean-duffy-yanking-an-/c",
  "content": "127 'Red-Handed': Sean Duffy Yanking an Astonishing 17,000 Illegal Trucker's Licenses in Gavin Newsom's CA (redstate.com) posted 4 hours ago by Sea_Still 4 comments award share report block 'Red-Handed': Sean Duffy Yanking an Astonishing 17,000 Illegal Trucker's Licenses in Gavin Newsom's CA California's Gov. Newsom faces backlash over 17,000 illegal trucker's licenses issued. redstate.com\n4 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno Trooph-Hurts 3 points 4 hours ago About time permalink award report block reply SHILL_DETECTOR 1 points 4 hours ago this should save the lives of a few tax slaves permalink parent award report block reply Trooph-Hurts 2 points 4 hours ago Those who have been driving under these fake licensing should be banned from obtaining CDL’s permanently permalink parent award report block reply BonginosRac1stCowboy 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nTrooph-Hurts 3 points 4 hours ago About time permalink award report block reply SHILL_DETECTOR 1 points 4 hours ago this should save the lives of a few tax slaves permalink parent award report block reply Trooph-Hurts 2 points 4 hours ago Those who have been driving under these fake licensing should be banned from obtaining CDL’s permanently permalink parent award report block reply BonginosRac1stCowboy 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nSHILL_DETECTOR 1 points 4 hours ago this should save the lives of a few tax slaves permalink parent award report block reply Trooph-Hurts 2 points 4 hours ago Those who have been driving under these fake licensing should be banned from obtaining CDL’s permanently permalink parent award report block reply BonginosRac1stCowboy 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nTrooph-Hurts 2 points 4 hours ago Those who have been driving under these fake licensing should be banned from obtaining CDL’s permanently permalink parent award report block reply BonginosRac1stCowboy 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nBonginosRac1stCowboy 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:10:50.220909Z"
}