{
  "id": "1ARK5A9ZIJ",
  "url": "https://patriots.win/p/1ARK5A9ZIJ/make-treason-deadly-again/c",
  "content": "324 MAKE TREASON DEADLY AGAIN! posted 3 days ago by MemeWarsVet 24 comments award share download report block\n24 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno TheAftermath 9 points 3 days ago Over half of Congress would be swinging in the breeze by now. permalink award report block reply TheAftermath 6 points 3 days ago Nah, make that 100%. permalink parent award report block reply SicSemperTyrannis2 4 points 3 days ago Not quite that much. Almost. permalink parent award report block reply TheAftermath 3 points 3 days ago Okay, 70%. I was being grouchy. permalink parent award report block reply SicSemperTyrannis2 0 points 3 days ago Perfectly understandable ;) permalink parent award report block reply view 1 more comments... Standingoak 2 points 3 days ago 4 at a time is not enough.  Can't we use Obummer's FEMA  Guillotines ? permalink parent award report block reply ColonelKlink 5 points 3 days ago It should happen, but it won't. Democrats tried to assassinate our president many times and they're still calling for it without any consequences. permalink award report block reply Duce30 4 points 3 days ago All I want for Christmas... permalink award report block reply ItsBacon 4 points 3 days ago Seems like a relevant place to post this. https://centerforaninformedamerica.com/lincoln permalink award report block reply Trooph-Hurts 3 points 3 days ago It’s needed,,,,, helicopter rides would have been used back then if helicopters existed! permalink award report block reply SicSemperTyrannis2 1 points 3 days ago Rope is cheaper. permalink parent award report block reply Trooph-Hurts 1 points 3 days ago Easier to view from any distance :) worth the extra cost! permalink parent award report block reply AfterGlow 3 points 3 days ago That thing looks rickety. Is it safe? permalink award report block reply journalist 2 points 3 days ago I have my top four people that I want to see swing. permalink award report block reply alfredbester 2 points 3 days ago This should be the new sidebar photo. I don't like that little Nick Fuentes gets more bad press than us. permalink award report block reply patrioticwinning3 2 points 3 days ago Arrests when!? permalink award report block reply MAGALADON9 2 points 3 days ago REMINDER:: treason is only when helping a foreign enemy against the united states TRIBUNALS: is military not just some extra bad ass court. So when we say treason and tribunals who is the enemy the people are working with and what are the military issues that would necessitate a tribunal permalink award report block reply MemeWarsVet OP 1 points 3 days ago Willing allowing, nay ,ENCOURAGING tens of millions of illegal aliens to enter the country. That's an invasion. permalink parent award report block reply MAGALADON9 1 points 3 days ago Sure and sedition not treason permalink parent award report block reply MemeWarsVet OP 1 points 3 days ago Kill them, too. permalink parent award report block reply jonnyuno 1 points 3 days ago I hate to be that guy.  Typo. Please correct. Make gallows daily again. permalink award report block reply barwhack 1 points 3 days ago Very. Yes. permalink award report block reply Mhmm2MoreWeeks 1 points 3 days ago Its easy. You got the Judges and DoJ and present solid evidence. When they refuse, you arrest them immediately as accomplices after the fact, and ask the next person in line to indict and prosecute the Traitors. permalink award report block reply\nTheAftermath 9 points 3 days ago Over half of Congress would be swinging in the breeze by now. permalink award report block reply TheAftermath 6 points 3 days ago Nah, make that 100%. permalink parent award report block reply SicSemperTyrannis2 4 points 3 days ago Not quite that much. Almost. permalink parent award report block reply TheAftermath 3 points 3 days ago Okay, 70%. I was being grouchy. permalink parent award report block reply SicSemperTyrannis2 0 points 3 days ago Perfectly understandable ;) permalink parent award report block reply view 1 more comments... Standingoak 2 points 3 days ago 4 at a time is not enough.  Can't we use Obummer's FEMA  Guillotines ? permalink parent award report block reply\nTheAftermath 6 points 3 days ago Nah, make that 100%. permalink parent award report block reply SicSemperTyrannis2 4 points 3 days ago Not quite that much. Almost. permalink parent award report block reply TheAftermath 3 points 3 days ago Okay, 70%. I was being grouchy. permalink parent award report block reply SicSemperTyrannis2 0 points 3 days ago Perfectly understandable ;) permalink parent award report block reply view 1 more comments...\nSicSemperTyrannis2 4 points 3 days ago Not quite that much. Almost. permalink parent award report block reply TheAftermath 3 points 3 days ago Okay, 70%. I was being grouchy. permalink parent award report block reply SicSemperTyrannis2 0 points 3 days ago Perfectly understandable ;) permalink parent award report block reply view 1 more comments...\nTheAftermath 3 points 3 days ago Okay, 70%. I was being grouchy. permalink parent award report block reply SicSemperTyrannis2 0 points 3 days ago Perfectly understandable ;) permalink parent award report block reply view 1 more comments...\nSicSemperTyrannis2 0 points 3 days ago Perfectly understandable ;) permalink parent award report block reply view 1 more comments...\nStandingoak 2 points 3 days ago 4 at a time is not enough.  Can't we use Obummer's FEMA  Guillotines ? permalink parent award report block reply\nColonelKlink 5 points 3 days ago It should happen, but it won't. Democrats tried to assassinate our president many times and they're still calling for it without any consequences. permalink award report block reply\nDuce30 4 points 3 days ago All I want for Christmas... permalink award report block reply\nItsBacon 4 points 3 days ago Seems like a relevant place to post this. https://centerforaninformedamerica.com/lincoln permalink award report block reply\nTrooph-Hurts 3 points 3 days ago It’s needed,,,,, helicopter rides would have been used back then if helicopters existed! permalink award report block reply SicSemperTyrannis2 1 points 3 days ago Rope is cheaper. permalink parent award report block reply Trooph-Hurts 1 points 3 days ago Easier to view from any distance :) worth the extra cost! permalink parent award report block reply\nSicSemperTyrannis2 1 points 3 days ago Rope is cheaper. permalink parent award report block reply Trooph-Hurts 1 points 3 days ago Easier to view from any distance :) worth the extra cost! permalink parent award report block reply\nTrooph-Hurts 1 points 3 days ago Easier to view from any distance :) worth the extra cost! permalink parent award report block reply\nAfterGlow 3 points 3 days ago That thing looks rickety. Is it safe? permalink award report block reply\njournalist 2 points 3 days ago I have my top four people that I want to see swing. permalink award report block reply\nalfredbester 2 points 3 days ago This should be the new sidebar photo. I don't like that little Nick Fuentes gets more bad press than us. permalink award report block reply\npatrioticwinning3 2 points 3 days ago Arrests when!? permalink award report block reply\nMAGALADON9 2 points 3 days ago REMINDER:: treason is only when helping a foreign enemy against the united states TRIBUNALS: is military not just some extra bad ass court. So when we say treason and tribunals who is the enemy the people are working with and what are the military issues that would necessitate a tribunal permalink award report block reply MemeWarsVet OP 1 points 3 days ago Willing allowing, nay ,ENCOURAGING tens of millions of illegal aliens to enter the country. That's an invasion. permalink parent award report block reply MAGALADON9 1 points 3 days ago Sure and sedition not treason permalink parent award report block reply MemeWarsVet OP 1 points 3 days ago Kill them, too. permalink parent award report block reply\nMemeWarsVet OP 1 points 3 days ago Willing allowing, nay ,ENCOURAGING tens of millions of illegal aliens to enter the country. That's an invasion. permalink parent award report block reply MAGALADON9 1 points 3 days ago Sure and sedition not treason permalink parent award report block reply MemeWarsVet OP 1 points 3 days ago Kill them, too. permalink parent award report block reply\nMAGALADON9 1 points 3 days ago Sure and sedition not treason permalink parent award report block reply MemeWarsVet OP 1 points 3 days ago Kill them, too. permalink parent award report block reply\nMemeWarsVet OP 1 points 3 days ago Kill them, too. permalink parent award report block reply\njonnyuno 1 points 3 days ago I hate to be that guy.  Typo. Please correct. Make gallows daily again. permalink award report block reply\nbarwhack 1 points 3 days ago Very. Yes. permalink award report block reply\nMhmm2MoreWeeks 1 points 3 days ago Its easy. You got the Judges and DoJ and present solid evidence. When they refuse, you arrest them immediately as accomplices after the fact, and ask the next person in line to indict and prosecute the Traitors. permalink award report block reply",
  "fetched_at": "2025-11-12T22:58:41.778457Z"
}