{
  "id": "1ARK9mGPnG",
  "url": "https://patriots.win/p/1ARK9mGPnG/democrats-in-october-and-novembe/c",
  "content": "1237 Democrats in October and November posted 19 hours ago by I-am-Orlando PRO 48 comments award share download report block\n48 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style TheRedPilledArtist 42 points 19 hours ago Wait a minute, you mean Democrats are 𝙙𝙞𝙨𝙝𝙤𝙣𝙚𝙨𝙩?! permalink award report block reply BeauHD 11 points 18 hours ago Dude how did you do the bold italic? permalink parent award report block reply TheRedPilledArtist 8 points 18 hours ago Try three asterisks before and after your sentence. permalink parent award report block reply Quietam_Unum 3 points 11 hours ago Try three asterisks Two is italic, three is bold & italic Octothorpe at beginning of line is large: \"# text\" Text https://www.markdownguide.org/cheat-sheet/ permalink parent award report block reply crashdaddy 2 points 11 hours ago One is italic, two is bold, and three is both. Bonus Putting two tildes (~) before and after the text makes it strikethrough ! and putting an octothorpe at the beginning of the line makes it YUGE ( many people say it's the yugest ) And you know how I got that groovy horizontal line up there? That's right, three underscores (_) in a row at the beginning of a line. permalink parent award report block reply view 2 more comments... Hawksendoom 2 points 15 hours ago *** what the...  *** permalink parent award report block reply SpellingContable 2 points 6 hours ago Kek, permalink parent award report block reply JustAnotherPsyopNPC 2 points 13 hours ago what the ... permalink parent award report block reply view 1 more comments... Ironh19 1 points 9 hours ago like this permalink parent award report block reply BeauHD 1 points 8 hours ago reeee permalink parent award report block reply BeauHD 1 points 7 hours ago reeeeeeee permalink parent award report block reply view 2 more comments... Oliphaunt 4 points 14 hours ago No. Democrats lack imagination. They can't comprehend the evil of the soiled-child-mattress-tunnelling-rodents are who subverted our mainstream media and social media and Congress with their filthy lucre bribery and pedo extortion. They haven't noticed demons walking among us. permalink parent award report block reply seeling0 11 points 18 hours ago You'd think they'd give a fuck about appearing hypocritical, but Democrats lie like they breathe and I doubt they care about winning anyone over anymore. permalink award report block reply HKgoneWild 1 points 9 hours ago They're corrupted and co-opted in destroying the country. permalink parent award report block reply goldkeyboardwarrior 9 points 19 hours ago Apparently the lesson Dems learned from this is to primary those guys and try to replace them with far-leftists that can’t get elected in any state that isn’t at least D+20. permalink award report block reply MasterChief08 2 points 15 hours ago Conservatives need to start rigging elections permalink parent award report block reply Obambi -1 points 15 hours ago They work for the same tribe permalink parent award report block reply MasterChief08 1 points 14 hours ago I said conservatives. Not Republicans permalink parent award report block reply HKgoneWild 2 points 9 hours ago Conservatives. What has been conserved? We need restoration. Not conservation. permalink parent award report block reply view 1 more comments... barwhack 9 points 19 hours ago TDS: tedious. permalink award report block reply Doritalos 6 points 18 hours ago Democrats: \"WTF, I love Government shutdowns now\" I wonder what would happen if Trump vetos the CR and continues the shutdown, actually I don't wonder/ They will just flip flop again. permalink award report block reply KungPaoMcChicken 2 points 15 hours ago Then it will look like Trump did it permalink parent award report block reply FartOnLibtards 4 points 17 hours ago Democrats win the midterms in 2026... if Trump doesn't get his shit together and fix the economy permalink award report block reply MasterChief08 1 points 15 hours ago Just rig the election. I'm serious. Fuck the left. Order the Post Office to destroy ballots from Democrat strongholds. I don't care anymore. The left is pure evil. Don't ever give up power again permalink parent award report block reply JoinTheDiscussion 3 points 17 hours ago All while saying under their breath, thank you for not ending the filibuster so we can use it after we steal some seats in the midterms. permalink award report block reply Filo76 3 points 17 hours ago Democrats are upset because illegals didn't get their free healthcare and trannies didn't get elevated to most favored citizen (well, 2nd most). permalink award report block reply IntergalacticWalrus 3 points 17 hours ago We also didn't get our mass layoffs though. permalink parent award report block reply MasterChief08 1 points 15 hours ago Only 5k were laid off. Tops. It wasn't that effective. Another 4k resigned or retired who won't be coming back. permalink parent award report block reply HKgoneWild 1 points 9 hours ago Democrats and Republicans are upset because major airports were going to stop supporting donor's private aircraft flying in and out. permalink parent award report block reply Lordfred1993 2 points 10 hours ago It goes the same for Republicans.   Its all theater boys! permalink award report block reply HaSumBro 2 points 17 hours ago When does it open? We're at the 41 day mark. Does Trump fire everyone and then re-open it? Is it to late for mass layoffs? permalink award report block reply possibletower 2 points 17 hours ago Whenever the House passes the modified CR. They can pass it tomorrow I think. Depends on if Rand Paul delays it until next week because of some stupid hemp pork barrel amendment he is trying to pass. permalink parent award report block reply Filo76 3 points 17 hours ago Rand Paul is a shortsighted fool.  He thinks he's playing old fashioned politics, but all he's doing is playing into the democrats hand. We have a nation to save and he's being a petty bitch. permalink parent award report block reply MasterChief08 2 points 16 hours ago Yes the left are hypocrites. It's 2025. You're not going to guilt evil demonic people who literally want to murder us and our kids. We're in a war. Leftists are not our neighbors. They're terrorists and traitors. Learn friend-enemy distinction and apply it to your life. We need to protect ourselves. permalink award report block reply Badfinz_FL 1 points 12 hours ago 🤣🤣🤣🤣🤣 Yeah no shit.  The demo commies are coming apart at the seams like a cheap Korean suit permalink award report block reply Michalusmichalus 1 points 11 hours ago Without their lies and hypocrisy, they'd have nothing. permalink award report block reply Droford 1 points 12 hours ago This is what the Republicans did for years permalink award report block reply pugsan 1 points 11 hours ago I believe that for ~25-35% of individuals, politics is the same as any sport. Born/raised into it and propgandized to by the 'family', it's all they know. No matter the ideology, that percentage of people simply want their 'team' to win. At any cost. permalink award report block reply YodaBannon 1 points 13 hours ago 😂 permalink award report block reply ModelMinority 1 points 14 hours ago World would be better if there were fewer libtards. permalink award report block reply GarudaOne 1 points 15 hours ago Too true. permalink award report block reply\nTheRedPilledArtist 42 points 19 hours ago Wait a minute, you mean Democrats are 𝙙𝙞𝙨𝙝𝙤𝙣𝙚𝙨𝙩?! permalink award report block reply BeauHD 11 points 18 hours ago Dude how did you do the bold italic? permalink parent award report block reply TheRedPilledArtist 8 points 18 hours ago Try three asterisks before and after your sentence. permalink parent award report block reply Quietam_Unum 3 points 11 hours ago Try three asterisks Two is italic, three is bold & italic Octothorpe at beginning of line is large: \"# text\" Text https://www.markdownguide.org/cheat-sheet/ permalink parent award report block reply crashdaddy 2 points 11 hours ago One is italic, two is bold, and three is both. Bonus Putting two tildes (~) before and after the text makes it strikethrough ! and putting an octothorpe at the beginning of the line makes it YUGE ( many people say it's the yugest ) And you know how I got that groovy horizontal line up there? That's right, three underscores (_) in a row at the beginning of a line. permalink parent award report block reply view 2 more comments... Hawksendoom 2 points 15 hours ago *** what the...  *** permalink parent award report block reply SpellingContable 2 points 6 hours ago Kek, permalink parent award report block reply JustAnotherPsyopNPC 2 points 13 hours ago what the ... permalink parent award report block reply view 1 more comments... Ironh19 1 points 9 hours ago like this permalink parent award report block reply BeauHD 1 points 8 hours ago reeee permalink parent award report block reply BeauHD 1 points 7 hours ago reeeeeeee permalink parent award report block reply view 2 more comments... Oliphaunt 4 points 14 hours ago No. Democrats lack imagination. They can't comprehend the evil of the soiled-child-mattress-tunnelling-rodents are who subverted our mainstream media and social media and Congress with their filthy lucre bribery and pedo extortion. They haven't noticed demons walking among us. permalink parent award report block reply\nBeauHD 11 points 18 hours ago Dude how did you do the bold italic? permalink parent award report block reply TheRedPilledArtist 8 points 18 hours ago Try three asterisks before and after your sentence. permalink parent award report block reply Quietam_Unum 3 points 11 hours ago Try three asterisks Two is italic, three is bold & italic Octothorpe at beginning of line is large: \"# text\" Text https://www.markdownguide.org/cheat-sheet/ permalink parent award report block reply crashdaddy 2 points 11 hours ago One is italic, two is bold, and three is both. Bonus Putting two tildes (~) before and after the text makes it strikethrough ! and putting an octothorpe at the beginning of the line makes it YUGE ( many people say it's the yugest ) And you know how I got that groovy horizontal line up there? That's right, three underscores (_) in a row at the beginning of a line. permalink parent award report block reply view 2 more comments... Hawksendoom 2 points 15 hours ago *** what the...  *** permalink parent award report block reply SpellingContable 2 points 6 hours ago Kek, permalink parent award report block reply JustAnotherPsyopNPC 2 points 13 hours ago what the ... permalink parent award report block reply view 1 more comments... Ironh19 1 points 9 hours ago like this permalink parent award report block reply BeauHD 1 points 8 hours ago reeee permalink parent award report block reply BeauHD 1 points 7 hours ago reeeeeeee permalink parent award report block reply view 2 more comments...\nTheRedPilledArtist 8 points 18 hours ago Try three asterisks before and after your sentence. permalink parent award report block reply Quietam_Unum 3 points 11 hours ago Try three asterisks Two is italic, three is bold & italic Octothorpe at beginning of line is large: \"# text\" Text https://www.markdownguide.org/cheat-sheet/ permalink parent award report block reply crashdaddy 2 points 11 hours ago One is italic, two is bold, and three is both. Bonus Putting two tildes (~) before and after the text makes it strikethrough ! and putting an octothorpe at the beginning of the line makes it YUGE ( many people say it's the yugest ) And you know how I got that groovy horizontal line up there? That's right, three underscores (_) in a row at the beginning of a line. permalink parent award report block reply view 2 more comments... Hawksendoom 2 points 15 hours ago *** what the...  *** permalink parent award report block reply SpellingContable 2 points 6 hours ago Kek, permalink parent award report block reply JustAnotherPsyopNPC 2 points 13 hours ago what the ... permalink parent award report block reply view 1 more comments...\nQuietam_Unum 3 points 11 hours ago Try three asterisks Two is italic, three is bold & italic Octothorpe at beginning of line is large: \"# text\" Text https://www.markdownguide.org/cheat-sheet/ permalink parent award report block reply crashdaddy 2 points 11 hours ago One is italic, two is bold, and three is both. Bonus Putting two tildes (~) before and after the text makes it strikethrough ! and putting an octothorpe at the beginning of the line makes it YUGE ( many people say it's the yugest ) And you know how I got that groovy horizontal line up there? That's right, three underscores (_) in a row at the beginning of a line. permalink parent award report block reply view 2 more comments...\ncrashdaddy 2 points 11 hours ago One is italic, two is bold, and three is both. Bonus Putting two tildes (~) before and after the text makes it strikethrough ! and putting an octothorpe at the beginning of the line makes it YUGE ( many people say it's the yugest ) And you know how I got that groovy horizontal line up there? That's right, three underscores (_) in a row at the beginning of a line. permalink parent award report block reply view 2 more comments...\nHawksendoom 2 points 15 hours ago *** what the...  *** permalink parent award report block reply SpellingContable 2 points 6 hours ago Kek, permalink parent award report block reply JustAnotherPsyopNPC 2 points 13 hours ago what the ... permalink parent award report block reply view 1 more comments...\nSpellingContable 2 points 6 hours ago Kek, permalink parent award report block reply\nJustAnotherPsyopNPC 2 points 13 hours ago what the ... permalink parent award report block reply view 1 more comments...\nIronh19 1 points 9 hours ago like this permalink parent award report block reply BeauHD 1 points 8 hours ago reeee permalink parent award report block reply BeauHD 1 points 7 hours ago reeeeeeee permalink parent award report block reply view 2 more comments...\nBeauHD 1 points 8 hours ago reeee permalink parent award report block reply BeauHD 1 points 7 hours ago reeeeeeee permalink parent award report block reply view 2 more comments...\nBeauHD 1 points 7 hours ago reeeeeeee permalink parent award report block reply view 2 more comments...\nOliphaunt 4 points 14 hours ago No. Democrats lack imagination. They can't comprehend the evil of the soiled-child-mattress-tunnelling-rodents are who subverted our mainstream media and social media and Congress with their filthy lucre bribery and pedo extortion. They haven't noticed demons walking among us. permalink parent award report block reply\nseeling0 11 points 18 hours ago You'd think they'd give a fuck about appearing hypocritical, but Democrats lie like they breathe and I doubt they care about winning anyone over anymore. permalink award report block reply HKgoneWild 1 points 9 hours ago They're corrupted and co-opted in destroying the country. permalink parent award report block reply\nHKgoneWild 1 points 9 hours ago They're corrupted and co-opted in destroying the country. permalink parent award report block reply\ngoldkeyboardwarrior 9 points 19 hours ago Apparently the lesson Dems learned from this is to primary those guys and try to replace them with far-leftists that can’t get elected in any state that isn’t at least D+20. permalink award report block reply MasterChief08 2 points 15 hours ago Conservatives need to start rigging elections permalink parent award report block reply Obambi -1 points 15 hours ago They work for the same tribe permalink parent award report block reply MasterChief08 1 points 14 hours ago I said conservatives. Not Republicans permalink parent award report block reply HKgoneWild 2 points 9 hours ago Conservatives. What has been conserved? We need restoration. Not conservation. permalink parent award report block reply view 1 more comments...\nMasterChief08 2 points 15 hours ago Conservatives need to start rigging elections permalink parent award report block reply Obambi -1 points 15 hours ago They work for the same tribe permalink parent award report block reply MasterChief08 1 points 14 hours ago I said conservatives. Not Republicans permalink parent award report block reply HKgoneWild 2 points 9 hours ago Conservatives. What has been conserved? We need restoration. Not conservation. permalink parent award report block reply view 1 more comments...\nObambi -1 points 15 hours ago They work for the same tribe permalink parent award report block reply MasterChief08 1 points 14 hours ago I said conservatives. Not Republicans permalink parent award report block reply HKgoneWild 2 points 9 hours ago Conservatives. What has been conserved? We need restoration. Not conservation. permalink parent award report block reply view 1 more comments...\nMasterChief08 1 points 14 hours ago I said conservatives. Not Republicans permalink parent award report block reply HKgoneWild 2 points 9 hours ago Conservatives. What has been conserved? We need restoration. Not conservation. permalink parent award report block reply view 1 more comments...\nHKgoneWild 2 points 9 hours ago Conservatives. What has been conserved? We need restoration. Not conservation. permalink parent award report block reply view 1 more comments...\nbarwhack 9 points 19 hours ago TDS: tedious. permalink award report block reply\nDoritalos 6 points 18 hours ago Democrats: \"WTF, I love Government shutdowns now\" I wonder what would happen if Trump vetos the CR and continues the shutdown, actually I don't wonder/ They will just flip flop again. permalink award report block reply KungPaoMcChicken 2 points 15 hours ago Then it will look like Trump did it permalink parent award report block reply\nKungPaoMcChicken 2 points 15 hours ago Then it will look like Trump did it permalink parent award report block reply\nFartOnLibtards 4 points 17 hours ago Democrats win the midterms in 2026... if Trump doesn't get his shit together and fix the economy permalink award report block reply MasterChief08 1 points 15 hours ago Just rig the election. I'm serious. Fuck the left. Order the Post Office to destroy ballots from Democrat strongholds. I don't care anymore. The left is pure evil. Don't ever give up power again permalink parent award report block reply\nMasterChief08 1 points 15 hours ago Just rig the election. I'm serious. Fuck the left. Order the Post Office to destroy ballots from Democrat strongholds. I don't care anymore. The left is pure evil. Don't ever give up power again permalink parent award report block reply\nJoinTheDiscussion 3 points 17 hours ago All while saying under their breath, thank you for not ending the filibuster so we can use it after we steal some seats in the midterms. permalink award report block reply\nFilo76 3 points 17 hours ago Democrats are upset because illegals didn't get their free healthcare and trannies didn't get elevated to most favored citizen (well, 2nd most). permalink award report block reply IntergalacticWalrus 3 points 17 hours ago We also didn't get our mass layoffs though. permalink parent award report block reply MasterChief08 1 points 15 hours ago Only 5k were laid off. Tops. It wasn't that effective. Another 4k resigned or retired who won't be coming back. permalink parent award report block reply HKgoneWild 1 points 9 hours ago Democrats and Republicans are upset because major airports were going to stop supporting donor's private aircraft flying in and out. permalink parent award report block reply\nIntergalacticWalrus 3 points 17 hours ago We also didn't get our mass layoffs though. permalink parent award report block reply MasterChief08 1 points 15 hours ago Only 5k were laid off. Tops. It wasn't that effective. Another 4k resigned or retired who won't be coming back. permalink parent award report block reply\nMasterChief08 1 points 15 hours ago Only 5k were laid off. Tops. It wasn't that effective. Another 4k resigned or retired who won't be coming back. permalink parent award report block reply\nHKgoneWild 1 points 9 hours ago Democrats and Republicans are upset because major airports were going to stop supporting donor's private aircraft flying in and out. permalink parent award report block reply\nLordfred1993 2 points 10 hours ago It goes the same for Republicans.   Its all theater boys! permalink award report block reply\nHaSumBro 2 points 17 hours ago When does it open? We're at the 41 day mark. Does Trump fire everyone and then re-open it? Is it to late for mass layoffs? permalink award report block reply possibletower 2 points 17 hours ago Whenever the House passes the modified CR. They can pass it tomorrow I think. Depends on if Rand Paul delays it until next week because of some stupid hemp pork barrel amendment he is trying to pass. permalink parent award report block reply Filo76 3 points 17 hours ago Rand Paul is a shortsighted fool.  He thinks he's playing old fashioned politics, but all he's doing is playing into the democrats hand. We have a nation to save and he's being a petty bitch. permalink parent award report block reply\npossibletower 2 points 17 hours ago Whenever the House passes the modified CR. They can pass it tomorrow I think. Depends on if Rand Paul delays it until next week because of some stupid hemp pork barrel amendment he is trying to pass. permalink parent award report block reply Filo76 3 points 17 hours ago Rand Paul is a shortsighted fool.  He thinks he's playing old fashioned politics, but all he's doing is playing into the democrats hand. We have a nation to save and he's being a petty bitch. permalink parent award report block reply\nFilo76 3 points 17 hours ago Rand Paul is a shortsighted fool.  He thinks he's playing old fashioned politics, but all he's doing is playing into the democrats hand. We have a nation to save and he's being a petty bitch. permalink parent award report block reply\nMasterChief08 2 points 16 hours ago Yes the left are hypocrites. It's 2025. You're not going to guilt evil demonic people who literally want to murder us and our kids. We're in a war. Leftists are not our neighbors. They're terrorists and traitors. Learn friend-enemy distinction and apply it to your life. We need to protect ourselves. permalink award report block reply\nBadfinz_FL 1 points 12 hours ago 🤣🤣🤣🤣🤣 Yeah no shit.  The demo commies are coming apart at the seams like a cheap Korean suit permalink award report block reply\nMichalusmichalus 1 points 11 hours ago Without their lies and hypocrisy, they'd have nothing. permalink award report block reply\nDroford 1 points 12 hours ago This is what the Republicans did for years permalink award report block reply\npugsan 1 points 11 hours ago I believe that for ~25-35% of individuals, politics is the same as any sport. Born/raised into it and propgandized to by the 'family', it's all they know. No matter the ideology, that percentage of people simply want their 'team' to win. At any cost. permalink award report block reply\nYodaBannon 1 points 13 hours ago 😂 permalink award report block reply\nModelMinority 1 points 14 hours ago World would be better if there were fewer libtards. permalink award report block reply\nGarudaOne 1 points 15 hours ago Too true. permalink award report block reply",
  "fetched_at": "2025-11-12T23:03:33.560422Z"
}