{
  "id": "1ARK9oWvFi",
  "url": "https://patriots.win/p/1ARK9oWvFi/breaking-newsoms-former-chief-of/c",
  "content": "501 BREAKING: Newsom’s Former Chief of Staff Arrested by the FBI on Bank and Wire Fraud Charges (www.thegatewaypundit.com) posted 1 hour ago by thegatewaybandit 38 comments award share report block BREAKING: Newsom's Former Chief of Staff Arrested by the FBI on Bank and Wire Fraud Charges | The Gateway Pundit | by Cristina L... California Governor Gavin Newsom’s former Chief of Staff was arrested by the FBI in a public corruption probe. www.thegatewaypundit.com\n38 comments Sort by Top Top New Worst Old Save Around the Web Spawnlingman 55 points 1 hour ago It's always \"Former\".  They never go after anyone that's currently in position.   There is never an arrest where their pulling someone right out of their position of currently wrecking the country. permalink award report block reply DontTreadOnLego 12 points 55 minutes ago That's because they scurry away from their position when there are investigations ongoing. permalink parent award report block reply UH69MAGA 4 points 36 minutes ago Katie Hobbs' Henchwitches. permalink parent award report block reply MissingTrump 6 points 53 minutes ago And it's always low level people that never flip in their bosses. So predictable. But hey, at least we got an arrest. permalink parent award report block reply Hanging_Chad 2 points 10 minutes ago I’d be happy with Killary getting arrested permalink parent award report block reply War_Hamster 1 points 25 minutes ago Adam Schiff might soon be an exception to your observation. But I'm only focused on the Florida Grand Jury in January. permalink parent award report block reply BBvarn 1 points 21 minutes ago Why is Gen Z so fucking stupid. permalink parent award report block reply BidenSniffsLittleKid 23 points 1 hour ago Another arrest of a person no one cares about. Fantastic permalink award report block reply StrongIsland 3 points 38 minutes ago Yup… it’s like ending wars in whogivesafuckstan vs negroville… it’s worthless! But everyone here will parade it like the top win 👌 otherwise your a doomer 🙄 permalink parent award report block reply War_Hamster 1 points 23 minutes ago These are actually names most in CA politics are aware of. They're not headliners, but they're certainly not nobodies. permalink parent award report block reply Drewniverse 14 points 1 hour ago You mean leftists are criminals?? I was just about to switch parties because MAGA is done for according to Rachael Maddow. I'm going back to my MSM now boys. slurping sounds intensify permalink award report block reply ShadowInv 1 points 5 minutes ago America first party would be cool permalink parent award report block reply bumpman 10 points 1 hour ago Newsom has some skeletons in his closet, all it takes is a bit of digging, the mf is corrupt I hope they can get this former chief of staff to flip on newsom, tell us all the illegal shit he has done and we will cut you a break.. but it’s the fbi, so it’s hard to count on them permalink award report block reply Riehlpissed 6 points 30 minutes ago That’s a sign of a good incoming want to be president. permalink award report block reply TEXinLA 3 points 1 hour ago POPCORN & BEER permalink award report block reply GuidedDisinfo 2 points 39 minutes ago New scum indeed.  The sleazebag warns public servants about the Trump Administration’s pursuit of Trump’s “political enemies” when his former chief of staff has been under investigation for the past 3 years, 2 of which were while she was his current chief of staff. permalink award report block reply blueballs43 2 points 49 minutes ago HANDS CRAZY MAN AND FRIENDS, THE CALIFORNIA POLITICAL ZOO... who is the ORANGUTAN! and who is the Hippo and who is the Hyena permalink award report block reply Hangmhigh 2 points 1 hour ago Hopefully this is to get him to turn on someone that matters. Not holding by breath. permalink award report block reply TakingCoatsWIN 2 points 44 minutes ago I like where this is going... permalink award report block reply ConsrvspkgNJ 2 points 28 minutes ago Well, it looks they are starting to roll people up into Newscum. Let's see how insulated Newscum is or did his arrogance make him think he is teflon. permalink award report block reply YodaBannon 1 points 1 hour ago <hair gel's hand movements> permalink award report block reply MedicallyReddit 1 points 1 hour ago Let me know once Killdawg is in cuffs permalink award report block reply JesusTheOnlyWay 1 points 51 minutes ago Trump has already talked about how leaving her alone was a great decision permalink parent award report block reply KernalMustard 1 points 31 minutes ago I'm a fool for believing him. permalink parent award report block reply JesusTheOnlyWay 1 points 28 minutes ago Not really. Trump was a beast. He flipped politics on its' head. He's done a lot of great things. I don't think anyone could forsee brakes on this train. But here we are permalink parent award report block reply BrokenWolf2022 1 points 12 minutes ago I call bullshit. This DOJ doesn't arrest anyone. permalink award report block reply KarenLukasik 1 points 9 minutes ago That’s why politicians try to never retire! permalink award report block reply America101 1 points 6 minutes ago Newsom needs to be investigated. permalink award report block reply Cuetardian 1 points 45 minutes ago Don't tell me we're actually going to do something to these criminals . . . permalink award report block reply ReleasetheList 1 points 4 minutes ago They must have thought throwing crumbs at us like chickens would placate us. We want the red meat. permalink award report block reply Riehlpissed 1 points 31 minutes ago At Newsomes insistsnce, allegedly. permalink award report block reply Deplora 1 points 54 minutes ago Here we go with stickying a Gateway Spamdit post again.  Hey u/RuprechtThaMonkeyBoy do you think you could manage to pull down the AD this spambot posted, which I reported half an hour ago?? https://patriots.win/p/1ARK9oWeTD/dr-peter-mccullough-on-a-revolut/c permalink award report block reply RealTXPatriot 1 points 3 minutes ago I feel like media and even appears this site ... appears like theyre grooming us for this numb nuts fuck ass to be the nominee and likely win because of how media (and this site as well) are portraying VP Vance. Nobody in the normie world votes for a fat ass Richard Simmons look a like which is what the fat JD memes are really pushing him like. Meanwhile... memes about fuckwit hair gel Hitler in CA... nothing of the sort. Seems like a lot of field preparation for something we dont want.\nMake JD a fucking Chad. Make newsom a retard. permalink award report block reply aqua27 1 points 52 minutes ago Put the screws to him and get him to give up Newcome. permalink award report block reply freebirdie 0 points 38 minutes ago Gavin Newsom stole the fire aid money. Sure would be nice if we were in charge so we could go after him for embezzlement of 100 million dollars. Best we can do is more H1Bs and a reminder of how fucking stupid we are. Downvote away cultist faggots. You're dumber than a box of dog shit. permalink award report block reply Cuck-WTF 0 points 38 minutes ago So a fall guy permalink award report block reply Galahad175 -1 points 36 minutes ago Gateway bot.. gateway garbage permalink award report block reply Lulzokbro -1 points 28 minutes ago No one important will ever get charged permalink award report block reply Mhmm2MoreWeeks -2 points 1 hour ago Close Enough to know to get CLOSER. permalink award report block reply\nSpawnlingman 55 points 1 hour ago It's always \"Former\".  They never go after anyone that's currently in position.   There is never an arrest where their pulling someone right out of their position of currently wrecking the country. permalink award report block reply DontTreadOnLego 12 points 55 minutes ago That's because they scurry away from their position when there are investigations ongoing. permalink parent award report block reply UH69MAGA 4 points 36 minutes ago Katie Hobbs' Henchwitches. permalink parent award report block reply MissingTrump 6 points 53 minutes ago And it's always low level people that never flip in their bosses. So predictable. But hey, at least we got an arrest. permalink parent award report block reply Hanging_Chad 2 points 10 minutes ago I’d be happy with Killary getting arrested permalink parent award report block reply War_Hamster 1 points 25 minutes ago Adam Schiff might soon be an exception to your observation. But I'm only focused on the Florida Grand Jury in January. permalink parent award report block reply BBvarn 1 points 21 minutes ago Why is Gen Z so fucking stupid. permalink parent award report block reply\nDontTreadOnLego 12 points 55 minutes ago That's because they scurry away from their position when there are investigations ongoing. permalink parent award report block reply UH69MAGA 4 points 36 minutes ago Katie Hobbs' Henchwitches. permalink parent award report block reply\nUH69MAGA 4 points 36 minutes ago Katie Hobbs' Henchwitches. permalink parent award report block reply\nMissingTrump 6 points 53 minutes ago And it's always low level people that never flip in their bosses. So predictable. But hey, at least we got an arrest. permalink parent award report block reply\nHanging_Chad 2 points 10 minutes ago I’d be happy with Killary getting arrested permalink parent award report block reply\nWar_Hamster 1 points 25 minutes ago Adam Schiff might soon be an exception to your observation. But I'm only focused on the Florida Grand Jury in January. permalink parent award report block reply\nBBvarn 1 points 21 minutes ago Why is Gen Z so fucking stupid. permalink parent award report block reply\nBidenSniffsLittleKid 23 points 1 hour ago Another arrest of a person no one cares about. Fantastic permalink award report block reply StrongIsland 3 points 38 minutes ago Yup… it’s like ending wars in whogivesafuckstan vs negroville… it’s worthless! But everyone here will parade it like the top win 👌 otherwise your a doomer 🙄 permalink parent award report block reply War_Hamster 1 points 23 minutes ago These are actually names most in CA politics are aware of. They're not headliners, but they're certainly not nobodies. permalink parent award report block reply\nStrongIsland 3 points 38 minutes ago Yup… it’s like ending wars in whogivesafuckstan vs negroville… it’s worthless! But everyone here will parade it like the top win 👌 otherwise your a doomer 🙄 permalink parent award report block reply\nWar_Hamster 1 points 23 minutes ago These are actually names most in CA politics are aware of. They're not headliners, but they're certainly not nobodies. permalink parent award report block reply\nDrewniverse 14 points 1 hour ago You mean leftists are criminals?? I was just about to switch parties because MAGA is done for according to Rachael Maddow. I'm going back to my MSM now boys. slurping sounds intensify permalink award report block reply ShadowInv 1 points 5 minutes ago America first party would be cool permalink parent award report block reply\nShadowInv 1 points 5 minutes ago America first party would be cool permalink parent award report block reply\nbumpman 10 points 1 hour ago Newsom has some skeletons in his closet, all it takes is a bit of digging, the mf is corrupt I hope they can get this former chief of staff to flip on newsom, tell us all the illegal shit he has done and we will cut you a break.. but it’s the fbi, so it’s hard to count on them permalink award report block reply\nRiehlpissed 6 points 30 minutes ago That’s a sign of a good incoming want to be president. permalink award report block reply\nTEXinLA 3 points 1 hour ago POPCORN & BEER permalink award report block reply\nGuidedDisinfo 2 points 39 minutes ago New scum indeed.  The sleazebag warns public servants about the Trump Administration’s pursuit of Trump’s “political enemies” when his former chief of staff has been under investigation for the past 3 years, 2 of which were while she was his current chief of staff. permalink award report block reply\nblueballs43 2 points 49 minutes ago HANDS CRAZY MAN AND FRIENDS, THE CALIFORNIA POLITICAL ZOO... who is the ORANGUTAN! and who is the Hippo and who is the Hyena permalink award report block reply\nHangmhigh 2 points 1 hour ago Hopefully this is to get him to turn on someone that matters. Not holding by breath. permalink award report block reply\nTakingCoatsWIN 2 points 44 minutes ago I like where this is going... permalink award report block reply\nConsrvspkgNJ 2 points 28 minutes ago Well, it looks they are starting to roll people up into Newscum. Let's see how insulated Newscum is or did his arrogance make him think he is teflon. permalink award report block reply\nYodaBannon 1 points 1 hour ago <hair gel's hand movements> permalink award report block reply\nMedicallyReddit 1 points 1 hour ago Let me know once Killdawg is in cuffs permalink award report block reply JesusTheOnlyWay 1 points 51 minutes ago Trump has already talked about how leaving her alone was a great decision permalink parent award report block reply KernalMustard 1 points 31 minutes ago I'm a fool for believing him. permalink parent award report block reply JesusTheOnlyWay 1 points 28 minutes ago Not really. Trump was a beast. He flipped politics on its' head. He's done a lot of great things. I don't think anyone could forsee brakes on this train. But here we are permalink parent award report block reply\nJesusTheOnlyWay 1 points 51 minutes ago Trump has already talked about how leaving her alone was a great decision permalink parent award report block reply KernalMustard 1 points 31 minutes ago I'm a fool for believing him. permalink parent award report block reply JesusTheOnlyWay 1 points 28 minutes ago Not really. Trump was a beast. He flipped politics on its' head. He's done a lot of great things. I don't think anyone could forsee brakes on this train. But here we are permalink parent award report block reply\nKernalMustard 1 points 31 minutes ago I'm a fool for believing him. permalink parent award report block reply JesusTheOnlyWay 1 points 28 minutes ago Not really. Trump was a beast. He flipped politics on its' head. He's done a lot of great things. I don't think anyone could forsee brakes on this train. But here we are permalink parent award report block reply\nJesusTheOnlyWay 1 points 28 minutes ago Not really. Trump was a beast. He flipped politics on its' head. He's done a lot of great things. I don't think anyone could forsee brakes on this train. But here we are permalink parent award report block reply\nBrokenWolf2022 1 points 12 minutes ago I call bullshit. This DOJ doesn't arrest anyone. permalink award report block reply\nKarenLukasik 1 points 9 minutes ago That’s why politicians try to never retire! permalink award report block reply\nAmerica101 1 points 6 minutes ago Newsom needs to be investigated. permalink award report block reply\nCuetardian 1 points 45 minutes ago Don't tell me we're actually going to do something to these criminals . . . permalink award report block reply\nReleasetheList 1 points 4 minutes ago They must have thought throwing crumbs at us like chickens would placate us. We want the red meat. permalink award report block reply\nRiehlpissed 1 points 31 minutes ago At Newsomes insistsnce, allegedly. permalink award report block reply\nDeplora 1 points 54 minutes ago Here we go with stickying a Gateway Spamdit post again.  Hey u/RuprechtThaMonkeyBoy do you think you could manage to pull down the AD this spambot posted, which I reported half an hour ago?? https://patriots.win/p/1ARK9oWeTD/dr-peter-mccullough-on-a-revolut/c permalink award report block reply\nRealTXPatriot 1 points 3 minutes ago I feel like media and even appears this site ... appears like theyre grooming us for this numb nuts fuck ass to be the nominee and likely win because of how media (and this site as well) are portraying VP Vance. Nobody in the normie world votes for a fat ass Richard Simmons look a like which is what the fat JD memes are really pushing him like. Meanwhile... memes about fuckwit hair gel Hitler in CA... nothing of the sort. Seems like a lot of field preparation for something we dont want.\nMake JD a fucking Chad. Make newsom a retard. permalink award report block reply\naqua27 1 points 52 minutes ago Put the screws to him and get him to give up Newcome. permalink award report block reply\nfreebirdie 0 points 38 minutes ago Gavin Newsom stole the fire aid money. Sure would be nice if we were in charge so we could go after him for embezzlement of 100 million dollars. Best we can do is more H1Bs and a reminder of how fucking stupid we are. Downvote away cultist faggots. You're dumber than a box of dog shit. permalink award report block reply\nCuck-WTF 0 points 38 minutes ago So a fall guy permalink award report block reply\nGalahad175 -1 points 36 minutes ago Gateway bot.. gateway garbage permalink award report block reply\nLulzokbro -1 points 28 minutes ago No one important will ever get charged permalink award report block reply\nMhmm2MoreWeeks -2 points 1 hour ago Close Enough to know to get CLOSER. permalink award report block reply",
  "fetched_at": "2025-11-12T23:29:26.495419Z"
}