{
  "id": "1ARK9l7jpI",
  "url": "https://patriots.win/p/1ARK9l7jpI/if-fuck-everyone-in-america-was-/c",
  "content": "527 If \"Fuck everyone in America\" was a Handshake posted 1 day ago by projectarcturus1 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save TheAftermath 9 points 1 day ago The classic 'it's a big club and you ain't in it' gesture. permalink award report block reply Shakakka99 7 points 1 day ago Blunder Twin powers, activate!!! FORM OF... a drunken stock thief! SHAPE OF... an oblivious turtle! permalink award report block reply SicSemperTyrannis2 2 points 13 hours ago Turkey neck and saline permalink parent award report block reply Retard_Strength 7 points 1 day ago be hilarious if they knocked each other over and shattered their hips permalink award report block reply heavyD 3 points 1 day ago You gave me that picture in my head where the turtle can't turn himself back over. permalink parent award report block reply heavyD 6 points 1 day ago Netflix \"tortoise and the ho\" permalink award report block reply Darth0311 2 points 17 hours ago You got vodka on my peanut butter! Well, you got peanut butter on my vodka! permalink award report block reply JamesBlomey 2 points 21 hours ago I wish I was living in the timeline where \"Thalidomide Nancy\" was a thing. permalink award report block reply JamesBlomey 2 points 21 hours ago I see Nancy is making a joke about Mitch's sister in law putting her Tesla in Drive and Mitch is trying to punch her out. permalink award report block reply expertnoticer 1 points 19 hours ago Comment removed by community filter, pending further review. permalink award report block reply\nTheAftermath 9 points 1 day ago The classic 'it's a big club and you ain't in it' gesture. permalink award report block reply\nShakakka99 7 points 1 day ago Blunder Twin powers, activate!!! FORM OF... a drunken stock thief! SHAPE OF... an oblivious turtle! permalink award report block reply SicSemperTyrannis2 2 points 13 hours ago Turkey neck and saline permalink parent award report block reply\nSicSemperTyrannis2 2 points 13 hours ago Turkey neck and saline permalink parent award report block reply\nRetard_Strength 7 points 1 day ago be hilarious if they knocked each other over and shattered their hips permalink award report block reply heavyD 3 points 1 day ago You gave me that picture in my head where the turtle can't turn himself back over. permalink parent award report block reply\nheavyD 3 points 1 day ago You gave me that picture in my head where the turtle can't turn himself back over. permalink parent award report block reply\nheavyD 6 points 1 day ago Netflix \"tortoise and the ho\" permalink award report block reply\nDarth0311 2 points 17 hours ago You got vodka on my peanut butter! Well, you got peanut butter on my vodka! permalink award report block reply\nJamesBlomey 2 points 21 hours ago I wish I was living in the timeline where \"Thalidomide Nancy\" was a thing. permalink award report block reply\nJamesBlomey 2 points 21 hours ago I see Nancy is making a joke about Mitch's sister in law putting her Tesla in Drive and Mitch is trying to punch her out. permalink award report block reply\nexpertnoticer 1 points 19 hours ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T21:00:54.064891Z"
}