{
  "id": "8170765",
  "title": "1524This🔥🗑️ ️ GARBAGE PEOPLE  🗑️🔥posted6 days agobywst478 commentsawardsharedownloadreportblock",
  "url": "https://patriots.win/p/1ARK514PX3/this/c",
  "content": "1524 This 🔥🗑️ ️ GARBAGE PEOPLE  🗑️🔥 posted 6 days ago by wst4 78 comments award share download report block\n78 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style YodaBannon 40 points 6 days ago playin the oldies today? permalink award report block reply Mr_Rightside 10 points 6 days ago What is it with Democrats and giving nazi salutes? AOC (Video) Barrack Obama Bill Nye (Video) Cory Booker (Video) Elizabeth Warren (Gif) Hillary Clinton Hillary Clinton again Hillary just can't help herself Jasmine Crockett Kamala Harris (Video) - Salute starts at 5:50-6:00 Tim Walz (Video) Tim Walz again permalink parent award report block reply DT170x 10 points 6 days ago Because it's (D)ifferent permalink parent award report block reply 5DchessWatch -1 points 6 days ago But they're all gay and / or jews.  They can't be nazis.  (/s) permalink parent award report block reply Govtizbad 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply posedgeclk 5 points 6 days ago They have a goal here: affirming that the media is reined in at all times. permalink parent award report block reply MacheteSanta 1 points 6 days ago You misspelled \"DemonKKKrats.\" permalink parent award report block reply Cacciali_Via 0 points 5 days ago You may not be a boomer, but you sure sound like one. permalink parent award report block reply MacheteSanta 1 points 5 days ago So you never knew the \"democrat\" party invented the KKK? Who's the boomer now? https://web.archive.org/web/20251011225626/https://www.conservapedia.com/Ku_Klux_Klan https://www.breitbart.com/politics/2016/08/25/hillary-clinton-friend-mentor-robert-byrd-kkk/ https://www.conservapedia.com/Robert_Byrd Robert Carlyle Byrd (November 20, 1917 – June 28, 2010) was a Democrat Senator and Exalted Cyclops of the Ku Klux Klan from West Virginia. He was the oldest member of Congress at his death at age 92, President pro tempore of the US Senate, and was the longest-serving Senator in history, having been first elected in 1958. Byrd twice held the position of Senate Democrat Leader, was a crucial 60th vote in holding a filibuster-proof Senate in 2009, is the only senator to have cast over 18,000 votes,[1] never once lost a general election[2] and remained a Democrat Party legend and icon until the end. He was third in line to the Presidency behind Vice President Joe Biden and Speaker Nancy Pelosi. permalink parent award report block reply view 3 more comments... SteelDriver 1 points 6 days ago It's only a \"Nazi Salute\" when someone on the right does it.  😉 permalink parent award report block reply bigdickhangsright 2 points 6 days ago 🎵 I just want to set the world on fiiiiiiiirrrrre 🎵 permalink parent award report block reply Made_in_America 23 points 6 days ago You give them way too much credit. The Nazis actually improved the pre-war German economy. permalink award report block reply hairless_ap3 23 points 6 days ago Exactly, calling these incompetent retards Nazis gives Nazis a bad name - at least the real Nazis were competent permalink parent award report block reply rebuildingMyself 14 points 6 days ago So competent, that the post WW2 new world order was obsessed with making sure Whites never have a shared identity or collective pride ever again while aggressively promoting all other races permalink parent award report block reply HeavyMetalPatriot 7 points 6 days ago Stop noticing!!! permalink parent award report block reply Coprolite 5 points 6 days ago Noticing is a dog whistle permalink parent award report block reply posedgeclk 5 points 6 days ago Sort of, but the tactics were every bit as socialist as FDR's. permalink parent award report block reply Made_in_America 4 points 6 days ago Not exactly. There's slight strategic overlap. Hitler reunited Germany with wealthy Bavaria, invested in industry and created real jobs that moved the economy forward whereas FDR created a lot of wasteful \"make work\" positions that critics called \"boondoggle\". But the best thing Hitler did was to kick the Rothschild banks out of Germany. If FDR had ended the Fed, he'd have been more economically successful. permalink parent award report block reply Jimmyprawns 2 points 6 days ago They were socialists who ran out of other people's money and had to invade and colonize Europe just to cover the enormous costs of their rampant social spending.  They didn't fix shit, they just promised a lot of free stuff for the workers and then paid for it by pillaging neighbor countries (western Europe).  It all fell apart when they invaded a country too poor, too backward, and too far down the socialist trail themselves to be a profitable colony: the USSR. permalink parent award report block reply Made_in_America 1 points 6 days ago Germany got a pretty shitty deal after WW1. They were split into pieces and forced to pay reparations that left them broke. On top of that they were getting eaten alive by parasitic usury and a Bolshevik-like coup attempt similar to what happened in Russia in the 1920s. Say what you will about their approach to solving things but the Nazis grievances against Jews were 100% legitimate. Their society was being morally eroded with child prostitution and gender affirming theory and economically destroyed just as America is today. And it's the same people doing it. permalink parent award report block reply Jimmyprawns 1 points 6 days ago \"Nazis grievances against Jews were 100% legitimate.\" Cope and seeth storm fag. Hitler and Stalin were fellow travelers and the east front was a lovers quarrel between ego maniacal dictators. permalink parent award report block reply CleanUpPhillyTrump24 14 points 6 days ago A contractor who is a Dem that I hire said, \"OH ELON DID A NAZI SALUTE. WHADDYOO SAY ABOUT THAT?\" I said, \"That is the most fucking retarded thing I have heard you or anyone ever say. Seriously? That's your beef with Elon? Because that proves that you need to turn off that giant TV and get a clue again.\" He looked red and angry. No one talks like this to Dems, but you all need to. Straight talk. Key to saving America is to make being stupid embarrassing again. Mockery will save us. permalink award report block reply HeavyMetalPatriot 6 points 6 days ago who is a Dem that I hire And there's the problem. I'm sorry to single you out as this pertains to ALL of us, especially ALL of us who can and do hire people. MAGA MUST HIRE MAGA. permalink parent award report block reply Jimmyprawns 2 points 6 days ago Ain't got time to vet that shit.  Just be so MAGA they can't stand you and self select out of your orbit. permalink parent award report block reply Prandogolio 6 points 6 days ago Mockery, and putting bullets in communists. permalink parent award report block reply Zskills 10 points 6 days ago I'm literally shaking.  Nazis have been running our country for longer than we thought permalink award report block reply tt777 4 points 6 days ago They're dog-whistling to their followers. permalink parent award report block reply Jimmyprawns 2 points 6 days ago I'm too lazy to shake like a crackhead Chihuahua all the time.  That shit takes effort and burns valuable calories.  I'm just a goofy, overweight Labrador retriever who refuses invitations from wolves and coyotes to go play in the woods.  And lays in the sun on cut grass in my yard until one of my humans show up and feeds me or throws my ball.  It's the best life. permalink parent award report block reply TexasBrowncoat 7 points 6 days ago That used to be the normal salute for the Pledge of Allegiance in America before the Nazis got hold of it. It was called the Bellamy Salute and was used from 1892 to 1942. But since these pictures are after 1942, these people are doing a Nazi salute. permalink award report block reply Tyrone_biggums 7 points 6 days ago It’s called a Roman salute. No need to make up new appellation permalink parent award report block reply Kaputtmacher 6 points 6 days ago Literally Hitler! permalink award report block reply Capoditutticapi1 6 points 6 days ago Heil Mohammad! ...probably... permalink award report block reply BigMikesSwingingCock 4 points 6 days ago They also heil moloch. permalink parent award report block reply LORDFALCONE 5 points 6 days ago Elon had better form permalink award report block reply AtheistTrumper 5 points 6 days ago Do you seriously think they give a shit about a gesture? They are demons. They just mimic human speech for the desired outcome. You're not in an argument. They elect people who fantasize about killing you and watching your wife hold your dying child in her arms, and they call you the violent extremist. What they say is never what they mean. What they mean is always that they want you dead. permalink award report block reply obamagavemeaphone 4 points 6 days ago Heil lo permalink award report block reply RogueLeaderX 4 points 6 days ago Zohrsn did it too! Which is hilarious, given his Jewish support and his own rampant antisemitism. permalink award report block reply ragnarokrobo 4 points 6 days ago Can you believe they're HYPOCRITES!!??11 permalink award report block reply Prandogolio 3 points 6 days ago WOW!!!  🚨 BREAKING! permalink parent award report block reply mateus 3 points 6 days ago ⭐THIS... IS SO OLD ⭐. Fixed it! 😂 (Seriously, who hasn't seen this? It was relevant years ago lol.) permalink award report block reply medicpatriot 3 points 6 days ago I’m not even joking when I say this. You shouldn’t insult Hitler and the Nazi party by comparing them to these people. permalink award report block reply MemeLawd 2 points 6 days ago I have to say I'm right there with them permalink award report block reply daveyistheman 2 points 6 days ago Nobody cares. The right thinks they're in a political debate. But the left is in a war. THEY DONT CARE that they are hypocrites. They will lie, cheat, steal, and kill as long as their side wins. And they have enough braindead idiots to do it with. We are nazis, they are not. And no argument or hard proof will ever change their mind of that permalink award report block reply grenades_and_ham 1 points 6 days ago “That’s eight, eight.” permalink award report block reply AgnesDomini 1 points 6 days ago You don't hate the MSM enough. permalink award report block reply SuperHonkey 1 points 6 days ago They just see Kyle... He's over there 😬 🫳🏻 permalink award report block reply Kraken 1 points 6 days ago So many Hitlers. permalink award report block reply Peekov3 1 points 6 days ago This... 🖕 permalink award report block reply TooBright 1 points 6 days ago Glozi salut permalink award report block reply OTher55 1 points 6 days ago old commercials for Secret anti-perspirant used to do this permalink award report block reply pedespeed 1 points 6 days ago So, just to be clear... Elon made it mainstream? permalink award report block reply bagel_fragility 1 points 6 days ago remember when they declared the OK hand gesture a nazi sign? you’re not voting your way out of communism, people. the rules are whatever you can get away with. permalink award report block reply Smurfection 1 points 6 days ago ya know, I still find it absolutely crazy that the left went after Elon Musk for doing the \"my heart goes out to you\" action.  Yes, that was what it was.  He tapped his heart twice and then pantomimed sending it into the crowd. K, weird story.  When that happened, my nephew who was homeschooled by my based sister, was at his first year of college.   He started texting his mother about how she could and his dad could be so evil as to support a nazi for president.   My sister isn't online and doesn't really keep up with politics that much and she started texting me frantically asking me what this was about.    I was able to get the vid from here P.W. and send it to her showing Elon did the \"my heart goes out to you\" action.    Then I texted her oodles of pics, also which were on this forums, showing dems doing the Nazi salute that is roman salute or appearing to do it. I'm still just shocked TheNews™ would go to those lengths based on an obvious lie.  I'm even more shocked that people believed that would be a thing.  I don't even think actual neo-nazis give the Roman Salute at this point. permalink award report block reply CrabbyTurtle2 1 points 6 days ago you forgot mandami permalink award report block reply RememberCharlieKirk 1 points 6 days ago \"No, the Democrats are the real nazis/racists/bigots/sexists.\" - Republicans A winning strategy, surely! permalink award report block reply Bullet3250 1 points 6 days ago A fair media would have put all these photos on the Front page/vCover with the headline \"Mein Fruher?\" permalink award report block reply Nomad899 1 points 6 days ago Seig Hail permalink award report block reply Amway 1 points 6 days ago I guess Native Americans do the Nazis salute left handed. permalink award report block reply mikejones 1 points 6 days ago All about the Right Angle. permalink award report block reply L74ge9wr 1 points 6 days ago The right initially believed this was a simple wave/appreciation gesture, the left quickly clarified this as a Nazi salute.  Now you know how they recognized it so quickly. permalink award report block reply Side_o_beef_curtains 1 points 6 days ago To be fair, Barry is just illustrating this size of his wife's cock, not saluting permalink award report block reply PillarOfWisdom 1 points 6 days ago These memes are so tiresome.  Accusing marxists of hypocrisy is like pissin in the wind.  Instead of addressing their accusation, just tell them to 'eat shit' and move on.  Marxists could not give a flying shit about hypocrisy.  They know what they're doing. permalink award report block reply Tacoboutit 1 points 5 days ago You forgot the Mandami one. permalink award report block reply Lurker404 1 points 6 days ago Fun fact: a German AfD politician was recently convicted for posting such an image, not because HE did a Nazi salute but because he showed that government officials were doing it (in response to the left accusing everyone on the right of doing it). permalink award report block reply YT45 1 points 6 days ago Look at all that naziism! permalink award report block reply ancroidubh 1 points 6 days ago Indian Betty can’t even get the correct arm for the salute… permalink award report block reply knnbccb 1 points 6 days ago The liberal lunatics are absolutely convinced that 'Nazi ideology' or fascism comes from our side. Our trademark, our DNA, our heritage. The brainwashing they received from 'experts' and in schools has really been potent. permalink award report block reply Prandogolio 1 points 6 days ago No, they just know they can use that name calling as a weapon permalink parent award report block reply MoreGuns 1 points 6 days ago N permalink award report block reply AntiCommieAktion 1 points 6 days ago Nazi-slandering only works on conservative politicians. permalink award report block reply 5DchessWatch 0 points 6 days ago hi uhl glow  bow ho permalink award report block reply Live_free_or_die_55 0 points 6 days ago Arrest the fucking nazis !!! permalink award report block reply TheDarkEmperor 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nYodaBannon 40 points 6 days ago playin the oldies today? permalink award report block reply Mr_Rightside 10 points 6 days ago What is it with Democrats and giving nazi salutes? AOC (Video) Barrack Obama Bill Nye (Video) Cory Booker (Video) Elizabeth Warren (Gif) Hillary Clinton Hillary Clinton again Hillary just can't help herself Jasmine Crockett Kamala Harris (Video) - Salute starts at 5:50-6:00 Tim Walz (Video) Tim Walz again permalink parent award report block reply DT170x 10 points 6 days ago Because it's (D)ifferent permalink parent award report block reply 5DchessWatch -1 points 6 days ago But they're all gay and / or jews.  They can't be nazis.  (/s) permalink parent award report block reply Govtizbad 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply posedgeclk 5 points 6 days ago They have a goal here: affirming that the media is reined in at all times. permalink parent award report block reply MacheteSanta 1 points 6 days ago You misspelled \"DemonKKKrats.\" permalink parent award report block reply Cacciali_Via 0 points 5 days ago You may not be a boomer, but you sure sound like one. permalink parent award report block reply MacheteSanta 1 points 5 days ago So you never knew the \"democrat\" party invented the KKK? Who's the boomer now? https://web.archive.org/web/20251011225626/https://www.conservapedia.com/Ku_Klux_Klan https://www.breitbart.com/politics/2016/08/25/hillary-clinton-friend-mentor-robert-byrd-kkk/ https://www.conservapedia.com/Robert_Byrd Robert Carlyle Byrd (November 20, 1917 – June 28, 2010) was a Democrat Senator and Exalted Cyclops of the Ku Klux Klan from West Virginia. He was the oldest member of Congress at his death at age 92, President pro tempore of the US Senate, and was the longest-serving Senator in history, having been first elected in 1958. Byrd twice held the position of Senate Democrat Leader, was a crucial 60th vote in holding a filibuster-proof Senate in 2009, is the only senator to have cast over 18,000 votes,[1] never once lost a general election[2] and remained a Democrat Party legend and icon until the end. He was third in line to the Presidency behind Vice President Joe Biden and Speaker Nancy Pelosi. permalink parent award report block reply view 3 more comments... SteelDriver 1 points 6 days ago It's only a \"Nazi Salute\" when someone on the right does it.  😉 permalink parent award report block reply bigdickhangsright 2 points 6 days ago 🎵 I just want to set the world on fiiiiiiiirrrrre 🎵 permalink parent award report block reply\nMr_Rightside 10 points 6 days ago What is it with Democrats and giving nazi salutes? AOC (Video) Barrack Obama Bill Nye (Video) Cory Booker (Video) Elizabeth Warren (Gif) Hillary Clinton Hillary Clinton again Hillary just can't help herself Jasmine Crockett Kamala Harris (Video) - Salute starts at 5:50-6:00 Tim Walz (Video) Tim Walz again permalink parent award report block reply DT170x 10 points 6 days ago Because it's (D)ifferent permalink parent award report block reply 5DchessWatch -1 points 6 days ago But they're all gay and / or jews.  They can't be nazis.  (/s) permalink parent award report block reply Govtizbad 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply posedgeclk 5 points 6 days ago They have a goal here: affirming that the media is reined in at all times. permalink parent award report block reply MacheteSanta 1 points 6 days ago You misspelled \"DemonKKKrats.\" permalink parent award report block reply Cacciali_Via 0 points 5 days ago You may not be a boomer, but you sure sound like one. permalink parent award report block reply MacheteSanta 1 points 5 days ago So you never knew the \"democrat\" party invented the KKK? Who's the boomer now? https://web.archive.org/web/20251011225626/https://www.conservapedia.com/Ku_Klux_Klan https://www.breitbart.com/politics/2016/08/25/hillary-clinton-friend-mentor-robert-byrd-kkk/ https://www.conservapedia.com/Robert_Byrd Robert Carlyle Byrd (November 20, 1917 – June 28, 2010) was a Democrat Senator and Exalted Cyclops of the Ku Klux Klan from West Virginia. He was the oldest member of Congress at his death at age 92, President pro tempore of the US Senate, and was the longest-serving Senator in history, having been first elected in 1958. Byrd twice held the position of Senate Democrat Leader, was a crucial 60th vote in holding a filibuster-proof Senate in 2009, is the only senator to have cast over 18,000 votes,[1] never once lost a general election[2] and remained a Democrat Party legend and icon until the end. He was third in line to the Presidency behind Vice President Joe Biden and Speaker Nancy Pelosi. permalink parent award report block reply view 3 more comments... SteelDriver 1 points 6 days ago It's only a \"Nazi Salute\" when someone on the right does it.  😉 permalink parent award report block reply\nDT170x 10 points 6 days ago Because it's (D)ifferent permalink parent award report block reply 5DchessWatch -1 points 6 days ago But they're all gay and / or jews.  They can't be nazis.  (/s) permalink parent award report block reply Govtizbad 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\n5DchessWatch -1 points 6 days ago But they're all gay and / or jews.  They can't be nazis.  (/s) permalink parent award report block reply\nGovtizbad 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nposedgeclk 5 points 6 days ago They have a goal here: affirming that the media is reined in at all times. permalink parent award report block reply\nMacheteSanta 1 points 6 days ago You misspelled \"DemonKKKrats.\" permalink parent award report block reply Cacciali_Via 0 points 5 days ago You may not be a boomer, but you sure sound like one. permalink parent award report block reply MacheteSanta 1 points 5 days ago So you never knew the \"democrat\" party invented the KKK? Who's the boomer now? https://web.archive.org/web/20251011225626/https://www.conservapedia.com/Ku_Klux_Klan https://www.breitbart.com/politics/2016/08/25/hillary-clinton-friend-mentor-robert-byrd-kkk/ https://www.conservapedia.com/Robert_Byrd Robert Carlyle Byrd (November 20, 1917 – June 28, 2010) was a Democrat Senator and Exalted Cyclops of the Ku Klux Klan from West Virginia. He was the oldest member of Congress at his death at age 92, President pro tempore of the US Senate, and was the longest-serving Senator in history, having been first elected in 1958. Byrd twice held the position of Senate Democrat Leader, was a crucial 60th vote in holding a filibuster-proof Senate in 2009, is the only senator to have cast over 18,000 votes,[1] never once lost a general election[2] and remained a Democrat Party legend and icon until the end. He was third in line to the Presidency behind Vice President Joe Biden and Speaker Nancy Pelosi. permalink parent award report block reply view 3 more comments...\nCacciali_Via 0 points 5 days ago You may not be a boomer, but you sure sound like one. permalink parent award report block reply MacheteSanta 1 points 5 days ago So you never knew the \"democrat\" party invented the KKK? Who's the boomer now? https://web.archive.org/web/20251011225626/https://www.conservapedia.com/Ku_Klux_Klan https://www.breitbart.com/politics/2016/08/25/hillary-clinton-friend-mentor-robert-byrd-kkk/ https://www.conservapedia.com/Robert_Byrd Robert Carlyle Byrd (November 20, 1917 – June 28, 2010) was a Democrat Senator and Exalted Cyclops of the Ku Klux Klan from West Virginia. He was the oldest member of Congress at his death at age 92, President pro tempore of the US Senate, and was the longest-serving Senator in history, having been first elected in 1958. Byrd twice held the position of Senate Democrat Leader, was a crucial 60th vote in holding a filibuster-proof Senate in 2009, is the only senator to have cast over 18,000 votes,[1] never once lost a general election[2] and remained a Democrat Party legend and icon until the end. He was third in line to the Presidency behind Vice President Joe Biden and Speaker Nancy Pelosi. permalink parent award report block reply view 3 more comments...\nMacheteSanta 1 points 5 days ago So you never knew the \"democrat\" party invented the KKK? Who's the boomer now? https://web.archive.org/web/20251011225626/https://www.conservapedia.com/Ku_Klux_Klan https://www.breitbart.com/politics/2016/08/25/hillary-clinton-friend-mentor-robert-byrd-kkk/ https://www.conservapedia.com/Robert_Byrd Robert Carlyle Byrd (November 20, 1917 – June 28, 2010) was a Democrat Senator and Exalted Cyclops of the Ku Klux Klan from West Virginia. He was the oldest member of Congress at his death at age 92, President pro tempore of the US Senate, and was the longest-serving Senator in history, having been first elected in 1958. Byrd twice held the position of Senate Democrat Leader, was a crucial 60th vote in holding a filibuster-proof Senate in 2009, is the only senator to have cast over 18,000 votes,[1] never once lost a general election[2] and remained a Democrat Party legend and icon until the end. He was third in line to the Presidency behind Vice President Joe Biden and Speaker Nancy Pelosi. permalink parent award report block reply view 3 more comments...\nSteelDriver 1 points 6 days ago It's only a \"Nazi Salute\" when someone on the right does it.  😉 permalink parent award report block reply\nbigdickhangsright 2 points 6 days ago 🎵 I just want to set the world on fiiiiiiiirrrrre 🎵 permalink parent award report block reply\nMade_in_America 23 points 6 days ago You give them way too much credit. The Nazis actually improved the pre-war German economy. permalink award report block reply hairless_ap3 23 points 6 days ago Exactly, calling these incompetent retards Nazis gives Nazis a bad name - at least the real Nazis were competent permalink parent award report block reply rebuildingMyself 14 points 6 days ago So competent, that the post WW2 new world order was obsessed with making sure Whites never have a shared identity or collective pride ever again while aggressively promoting all other races permalink parent award report block reply HeavyMetalPatriot 7 points 6 days ago Stop noticing!!! permalink parent award report block reply Coprolite 5 points 6 days ago Noticing is a dog whistle permalink parent award report block reply posedgeclk 5 points 6 days ago Sort of, but the tactics were every bit as socialist as FDR's. permalink parent award report block reply Made_in_America 4 points 6 days ago Not exactly. There's slight strategic overlap. Hitler reunited Germany with wealthy Bavaria, invested in industry and created real jobs that moved the economy forward whereas FDR created a lot of wasteful \"make work\" positions that critics called \"boondoggle\". But the best thing Hitler did was to kick the Rothschild banks out of Germany. If FDR had ended the Fed, he'd have been more economically successful. permalink parent award report block reply Jimmyprawns 2 points 6 days ago They were socialists who ran out of other people's money and had to invade and colonize Europe just to cover the enormous costs of their rampant social spending.  They didn't fix shit, they just promised a lot of free stuff for the workers and then paid for it by pillaging neighbor countries (western Europe).  It all fell apart when they invaded a country too poor, too backward, and too far down the socialist trail themselves to be a profitable colony: the USSR. permalink parent award report block reply Made_in_America 1 points 6 days ago Germany got a pretty shitty deal after WW1. They were split into pieces and forced to pay reparations that left them broke. On top of that they were getting eaten alive by parasitic usury and a Bolshevik-like coup attempt similar to what happened in Russia in the 1920s. Say what you will about their approach to solving things but the Nazis grievances against Jews were 100% legitimate. Their society was being morally eroded with child prostitution and gender affirming theory and economically destroyed just as America is today. And it's the same people doing it. permalink parent award report block reply Jimmyprawns 1 points 6 days ago \"Nazis grievances against Jews were 100% legitimate.\" Cope and seeth storm fag. Hitler and Stalin were fellow travelers and the east front was a lovers quarrel between ego maniacal dictators. permalink parent award report block reply\nhairless_ap3 23 points 6 days ago Exactly, calling these incompetent retards Nazis gives Nazis a bad name - at least the real Nazis were competent permalink parent award report block reply rebuildingMyself 14 points 6 days ago So competent, that the post WW2 new world order was obsessed with making sure Whites never have a shared identity or collective pride ever again while aggressively promoting all other races permalink parent award report block reply HeavyMetalPatriot 7 points 6 days ago Stop noticing!!! permalink parent award report block reply Coprolite 5 points 6 days ago Noticing is a dog whistle permalink parent award report block reply\nrebuildingMyself 14 points 6 days ago So competent, that the post WW2 new world order was obsessed with making sure Whites never have a shared identity or collective pride ever again while aggressively promoting all other races permalink parent award report block reply HeavyMetalPatriot 7 points 6 days ago Stop noticing!!! permalink parent award report block reply Coprolite 5 points 6 days ago Noticing is a dog whistle permalink parent award report block reply\nHeavyMetalPatriot 7 points 6 days ago Stop noticing!!! permalink parent award report block reply Coprolite 5 points 6 days ago Noticing is a dog whistle permalink parent award report block reply\nCoprolite 5 points 6 days ago Noticing is a dog whistle permalink parent award report block reply\nposedgeclk 5 points 6 days ago Sort of, but the tactics were every bit as socialist as FDR's. permalink parent award report block reply Made_in_America 4 points 6 days ago Not exactly. There's slight strategic overlap. Hitler reunited Germany with wealthy Bavaria, invested in industry and created real jobs that moved the economy forward whereas FDR created a lot of wasteful \"make work\" positions that critics called \"boondoggle\". But the best thing Hitler did was to kick the Rothschild banks out of Germany. If FDR had ended the Fed, he'd have been more economically successful. permalink parent award report block reply\nMade_in_America 4 points 6 days ago Not exactly. There's slight strategic overlap. Hitler reunited Germany with wealthy Bavaria, invested in industry and created real jobs that moved the economy forward whereas FDR created a lot of wasteful \"make work\" positions that critics called \"boondoggle\". But the best thing Hitler did was to kick the Rothschild banks out of Germany. If FDR had ended the Fed, he'd have been more economically successful. permalink parent award report block reply\nJimmyprawns 2 points 6 days ago They were socialists who ran out of other people's money and had to invade and colonize Europe just to cover the enormous costs of their rampant social spending.  They didn't fix shit, they just promised a lot of free stuff for the workers and then paid for it by pillaging neighbor countries (western Europe).  It all fell apart when they invaded a country too poor, too backward, and too far down the socialist trail themselves to be a profitable colony: the USSR. permalink parent award report block reply Made_in_America 1 points 6 days ago Germany got a pretty shitty deal after WW1. They were split into pieces and forced to pay reparations that left them broke. On top of that they were getting eaten alive by parasitic usury and a Bolshevik-like coup attempt similar to what happened in Russia in the 1920s. Say what you will about their approach to solving things but the Nazis grievances against Jews were 100% legitimate. Their society was being morally eroded with child prostitution and gender affirming theory and economically destroyed just as America is today. And it's the same people doing it. permalink parent award report block reply Jimmyprawns 1 points 6 days ago \"Nazis grievances against Jews were 100% legitimate.\" Cope and seeth storm fag. Hitler and Stalin were fellow travelers and the east front was a lovers quarrel between ego maniacal dictators. permalink parent award report block reply\nMade_in_America 1 points 6 days ago Germany got a pretty shitty deal after WW1. They were split into pieces and forced to pay reparations that left them broke. On top of that they were getting eaten alive by parasitic usury and a Bolshevik-like coup attempt similar to what happened in Russia in the 1920s. Say what you will about their approach to solving things but the Nazis grievances against Jews were 100% legitimate. Their society was being morally eroded with child prostitution and gender affirming theory and economically destroyed just as America is today. And it's the same people doing it. permalink parent award report block reply Jimmyprawns 1 points 6 days ago \"Nazis grievances against Jews were 100% legitimate.\" Cope and seeth storm fag. Hitler and Stalin were fellow travelers and the east front was a lovers quarrel between ego maniacal dictators. permalink parent award report block reply\nJimmyprawns 1 points 6 days ago \"Nazis grievances against Jews were 100% legitimate.\" Cope and seeth storm fag. Hitler and Stalin were fellow travelers and the east front was a lovers quarrel between ego maniacal dictators. permalink parent award report block reply\nCleanUpPhillyTrump24 14 points 6 days ago A contractor who is a Dem that I hire said, \"OH ELON DID A NAZI SALUTE. WHADDYOO SAY ABOUT THAT?\" I said, \"That is the most fucking retarded thing I have heard you or anyone ever say. Seriously? That's your beef with Elon? Because that proves that you need to turn off that giant TV and get a clue again.\" He looked red and angry. No one talks like this to Dems, but you all need to. Straight talk. Key to saving America is to make being stupid embarrassing again. Mockery will save us. permalink award report block reply HeavyMetalPatriot 6 points 6 days ago who is a Dem that I hire And there's the problem. I'm sorry to single you out as this pertains to ALL of us, especially ALL of us who can and do hire people. MAGA MUST HIRE MAGA. permalink parent award report block reply Jimmyprawns 2 points 6 days ago Ain't got time to vet that shit.  Just be so MAGA they can't stand you and self select out of your orbit. permalink parent award report block reply Prandogolio 6 points 6 days ago Mockery, and putting bullets in communists. permalink parent award report block reply\nHeavyMetalPatriot 6 points 6 days ago who is a Dem that I hire And there's the problem. I'm sorry to single you out as this pertains to ALL of us, especially ALL of us who can and do hire people. MAGA MUST HIRE MAGA. permalink parent award report block reply Jimmyprawns 2 points 6 days ago Ain't got time to vet that shit.  Just be so MAGA they can't stand you and self select out of your orbit. permalink parent award report block reply\nJimmyprawns 2 points 6 days ago Ain't got time to vet that shit.  Just be so MAGA they can't stand you and self select out of your orbit. permalink parent award report block reply\nPrandogolio 6 points 6 days ago Mockery, and putting bullets in communists. permalink parent award report block reply\nZskills 10 points 6 days ago I'm literally shaking.  Nazis have been running our country for longer than we thought permalink award report block reply tt777 4 points 6 days ago They're dog-whistling to their followers. permalink parent award report block reply Jimmyprawns 2 points 6 days ago I'm too lazy to shake like a crackhead Chihuahua all the time.  That shit takes effort and burns valuable calories.  I'm just a goofy, overweight Labrador retriever who refuses invitations from wolves and coyotes to go play in the woods.  And lays in the sun on cut grass in my yard until one of my humans show up and feeds me or throws my ball.  It's the best life. permalink parent award report block reply\ntt777 4 points 6 days ago They're dog-whistling to their followers. permalink parent award report block reply\nJimmyprawns 2 points 6 days ago I'm too lazy to shake like a crackhead Chihuahua all the time.  That shit takes effort and burns valuable calories.  I'm just a goofy, overweight Labrador retriever who refuses invitations from wolves and coyotes to go play in the woods.  And lays in the sun on cut grass in my yard until one of my humans show up and feeds me or throws my ball.  It's the best life. permalink parent award report block reply\nTexasBrowncoat 7 points 6 days ago That used to be the normal salute for the Pledge of Allegiance in America before the Nazis got hold of it. It was called the Bellamy Salute and was used from 1892 to 1942. But since these pictures are after 1942, these people are doing a Nazi salute. permalink award report block reply Tyrone_biggums 7 points 6 days ago It’s called a Roman salute. No need to make up new appellation permalink parent award report block reply\nTyrone_biggums 7 points 6 days ago It’s called a Roman salute. No need to make up new appellation permalink parent award report block reply\nKaputtmacher 6 points 6 days ago Literally Hitler! permalink award report block reply\nCapoditutticapi1 6 points 6 days ago Heil Mohammad! ...probably... permalink award report block reply BigMikesSwingingCock 4 points 6 days ago They also heil moloch. permalink parent award report block reply\nBigMikesSwingingCock 4 points 6 days ago They also heil moloch. permalink parent award report block reply\nLORDFALCONE 5 points 6 days ago Elon had better form permalink award report block reply\nAtheistTrumper 5 points 6 days ago Do you seriously think they give a shit about a gesture? They are demons. They just mimic human speech for the desired outcome. You're not in an argument. They elect people who fantasize about killing you and watching your wife hold your dying child in her arms, and they call you the violent extremist. What they say is never what they mean. What they mean is always that they want you dead. permalink award report block reply\nobamagavemeaphone 4 points 6 days ago Heil lo permalink award report block reply\nRogueLeaderX 4 points 6 days ago Zohrsn did it too! Which is hilarious, given his Jewish support and his own rampant antisemitism. permalink award report block reply\nragnarokrobo 4 points 6 days ago Can you believe they're HYPOCRITES!!??11 permalink award report block reply Prandogolio 3 points 6 days ago WOW!!!  🚨 BREAKING! permalink parent award report block reply\nPrandogolio 3 points 6 days ago WOW!!!  🚨 BREAKING! permalink parent award report block reply\nmateus 3 points 6 days ago ⭐THIS... IS SO OLD ⭐. Fixed it! 😂 (Seriously, who hasn't seen this? It was relevant years ago lol.) permalink award report block reply\nmedicpatriot 3 points 6 days ago I’m not even joking when I say this. You shouldn’t insult Hitler and the Nazi party by comparing them to these people. permalink award report block reply\nMemeLawd 2 points 6 days ago I have to say I'm right there with them permalink award report block reply\ndaveyistheman 2 points 6 days ago Nobody cares. The right thinks they're in a political debate. But the left is in a war. THEY DONT CARE that they are hypocrites. They will lie, cheat, steal, and kill as long as their side wins. And they have enough braindead idiots to do it with. We are nazis, they are not. And no argument or hard proof will ever change their mind of that permalink award report block reply\ngrenades_and_ham 1 points 6 days ago “That’s eight, eight.” permalink award report block reply\nAgnesDomini 1 points 6 days ago You don't hate the MSM enough. permalink award report block reply\nSuperHonkey 1 points 6 days ago They just see Kyle... He's over there 😬 🫳🏻 permalink award report block reply\nKraken 1 points 6 days ago So many Hitlers. permalink award report block reply\nPeekov3 1 points 6 days ago This... 🖕 permalink award report block reply\nTooBright 1 points 6 days ago Glozi salut permalink award report block reply\nOTher55 1 points 6 days ago old commercials for Secret anti-perspirant used to do this permalink award report block reply\npedespeed 1 points 6 days ago So, just to be clear... Elon made it mainstream? permalink award report block reply\nbagel_fragility 1 points 6 days ago remember when they declared the OK hand gesture a nazi sign? you’re not voting your way out of communism, people. the rules are whatever you can get away with. permalink award report block reply\nSmurfection 1 points 6 days ago ya know, I still find it absolutely crazy that the left went after Elon Musk for doing the \"my heart goes out to you\" action.  Yes, that was what it was.  He tapped his heart twice and then pantomimed sending it into the crowd. K, weird story.  When that happened, my nephew who was homeschooled by my based sister, was at his first year of college.   He started texting his mother about how she could and his dad could be so evil as to support a nazi for president.   My sister isn't online and doesn't really keep up with politics that much and she started texting me frantically asking me what this was about.    I was able to get the vid from here P.W. and send it to her showing Elon did the \"my heart goes out to you\" action.    Then I texted her oodles of pics, also which were on this forums, showing dems doing the Nazi salute that is roman salute or appearing to do it. I'm still just shocked TheNews™ would go to those lengths based on an obvious lie.  I'm even more shocked that people believed that would be a thing.  I don't even think actual neo-nazis give the Roman Salute at this point. permalink award report block reply\nCrabbyTurtle2 1 points 6 days ago you forgot mandami permalink award report block reply\nRememberCharlieKirk 1 points 6 days ago \"No, the Democrats are the real nazis/racists/bigots/sexists.\" - Republicans A winning strategy, surely! permalink award report block reply\nBullet3250 1 points 6 days ago A fair media would have put all these photos on the Front page/vCover with the headline \"Mein Fruher?\" permalink award report block reply\nNomad899 1 points 6 days ago Seig Hail permalink award report block reply\nAmway 1 points 6 days ago I guess Native Americans do the Nazis salute left handed. permalink award report block reply\nmikejones 1 points 6 days ago All about the Right Angle. permalink award report block reply\nL74ge9wr 1 points 6 days ago The right initially believed this was a simple wave/appreciation gesture, the left quickly clarified this as a Nazi salute.  Now you know how they recognized it so quickly. permalink award report block reply\nSide_o_beef_curtains 1 points 6 days ago To be fair, Barry is just illustrating this size of his wife's cock, not saluting permalink award report block reply\nPillarOfWisdom 1 points 6 days ago These memes are so tiresome.  Accusing marxists of hypocrisy is like pissin in the wind.  Instead of addressing their accusation, just tell them to 'eat shit' and move on.  Marxists could not give a flying shit about hypocrisy.  They know what they're doing. permalink award report block reply\nTacoboutit 1 points 5 days ago You forgot the Mandami one. permalink award report block reply\nLurker404 1 points 6 days ago Fun fact: a German AfD politician was recently convicted for posting such an image, not because HE did a Nazi salute but because he showed that government officials were doing it (in response to the left accusing everyone on the right of doing it). permalink award report block reply\nYT45 1 points 6 days ago Look at all that naziism! permalink award report block reply\nancroidubh 1 points 6 days ago Indian Betty can’t even get the correct arm for the salute… permalink award report block reply\nknnbccb 1 points 6 days ago The liberal lunatics are absolutely convinced that 'Nazi ideology' or fascism comes from our side. Our trademark, our DNA, our heritage. The brainwashing they received from 'experts' and in schools has really been potent. permalink award report block reply Prandogolio 1 points 6 days ago No, they just know they can use that name calling as a weapon permalink parent award report block reply\nPrandogolio 1 points 6 days ago No, they just know they can use that name calling as a weapon permalink parent award report block reply\nMoreGuns 1 points 6 days ago N permalink award report block reply\nAntiCommieAktion 1 points 6 days ago Nazi-slandering only works on conservative politicians. permalink award report block reply\n5DchessWatch 0 points 6 days ago hi uhl glow  bow ho permalink award report block reply\nLive_free_or_die_55 0 points 6 days ago Arrest the fucking nazis !!! permalink award report block reply\nTheDarkEmperor 1 points 6 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:01:21.934843Z"
}