{
  "id": "8170073",
  "title": "1401New Jersey saw 500,000+ more votes than any other year in history, and nearly all of them went t",
  "url": "https://patriots.win/p/1ARK512UFv/new-jersey-saw-500000-more-votes/c",
  "content": "1401 New Jersey saw 500,000+ more votes than any other year in history, and nearly all of them went to Democrats? 🤔 posted 7 days ago by PiratePatriotParrot 164 comments award share report block Chief Nerd @TheChiefNerd • 7d New Jersey saw 500,000+ more votes than any other year in history, and nearly all of them went to Democrats? 🤔 Wake Up NJ 🇺🇸 New Jersey @wakeupnj • 7d Any thoughts New Jersey?\n164 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style patrioticwinning3 235 points 7 days ago Zero riggers arrested = zero incentive not to rig. permalink award report block reply HeavyMetalPatriot 74 points 7 days ago THIS permalink parent award report block reply Kingoftheroad 39 points 7 days ago THIS is what happens as long as elections aren't restructured for security. Even the states redistricting in our favor is, even though necessary right now to combat their rigging of elections, potential very antithetical to fair and true elections. I saw from family who sent it to me that they did redistricting in Canada for the federal elections late last year right before Trudeau stepped down and guess what happened...their liberals won the federal election again. So it can be a genuine correction or it can be used in a disingenuous way to rig elections like California uses called ballot harvesting to rig their elections permalink parent award report block reply guywholikesDjtof2024 28 points 6 days ago I SUSPECTED IT WAS FRAUD. MAGA RIGHT AGAIN. permalink parent award report block reply Crucible 29 points 7 days ago The cost of not having GOP boots on the ground. This was a winnable race. permalink parent award report block reply perma-maga 27 points 6 days ago The price of Republicans in Congress being useless. permalink parent award report block reply MorningFrost 8 points 6 days ago Worse than useless. permalink parent award report block reply clownworld30330 4 points 6 days ago The price of Blondi. Trump didn’t lift a finger to call out and fight the coming fraud. The fraud came. Now it’s too late for this cycle. But do you think they’ll do anything about it ahead of the midterms? Lol no they won’t. permalink parent award report block reply mojorisen 3 points 6 days ago First Republican voters have to hold their representatives to task.  Constant calls, showing up at town halls and raising hell, primary them, etc.  Unless that happens they have no incentive to do anything but what they have been doing. permalink parent award report block reply BruddahIz 1 points 6 days ago Teh GOP/Pressler were on the ground - this is why they had to cheat so much ? permalink parent award report block reply Crucible 2 points 6 days ago You need thousands of Scott Preslers if you're serious about winning. permalink parent award report block reply Made_in_America 14 points 6 days ago It was probably orchestrated by some of the same players involved in the 2020 steal. When criminals walk, you get more crime. permalink parent award report block reply MorningFrost 10 points 6 days ago ZERO arrests. permalink parent award report block reply NomadicKrow2 7 points 6 days ago I'd be looking at Pam Bondi, but I'd have to turn Fox News on. permalink parent award report block reply MorningFrost 4 points 6 days ago She isn't doing anything. permalink parent award report block reply view 2 more comments... schiff_for_brains 1 points 6 days ago They don't even need to walk.  Nobody is arresting them. permalink parent award report block reply infinitysupreme 12 points 6 days ago The riggers got medals from the Biden White House permalink parent award report block reply NotYourMan 5 points 6 days ago IKR!  How are people voting for democrats?  This is the party that released COVID to win the 2020 election.  The party that mandated an experimental vaccine that killed thousands due to adverse reactions.  The party that used censorship and lawfare against political opponents.  The democrats are very organized in their conquest of US elections.  We need that on the republican side. permalink parent award report block reply aSavvyBoi 1 points 6 days ago You'd be surprised how many retarded people there are, my own parents included.  They refuse to believe point 1, and think everything else you mentioned is a good thing. permalink parent award report block reply load 7 more comments... projectarcturus1 81 points 7 days ago Voter fraud, as always. This our most important issue, because the fraud is what causes all our other problems. permalink award report block reply Counterwhat 21 points 6 days ago This and only this.  I bet the the percentage was the same across the state. It was done on small increments as to not cause suspicion. permalink parent award report block reply Odyssey 8 points 6 days ago Voter fraud leads to stolen seat from the legitimate governor. Illegitimate governor further codifies voter fraud on day one for rigging local, AG and Supreme Court elections. Illegitimate governor appoints district judges. Appointed district judges issues injunction against legitimately elected President. Illegitimate governor shelters illegal aliens for permanent supermajority. Illegitimate governor reelects herself. Illegitimate governor steals House & Senate seats in the general election. Illegitimate senators vote to shut down the government. Illegitimate senators refuse to appoint unfavorable federal judges. Illegitimate senators vote to put favourable federal judges who declare voter ID as unconstitutional. <-- You have reached here permalink parent award report block reply BKav 6 points 6 days ago Yes👆 permalink parent award report block reply Taqiyya_Mockingbird 5 points 6 days ago Sorry, we’ll need to win midterms if we want to look into thinking about investigating the possibility that something adjacent to voting errors occurred. permalink parent award report block reply bidensmissingbrain 5 points 6 days ago Oh noes! We didn’t win the midterms! Darn, that’s too bad, if only DRuMpH hadn’t said that thing. Oh well, guess we better grift fundraise for the next 2 years to squeeze every cent the dems don’t steal from people. 😎 permalink parent award report block reply Sgt_Hulka 29 points 6 days ago The republicans are a joke. They don’t want to fix anything.  If they did, they would have fixed it. Why is mail-in voting still a thing?  Why is Election Day now weeks or months long?  Why is voter ID so hard to enact? I’m sick of it.  I think elections were rigged all over the country. People didn’t go to jail.  They will continue to cheat and who can blame them? permalink award report block reply Simple_Doot 13 points 6 days ago Why is GOP running weak as fuck and not delivering on the platform a thing? permalink parent award report block reply AmericanJawa 11 points 6 days ago Why is GOP running weak as fuck and not delivering on the platform a thing? Because they don't want anything to be delivered on, they prefer the status quo. permalink parent award report block reply rebuildingMyself 2 points 6 days ago Yes the Uniparty hates Outsiders disrupting their agendas and I'm not talking about politicians we actually elect, but the permanent Deep State class that controls most of them. permalink parent award report block reply Leeeashlee 1 points 6 days ago Bc gop sucks balls permalink parent award report block reply Sgt_Hulka 1 points 6 days ago Great question. permalink parent award report block reply RocksCanOnlyWait 26 points 6 days ago The numbers are believable. The table is only showing years with a gubernatorial election. For comparison, 2024 had 2.2 million votes for Harris and 1.9 million for Trump. 2021 had a strong incumbent running for governor, so the turnout would be lower than in an open seat year. permalink award report block reply ESAsher 19 points 6 days ago Agreed.  Even if cheating occurred it probably took the form of new biden 'imports' and not more explicit methods.  300,000 is not much in the face of biden's 40-ish million and Jersey is a sanctuary state.  I still want to see some sweeping election integrity reforms though. permalink parent award report block reply Grilledpepe 9 points 6 days ago Saying things like 'the numbers are believable' just excuses obvious fraud.  I'm not making any excuses for these clowns.  Make them prove that many people are actually voting permalink parent award report block reply Kwyjiboy0 4 points 6 days ago What about the open seat years of 2017, 2009, or 2001? All had 2.1-2.3m votes. Then 2025 had 3.2m. 2021 wasn't that strong of an incumbent if 1.25m voted against him. That number of votes would have won half of the other elections, considering total votes really hasn't increased from 1969 to 2017. permalink parent award report block reply RocksCanOnlyWait -1 points 6 days ago Voter turnouts have increased across the board starting in 2020 and peak turnout has remained high for Republicans and Democrats alike. However, Democrat turnout is more consistent, whereas Republican turnout is more varied. Yes, some fraud happens. But it's not going to account for over 10% of the votes. permalink parent award report block reply FractalRoar 3 points 6 days ago Phantom voters have increased markedly in the last two cycles.The machines insert as many ballot images as they have names to use, then the voter rolls get caught up over the next month or two. permalink parent award report block reply RandyMoss 3 points 6 days ago Found the cuck! permalink parent award report block reply HKYGOALIE30 2 points 6 days ago The Dems turned out in big numbers. Jack got 150K more votes and still lost. It sucks. permalink parent award report block reply load 5 more comments... vote_for_MAGA_2020 13 points 6 days ago Clearly the Trump admin isn't going to address the massive voter fraud that is sending this country into the toilet. permalink award report block reply Treefiddydiddy 9 points 6 days ago these cheating liberal whites and their brown pets will NEVER stop with this shit unless the hammer falls on them permalink award report block reply throttlejohnson 8 points 6 days ago could be all the illegals voting....wait permalink award report block reply Matehmateh 7 points 6 days ago Pajeets in the millions? permalink award report block reply KarlHungus53 1 points 6 days ago Can confirm. permalink parent award report block reply Christineblaseyford 7 points 6 days ago They are 100% cheating in 100% of elections. permalink award report block reply BrionK 5 points 6 days ago Destroy the machines. permalink award report block reply Rock9Head 5 points 6 days ago Stolen elections. All of them. permalink award report block reply spinometer2 4 points 6 days ago ALL THE ELECTIONS ARE RIGGED too big to rig was for real plus there had to be white hackers in key places in 2024 to block their rigging attempts permalink award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply spinometer2 3 points 6 days ago \"controlled opposition\" - so all the attacks against him, including the bullet, were never meant to harm him? outta here retard permalink parent award report block reply TDBabyBite 1 points 6 days ago Neocon foreign policy...like ending 7 wars? Interesting. Do you think Biden really got a historic number of votes? Kamala polled back in 2020 at like 2 percent, do you think she even came close to Trumps votes? permalink parent award report block reply Tookens 4 points 6 days ago Hordes of TDS-afflicted, mentally-ill, America-hating democrats rushing to the polls to FIGHT TRUMP <duurrrrrr!#KE(@> permalink award report block reply ArtLife 5 points 6 days ago I agree, the relentless mantra that Trump and R's are the source of everything wrong with your life and times is working. The polls of people in NY who think everything sucks but somehow isn't the fault of their own leaders is amazing to see. Orwell's 2 minutes of hate in action, and this is nationwide. The R's have not done nearly what they could since last year. Terrible PR and communication, always nitpicking points that the general public doesn't see or understand. I listened to Ted Cruz and John Kennedy on some podcast last night, Kennedy hawking his book. He means well but you see how these guys are so far removed from everyday people. They pride themselves on lawyerly discussion while the country burns down, and they are all buddies in DC. Congress and Senate should be part-time minimally paid jobs. There should be a way to completely outlaw lobbying, especially of Senators, and repeal the 17th. Congress should not be able to vote anything for themselves, and most of the amenities should be eliminated. Representatives should always only talk to their own individual constituents, and the state level reps. permalink parent award report block reply anotherthing 3 points 6 days ago There's a reason why they tried that No Kings thing during a government shutdown that they caused so close to an election. We lost the 4D chess idea with the Big Bloated Bill. That shutdown fight should have been over budget cuts at the beginning of Trump's term when he was riding that wave of political capital. Instead, we got Biden Era spending with some MAGA stuff tacked on there. The Senate Parliamentarian that's been there since Harry Reid gutted a lot of that MAGA stuff, and Trump was still demanding it. He demonstrated then that he was afraid of the filibuster and he was going to sacrifice nearly everything to avoid that filibuster. Now you have Democrats pulling the \"Big Ask\" from Trump's playbook with the $1.5T in extra spending. permalink parent award report block reply OTher55 3 points 6 days ago The vote margin last year was Kackler +252,498 The vote margin here is Sherill +414,369 Raw total of votes cast last year is Kawkgobbler 2.2 million vs. Trump 1.9 million Sure the result sucks. But crying fraud at every loss makes you sound like the boy who cried wolf. permalink award report block reply mailinvoter 3 points 6 days ago What if there was a wolf in the Cockgobbler's election results, but you didn't see it and claim it was never there? Is it just a coincidence that every state Trump won has picture voter id? permalink parent award report block reply OTher55 4 points 6 days ago Schrodinger's wolf in the Gobbler's box. Red votes dropped 500k from last year, while Blue votes dropped 400k. That's an enthusiasm to turn out problem. Here's more. In 2020, the vote margin was Braindead +725,061. The margin shrunk almost 500k in 4 years. That's hard evidence and facts. Aren't we supposed to choose facts over feelings? permalink parent award report block reply mailinvoter 1 points 6 days ago So you're not aware of postal workers dumping ballots and election workers claiming to rip up Trump ballots?  I see you mentioned \"votes\" but not \"voters\". You can play the other sides' games and ignore the facts, but I'll just say I hope you don't give that wolf indigestion. permalink parent award report block reply proud_semi_fascist 1 points 6 days ago Hey dummy. You can't compare 2020 to literally anything. They sent a mail in ballot to every registered voter in the state. The fraud was off the charts. You do realize that they register you to vote through DMV, and they allow illegals to get drivers licenses in NJ. So illegals are 100% registered to vote, and are either doing it themselves or having their ballots filled out for them. Sorry if that hurts your feelings. permalink parent award report block reply OTher55 0 points 6 days ago I can't compare 2020 to anything, but you can? Oh ok. https://patriots.win/p/1ARK513J8W/obvious-voter-fraud-in-nj-on-tue/c permalink parent award report block reply view 2 more comments... proud_semi_fascist 2 points 6 days ago This was an off year governor election. Read the table. The total votes here are absurd, and they still have 150k more to count. When the dust settles, I can almost guarantee that more registered Dems will have voted than in last year's presidential election. Sorry, that's not believable. permalink parent award report block reply DenturesNancy 3 points 6 days ago Trump and his admin ain't doing shit about election integrity.  Democraps will continue their monopoly over elections as long as the US exists permalink award report block reply TrancePhreak 3 points 6 days ago New Jersey mafia is very entrenched. permalink award report block reply MySidesGoUp 3 points 6 days ago The US Govt is the enemy of the people. permalink award report block reply ConsrvspkgNJ 3 points 6 days ago Yeah, we know. We know who did it, how they did it and we know what happened Tuesday like in 2018 was the test run to have it implemented nationally in the midterms.\nThe NJ AG will never, ever ,ever bust one of their own so voter fraud goes unchecked as long as it keeps Dems in power. I have jokingly told some guys in the Ocean County GOP that we should do exactly as they do in North Jersey....make every cemetery a GOP voting district. We will have to cheat so bad that it is impossible to ignore. Make 60 Minutes come down here, make Van Jones do a CNN Special Report on Jersey Voter Fraud, make Whoopie issue a tearful plea to end the rampant voter fraud in NJ.....all of it and then say \"we are just following our Democrat brethren in north Jersey, they showed us the way and damn if it doesn't work.\" permalink award report block reply Corse46 3 points 6 days ago Cool, totally irrelevant. Still haven’t sorted out 2020 from 5 years ago. We have a POTUS who is afraid to act on this topic so it will continue forever. permalink award report block reply ShambolicPaul2 3 points 6 days ago Any other year and election and that would have easily been enough for a republican win. What an absolute joke of an election system you have over there permalink award report block reply DITTOPatriot 3 points 6 days ago The MIGA stance of the Administration and the Republican   swamp is going to make the 2026 election epic. And Trump will be impeached by Feburary of 2017. permalink award report block reply Moistbreadcrumb 2 points 6 days ago Actually its up 1 million over the last 8 years permalink award report block reply Banfir 2 points 6 days ago There is no such thing as a fair election with illegals in the picture. Our Democracy is already toast. permalink award report block reply JuicyfearsMAGA 2 points 6 days ago Looks like when they shut down the polls in the top three Republican leaning counties in the state due to glitches they were actually just changing those votes under the table to the Dem candidate permalink award report block reply RhodesianRidgeback 2 points 6 days ago More stealing. Trump: Silent. permalink award report block reply HenkZeilstra 2 points 6 days ago FBI, DOJ, CIA does not do ANY SHIT ABOUT THIS permalink award report block reply MeMargie 1 points 6 days ago they all aid in the corruption. permalink parent award report block reply ChyNahAzzWhole1 2 points 6 days ago Did the population increase 500,000 Single eligible voters? No families? No children? Did school populations increase? Cheating 101. permalink award report block reply Scot 2 points 6 days ago The democrats could openly admit to their election fraud and the republicans would still do NOTHING. permalink award report block reply Wexit-Delecto 2 points 6 days ago They stole the 2020 presidential election the same way, but NOTHING AT ALL was done about it. Why wouldn't they steal elections if there are ZERO consequences? permalink award report block reply mailinvoter 2 points 6 days ago What's odd is that another person on X asked grok what the illegal population is in NJ.  It happens to be over 525k. Coincidence?  IDK 🤷 https://x.com/NugsLoL/status/1986371033545187451 permalink award report block reply proud_semi_fascist 2 points 6 days ago You can register to vote when you get your drivers license, and illegals are allowed to get drivers licenses in NJ. You do the math. permalink parent award report block reply thefatman 1 points 6 days ago It's well, well more than a half million and change here. permalink parent award report block reply NamendaBiden 2 points 6 days ago Stop with the conspiracy theory shit.  Off year turn out always increases by 22% vs the last election.  Plus its not like you have standing or anything. Edit: sentence 2 should show that this post was sarcastic.  But clearly that needs clarification. permalink award report block reply proud_semi_fascist 1 points 6 days ago The table is right there for you to look at dummy. Plot the total votes for every year on a graph and you'll see how absurd this year looks. They're not even done counting yet. When the final mail in and provisionals are counted, the total will be 3.4 million. The number of registered Democrats who voted will likely be higher than the number that voted for Kamala (unaffiliated make up a smaller % of voters in off year NJ elections). When you look at individual precincts, the results look even more absurd. permalink parent award report block reply NamendaBiden 1 points 6 days ago Adjust your sarcasm meter homie permalink parent award report block reply breathittbill 2 points 6 days ago As the old saying goes: it doesn’t matter how the people vote, what counts is who is counting the votes. permalink award report block reply Somebody157 2 points 6 days ago This is statistically impossible without cheating. permalink award report block reply Leeeashlee 2 points 6 days ago Jack sucked the first time, he sucked the second time. No plan. No one is motivated for him except rinos.  He had dumb ads about pork roll. permalink award report block reply OZJRant 2 points 6 days ago Yeah I have a thought..Republicans just got played AGAIN!!\nSooo fkn stupid!! permalink award report block reply thefatman 2 points 6 days ago Take a ride through South Plainfield, Edison, Parlin,  and Woodbridge, then work your way south on Route 1 until you hit somewhere around Hamilton, you will see exactly why. permalink award report block reply Texasnumber1 2 points 6 days ago They need to be charged as terrorists enough is enough permalink award report block reply Ferretman 2 points 6 days ago Seems unlikely permalink award report block reply RogueLeaderX 2 points 6 days ago Yeah, there is definitely shenanigans going on there. Jack was EXTREMELY close last election, he got blown out this time. permalink award report block reply Klaus73 1 points 6 days ago Sigh here we go again. permalink award report block reply DCYR66 1 points 6 days ago Fuck democrats!! I hope their newly elected assholes bend them over and fuck them hard and dry!!! They deserve what they vote for fucking idiots!! permalink award report block reply Klown_Kutz 1 points 6 days ago Women voters. Repeal the 19th permalink award report block reply Dev404 1 points 6 days ago This administration hasn't taken rigged elections seriously, so rigged they will remain. Maricopa Audit still has the proof of the elections being rigged, but this administration can't be bothered with it, hell, they can't even be bothered with exposing Epstein's clients which is low hanging fruit. permalink award report block reply Bigperm 1 points 6 days ago I clipped this from the next door app that someone posted... Something very fishy going on at the election station. I casted my REPUBLICAN votes, and each one defaulted to DEMOCRAT! It happened THREE TIMES! My 4th attempt correctly showed my REPUBLICAN votes, but then the machine froze and would not let me print the ballot! Poll workers gathered around the machine, and then phoned someone for help. The workers were told to reboot the machine, which they did, and it happened AGAIN! I had requested that this machine be  noted as \"out of order\",  but it was not done! Therefore, i called the police as i felt this was wrong. Officer arrived and a report was filed. Also, while this was happening, another candidate on the ballot happened to walk in and i informed him of what had transpired.  He made several calls and a commissioner of the Board of Elections arrived. After giving my information, I was asked to leave, as they were going to do an investigation. I've spoken to a couple news teams. permalink award report block reply hairless_ap3 1 points 6 days ago It's called cheating permalink award report block reply Slyster45 1 points 6 days ago Paper Ballots permalink award report block reply ncswicn 1 points 6 days ago #NothingToSeeHere permalink award report block reply Trump737 1 points 6 days ago I mean its so freakign obvious-  i guess we found those 2020 biden voters. permalink award report block reply Trump737 1 points 6 days ago No do VA permalink award report block reply proud_semi_fascist 1 points 6 days ago Virginia results are likely real. They have had a Republican governor and AG for the last four years who have been keeping watch on the voter rolls. In NJ you've had full Dem rule for the last 8 years. And that was through the massive expansion of mail in voting. permalink parent award report block reply Wexit-Delecto 1 points 6 days ago u/TakingCoatsWIN To follow up with our conversation from yesterday: it appears they can steal elections in the same manner as in 2020. permalink award report block reply TakingCoatsWIN 2 points 6 days ago They did it to Kari Lake in 2024, if they did it in the presidential they would have had to stop the count in all swing states like in 2020, that wasn't going to fly when the entire world is watching. permalink parent award report block reply Spellmonger 1 points 6 days ago WELL HERE WE ARE AGAIN , another election under our belts filled with \"in-your-face cheating\". Another one coming up a year from now, and no meaningful election reform after all these years. Do not doubt that we will be left twisting in the breeze next November.\nPresident Trump asked our Senators to: <-  \"End the Filibuster and Pass Bills to Secure Elections – Thune: “Just Not Happening” We must find a way to make elections local, which means precincts with borders that encompass no more than 2,000 to 3,000 eligible voters, and those eligible voters have absolute control of the conduct of the election in their precinct.  And all the State Legislatures or Congress has to do is set the date and provide the necessary funds. No state voter rolls, just a pre-election resident-conducted canvass to locate eligible voters living in their SMALL precinct and to identify voters who need special help.   And then the common sense rules that we all have talked about for years. This way, if there are people incentivized to cheat, they will only taint 2-3 thousand ballots, not the whole State of California or Michigan, or Pennsylvania, or Georgia, NJ, Ohio ... If you are thinking this will be too difficult, try to imagine what George Washington, Thomas Jefferson, John Adams, Benjamin Franklin, Alexander Hamilton, John Jay, and James Madison thought about the task ahead of them. permalink award report block reply FreedomFlowerDelta 1 points 6 days ago Elections are fake and gay permalink award report block reply BrewSwillis 1 points 6 days ago And the Republican candidate has enough votes to win any other year, but somehow, illogically, the democrat has even more. Just like Trump v Biden in 2020. permalink award report block reply OrangeManBadasss 1 points 6 days ago Fuck it. We need to start cheating. permalink award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply emorphia 1 points 6 days ago adn they will send a letter and go on fox news to state that they are outraged ... and do nothing about it. permalink award report block reply Elencher 1 points 6 days ago By percentage this is a bigger dump than Biden 2020. permalink award report block reply grassshrimp 1 points 6 days ago No voter ID, a long time Democrat war machine rigging elections for many decades, lots of illegals to flood the system with ballots, Jack not embracing MAGA and Trump and triggered white women who think they are losing rights. A recipe for Democrat control. permalink award report block reply vongregormench 1 points 6 days ago 2021 was a huge jump too. That looks like the start of this. permalink award report block reply DingleBalls 1 points 6 days ago Yeah that's definitely the rigging machine in action. permalink award report block reply corntortilla 1 points 6 days ago This must be true. It’s on the internet for fuck sake. permalink award report block reply PiratePatriotParrot OP 0 points 6 days ago The president is really this guy name Biden but the internet tells us otherwise. permalink parent award report block reply corntortilla 0 points 6 days ago Found another retard. permalink parent award report block reply PiratePatriotParrot OP 1 points 6 days ago It's a joke permalink parent award report block reply caKAG 1 points 6 days ago Sherril was involved in a cheating scandal at the Naval Academy that she was not allowed to walk for graduation. Seems she was well prepared to cheat her way to the governorship permalink award report block reply keeptherepublic1776 1 points 6 days ago Dems will own both houses and trump will be kicked out. And America will begin it's fast decline to nothing permalink award report block reply Executarian2 1 points 6 days ago The constant cope is fucking pathetic. Whenever we lose an election, it’s now voter fraud instead of a plethora of obvious reasons, like an unpopular president, the government shutdown, no attack against affordability. Also, Jack got 120k more than the Republican in the last election. Not only are you ignoring reality, you’re also awful at analyzing the numbers. permalink award report block reply ChilledCovfefe 1 points 6 days ago The democrats are still powerful and own all of the media. They have a lot of people whipped up into a frenzy about ICE and trans and Israel etc. so they have energized their base in these blue states. The machines still need to go but just realize that they are good at getting a lot of people to believe crazy shit and then go vote. permalink parent award report block reply Executarian2 -1 points 6 days ago I think it’s less about the media’s propaganda because nobody gives a shit about that anymore. Trump’s approval rating is down FIFTY PERCENT from the start of the year amongst 18-24 year olds because of his ridiculous pro-Israel stance. It might be one of the most important issues. Combine that with Trump’s complete inability to tackle affordability in any way and it makes complete sense that we would get shellacked in this election. Midterms will be even worse. permalink parent award report block reply Taqiyya_Mockingbird 1 points 6 days ago Any suitcases under the tables? Anyone seen Ruby Freeman? permalink award report block reply MorningFrost 1 points 6 days ago FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD permalink award report block reply lispboy 1 points 6 days ago The shut down got them the turnout they needed in the urban areas. permalink award report block reply 123breadman 1 points 6 days ago Those are all the liberal NYCers who left and voted in NJ. permalink award report block reply JDVance4President28 1 points 6 days ago Lol this just reminded me of when large amount of people here actually thought Trump allowed the 2020 election to be stolen in order to \"catch\" the deep state red handed for consequences. Point being, no consequences ever came. So of course the election fraud is still happening. permalink award report block reply Snowdone 1 points 6 days ago I am I. New Jersey. Ciatarelli signs are EVERYWHERE. I have seen ONE Sherril sign. No way she won. What they did here was the same as the recall election in CA where I live. They rigged it hard there so if you cried fraud it would sound ridiculous because Newsome “got” 70% of the vote to not get recalled. Over there “Recall Newsome” signs were EVERYWHERE. I LIVE IN A COUMTY WHERE TRUMP LOSES EVERYTIME yet they wanted Nesome out. It was the trial run for the Big Fraud they ran this election. See if it’s big enough it’s hard to say fraud and no you can’t inspect the ballots either. VA and NJ were both neck and neck until Election Day. Then… but democrats get 57+ % of the vote. BULLSHIT! permalink award report block reply Grindelwald 1 points 6 days ago And the computer volume was that much higher going into and out of NYC that day.  Hard to get to the polls in two places in one day, you know? permalink award report block reply PillarOfWisdom 1 points 6 days ago That's odd.  Who knew there are consequences to not prosecuting election fraud.  If only we had someone in the White House and Congress to do something about it.  Oh well, maybe next election.  As long as we keep sending money to Israel...that's all that matters. permalink award report block reply LLegendary 1 points 6 days ago Well....they haven't done anything to stop the voter fraud..... permalink award report block reply MorningFrost 1 points 6 days ago We can expect another steal. WHY?  BECAUSE NOTHING HAS BEEN DONE SINCE the 2020 STEAL.!!!!!! permalink award report block reply MemoryHoleyeO 1 points 6 days ago Cheating will continue until moral improves permalink award report block reply Auroraalpha 1 points 6 days ago Just like 81M ballots! permalink award report block reply rejectnullhypothesis 1 points 6 days ago It's hard not to give up as a MAGA voter when the DOJ and FBI do nothing about massive election fraud. permalink award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Obieonekanobi 1 points 6 days ago Illegals. permalink award report block reply BBvarn 1 points 6 days ago If any citizens pay taxes in New Jersey, they are fools. permalink award report block reply Odyssey 1 points 6 days ago Put this evidence on top of the pile of \"NO STANDING\" evidence we already have. It will be useful in when ranting about it in Fox News interviews. permalink award report block reply CommieCrats 1 points 6 days ago Ammo box permalink award report block reply Walleye-vision71 0 points 6 days ago Yeah, because New Jersey electing democrats is shocking news! permalink award report block reply shogun5000 0 points 6 days ago 2nd term performance is a fucking joke so far permalink award report block reply tarballs 0 points 6 days ago Longterm Democrat control from the highest level to the lowest, has created a kind of cascading effect in the dirty Jerz. It's not just chain immigration snowballing, it's everything. Old people dying or retiring to Florida, young people turning 18, White people being stupid enough to get jabbed for covid and racemix, small business owners selling and fucking off, indian ownership replacing those small businesses with the freebie loans they get. Blacks having several kids each and spreading out from their inner city hives (and going apeshit over the EBT stuff). Weed getting decriminalized, non-stop construction of new apartment buildings everywhere. The cold war being a distant forgotten memory and geopolitical developments vis a vis Ukraine mean that eastern Europeans, Koreans, Cubans, etc don't reliably lean right wing anymore. It's an above average intelligence state full of 105-115 IQ careerists, and those kinds of people arrogantly fancy themselves \"smart\" and wouldn't be caught dead voting Republican like those stupid \"rednecks\" that maintain their roads and deliver their food to the grocery store. Trump turns off those so-called independents, and if he's not on the ballot then Republicans don't turn out. Jerseyans are kind people but there's an undeniable air of feudal hostility- people don't talk to each other outside of their bubbles, young White people get pretty much no exposure to foundational American ideals. The boys all have broccoli hair, wear gold chains, and talk in negro slang. The ones that don't, fall into other subcultures that lean left-wing. I can personally tell you stories about the dirty looks and treatment I've gotten from other Republicans and Christians, for literally no real reason I can keep going. It's bad. It's really bad. I don't really mind Arabs but Mohammedian headgear is something you see pretty much every time you go outside. My high school hosted fireworks for independence day and it was literally 85%+ brown asians. This election was supposed to be Ciattarelli's hail mary moment, his 2024, but now I have no idea how the GOP is supposed to win anything without swinging hard left. permalink award report block reply PiratePatriotParrot OP 1 points 6 days ago You got your pulse on everything. \"The boys all have broccoli hair\" > I watch high school get out everyday and it's YEP, every kid with that shit. + ebike permalink parent award report block reply tarballs 1 points 6 days ago It has been said that I'm mentally all over the place. I take it as a compliment permalink parent award report block reply mass55th 0 points 7 days ago Now where have I seen that before??? Bueller? Bueller??Bueller??? permalink award report block reply Schroeder09 -1 points 6 days ago Yeah. The RNC is incompetent and complicit. They should've hired Scott Presley and TPUSA's  get out the vote people years ago. They're not serious. They're just there to launder money and basically live off donations as a form of welfare while they produce zero results. The Dems hire canvassers and activists on indeed. Their strategies work. You all look like retards thinking EVERY election is won through cheating. permalink award report block reply mailinvoter 2 points 6 days ago If the demonrats could win without election fraud, then why do they do it? permalink parent award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\npatrioticwinning3 235 points 7 days ago Zero riggers arrested = zero incentive not to rig. permalink award report block reply HeavyMetalPatriot 74 points 7 days ago THIS permalink parent award report block reply Kingoftheroad 39 points 7 days ago THIS is what happens as long as elections aren't restructured for security. Even the states redistricting in our favor is, even though necessary right now to combat their rigging of elections, potential very antithetical to fair and true elections. I saw from family who sent it to me that they did redistricting in Canada for the federal elections late last year right before Trudeau stepped down and guess what happened...their liberals won the federal election again. So it can be a genuine correction or it can be used in a disingenuous way to rig elections like California uses called ballot harvesting to rig their elections permalink parent award report block reply guywholikesDjtof2024 28 points 6 days ago I SUSPECTED IT WAS FRAUD. MAGA RIGHT AGAIN. permalink parent award report block reply Crucible 29 points 7 days ago The cost of not having GOP boots on the ground. This was a winnable race. permalink parent award report block reply perma-maga 27 points 6 days ago The price of Republicans in Congress being useless. permalink parent award report block reply MorningFrost 8 points 6 days ago Worse than useless. permalink parent award report block reply clownworld30330 4 points 6 days ago The price of Blondi. Trump didn’t lift a finger to call out and fight the coming fraud. The fraud came. Now it’s too late for this cycle. But do you think they’ll do anything about it ahead of the midterms? Lol no they won’t. permalink parent award report block reply mojorisen 3 points 6 days ago First Republican voters have to hold their representatives to task.  Constant calls, showing up at town halls and raising hell, primary them, etc.  Unless that happens they have no incentive to do anything but what they have been doing. permalink parent award report block reply BruddahIz 1 points 6 days ago Teh GOP/Pressler were on the ground - this is why they had to cheat so much ? permalink parent award report block reply Crucible 2 points 6 days ago You need thousands of Scott Preslers if you're serious about winning. permalink parent award report block reply Made_in_America 14 points 6 days ago It was probably orchestrated by some of the same players involved in the 2020 steal. When criminals walk, you get more crime. permalink parent award report block reply MorningFrost 10 points 6 days ago ZERO arrests. permalink parent award report block reply NomadicKrow2 7 points 6 days ago I'd be looking at Pam Bondi, but I'd have to turn Fox News on. permalink parent award report block reply MorningFrost 4 points 6 days ago She isn't doing anything. permalink parent award report block reply view 2 more comments... schiff_for_brains 1 points 6 days ago They don't even need to walk.  Nobody is arresting them. permalink parent award report block reply infinitysupreme 12 points 6 days ago The riggers got medals from the Biden White House permalink parent award report block reply NotYourMan 5 points 6 days ago IKR!  How are people voting for democrats?  This is the party that released COVID to win the 2020 election.  The party that mandated an experimental vaccine that killed thousands due to adverse reactions.  The party that used censorship and lawfare against political opponents.  The democrats are very organized in their conquest of US elections.  We need that on the republican side. permalink parent award report block reply aSavvyBoi 1 points 6 days ago You'd be surprised how many retarded people there are, my own parents included.  They refuse to believe point 1, and think everything else you mentioned is a good thing. permalink parent award report block reply load 7 more comments...\nHeavyMetalPatriot 74 points 7 days ago THIS permalink parent award report block reply Kingoftheroad 39 points 7 days ago THIS is what happens as long as elections aren't restructured for security. Even the states redistricting in our favor is, even though necessary right now to combat their rigging of elections, potential very antithetical to fair and true elections. I saw from family who sent it to me that they did redistricting in Canada for the federal elections late last year right before Trudeau stepped down and guess what happened...their liberals won the federal election again. So it can be a genuine correction or it can be used in a disingenuous way to rig elections like California uses called ballot harvesting to rig their elections permalink parent award report block reply guywholikesDjtof2024 28 points 6 days ago I SUSPECTED IT WAS FRAUD. MAGA RIGHT AGAIN. permalink parent award report block reply\nKingoftheroad 39 points 7 days ago THIS is what happens as long as elections aren't restructured for security. Even the states redistricting in our favor is, even though necessary right now to combat their rigging of elections, potential very antithetical to fair and true elections. I saw from family who sent it to me that they did redistricting in Canada for the federal elections late last year right before Trudeau stepped down and guess what happened...their liberals won the federal election again. So it can be a genuine correction or it can be used in a disingenuous way to rig elections like California uses called ballot harvesting to rig their elections permalink parent award report block reply\nguywholikesDjtof2024 28 points 6 days ago I SUSPECTED IT WAS FRAUD. MAGA RIGHT AGAIN. permalink parent award report block reply\nCrucible 29 points 7 days ago The cost of not having GOP boots on the ground. This was a winnable race. permalink parent award report block reply perma-maga 27 points 6 days ago The price of Republicans in Congress being useless. permalink parent award report block reply MorningFrost 8 points 6 days ago Worse than useless. permalink parent award report block reply clownworld30330 4 points 6 days ago The price of Blondi. Trump didn’t lift a finger to call out and fight the coming fraud. The fraud came. Now it’s too late for this cycle. But do you think they’ll do anything about it ahead of the midterms? Lol no they won’t. permalink parent award report block reply mojorisen 3 points 6 days ago First Republican voters have to hold their representatives to task.  Constant calls, showing up at town halls and raising hell, primary them, etc.  Unless that happens they have no incentive to do anything but what they have been doing. permalink parent award report block reply BruddahIz 1 points 6 days ago Teh GOP/Pressler were on the ground - this is why they had to cheat so much ? permalink parent award report block reply Crucible 2 points 6 days ago You need thousands of Scott Preslers if you're serious about winning. permalink parent award report block reply\nperma-maga 27 points 6 days ago The price of Republicans in Congress being useless. permalink parent award report block reply MorningFrost 8 points 6 days ago Worse than useless. permalink parent award report block reply clownworld30330 4 points 6 days ago The price of Blondi. Trump didn’t lift a finger to call out and fight the coming fraud. The fraud came. Now it’s too late for this cycle. But do you think they’ll do anything about it ahead of the midterms? Lol no they won’t. permalink parent award report block reply\nMorningFrost 8 points 6 days ago Worse than useless. permalink parent award report block reply\nclownworld30330 4 points 6 days ago The price of Blondi. Trump didn’t lift a finger to call out and fight the coming fraud. The fraud came. Now it’s too late for this cycle. But do you think they’ll do anything about it ahead of the midterms? Lol no they won’t. permalink parent award report block reply\nmojorisen 3 points 6 days ago First Republican voters have to hold their representatives to task.  Constant calls, showing up at town halls and raising hell, primary them, etc.  Unless that happens they have no incentive to do anything but what they have been doing. permalink parent award report block reply\nBruddahIz 1 points 6 days ago Teh GOP/Pressler were on the ground - this is why they had to cheat so much ? permalink parent award report block reply Crucible 2 points 6 days ago You need thousands of Scott Preslers if you're serious about winning. permalink parent award report block reply\nCrucible 2 points 6 days ago You need thousands of Scott Preslers if you're serious about winning. permalink parent award report block reply\nMade_in_America 14 points 6 days ago It was probably orchestrated by some of the same players involved in the 2020 steal. When criminals walk, you get more crime. permalink parent award report block reply MorningFrost 10 points 6 days ago ZERO arrests. permalink parent award report block reply NomadicKrow2 7 points 6 days ago I'd be looking at Pam Bondi, but I'd have to turn Fox News on. permalink parent award report block reply MorningFrost 4 points 6 days ago She isn't doing anything. permalink parent award report block reply view 2 more comments... schiff_for_brains 1 points 6 days ago They don't even need to walk.  Nobody is arresting them. permalink parent award report block reply\nMorningFrost 10 points 6 days ago ZERO arrests. permalink parent award report block reply NomadicKrow2 7 points 6 days ago I'd be looking at Pam Bondi, but I'd have to turn Fox News on. permalink parent award report block reply MorningFrost 4 points 6 days ago She isn't doing anything. permalink parent award report block reply view 2 more comments...\nNomadicKrow2 7 points 6 days ago I'd be looking at Pam Bondi, but I'd have to turn Fox News on. permalink parent award report block reply MorningFrost 4 points 6 days ago She isn't doing anything. permalink parent award report block reply view 2 more comments...\nMorningFrost 4 points 6 days ago She isn't doing anything. permalink parent award report block reply view 2 more comments...\nschiff_for_brains 1 points 6 days ago They don't even need to walk.  Nobody is arresting them. permalink parent award report block reply\ninfinitysupreme 12 points 6 days ago The riggers got medals from the Biden White House permalink parent award report block reply\nNotYourMan 5 points 6 days ago IKR!  How are people voting for democrats?  This is the party that released COVID to win the 2020 election.  The party that mandated an experimental vaccine that killed thousands due to adverse reactions.  The party that used censorship and lawfare against political opponents.  The democrats are very organized in their conquest of US elections.  We need that on the republican side. permalink parent award report block reply aSavvyBoi 1 points 6 days ago You'd be surprised how many retarded people there are, my own parents included.  They refuse to believe point 1, and think everything else you mentioned is a good thing. permalink parent award report block reply\naSavvyBoi 1 points 6 days ago You'd be surprised how many retarded people there are, my own parents included.  They refuse to believe point 1, and think everything else you mentioned is a good thing. permalink parent award report block reply\nprojectarcturus1 81 points 7 days ago Voter fraud, as always. This our most important issue, because the fraud is what causes all our other problems. permalink award report block reply Counterwhat 21 points 6 days ago This and only this.  I bet the the percentage was the same across the state. It was done on small increments as to not cause suspicion. permalink parent award report block reply Odyssey 8 points 6 days ago Voter fraud leads to stolen seat from the legitimate governor. Illegitimate governor further codifies voter fraud on day one for rigging local, AG and Supreme Court elections. Illegitimate governor appoints district judges. Appointed district judges issues injunction against legitimately elected President. Illegitimate governor shelters illegal aliens for permanent supermajority. Illegitimate governor reelects herself. Illegitimate governor steals House & Senate seats in the general election. Illegitimate senators vote to shut down the government. Illegitimate senators refuse to appoint unfavorable federal judges. Illegitimate senators vote to put favourable federal judges who declare voter ID as unconstitutional. <-- You have reached here permalink parent award report block reply BKav 6 points 6 days ago Yes👆 permalink parent award report block reply Taqiyya_Mockingbird 5 points 6 days ago Sorry, we’ll need to win midterms if we want to look into thinking about investigating the possibility that something adjacent to voting errors occurred. permalink parent award report block reply bidensmissingbrain 5 points 6 days ago Oh noes! We didn’t win the midterms! Darn, that’s too bad, if only DRuMpH hadn’t said that thing. Oh well, guess we better grift fundraise for the next 2 years to squeeze every cent the dems don’t steal from people. 😎 permalink parent award report block reply\nCounterwhat 21 points 6 days ago This and only this.  I bet the the percentage was the same across the state. It was done on small increments as to not cause suspicion. permalink parent award report block reply\nOdyssey 8 points 6 days ago Voter fraud leads to stolen seat from the legitimate governor. Illegitimate governor further codifies voter fraud on day one for rigging local, AG and Supreme Court elections. Illegitimate governor appoints district judges. Appointed district judges issues injunction against legitimately elected President. Illegitimate governor shelters illegal aliens for permanent supermajority. Illegitimate governor reelects herself. Illegitimate governor steals House & Senate seats in the general election. Illegitimate senators vote to shut down the government. Illegitimate senators refuse to appoint unfavorable federal judges. Illegitimate senators vote to put favourable federal judges who declare voter ID as unconstitutional. <-- You have reached here permalink parent award report block reply\nBKav 6 points 6 days ago Yes👆 permalink parent award report block reply\nTaqiyya_Mockingbird 5 points 6 days ago Sorry, we’ll need to win midterms if we want to look into thinking about investigating the possibility that something adjacent to voting errors occurred. permalink parent award report block reply bidensmissingbrain 5 points 6 days ago Oh noes! We didn’t win the midterms! Darn, that’s too bad, if only DRuMpH hadn’t said that thing. Oh well, guess we better grift fundraise for the next 2 years to squeeze every cent the dems don’t steal from people. 😎 permalink parent award report block reply\nbidensmissingbrain 5 points 6 days ago Oh noes! We didn’t win the midterms! Darn, that’s too bad, if only DRuMpH hadn’t said that thing. Oh well, guess we better grift fundraise for the next 2 years to squeeze every cent the dems don’t steal from people. 😎 permalink parent award report block reply\nSgt_Hulka 29 points 6 days ago The republicans are a joke. They don’t want to fix anything.  If they did, they would have fixed it. Why is mail-in voting still a thing?  Why is Election Day now weeks or months long?  Why is voter ID so hard to enact? I’m sick of it.  I think elections were rigged all over the country. People didn’t go to jail.  They will continue to cheat and who can blame them? permalink award report block reply Simple_Doot 13 points 6 days ago Why is GOP running weak as fuck and not delivering on the platform a thing? permalink parent award report block reply AmericanJawa 11 points 6 days ago Why is GOP running weak as fuck and not delivering on the platform a thing? Because they don't want anything to be delivered on, they prefer the status quo. permalink parent award report block reply rebuildingMyself 2 points 6 days ago Yes the Uniparty hates Outsiders disrupting their agendas and I'm not talking about politicians we actually elect, but the permanent Deep State class that controls most of them. permalink parent award report block reply Leeeashlee 1 points 6 days ago Bc gop sucks balls permalink parent award report block reply Sgt_Hulka 1 points 6 days ago Great question. permalink parent award report block reply\nSimple_Doot 13 points 6 days ago Why is GOP running weak as fuck and not delivering on the platform a thing? permalink parent award report block reply AmericanJawa 11 points 6 days ago Why is GOP running weak as fuck and not delivering on the platform a thing? Because they don't want anything to be delivered on, they prefer the status quo. permalink parent award report block reply rebuildingMyself 2 points 6 days ago Yes the Uniparty hates Outsiders disrupting their agendas and I'm not talking about politicians we actually elect, but the permanent Deep State class that controls most of them. permalink parent award report block reply Leeeashlee 1 points 6 days ago Bc gop sucks balls permalink parent award report block reply Sgt_Hulka 1 points 6 days ago Great question. permalink parent award report block reply\nAmericanJawa 11 points 6 days ago Why is GOP running weak as fuck and not delivering on the platform a thing? Because they don't want anything to be delivered on, they prefer the status quo. permalink parent award report block reply rebuildingMyself 2 points 6 days ago Yes the Uniparty hates Outsiders disrupting their agendas and I'm not talking about politicians we actually elect, but the permanent Deep State class that controls most of them. permalink parent award report block reply\nrebuildingMyself 2 points 6 days ago Yes the Uniparty hates Outsiders disrupting their agendas and I'm not talking about politicians we actually elect, but the permanent Deep State class that controls most of them. permalink parent award report block reply\nLeeeashlee 1 points 6 days ago Bc gop sucks balls permalink parent award report block reply\nSgt_Hulka 1 points 6 days ago Great question. permalink parent award report block reply\nRocksCanOnlyWait 26 points 6 days ago The numbers are believable. The table is only showing years with a gubernatorial election. For comparison, 2024 had 2.2 million votes for Harris and 1.9 million for Trump. 2021 had a strong incumbent running for governor, so the turnout would be lower than in an open seat year. permalink award report block reply ESAsher 19 points 6 days ago Agreed.  Even if cheating occurred it probably took the form of new biden 'imports' and not more explicit methods.  300,000 is not much in the face of biden's 40-ish million and Jersey is a sanctuary state.  I still want to see some sweeping election integrity reforms though. permalink parent award report block reply Grilledpepe 9 points 6 days ago Saying things like 'the numbers are believable' just excuses obvious fraud.  I'm not making any excuses for these clowns.  Make them prove that many people are actually voting permalink parent award report block reply Kwyjiboy0 4 points 6 days ago What about the open seat years of 2017, 2009, or 2001? All had 2.1-2.3m votes. Then 2025 had 3.2m. 2021 wasn't that strong of an incumbent if 1.25m voted against him. That number of votes would have won half of the other elections, considering total votes really hasn't increased from 1969 to 2017. permalink parent award report block reply RocksCanOnlyWait -1 points 6 days ago Voter turnouts have increased across the board starting in 2020 and peak turnout has remained high for Republicans and Democrats alike. However, Democrat turnout is more consistent, whereas Republican turnout is more varied. Yes, some fraud happens. But it's not going to account for over 10% of the votes. permalink parent award report block reply FractalRoar 3 points 6 days ago Phantom voters have increased markedly in the last two cycles.The machines insert as many ballot images as they have names to use, then the voter rolls get caught up over the next month or two. permalink parent award report block reply RandyMoss 3 points 6 days ago Found the cuck! permalink parent award report block reply HKYGOALIE30 2 points 6 days ago The Dems turned out in big numbers. Jack got 150K more votes and still lost. It sucks. permalink parent award report block reply load 5 more comments...\nESAsher 19 points 6 days ago Agreed.  Even if cheating occurred it probably took the form of new biden 'imports' and not more explicit methods.  300,000 is not much in the face of biden's 40-ish million and Jersey is a sanctuary state.  I still want to see some sweeping election integrity reforms though. permalink parent award report block reply\nGrilledpepe 9 points 6 days ago Saying things like 'the numbers are believable' just excuses obvious fraud.  I'm not making any excuses for these clowns.  Make them prove that many people are actually voting permalink parent award report block reply\nKwyjiboy0 4 points 6 days ago What about the open seat years of 2017, 2009, or 2001? All had 2.1-2.3m votes. Then 2025 had 3.2m. 2021 wasn't that strong of an incumbent if 1.25m voted against him. That number of votes would have won half of the other elections, considering total votes really hasn't increased from 1969 to 2017. permalink parent award report block reply RocksCanOnlyWait -1 points 6 days ago Voter turnouts have increased across the board starting in 2020 and peak turnout has remained high for Republicans and Democrats alike. However, Democrat turnout is more consistent, whereas Republican turnout is more varied. Yes, some fraud happens. But it's not going to account for over 10% of the votes. permalink parent award report block reply FractalRoar 3 points 6 days ago Phantom voters have increased markedly in the last two cycles.The machines insert as many ballot images as they have names to use, then the voter rolls get caught up over the next month or two. permalink parent award report block reply\nRocksCanOnlyWait -1 points 6 days ago Voter turnouts have increased across the board starting in 2020 and peak turnout has remained high for Republicans and Democrats alike. However, Democrat turnout is more consistent, whereas Republican turnout is more varied. Yes, some fraud happens. But it's not going to account for over 10% of the votes. permalink parent award report block reply FractalRoar 3 points 6 days ago Phantom voters have increased markedly in the last two cycles.The machines insert as many ballot images as they have names to use, then the voter rolls get caught up over the next month or two. permalink parent award report block reply\nFractalRoar 3 points 6 days ago Phantom voters have increased markedly in the last two cycles.The machines insert as many ballot images as they have names to use, then the voter rolls get caught up over the next month or two. permalink parent award report block reply\nRandyMoss 3 points 6 days ago Found the cuck! permalink parent award report block reply\nHKYGOALIE30 2 points 6 days ago The Dems turned out in big numbers. Jack got 150K more votes and still lost. It sucks. permalink parent award report block reply\nvote_for_MAGA_2020 13 points 6 days ago Clearly the Trump admin isn't going to address the massive voter fraud that is sending this country into the toilet. permalink award report block reply\nTreefiddydiddy 9 points 6 days ago these cheating liberal whites and their brown pets will NEVER stop with this shit unless the hammer falls on them permalink award report block reply\nthrottlejohnson 8 points 6 days ago could be all the illegals voting....wait permalink award report block reply\nMatehmateh 7 points 6 days ago Pajeets in the millions? permalink award report block reply KarlHungus53 1 points 6 days ago Can confirm. permalink parent award report block reply\nKarlHungus53 1 points 6 days ago Can confirm. permalink parent award report block reply\nChristineblaseyford 7 points 6 days ago They are 100% cheating in 100% of elections. permalink award report block reply\nBrionK 5 points 6 days ago Destroy the machines. permalink award report block reply\nRock9Head 5 points 6 days ago Stolen elections. All of them. permalink award report block reply\nspinometer2 4 points 6 days ago ALL THE ELECTIONS ARE RIGGED too big to rig was for real plus there had to be white hackers in key places in 2024 to block their rigging attempts permalink award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply spinometer2 3 points 6 days ago \"controlled opposition\" - so all the attacks against him, including the bullet, were never meant to harm him? outta here retard permalink parent award report block reply TDBabyBite 1 points 6 days ago Neocon foreign policy...like ending 7 wars? Interesting. Do you think Biden really got a historic number of votes? Kamala polled back in 2020 at like 2 percent, do you think she even came close to Trumps votes? permalink parent award report block reply\nNewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply spinometer2 3 points 6 days ago \"controlled opposition\" - so all the attacks against him, including the bullet, were never meant to harm him? outta here retard permalink parent award report block reply TDBabyBite 1 points 6 days ago Neocon foreign policy...like ending 7 wars? Interesting. Do you think Biden really got a historic number of votes? Kamala polled back in 2020 at like 2 percent, do you think she even came close to Trumps votes? permalink parent award report block reply\nspinometer2 3 points 6 days ago \"controlled opposition\" - so all the attacks against him, including the bullet, were never meant to harm him? outta here retard permalink parent award report block reply\nTDBabyBite 1 points 6 days ago Neocon foreign policy...like ending 7 wars? Interesting. Do you think Biden really got a historic number of votes? Kamala polled back in 2020 at like 2 percent, do you think she even came close to Trumps votes? permalink parent award report block reply\nTookens 4 points 6 days ago Hordes of TDS-afflicted, mentally-ill, America-hating democrats rushing to the polls to FIGHT TRUMP <duurrrrrr!#KE(@> permalink award report block reply ArtLife 5 points 6 days ago I agree, the relentless mantra that Trump and R's are the source of everything wrong with your life and times is working. The polls of people in NY who think everything sucks but somehow isn't the fault of their own leaders is amazing to see. Orwell's 2 minutes of hate in action, and this is nationwide. The R's have not done nearly what they could since last year. Terrible PR and communication, always nitpicking points that the general public doesn't see or understand. I listened to Ted Cruz and John Kennedy on some podcast last night, Kennedy hawking his book. He means well but you see how these guys are so far removed from everyday people. They pride themselves on lawyerly discussion while the country burns down, and they are all buddies in DC. Congress and Senate should be part-time minimally paid jobs. There should be a way to completely outlaw lobbying, especially of Senators, and repeal the 17th. Congress should not be able to vote anything for themselves, and most of the amenities should be eliminated. Representatives should always only talk to their own individual constituents, and the state level reps. permalink parent award report block reply anotherthing 3 points 6 days ago There's a reason why they tried that No Kings thing during a government shutdown that they caused so close to an election. We lost the 4D chess idea with the Big Bloated Bill. That shutdown fight should have been over budget cuts at the beginning of Trump's term when he was riding that wave of political capital. Instead, we got Biden Era spending with some MAGA stuff tacked on there. The Senate Parliamentarian that's been there since Harry Reid gutted a lot of that MAGA stuff, and Trump was still demanding it. He demonstrated then that he was afraid of the filibuster and he was going to sacrifice nearly everything to avoid that filibuster. Now you have Democrats pulling the \"Big Ask\" from Trump's playbook with the $1.5T in extra spending. permalink parent award report block reply\nArtLife 5 points 6 days ago I agree, the relentless mantra that Trump and R's are the source of everything wrong with your life and times is working. The polls of people in NY who think everything sucks but somehow isn't the fault of their own leaders is amazing to see. Orwell's 2 minutes of hate in action, and this is nationwide. The R's have not done nearly what they could since last year. Terrible PR and communication, always nitpicking points that the general public doesn't see or understand. I listened to Ted Cruz and John Kennedy on some podcast last night, Kennedy hawking his book. He means well but you see how these guys are so far removed from everyday people. They pride themselves on lawyerly discussion while the country burns down, and they are all buddies in DC. Congress and Senate should be part-time minimally paid jobs. There should be a way to completely outlaw lobbying, especially of Senators, and repeal the 17th. Congress should not be able to vote anything for themselves, and most of the amenities should be eliminated. Representatives should always only talk to their own individual constituents, and the state level reps. permalink parent award report block reply anotherthing 3 points 6 days ago There's a reason why they tried that No Kings thing during a government shutdown that they caused so close to an election. We lost the 4D chess idea with the Big Bloated Bill. That shutdown fight should have been over budget cuts at the beginning of Trump's term when he was riding that wave of political capital. Instead, we got Biden Era spending with some MAGA stuff tacked on there. The Senate Parliamentarian that's been there since Harry Reid gutted a lot of that MAGA stuff, and Trump was still demanding it. He demonstrated then that he was afraid of the filibuster and he was going to sacrifice nearly everything to avoid that filibuster. Now you have Democrats pulling the \"Big Ask\" from Trump's playbook with the $1.5T in extra spending. permalink parent award report block reply\nanotherthing 3 points 6 days ago There's a reason why they tried that No Kings thing during a government shutdown that they caused so close to an election. We lost the 4D chess idea with the Big Bloated Bill. That shutdown fight should have been over budget cuts at the beginning of Trump's term when he was riding that wave of political capital. Instead, we got Biden Era spending with some MAGA stuff tacked on there. The Senate Parliamentarian that's been there since Harry Reid gutted a lot of that MAGA stuff, and Trump was still demanding it. He demonstrated then that he was afraid of the filibuster and he was going to sacrifice nearly everything to avoid that filibuster. Now you have Democrats pulling the \"Big Ask\" from Trump's playbook with the $1.5T in extra spending. permalink parent award report block reply\nOTher55 3 points 6 days ago The vote margin last year was Kackler +252,498 The vote margin here is Sherill +414,369 Raw total of votes cast last year is Kawkgobbler 2.2 million vs. Trump 1.9 million Sure the result sucks. But crying fraud at every loss makes you sound like the boy who cried wolf. permalink award report block reply mailinvoter 3 points 6 days ago What if there was a wolf in the Cockgobbler's election results, but you didn't see it and claim it was never there? Is it just a coincidence that every state Trump won has picture voter id? permalink parent award report block reply OTher55 4 points 6 days ago Schrodinger's wolf in the Gobbler's box. Red votes dropped 500k from last year, while Blue votes dropped 400k. That's an enthusiasm to turn out problem. Here's more. In 2020, the vote margin was Braindead +725,061. The margin shrunk almost 500k in 4 years. That's hard evidence and facts. Aren't we supposed to choose facts over feelings? permalink parent award report block reply mailinvoter 1 points 6 days ago So you're not aware of postal workers dumping ballots and election workers claiming to rip up Trump ballots?  I see you mentioned \"votes\" but not \"voters\". You can play the other sides' games and ignore the facts, but I'll just say I hope you don't give that wolf indigestion. permalink parent award report block reply proud_semi_fascist 1 points 6 days ago Hey dummy. You can't compare 2020 to literally anything. They sent a mail in ballot to every registered voter in the state. The fraud was off the charts. You do realize that they register you to vote through DMV, and they allow illegals to get drivers licenses in NJ. So illegals are 100% registered to vote, and are either doing it themselves or having their ballots filled out for them. Sorry if that hurts your feelings. permalink parent award report block reply OTher55 0 points 6 days ago I can't compare 2020 to anything, but you can? Oh ok. https://patriots.win/p/1ARK513J8W/obvious-voter-fraud-in-nj-on-tue/c permalink parent award report block reply view 2 more comments... proud_semi_fascist 2 points 6 days ago This was an off year governor election. Read the table. The total votes here are absurd, and they still have 150k more to count. When the dust settles, I can almost guarantee that more registered Dems will have voted than in last year's presidential election. Sorry, that's not believable. permalink parent award report block reply\nmailinvoter 3 points 6 days ago What if there was a wolf in the Cockgobbler's election results, but you didn't see it and claim it was never there? Is it just a coincidence that every state Trump won has picture voter id? permalink parent award report block reply OTher55 4 points 6 days ago Schrodinger's wolf in the Gobbler's box. Red votes dropped 500k from last year, while Blue votes dropped 400k. That's an enthusiasm to turn out problem. Here's more. In 2020, the vote margin was Braindead +725,061. The margin shrunk almost 500k in 4 years. That's hard evidence and facts. Aren't we supposed to choose facts over feelings? permalink parent award report block reply mailinvoter 1 points 6 days ago So you're not aware of postal workers dumping ballots and election workers claiming to rip up Trump ballots?  I see you mentioned \"votes\" but not \"voters\". You can play the other sides' games and ignore the facts, but I'll just say I hope you don't give that wolf indigestion. permalink parent award report block reply proud_semi_fascist 1 points 6 days ago Hey dummy. You can't compare 2020 to literally anything. They sent a mail in ballot to every registered voter in the state. The fraud was off the charts. You do realize that they register you to vote through DMV, and they allow illegals to get drivers licenses in NJ. So illegals are 100% registered to vote, and are either doing it themselves or having their ballots filled out for them. Sorry if that hurts your feelings. permalink parent award report block reply OTher55 0 points 6 days ago I can't compare 2020 to anything, but you can? Oh ok. https://patriots.win/p/1ARK513J8W/obvious-voter-fraud-in-nj-on-tue/c permalink parent award report block reply view 2 more comments...\nOTher55 4 points 6 days ago Schrodinger's wolf in the Gobbler's box. Red votes dropped 500k from last year, while Blue votes dropped 400k. That's an enthusiasm to turn out problem. Here's more. In 2020, the vote margin was Braindead +725,061. The margin shrunk almost 500k in 4 years. That's hard evidence and facts. Aren't we supposed to choose facts over feelings? permalink parent award report block reply mailinvoter 1 points 6 days ago So you're not aware of postal workers dumping ballots and election workers claiming to rip up Trump ballots?  I see you mentioned \"votes\" but not \"voters\". You can play the other sides' games and ignore the facts, but I'll just say I hope you don't give that wolf indigestion. permalink parent award report block reply proud_semi_fascist 1 points 6 days ago Hey dummy. You can't compare 2020 to literally anything. They sent a mail in ballot to every registered voter in the state. The fraud was off the charts. You do realize that they register you to vote through DMV, and they allow illegals to get drivers licenses in NJ. So illegals are 100% registered to vote, and are either doing it themselves or having their ballots filled out for them. Sorry if that hurts your feelings. permalink parent award report block reply OTher55 0 points 6 days ago I can't compare 2020 to anything, but you can? Oh ok. https://patriots.win/p/1ARK513J8W/obvious-voter-fraud-in-nj-on-tue/c permalink parent award report block reply view 2 more comments...\nmailinvoter 1 points 6 days ago So you're not aware of postal workers dumping ballots and election workers claiming to rip up Trump ballots?  I see you mentioned \"votes\" but not \"voters\". You can play the other sides' games and ignore the facts, but I'll just say I hope you don't give that wolf indigestion. permalink parent award report block reply\nproud_semi_fascist 1 points 6 days ago Hey dummy. You can't compare 2020 to literally anything. They sent a mail in ballot to every registered voter in the state. The fraud was off the charts. You do realize that they register you to vote through DMV, and they allow illegals to get drivers licenses in NJ. So illegals are 100% registered to vote, and are either doing it themselves or having their ballots filled out for them. Sorry if that hurts your feelings. permalink parent award report block reply OTher55 0 points 6 days ago I can't compare 2020 to anything, but you can? Oh ok. https://patriots.win/p/1ARK513J8W/obvious-voter-fraud-in-nj-on-tue/c permalink parent award report block reply view 2 more comments...\nOTher55 0 points 6 days ago I can't compare 2020 to anything, but you can? Oh ok. https://patriots.win/p/1ARK513J8W/obvious-voter-fraud-in-nj-on-tue/c permalink parent award report block reply view 2 more comments...\nproud_semi_fascist 2 points 6 days ago This was an off year governor election. Read the table. The total votes here are absurd, and they still have 150k more to count. When the dust settles, I can almost guarantee that more registered Dems will have voted than in last year's presidential election. Sorry, that's not believable. permalink parent award report block reply\nDenturesNancy 3 points 6 days ago Trump and his admin ain't doing shit about election integrity.  Democraps will continue their monopoly over elections as long as the US exists permalink award report block reply\nTrancePhreak 3 points 6 days ago New Jersey mafia is very entrenched. permalink award report block reply\nMySidesGoUp 3 points 6 days ago The US Govt is the enemy of the people. permalink award report block reply\nConsrvspkgNJ 3 points 6 days ago Yeah, we know. We know who did it, how they did it and we know what happened Tuesday like in 2018 was the test run to have it implemented nationally in the midterms.\nThe NJ AG will never, ever ,ever bust one of their own so voter fraud goes unchecked as long as it keeps Dems in power. I have jokingly told some guys in the Ocean County GOP that we should do exactly as they do in North Jersey....make every cemetery a GOP voting district. We will have to cheat so bad that it is impossible to ignore. Make 60 Minutes come down here, make Van Jones do a CNN Special Report on Jersey Voter Fraud, make Whoopie issue a tearful plea to end the rampant voter fraud in NJ.....all of it and then say \"we are just following our Democrat brethren in north Jersey, they showed us the way and damn if it doesn't work.\" permalink award report block reply\nCorse46 3 points 6 days ago Cool, totally irrelevant. Still haven’t sorted out 2020 from 5 years ago. We have a POTUS who is afraid to act on this topic so it will continue forever. permalink award report block reply\nShambolicPaul2 3 points 6 days ago Any other year and election and that would have easily been enough for a republican win. What an absolute joke of an election system you have over there permalink award report block reply\nDITTOPatriot 3 points 6 days ago The MIGA stance of the Administration and the Republican   swamp is going to make the 2026 election epic. And Trump will be impeached by Feburary of 2017. permalink award report block reply\nMoistbreadcrumb 2 points 6 days ago Actually its up 1 million over the last 8 years permalink award report block reply\nBanfir 2 points 6 days ago There is no such thing as a fair election with illegals in the picture. Our Democracy is already toast. permalink award report block reply\nJuicyfearsMAGA 2 points 6 days ago Looks like when they shut down the polls in the top three Republican leaning counties in the state due to glitches they were actually just changing those votes under the table to the Dem candidate permalink award report block reply\nRhodesianRidgeback 2 points 6 days ago More stealing. Trump: Silent. permalink award report block reply\nHenkZeilstra 2 points 6 days ago FBI, DOJ, CIA does not do ANY SHIT ABOUT THIS permalink award report block reply MeMargie 1 points 6 days ago they all aid in the corruption. permalink parent award report block reply\nMeMargie 1 points 6 days ago they all aid in the corruption. permalink parent award report block reply\nChyNahAzzWhole1 2 points 6 days ago Did the population increase 500,000 Single eligible voters? No families? No children? Did school populations increase? Cheating 101. permalink award report block reply\nScot 2 points 6 days ago The democrats could openly admit to their election fraud and the republicans would still do NOTHING. permalink award report block reply\nWexit-Delecto 2 points 6 days ago They stole the 2020 presidential election the same way, but NOTHING AT ALL was done about it. Why wouldn't they steal elections if there are ZERO consequences? permalink award report block reply\nmailinvoter 2 points 6 days ago What's odd is that another person on X asked grok what the illegal population is in NJ.  It happens to be over 525k. Coincidence?  IDK 🤷 https://x.com/NugsLoL/status/1986371033545187451 permalink award report block reply proud_semi_fascist 2 points 6 days ago You can register to vote when you get your drivers license, and illegals are allowed to get drivers licenses in NJ. You do the math. permalink parent award report block reply thefatman 1 points 6 days ago It's well, well more than a half million and change here. permalink parent award report block reply\nproud_semi_fascist 2 points 6 days ago You can register to vote when you get your drivers license, and illegals are allowed to get drivers licenses in NJ. You do the math. permalink parent award report block reply\nthefatman 1 points 6 days ago It's well, well more than a half million and change here. permalink parent award report block reply\nNamendaBiden 2 points 6 days ago Stop with the conspiracy theory shit.  Off year turn out always increases by 22% vs the last election.  Plus its not like you have standing or anything. Edit: sentence 2 should show that this post was sarcastic.  But clearly that needs clarification. permalink award report block reply proud_semi_fascist 1 points 6 days ago The table is right there for you to look at dummy. Plot the total votes for every year on a graph and you'll see how absurd this year looks. They're not even done counting yet. When the final mail in and provisionals are counted, the total will be 3.4 million. The number of registered Democrats who voted will likely be higher than the number that voted for Kamala (unaffiliated make up a smaller % of voters in off year NJ elections). When you look at individual precincts, the results look even more absurd. permalink parent award report block reply NamendaBiden 1 points 6 days ago Adjust your sarcasm meter homie permalink parent award report block reply\nproud_semi_fascist 1 points 6 days ago The table is right there for you to look at dummy. Plot the total votes for every year on a graph and you'll see how absurd this year looks. They're not even done counting yet. When the final mail in and provisionals are counted, the total will be 3.4 million. The number of registered Democrats who voted will likely be higher than the number that voted for Kamala (unaffiliated make up a smaller % of voters in off year NJ elections). When you look at individual precincts, the results look even more absurd. permalink parent award report block reply NamendaBiden 1 points 6 days ago Adjust your sarcasm meter homie permalink parent award report block reply\nNamendaBiden 1 points 6 days ago Adjust your sarcasm meter homie permalink parent award report block reply\nbreathittbill 2 points 6 days ago As the old saying goes: it doesn’t matter how the people vote, what counts is who is counting the votes. permalink award report block reply\nSomebody157 2 points 6 days ago This is statistically impossible without cheating. permalink award report block reply\nLeeeashlee 2 points 6 days ago Jack sucked the first time, he sucked the second time. No plan. No one is motivated for him except rinos.  He had dumb ads about pork roll. permalink award report block reply\nOZJRant 2 points 6 days ago Yeah I have a thought..Republicans just got played AGAIN!!\nSooo fkn stupid!! permalink award report block reply\nthefatman 2 points 6 days ago Take a ride through South Plainfield, Edison, Parlin,  and Woodbridge, then work your way south on Route 1 until you hit somewhere around Hamilton, you will see exactly why. permalink award report block reply\nTexasnumber1 2 points 6 days ago They need to be charged as terrorists enough is enough permalink award report block reply\nFerretman 2 points 6 days ago Seems unlikely permalink award report block reply\nRogueLeaderX 2 points 6 days ago Yeah, there is definitely shenanigans going on there. Jack was EXTREMELY close last election, he got blown out this time. permalink award report block reply\nKlaus73 1 points 6 days ago Sigh here we go again. permalink award report block reply\nDCYR66 1 points 6 days ago Fuck democrats!! I hope their newly elected assholes bend them over and fuck them hard and dry!!! They deserve what they vote for fucking idiots!! permalink award report block reply\nKlown_Kutz 1 points 6 days ago Women voters. Repeal the 19th permalink award report block reply\nDev404 1 points 6 days ago This administration hasn't taken rigged elections seriously, so rigged they will remain. Maricopa Audit still has the proof of the elections being rigged, but this administration can't be bothered with it, hell, they can't even be bothered with exposing Epstein's clients which is low hanging fruit. permalink award report block reply\nBigperm 1 points 6 days ago I clipped this from the next door app that someone posted... Something very fishy going on at the election station. I casted my REPUBLICAN votes, and each one defaulted to DEMOCRAT! It happened THREE TIMES! My 4th attempt correctly showed my REPUBLICAN votes, but then the machine froze and would not let me print the ballot! Poll workers gathered around the machine, and then phoned someone for help. The workers were told to reboot the machine, which they did, and it happened AGAIN! I had requested that this machine be  noted as \"out of order\",  but it was not done! Therefore, i called the police as i felt this was wrong. Officer arrived and a report was filed. Also, while this was happening, another candidate on the ballot happened to walk in and i informed him of what had transpired.  He made several calls and a commissioner of the Board of Elections arrived. After giving my information, I was asked to leave, as they were going to do an investigation. I've spoken to a couple news teams. permalink award report block reply\nhairless_ap3 1 points 6 days ago It's called cheating permalink award report block reply\nSlyster45 1 points 6 days ago Paper Ballots permalink award report block reply\nncswicn 1 points 6 days ago #NothingToSeeHere permalink award report block reply\nTrump737 1 points 6 days ago I mean its so freakign obvious-  i guess we found those 2020 biden voters. permalink award report block reply\nTrump737 1 points 6 days ago No do VA permalink award report block reply proud_semi_fascist 1 points 6 days ago Virginia results are likely real. They have had a Republican governor and AG for the last four years who have been keeping watch on the voter rolls. In NJ you've had full Dem rule for the last 8 years. And that was through the massive expansion of mail in voting. permalink parent award report block reply\nproud_semi_fascist 1 points 6 days ago Virginia results are likely real. They have had a Republican governor and AG for the last four years who have been keeping watch on the voter rolls. In NJ you've had full Dem rule for the last 8 years. And that was through the massive expansion of mail in voting. permalink parent award report block reply\nWexit-Delecto 1 points 6 days ago u/TakingCoatsWIN To follow up with our conversation from yesterday: it appears they can steal elections in the same manner as in 2020. permalink award report block reply TakingCoatsWIN 2 points 6 days ago They did it to Kari Lake in 2024, if they did it in the presidential they would have had to stop the count in all swing states like in 2020, that wasn't going to fly when the entire world is watching. permalink parent award report block reply\nTakingCoatsWIN 2 points 6 days ago They did it to Kari Lake in 2024, if they did it in the presidential they would have had to stop the count in all swing states like in 2020, that wasn't going to fly when the entire world is watching. permalink parent award report block reply\nSpellmonger 1 points 6 days ago WELL HERE WE ARE AGAIN , another election under our belts filled with \"in-your-face cheating\". Another one coming up a year from now, and no meaningful election reform after all these years. Do not doubt that we will be left twisting in the breeze next November.\nPresident Trump asked our Senators to: <-  \"End the Filibuster and Pass Bills to Secure Elections – Thune: “Just Not Happening” We must find a way to make elections local, which means precincts with borders that encompass no more than 2,000 to 3,000 eligible voters, and those eligible voters have absolute control of the conduct of the election in their precinct.  And all the State Legislatures or Congress has to do is set the date and provide the necessary funds. No state voter rolls, just a pre-election resident-conducted canvass to locate eligible voters living in their SMALL precinct and to identify voters who need special help.   And then the common sense rules that we all have talked about for years. This way, if there are people incentivized to cheat, they will only taint 2-3 thousand ballots, not the whole State of California or Michigan, or Pennsylvania, or Georgia, NJ, Ohio ... If you are thinking this will be too difficult, try to imagine what George Washington, Thomas Jefferson, John Adams, Benjamin Franklin, Alexander Hamilton, John Jay, and James Madison thought about the task ahead of them. permalink award report block reply\nFreedomFlowerDelta 1 points 6 days ago Elections are fake and gay permalink award report block reply\nBrewSwillis 1 points 6 days ago And the Republican candidate has enough votes to win any other year, but somehow, illogically, the democrat has even more. Just like Trump v Biden in 2020. permalink award report block reply\nOrangeManBadasss 1 points 6 days ago Fuck it. We need to start cheating. permalink award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nNewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nemorphia 1 points 6 days ago adn they will send a letter and go on fox news to state that they are outraged ... and do nothing about it. permalink award report block reply\nElencher 1 points 6 days ago By percentage this is a bigger dump than Biden 2020. permalink award report block reply\ngrassshrimp 1 points 6 days ago No voter ID, a long time Democrat war machine rigging elections for many decades, lots of illegals to flood the system with ballots, Jack not embracing MAGA and Trump and triggered white women who think they are losing rights. A recipe for Democrat control. permalink award report block reply\nvongregormench 1 points 6 days ago 2021 was a huge jump too. That looks like the start of this. permalink award report block reply\nDingleBalls 1 points 6 days ago Yeah that's definitely the rigging machine in action. permalink award report block reply\ncorntortilla 1 points 6 days ago This must be true. It’s on the internet for fuck sake. permalink award report block reply PiratePatriotParrot OP 0 points 6 days ago The president is really this guy name Biden but the internet tells us otherwise. permalink parent award report block reply corntortilla 0 points 6 days ago Found another retard. permalink parent award report block reply PiratePatriotParrot OP 1 points 6 days ago It's a joke permalink parent award report block reply\nPiratePatriotParrot OP 0 points 6 days ago The president is really this guy name Biden but the internet tells us otherwise. permalink parent award report block reply corntortilla 0 points 6 days ago Found another retard. permalink parent award report block reply PiratePatriotParrot OP 1 points 6 days ago It's a joke permalink parent award report block reply\ncorntortilla 0 points 6 days ago Found another retard. permalink parent award report block reply PiratePatriotParrot OP 1 points 6 days ago It's a joke permalink parent award report block reply\nPiratePatriotParrot OP 1 points 6 days ago It's a joke permalink parent award report block reply\ncaKAG 1 points 6 days ago Sherril was involved in a cheating scandal at the Naval Academy that she was not allowed to walk for graduation. Seems she was well prepared to cheat her way to the governorship permalink award report block reply\nkeeptherepublic1776 1 points 6 days ago Dems will own both houses and trump will be kicked out. And America will begin it's fast decline to nothing permalink award report block reply\nExecutarian2 1 points 6 days ago The constant cope is fucking pathetic. Whenever we lose an election, it’s now voter fraud instead of a plethora of obvious reasons, like an unpopular president, the government shutdown, no attack against affordability. Also, Jack got 120k more than the Republican in the last election. Not only are you ignoring reality, you’re also awful at analyzing the numbers. permalink award report block reply ChilledCovfefe 1 points 6 days ago The democrats are still powerful and own all of the media. They have a lot of people whipped up into a frenzy about ICE and trans and Israel etc. so they have energized their base in these blue states. The machines still need to go but just realize that they are good at getting a lot of people to believe crazy shit and then go vote. permalink parent award report block reply Executarian2 -1 points 6 days ago I think it’s less about the media’s propaganda because nobody gives a shit about that anymore. Trump’s approval rating is down FIFTY PERCENT from the start of the year amongst 18-24 year olds because of his ridiculous pro-Israel stance. It might be one of the most important issues. Combine that with Trump’s complete inability to tackle affordability in any way and it makes complete sense that we would get shellacked in this election. Midterms will be even worse. permalink parent award report block reply\nChilledCovfefe 1 points 6 days ago The democrats are still powerful and own all of the media. They have a lot of people whipped up into a frenzy about ICE and trans and Israel etc. so they have energized their base in these blue states. The machines still need to go but just realize that they are good at getting a lot of people to believe crazy shit and then go vote. permalink parent award report block reply Executarian2 -1 points 6 days ago I think it’s less about the media’s propaganda because nobody gives a shit about that anymore. Trump’s approval rating is down FIFTY PERCENT from the start of the year amongst 18-24 year olds because of his ridiculous pro-Israel stance. It might be one of the most important issues. Combine that with Trump’s complete inability to tackle affordability in any way and it makes complete sense that we would get shellacked in this election. Midterms will be even worse. permalink parent award report block reply\nExecutarian2 -1 points 6 days ago I think it’s less about the media’s propaganda because nobody gives a shit about that anymore. Trump’s approval rating is down FIFTY PERCENT from the start of the year amongst 18-24 year olds because of his ridiculous pro-Israel stance. It might be one of the most important issues. Combine that with Trump’s complete inability to tackle affordability in any way and it makes complete sense that we would get shellacked in this election. Midterms will be even worse. permalink parent award report block reply\nTaqiyya_Mockingbird 1 points 6 days ago Any suitcases under the tables? Anyone seen Ruby Freeman? permalink award report block reply\nMorningFrost 1 points 6 days ago FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD FRAUD permalink award report block reply\nlispboy 1 points 6 days ago The shut down got them the turnout they needed in the urban areas. permalink award report block reply\n123breadman 1 points 6 days ago Those are all the liberal NYCers who left and voted in NJ. permalink award report block reply\nJDVance4President28 1 points 6 days ago Lol this just reminded me of when large amount of people here actually thought Trump allowed the 2020 election to be stolen in order to \"catch\" the deep state red handed for consequences. Point being, no consequences ever came. So of course the election fraud is still happening. permalink award report block reply\nSnowdone 1 points 6 days ago I am I. New Jersey. Ciatarelli signs are EVERYWHERE. I have seen ONE Sherril sign. No way she won. What they did here was the same as the recall election in CA where I live. They rigged it hard there so if you cried fraud it would sound ridiculous because Newsome “got” 70% of the vote to not get recalled. Over there “Recall Newsome” signs were EVERYWHERE. I LIVE IN A COUMTY WHERE TRUMP LOSES EVERYTIME yet they wanted Nesome out. It was the trial run for the Big Fraud they ran this election. See if it’s big enough it’s hard to say fraud and no you can’t inspect the ballots either. VA and NJ were both neck and neck until Election Day. Then… but democrats get 57+ % of the vote. BULLSHIT! permalink award report block reply\nGrindelwald 1 points 6 days ago And the computer volume was that much higher going into and out of NYC that day.  Hard to get to the polls in two places in one day, you know? permalink award report block reply\nPillarOfWisdom 1 points 6 days ago That's odd.  Who knew there are consequences to not prosecuting election fraud.  If only we had someone in the White House and Congress to do something about it.  Oh well, maybe next election.  As long as we keep sending money to Israel...that's all that matters. permalink award report block reply\nLLegendary 1 points 6 days ago Well....they haven't done anything to stop the voter fraud..... permalink award report block reply\nMorningFrost 1 points 6 days ago We can expect another steal. WHY?  BECAUSE NOTHING HAS BEEN DONE SINCE the 2020 STEAL.!!!!!! permalink award report block reply\nMemoryHoleyeO 1 points 6 days ago Cheating will continue until moral improves permalink award report block reply\nAuroraalpha 1 points 6 days ago Just like 81M ballots! permalink award report block reply\nrejectnullhypothesis 1 points 6 days ago It's hard not to give up as a MAGA voter when the DOJ and FBI do nothing about massive election fraud. permalink award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nNewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nObieonekanobi 1 points 6 days ago Illegals. permalink award report block reply\nBBvarn 1 points 6 days ago If any citizens pay taxes in New Jersey, they are fools. permalink award report block reply\nOdyssey 1 points 6 days ago Put this evidence on top of the pile of \"NO STANDING\" evidence we already have. It will be useful in when ranting about it in Fox News interviews. permalink award report block reply\nCommieCrats 1 points 6 days ago Ammo box permalink award report block reply\nWalleye-vision71 0 points 6 days ago Yeah, because New Jersey electing democrats is shocking news! permalink award report block reply\nshogun5000 0 points 6 days ago 2nd term performance is a fucking joke so far permalink award report block reply\ntarballs 0 points 6 days ago Longterm Democrat control from the highest level to the lowest, has created a kind of cascading effect in the dirty Jerz. It's not just chain immigration snowballing, it's everything. Old people dying or retiring to Florida, young people turning 18, White people being stupid enough to get jabbed for covid and racemix, small business owners selling and fucking off, indian ownership replacing those small businesses with the freebie loans they get. Blacks having several kids each and spreading out from their inner city hives (and going apeshit over the EBT stuff). Weed getting decriminalized, non-stop construction of new apartment buildings everywhere. The cold war being a distant forgotten memory and geopolitical developments vis a vis Ukraine mean that eastern Europeans, Koreans, Cubans, etc don't reliably lean right wing anymore. It's an above average intelligence state full of 105-115 IQ careerists, and those kinds of people arrogantly fancy themselves \"smart\" and wouldn't be caught dead voting Republican like those stupid \"rednecks\" that maintain their roads and deliver their food to the grocery store. Trump turns off those so-called independents, and if he's not on the ballot then Republicans don't turn out. Jerseyans are kind people but there's an undeniable air of feudal hostility- people don't talk to each other outside of their bubbles, young White people get pretty much no exposure to foundational American ideals. The boys all have broccoli hair, wear gold chains, and talk in negro slang. The ones that don't, fall into other subcultures that lean left-wing. I can personally tell you stories about the dirty looks and treatment I've gotten from other Republicans and Christians, for literally no real reason I can keep going. It's bad. It's really bad. I don't really mind Arabs but Mohammedian headgear is something you see pretty much every time you go outside. My high school hosted fireworks for independence day and it was literally 85%+ brown asians. This election was supposed to be Ciattarelli's hail mary moment, his 2024, but now I have no idea how the GOP is supposed to win anything without swinging hard left. permalink award report block reply PiratePatriotParrot OP 1 points 6 days ago You got your pulse on everything. \"The boys all have broccoli hair\" > I watch high school get out everyday and it's YEP, every kid with that shit. + ebike permalink parent award report block reply tarballs 1 points 6 days ago It has been said that I'm mentally all over the place. I take it as a compliment permalink parent award report block reply\nPiratePatriotParrot OP 1 points 6 days ago You got your pulse on everything. \"The boys all have broccoli hair\" > I watch high school get out everyday and it's YEP, every kid with that shit. + ebike permalink parent award report block reply tarballs 1 points 6 days ago It has been said that I'm mentally all over the place. I take it as a compliment permalink parent award report block reply\ntarballs 1 points 6 days ago It has been said that I'm mentally all over the place. I take it as a compliment permalink parent award report block reply\nmass55th 0 points 7 days ago Now where have I seen that before??? Bueller? Bueller??Bueller??? permalink award report block reply\nSchroeder09 -1 points 6 days ago Yeah. The RNC is incompetent and complicit. They should've hired Scott Presley and TPUSA's  get out the vote people years ago. They're not serious. They're just there to launder money and basically live off donations as a form of welfare while they produce zero results. The Dems hire canvassers and activists on indeed. Their strategies work. You all look like retards thinking EVERY election is won through cheating. permalink award report block reply mailinvoter 2 points 6 days ago If the demonrats could win without election fraud, then why do they do it? permalink parent award report block reply\nmailinvoter 2 points 6 days ago If the demonrats could win without election fraud, then why do they do it? permalink parent award report block reply\nEyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nEyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:06:32.416746Z"
}