{
  "id": "1ARK54SV20",
  "url": "https://patriots.win/p/1ARK54SV20/science-fiction-is-crazy-right/c",
  "content": "390 Science Fiction is Crazy... Right? posted 5 days ago by Trick 18 comments award share download report block\n18 comments Sort by Top Top New Worst Old Save Around the Web Seniors Born 1939-1969 Receive 11 Benefits This Month If They Ask Super Saving Online cyberrigger 10 points 5 days ago Cell phones have dimension ratios similar to the Monolith. permalink award report block reply BetterNameUnfound 2 points 5 days ago So they make us smarter? Neat! permalink parent award report block reply kjj9 1 points 5 days ago Probably only the first 3. permalink parent award report block reply mydogma8yourkarma 1 points 5 days ago Flip phones were invented in the 60's by Starfleet.  I guess you could also include Space Force. permalink parent award report block reply Fingerbang 7 points 5 days ago When I was a kid I was promised that in the future I could watch t.v on my Casio calculator watch permalink award report block reply MR__K 4 points 5 days ago Casio made a tv watch. If you where really looking you would know that. Also smart watches do this. permalink parent award report block reply skuts 6 points 5 days ago See Colossus , another predictive sci-fi buried deeper than Pompey. permalink award report block reply mydogma8yourkarma 2 points 5 days ago Thanks, I'll be checking this out despite your misspelling and subsequent apology for Pompeii... 😁  BTW also a great album and video by Pink Floyd, Live from Pompeii. permalink parent award report block reply SPEDMan64 2 points 5 days ago Pompey was a Roman general and statesman. permalink parent award report block reply skuts 2 points 5 days ago Please excuse the hell out of me. I meant Pompeii, although Pompey is buried pretty deep too. permalink parent award report block reply sobriquet 4 points 5 days ago Sci-fi: do not create the torment nexus. Modern science: good news everyone! We've created the torment nexus! permalink award report block reply SubmarineGuy 3 points 5 days ago Not everyone. The survivor shuts the machine down and then goes on a spectacular journey to another star. The Movie is deliberately confusing at this point because Kubrick believed a civilization so advanced would be beyond our comprehension. permalink award report block reply CharlesWilliams 4 points 5 days ago “Open the pod bay doors HAL” permalink parent award report block reply MR__K 3 points 5 days ago I cant do that charles permalink parent award report block reply SPEDMan64 1 points 5 days ago We're planning a trip to Europa. Wonder how that will go. permalink parent award report block reply skuts 1 points 5 days ago Personally, I hope there's somebody there that gets really annoyed that we came a knockin'. permalink parent award report block reply NotYourMan 3 points 5 days ago Are we ready for the three laws of robotics yet?  Positronic brains should fit the bill! permalink award report block reply SBOJ_JOBS 2 points 5 days ago AI: I'm sorry, Dave, but I can't do that. permalink award report block reply TheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\ncyberrigger 10 points 5 days ago Cell phones have dimension ratios similar to the Monolith. permalink award report block reply BetterNameUnfound 2 points 5 days ago So they make us smarter? Neat! permalink parent award report block reply kjj9 1 points 5 days ago Probably only the first 3. permalink parent award report block reply mydogma8yourkarma 1 points 5 days ago Flip phones were invented in the 60's by Starfleet.  I guess you could also include Space Force. permalink parent award report block reply\nBetterNameUnfound 2 points 5 days ago So they make us smarter? Neat! permalink parent award report block reply\nkjj9 1 points 5 days ago Probably only the first 3. permalink parent award report block reply\nmydogma8yourkarma 1 points 5 days ago Flip phones were invented in the 60's by Starfleet.  I guess you could also include Space Force. permalink parent award report block reply\nFingerbang 7 points 5 days ago When I was a kid I was promised that in the future I could watch t.v on my Casio calculator watch permalink award report block reply MR__K 4 points 5 days ago Casio made a tv watch. If you where really looking you would know that. Also smart watches do this. permalink parent award report block reply\nMR__K 4 points 5 days ago Casio made a tv watch. If you where really looking you would know that. Also smart watches do this. permalink parent award report block reply\nskuts 6 points 5 days ago See Colossus , another predictive sci-fi buried deeper than Pompey. permalink award report block reply mydogma8yourkarma 2 points 5 days ago Thanks, I'll be checking this out despite your misspelling and subsequent apology for Pompeii... 😁  BTW also a great album and video by Pink Floyd, Live from Pompeii. permalink parent award report block reply SPEDMan64 2 points 5 days ago Pompey was a Roman general and statesman. permalink parent award report block reply skuts 2 points 5 days ago Please excuse the hell out of me. I meant Pompeii, although Pompey is buried pretty deep too. permalink parent award report block reply\nmydogma8yourkarma 2 points 5 days ago Thanks, I'll be checking this out despite your misspelling and subsequent apology for Pompeii... 😁  BTW also a great album and video by Pink Floyd, Live from Pompeii. permalink parent award report block reply\nSPEDMan64 2 points 5 days ago Pompey was a Roman general and statesman. permalink parent award report block reply skuts 2 points 5 days ago Please excuse the hell out of me. I meant Pompeii, although Pompey is buried pretty deep too. permalink parent award report block reply\nskuts 2 points 5 days ago Please excuse the hell out of me. I meant Pompeii, although Pompey is buried pretty deep too. permalink parent award report block reply\nsobriquet 4 points 5 days ago Sci-fi: do not create the torment nexus. Modern science: good news everyone! We've created the torment nexus! permalink award report block reply\nSubmarineGuy 3 points 5 days ago Not everyone. The survivor shuts the machine down and then goes on a spectacular journey to another star. The Movie is deliberately confusing at this point because Kubrick believed a civilization so advanced would be beyond our comprehension. permalink award report block reply CharlesWilliams 4 points 5 days ago “Open the pod bay doors HAL” permalink parent award report block reply MR__K 3 points 5 days ago I cant do that charles permalink parent award report block reply SPEDMan64 1 points 5 days ago We're planning a trip to Europa. Wonder how that will go. permalink parent award report block reply skuts 1 points 5 days ago Personally, I hope there's somebody there that gets really annoyed that we came a knockin'. permalink parent award report block reply\nCharlesWilliams 4 points 5 days ago “Open the pod bay doors HAL” permalink parent award report block reply MR__K 3 points 5 days ago I cant do that charles permalink parent award report block reply\nMR__K 3 points 5 days ago I cant do that charles permalink parent award report block reply\nSPEDMan64 1 points 5 days ago We're planning a trip to Europa. Wonder how that will go. permalink parent award report block reply skuts 1 points 5 days ago Personally, I hope there's somebody there that gets really annoyed that we came a knockin'. permalink parent award report block reply\nskuts 1 points 5 days ago Personally, I hope there's somebody there that gets really annoyed that we came a knockin'. permalink parent award report block reply\nNotYourMan 3 points 5 days ago Are we ready for the three laws of robotics yet?  Positronic brains should fit the bill! permalink award report block reply\nSBOJ_JOBS 2 points 5 days ago AI: I'm sorry, Dave, but I can't do that. permalink award report block reply\nTheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T22:57:17.293129Z"
}