{
  "id": "8185178",
  "title": "744GM to all you no talent bums out thereposted5 hours agobyA1EM59 commentsawardsharedownloadreportb",
  "url": "https://patriots.win/p/1ARK9nNz6O/gm-to-all-you-no-talent-bums-out/c",
  "content": "889 GM to all you no talent bums out there posted 9 hours ago by A1EM 63 comments award share download report block\n63 comments Sort by Top Top New Worst Old Save GuerillaYourDreams 53 points 9 hours ago We are allowed to be grateful that Trump is our President, and still see clearly when he messed up. PLENTY OF TALENT HERE IN THE US, SIR. ELIMINATE ALL IMMIGRATION FOR TEN YEARS or kiss the USA goodbye forever. permalink award report block reply covok48 8 points 7 hours ago Make it 100 years! permalink parent award report block reply Girthquakes -19 points 9 hours ago If all these takes could be like this, Im sure more people would listen and agree. But 90% of these takes are from troll faggots using sleeper sock accounts to boost upvotes and amplify a message that is antithetical to this forum. It's astroturfed outrage just like every other time trump does a thing and reddit reacts by flooding our forum. permalink parent award report block reply YouEssAye 19 points 8 hours ago You're simply wrong and out of touch if you think this recent sentiment here is anything but hardcore Trump supporters like myself who are angry about being betrayed by Trump repeatedly siding with special interests over his constituents. Edit: You're free to sort my comment history by \"Old\" to decide whether I'm just a \"sleeper sock puppet account\". Also sort my comment history by \"Worst\" to see how many downvotes I took trying to tell you guys that Elon and DeSantis weren't our guys. permalink parent award report block reply Washington_Redskins 12 points 8 hours ago Agreed . Someone has to make sure president Trump understands what his base wants. If not us, than who? We still support Trump, and we've seen him change his mind on things before. permalink parent award report block reply bejeavis 2 points 6 hours ago Same feel free to check me as well permalink parent award report block reply Truthisunpopular 9 points 8 hours ago Yes, everyone that disagrees with you is a bot or a sleeper account. Keep your head in the sand, it'll all just work out fine. permalink parent award report block reply Girthquakes -4 points 8 hours ago The obvious faux-concern riddled accounts with no post history that only pop up to bandwagon posts like these are indeed sleeper accounts. Being intentionally obtuse doesnt change that. permalink parent award report block reply Truthisunpopular 2 points 4 hours ago I am not saying that they do not exist, just that there are major problems in MAGA right now and not everyone is a shill or a bot. permalink parent award report block reply MasterChief08 6 points 8 hours ago I will support Trump against the forces of the left but I'm allowed to criticize him. permalink parent award report block reply TrumpBetrays247 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply GuerillaYourDreams 3 points 9 hours ago That's why Guerilla EagleEye is on the lookout for them all. :) permalink parent award report block reply covok48 3 points 7 hours ago Shut up, Jeet. permalink parent award report block reply Girthquakes 0 points 7 hours ago Super edgy, little chanfag permalink parent award report block reply load 1 more comments... LauraCoomer 21 points 9 hours ago GM fren permalink award report block reply newestofnew 5 points 9 hours ago kek permalink parent award report block reply Lib_Women_Have_HSV 17 points 9 hours ago I'm not joking when I say I've been in that room before. Looks like my neighbor Bills room back in 1989. permalink award report block reply The_Emperor 2 points 8 hours ago I had a basement lab not unlike this.  Had a bunch of old tech...not as many as Pepe here. permalink parent award report block reply BeauHD 2 points 8 hours ago That is exactly what a lab in the 1980s would look like. That stuff was certainly bought at an antique shop. Or the antique shop cleared out when they saw a green frog inquiring about it, so he just took it! permalink parent award report block reply bleeje 15 points 9 hours ago Pepe needs a good strong bowl of curry from his kindly foreign trainer that he can scoop and eat with his hands and then he needs to pack his shit up and gtfo so the trainer can occupy this nice basement  and bring in his entire extended family :) (Oh btw the foreign trainer will then get a great mortgage to buy out the building entirely and then Pepe will be scolded by a friendly Gen Xer to purchase an old shoebox wherefrom he can then WORK HARD and rebuild himself!! Without any of that wasteful \"avacado toast!\" that Pepe hasn't ever even had.) permalink award report block reply Oleander 9 points 9 hours ago Lol why'd you get downvoted? This is reality for many people. Sometimes they have the American train their own Indian replacement. permalink parent award report block reply Girthquakes -9 points 9 hours ago Because it's low-energy faggotry that users used to get banned for permalink parent award report block reply Classygasoline 2 points 7 hours ago Yeah only sycophants allowed on this forum! permalink parent award report block reply covok48 2 points 7 hours ago Go Home, Jeet. permalink parent award report block reply GA_Logic 11 points 9 hours ago STEM degree here and I can tell all you young ones that the job market has been broken since 2008. Do not give up but keep in mind that how the world used to be is hard to go back to. America will be great again but the deep state isn't going to go down without a fight. permalink award report block reply libsRshitheads 3 points 6 hours ago I got my Associate's degree in Computer Programming (that's the name of the program on my diploma) back in 2003. Got hired by a software development company in March 2008 and was laid off in March of 2009. Of course the economy was shit at that time, but the very small company I worked for owned an office in Pakistan. The Pakis would work (and fuck shit up) while us Americans were sleeping, I'm sure for pennies on the dollar. Haven't worked in that industry in close to 15 years now. 2008 was the year I made the most money in my life until about 3-4 years ago. #feelsbadman permalink parent award report block reply Parhelion12 2 points 7 hours ago It starts with respectfully being open to discuss politics at Thanksgiving. permalink parent award report block reply mav7579 2 points 5 hours ago It goes back even further than that in the tech sector, the dot com bust. permalink parent award report block reply Cole_Burns 9 points 9 hours ago I see that you have the beginnings of a sound studio. Beat lab is the next step forward , Fren. 😉 permalink award report block reply JBlaze056 8 points 8 hours ago If only I was a brown H1B foreigner then the American government would work for me as well. permalink award report block reply RudeFrog 8 points 9 hours ago So tired boss permalink award report block reply HumblePepe 7 points 8 hours ago Perhaps it's not talent America lacks, but a lack of stomach for wasting our lives working for soulless corps and greedy companies that seek to replace us, knowing we can't afford the bare minimums our ancestors could afford while foreign invaders for subsidized off our own wealth overtake us. permalink award report block reply MrMcGreenGenes 6 points 8 hours ago He's effectively called us a Basket of Untrainable Deplorables. NOT what I voted for! permalink award report block reply airborne3502 6 points 9 hours ago We pulled women out of kitchens in World War II and trained them to build bombers and fly them to the European theater. President Trump knows we've got the talent. The quick sound bite is bad, really bad, but the point he's making is that we do need to get trained up. Hopefully, he'll revisit this and clear up the bad optics. Americans can build a damn missile, and Raytheon gets billions of dollars from the federal government to do so. Incentivize them to hire at home permalink award report block reply DestroyerofCobwebs 13 points 9 hours ago It's more than optics at this point, and people can take their downvotes and shove it. There is a pattern of behavior from both Trump and his administration.  One flubbed statement could be looked past, everyone makes mistakes.  This is not a mistake; every time Trump and his surrogates address this issue, the message is the same:  American workers aren't good enough.  It's a load of shit, a damned vicious lie, and the people carrying Trump's water on this issue are traitors. permalink parent award report block reply airborne3502 3 points 8 hours ago American workers threw up Trump's buildings. He knows we've got the stuff. Imagine for a minute that your predecessor gave so many of your missiles to Ukraine that you couldn't fight a war for more than 48 hours. The Pentagon is screaming that they need missiles and they need them YESTERDAY. You're in a position where the only people that know how to build them, at the moment, are these H1B's. Maybe they are, maybe they aren't, but that's what he's being told. I'm guessing that's what he's talking about without wanting to tell our enemies we've only got a few rounds of ammunition left in the magazine permalink parent award report block reply DestroyerofCobwebs 5 points 8 hours ago If he's not smart enough, after decades of being a CEO, to sniff out a manufactured crisis put on by his underlings to achieve a goal that makes them personally rich, he needs to hang it up. Nobody is going to attack the United States in the near-mid term future.  There is no crisis worth importing a bunch of cheap labor for. This isn't about time, it's about money, just like it always is. permalink parent award report block reply BruddahIz 13 points 9 hours ago There are a lot of smart 30 and less people out there that wil take the jobs and actually care about what they are doing. - we do NOT need the talent. permalink parent award report block reply mty_green_go 7 points 9 hours ago Raytheon has tons of H1B's.. they actually had to stop hiring so many due to US Citizen requirements for DoD permalink parent award report block reply airborne3502 1 points 9 hours ago Awesome. Move that needle a little more in our favor I'm speculating that the Defense Department is screaming for their missile stores to be restocked because we gave them all to the Ukrainians to shoot at Russia. President Trump has never wavered when it comes to meeting the needs of the military. permalink parent award report block reply Mamapedia 3 points 9 hours ago Make it illegal for them to bring in replacements, with few and necessary exceptions. permalink parent award report block reply MamaLlama2pointOh 2 points 7 hours ago I just heard on Brian Kilmeade talk show an explanation that we need to have foreign workers come to train American workers  and then go back to their countries. They made the point they need good training since we haven’t done certain manufacturing jobs in decades. I think that makes sense, especially after hearing the exchange between Laura Ingraham and POTUS. permalink parent award report block reply load 4 more comments... Meister_Bockmist 6 points 9 hours ago Enjoy your covfefe, fren. GM! permalink award report block reply MakeAmericaGreat9 5 points 9 hours ago Feels bad man. Feels real bad. permalink award report block reply Mamapedia 4 points 9 hours ago Don't forget lazy!! permalink award report block reply neveser 2 points 6 hours ago \"No talent bum\"... the new deplorables? I think so! permalink award report block reply Crappydatum 2 points 6 hours ago Context? Nice museum BTW permalink award report block reply ReleasetheList 3 points 6 hours ago Trump called Americans talentless last night in an interview with fox in an attempt to defend flooding the country with H1B's. permalink parent award report block reply The_Nowhere_Man 1 points 3 hours ago Oh shit. Really? Got the sauce so I can send it to a few folks? If not I'm sure I'll find it later. permalink parent award report block reply ReleasetheList 1 points 3 hours ago https://patriots.win/p/1ARK9nOnup permalink parent award report block reply Hawksendoom 2 points 8 hours ago GM! permalink award report block reply delnaga 2 points 7 hours ago Speak for yourself fren. I’m a very talented bum. 🤣 permalink award report block reply Chickapede 1 points 6 hours ago What if.... his comments are a distraction to start the debate on what is coming, meanwhile diverting attention because grand juries are about to drop a nuclear bomb on some big players?  We don't know everything he knows and I'll just wait to see what Caroline says to clarify things. permalink award report block reply JustAnotherPsyopNPC 1 points 3 hours ago Retard faggot 4 lyfe! permalink award report block reply DangerousAmerican76 0 points 7 hours ago Bruh he’s talking to out of touch old fucks clearly, I don’t feel betrayed, I think he’s stabbing in the dark to fix shit as we wild out, sometimes he just says shit to see how people react.\nHe clearly has even some\nComplaints about not being able to own a home, 50 year mortgage is gay af and debt slavery, I hope someone gets to him and tells him to increase deportation and the cost of housing will go down naturally. permalink award report block reply DangerousAmerican76 1 points 7 hours ago Let’s not fight but collaborate with one another We are all we have frens permalink parent award report block reply KiekhaeferSoldier 0 points 9 hours ago I BET I am not the only one here who believes this is what over half the posters here look like in real life...?   Amirite? permalink award report block reply Patriot4TN 1 points 8 hours ago Green and a frog? I would lean more towards  pasty white and 90lbs. permalink parent award report block reply UH60MAGA -1 points 7 hours ago sad rivetting sheet metal noises permalink award report block reply Parhelion12 3 points 7 hours ago This actually made me sad. Everything is echoes in the past. permalink parent award report block reply\nGuerillaYourDreams 53 points 9 hours ago We are allowed to be grateful that Trump is our President, and still see clearly when he messed up. PLENTY OF TALENT HERE IN THE US, SIR. ELIMINATE ALL IMMIGRATION FOR TEN YEARS or kiss the USA goodbye forever. permalink award report block reply covok48 8 points 7 hours ago Make it 100 years! permalink parent award report block reply Girthquakes -19 points 9 hours ago If all these takes could be like this, Im sure more people would listen and agree. But 90% of these takes are from troll faggots using sleeper sock accounts to boost upvotes and amplify a message that is antithetical to this forum. It's astroturfed outrage just like every other time trump does a thing and reddit reacts by flooding our forum. permalink parent award report block reply YouEssAye 19 points 8 hours ago You're simply wrong and out of touch if you think this recent sentiment here is anything but hardcore Trump supporters like myself who are angry about being betrayed by Trump repeatedly siding with special interests over his constituents. Edit: You're free to sort my comment history by \"Old\" to decide whether I'm just a \"sleeper sock puppet account\". Also sort my comment history by \"Worst\" to see how many downvotes I took trying to tell you guys that Elon and DeSantis weren't our guys. permalink parent award report block reply Washington_Redskins 12 points 8 hours ago Agreed . Someone has to make sure president Trump understands what his base wants. If not us, than who? We still support Trump, and we've seen him change his mind on things before. permalink parent award report block reply bejeavis 2 points 6 hours ago Same feel free to check me as well permalink parent award report block reply Truthisunpopular 9 points 8 hours ago Yes, everyone that disagrees with you is a bot or a sleeper account. Keep your head in the sand, it'll all just work out fine. permalink parent award report block reply Girthquakes -4 points 8 hours ago The obvious faux-concern riddled accounts with no post history that only pop up to bandwagon posts like these are indeed sleeper accounts. Being intentionally obtuse doesnt change that. permalink parent award report block reply Truthisunpopular 2 points 4 hours ago I am not saying that they do not exist, just that there are major problems in MAGA right now and not everyone is a shill or a bot. permalink parent award report block reply MasterChief08 6 points 8 hours ago I will support Trump against the forces of the left but I'm allowed to criticize him. permalink parent award report block reply TrumpBetrays247 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply GuerillaYourDreams 3 points 9 hours ago That's why Guerilla EagleEye is on the lookout for them all. :) permalink parent award report block reply covok48 3 points 7 hours ago Shut up, Jeet. permalink parent award report block reply Girthquakes 0 points 7 hours ago Super edgy, little chanfag permalink parent award report block reply load 1 more comments...\ncovok48 8 points 7 hours ago Make it 100 years! permalink parent award report block reply\nGirthquakes -19 points 9 hours ago If all these takes could be like this, Im sure more people would listen and agree. But 90% of these takes are from troll faggots using sleeper sock accounts to boost upvotes and amplify a message that is antithetical to this forum. It's astroturfed outrage just like every other time trump does a thing and reddit reacts by flooding our forum. permalink parent award report block reply YouEssAye 19 points 8 hours ago You're simply wrong and out of touch if you think this recent sentiment here is anything but hardcore Trump supporters like myself who are angry about being betrayed by Trump repeatedly siding with special interests over his constituents. Edit: You're free to sort my comment history by \"Old\" to decide whether I'm just a \"sleeper sock puppet account\". Also sort my comment history by \"Worst\" to see how many downvotes I took trying to tell you guys that Elon and DeSantis weren't our guys. permalink parent award report block reply Washington_Redskins 12 points 8 hours ago Agreed . Someone has to make sure president Trump understands what his base wants. If not us, than who? We still support Trump, and we've seen him change his mind on things before. permalink parent award report block reply bejeavis 2 points 6 hours ago Same feel free to check me as well permalink parent award report block reply Truthisunpopular 9 points 8 hours ago Yes, everyone that disagrees with you is a bot or a sleeper account. Keep your head in the sand, it'll all just work out fine. permalink parent award report block reply Girthquakes -4 points 8 hours ago The obvious faux-concern riddled accounts with no post history that only pop up to bandwagon posts like these are indeed sleeper accounts. Being intentionally obtuse doesnt change that. permalink parent award report block reply Truthisunpopular 2 points 4 hours ago I am not saying that they do not exist, just that there are major problems in MAGA right now and not everyone is a shill or a bot. permalink parent award report block reply MasterChief08 6 points 8 hours ago I will support Trump against the forces of the left but I'm allowed to criticize him. permalink parent award report block reply TrumpBetrays247 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply GuerillaYourDreams 3 points 9 hours ago That's why Guerilla EagleEye is on the lookout for them all. :) permalink parent award report block reply covok48 3 points 7 hours ago Shut up, Jeet. permalink parent award report block reply Girthquakes 0 points 7 hours ago Super edgy, little chanfag permalink parent award report block reply load 1 more comments...\nYouEssAye 19 points 8 hours ago You're simply wrong and out of touch if you think this recent sentiment here is anything but hardcore Trump supporters like myself who are angry about being betrayed by Trump repeatedly siding with special interests over his constituents. Edit: You're free to sort my comment history by \"Old\" to decide whether I'm just a \"sleeper sock puppet account\". Also sort my comment history by \"Worst\" to see how many downvotes I took trying to tell you guys that Elon and DeSantis weren't our guys. permalink parent award report block reply Washington_Redskins 12 points 8 hours ago Agreed . Someone has to make sure president Trump understands what his base wants. If not us, than who? We still support Trump, and we've seen him change his mind on things before. permalink parent award report block reply bejeavis 2 points 6 hours ago Same feel free to check me as well permalink parent award report block reply\nWashington_Redskins 12 points 8 hours ago Agreed . Someone has to make sure president Trump understands what his base wants. If not us, than who? We still support Trump, and we've seen him change his mind on things before. permalink parent award report block reply\nbejeavis 2 points 6 hours ago Same feel free to check me as well permalink parent award report block reply\nTruthisunpopular 9 points 8 hours ago Yes, everyone that disagrees with you is a bot or a sleeper account. Keep your head in the sand, it'll all just work out fine. permalink parent award report block reply Girthquakes -4 points 8 hours ago The obvious faux-concern riddled accounts with no post history that only pop up to bandwagon posts like these are indeed sleeper accounts. Being intentionally obtuse doesnt change that. permalink parent award report block reply Truthisunpopular 2 points 4 hours ago I am not saying that they do not exist, just that there are major problems in MAGA right now and not everyone is a shill or a bot. permalink parent award report block reply\nGirthquakes -4 points 8 hours ago The obvious faux-concern riddled accounts with no post history that only pop up to bandwagon posts like these are indeed sleeper accounts. Being intentionally obtuse doesnt change that. permalink parent award report block reply Truthisunpopular 2 points 4 hours ago I am not saying that they do not exist, just that there are major problems in MAGA right now and not everyone is a shill or a bot. permalink parent award report block reply\nTruthisunpopular 2 points 4 hours ago I am not saying that they do not exist, just that there are major problems in MAGA right now and not everyone is a shill or a bot. permalink parent award report block reply\nMasterChief08 6 points 8 hours ago I will support Trump against the forces of the left but I'm allowed to criticize him. permalink parent award report block reply TrumpBetrays247 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nTrumpBetrays247 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nGuerillaYourDreams 3 points 9 hours ago That's why Guerilla EagleEye is on the lookout for them all. :) permalink parent award report block reply\ncovok48 3 points 7 hours ago Shut up, Jeet. permalink parent award report block reply Girthquakes 0 points 7 hours ago Super edgy, little chanfag permalink parent award report block reply\nGirthquakes 0 points 7 hours ago Super edgy, little chanfag permalink parent award report block reply\nLauraCoomer 21 points 9 hours ago GM fren permalink award report block reply newestofnew 5 points 9 hours ago kek permalink parent award report block reply\nnewestofnew 5 points 9 hours ago kek permalink parent award report block reply\nLib_Women_Have_HSV 17 points 9 hours ago I'm not joking when I say I've been in that room before. Looks like my neighbor Bills room back in 1989. permalink award report block reply The_Emperor 2 points 8 hours ago I had a basement lab not unlike this.  Had a bunch of old tech...not as many as Pepe here. permalink parent award report block reply BeauHD 2 points 8 hours ago That is exactly what a lab in the 1980s would look like. That stuff was certainly bought at an antique shop. Or the antique shop cleared out when they saw a green frog inquiring about it, so he just took it! permalink parent award report block reply\nThe_Emperor 2 points 8 hours ago I had a basement lab not unlike this.  Had a bunch of old tech...not as many as Pepe here. permalink parent award report block reply\nBeauHD 2 points 8 hours ago That is exactly what a lab in the 1980s would look like. That stuff was certainly bought at an antique shop. Or the antique shop cleared out when they saw a green frog inquiring about it, so he just took it! permalink parent award report block reply\nbleeje 15 points 9 hours ago Pepe needs a good strong bowl of curry from his kindly foreign trainer that he can scoop and eat with his hands and then he needs to pack his shit up and gtfo so the trainer can occupy this nice basement  and bring in his entire extended family :) (Oh btw the foreign trainer will then get a great mortgage to buy out the building entirely and then Pepe will be scolded by a friendly Gen Xer to purchase an old shoebox wherefrom he can then WORK HARD and rebuild himself!! Without any of that wasteful \"avacado toast!\" that Pepe hasn't ever even had.) permalink award report block reply Oleander 9 points 9 hours ago Lol why'd you get downvoted? This is reality for many people. Sometimes they have the American train their own Indian replacement. permalink parent award report block reply Girthquakes -9 points 9 hours ago Because it's low-energy faggotry that users used to get banned for permalink parent award report block reply Classygasoline 2 points 7 hours ago Yeah only sycophants allowed on this forum! permalink parent award report block reply covok48 2 points 7 hours ago Go Home, Jeet. permalink parent award report block reply\nOleander 9 points 9 hours ago Lol why'd you get downvoted? This is reality for many people. Sometimes they have the American train their own Indian replacement. permalink parent award report block reply Girthquakes -9 points 9 hours ago Because it's low-energy faggotry that users used to get banned for permalink parent award report block reply Classygasoline 2 points 7 hours ago Yeah only sycophants allowed on this forum! permalink parent award report block reply covok48 2 points 7 hours ago Go Home, Jeet. permalink parent award report block reply\nGirthquakes -9 points 9 hours ago Because it's low-energy faggotry that users used to get banned for permalink parent award report block reply Classygasoline 2 points 7 hours ago Yeah only sycophants allowed on this forum! permalink parent award report block reply covok48 2 points 7 hours ago Go Home, Jeet. permalink parent award report block reply\nClassygasoline 2 points 7 hours ago Yeah only sycophants allowed on this forum! permalink parent award report block reply\ncovok48 2 points 7 hours ago Go Home, Jeet. permalink parent award report block reply\nGA_Logic 11 points 9 hours ago STEM degree here and I can tell all you young ones that the job market has been broken since 2008. Do not give up but keep in mind that how the world used to be is hard to go back to. America will be great again but the deep state isn't going to go down without a fight. permalink award report block reply libsRshitheads 3 points 6 hours ago I got my Associate's degree in Computer Programming (that's the name of the program on my diploma) back in 2003. Got hired by a software development company in March 2008 and was laid off in March of 2009. Of course the economy was shit at that time, but the very small company I worked for owned an office in Pakistan. The Pakis would work (and fuck shit up) while us Americans were sleeping, I'm sure for pennies on the dollar. Haven't worked in that industry in close to 15 years now. 2008 was the year I made the most money in my life until about 3-4 years ago. #feelsbadman permalink parent award report block reply Parhelion12 2 points 7 hours ago It starts with respectfully being open to discuss politics at Thanksgiving. permalink parent award report block reply mav7579 2 points 5 hours ago It goes back even further than that in the tech sector, the dot com bust. permalink parent award report block reply\nlibsRshitheads 3 points 6 hours ago I got my Associate's degree in Computer Programming (that's the name of the program on my diploma) back in 2003. Got hired by a software development company in March 2008 and was laid off in March of 2009. Of course the economy was shit at that time, but the very small company I worked for owned an office in Pakistan. The Pakis would work (and fuck shit up) while us Americans were sleeping, I'm sure for pennies on the dollar. Haven't worked in that industry in close to 15 years now. 2008 was the year I made the most money in my life until about 3-4 years ago. #feelsbadman permalink parent award report block reply\nParhelion12 2 points 7 hours ago It starts with respectfully being open to discuss politics at Thanksgiving. permalink parent award report block reply\nmav7579 2 points 5 hours ago It goes back even further than that in the tech sector, the dot com bust. permalink parent award report block reply\nCole_Burns 9 points 9 hours ago I see that you have the beginnings of a sound studio. Beat lab is the next step forward , Fren. 😉 permalink award report block reply\nJBlaze056 8 points 8 hours ago If only I was a brown H1B foreigner then the American government would work for me as well. permalink award report block reply\nRudeFrog 8 points 9 hours ago So tired boss permalink award report block reply\nHumblePepe 7 points 8 hours ago Perhaps it's not talent America lacks, but a lack of stomach for wasting our lives working for soulless corps and greedy companies that seek to replace us, knowing we can't afford the bare minimums our ancestors could afford while foreign invaders for subsidized off our own wealth overtake us. permalink award report block reply\nMrMcGreenGenes 6 points 8 hours ago He's effectively called us a Basket of Untrainable Deplorables. NOT what I voted for! permalink award report block reply\nairborne3502 6 points 9 hours ago We pulled women out of kitchens in World War II and trained them to build bombers and fly them to the European theater. President Trump knows we've got the talent. The quick sound bite is bad, really bad, but the point he's making is that we do need to get trained up. Hopefully, he'll revisit this and clear up the bad optics. Americans can build a damn missile, and Raytheon gets billions of dollars from the federal government to do so. Incentivize them to hire at home permalink award report block reply DestroyerofCobwebs 13 points 9 hours ago It's more than optics at this point, and people can take their downvotes and shove it. There is a pattern of behavior from both Trump and his administration.  One flubbed statement could be looked past, everyone makes mistakes.  This is not a mistake; every time Trump and his surrogates address this issue, the message is the same:  American workers aren't good enough.  It's a load of shit, a damned vicious lie, and the people carrying Trump's water on this issue are traitors. permalink parent award report block reply airborne3502 3 points 8 hours ago American workers threw up Trump's buildings. He knows we've got the stuff. Imagine for a minute that your predecessor gave so many of your missiles to Ukraine that you couldn't fight a war for more than 48 hours. The Pentagon is screaming that they need missiles and they need them YESTERDAY. You're in a position where the only people that know how to build them, at the moment, are these H1B's. Maybe they are, maybe they aren't, but that's what he's being told. I'm guessing that's what he's talking about without wanting to tell our enemies we've only got a few rounds of ammunition left in the magazine permalink parent award report block reply DestroyerofCobwebs 5 points 8 hours ago If he's not smart enough, after decades of being a CEO, to sniff out a manufactured crisis put on by his underlings to achieve a goal that makes them personally rich, he needs to hang it up. Nobody is going to attack the United States in the near-mid term future.  There is no crisis worth importing a bunch of cheap labor for. This isn't about time, it's about money, just like it always is. permalink parent award report block reply BruddahIz 13 points 9 hours ago There are a lot of smart 30 and less people out there that wil take the jobs and actually care about what they are doing. - we do NOT need the talent. permalink parent award report block reply mty_green_go 7 points 9 hours ago Raytheon has tons of H1B's.. they actually had to stop hiring so many due to US Citizen requirements for DoD permalink parent award report block reply airborne3502 1 points 9 hours ago Awesome. Move that needle a little more in our favor I'm speculating that the Defense Department is screaming for their missile stores to be restocked because we gave them all to the Ukrainians to shoot at Russia. President Trump has never wavered when it comes to meeting the needs of the military. permalink parent award report block reply Mamapedia 3 points 9 hours ago Make it illegal for them to bring in replacements, with few and necessary exceptions. permalink parent award report block reply MamaLlama2pointOh 2 points 7 hours ago I just heard on Brian Kilmeade talk show an explanation that we need to have foreign workers come to train American workers  and then go back to their countries. They made the point they need good training since we haven’t done certain manufacturing jobs in decades. I think that makes sense, especially after hearing the exchange between Laura Ingraham and POTUS. permalink parent award report block reply load 4 more comments...\nDestroyerofCobwebs 13 points 9 hours ago It's more than optics at this point, and people can take their downvotes and shove it. There is a pattern of behavior from both Trump and his administration.  One flubbed statement could be looked past, everyone makes mistakes.  This is not a mistake; every time Trump and his surrogates address this issue, the message is the same:  American workers aren't good enough.  It's a load of shit, a damned vicious lie, and the people carrying Trump's water on this issue are traitors. permalink parent award report block reply airborne3502 3 points 8 hours ago American workers threw up Trump's buildings. He knows we've got the stuff. Imagine for a minute that your predecessor gave so many of your missiles to Ukraine that you couldn't fight a war for more than 48 hours. The Pentagon is screaming that they need missiles and they need them YESTERDAY. You're in a position where the only people that know how to build them, at the moment, are these H1B's. Maybe they are, maybe they aren't, but that's what he's being told. I'm guessing that's what he's talking about without wanting to tell our enemies we've only got a few rounds of ammunition left in the magazine permalink parent award report block reply DestroyerofCobwebs 5 points 8 hours ago If he's not smart enough, after decades of being a CEO, to sniff out a manufactured crisis put on by his underlings to achieve a goal that makes them personally rich, he needs to hang it up. Nobody is going to attack the United States in the near-mid term future.  There is no crisis worth importing a bunch of cheap labor for. This isn't about time, it's about money, just like it always is. permalink parent award report block reply\nairborne3502 3 points 8 hours ago American workers threw up Trump's buildings. He knows we've got the stuff. Imagine for a minute that your predecessor gave so many of your missiles to Ukraine that you couldn't fight a war for more than 48 hours. The Pentagon is screaming that they need missiles and they need them YESTERDAY. You're in a position where the only people that know how to build them, at the moment, are these H1B's. Maybe they are, maybe they aren't, but that's what he's being told. I'm guessing that's what he's talking about without wanting to tell our enemies we've only got a few rounds of ammunition left in the magazine permalink parent award report block reply DestroyerofCobwebs 5 points 8 hours ago If he's not smart enough, after decades of being a CEO, to sniff out a manufactured crisis put on by his underlings to achieve a goal that makes them personally rich, he needs to hang it up. Nobody is going to attack the United States in the near-mid term future.  There is no crisis worth importing a bunch of cheap labor for. This isn't about time, it's about money, just like it always is. permalink parent award report block reply\nDestroyerofCobwebs 5 points 8 hours ago If he's not smart enough, after decades of being a CEO, to sniff out a manufactured crisis put on by his underlings to achieve a goal that makes them personally rich, he needs to hang it up. Nobody is going to attack the United States in the near-mid term future.  There is no crisis worth importing a bunch of cheap labor for. This isn't about time, it's about money, just like it always is. permalink parent award report block reply\nBruddahIz 13 points 9 hours ago There are a lot of smart 30 and less people out there that wil take the jobs and actually care about what they are doing. - we do NOT need the talent. permalink parent award report block reply\nmty_green_go 7 points 9 hours ago Raytheon has tons of H1B's.. they actually had to stop hiring so many due to US Citizen requirements for DoD permalink parent award report block reply airborne3502 1 points 9 hours ago Awesome. Move that needle a little more in our favor I'm speculating that the Defense Department is screaming for their missile stores to be restocked because we gave them all to the Ukrainians to shoot at Russia. President Trump has never wavered when it comes to meeting the needs of the military. permalink parent award report block reply\nairborne3502 1 points 9 hours ago Awesome. Move that needle a little more in our favor I'm speculating that the Defense Department is screaming for their missile stores to be restocked because we gave them all to the Ukrainians to shoot at Russia. President Trump has never wavered when it comes to meeting the needs of the military. permalink parent award report block reply\nMamapedia 3 points 9 hours ago Make it illegal for them to bring in replacements, with few and necessary exceptions. permalink parent award report block reply\nMamaLlama2pointOh 2 points 7 hours ago I just heard on Brian Kilmeade talk show an explanation that we need to have foreign workers come to train American workers  and then go back to their countries. They made the point they need good training since we haven’t done certain manufacturing jobs in decades. I think that makes sense, especially after hearing the exchange between Laura Ingraham and POTUS. permalink parent award report block reply\nMeister_Bockmist 6 points 9 hours ago Enjoy your covfefe, fren. GM! permalink award report block reply\nMakeAmericaGreat9 5 points 9 hours ago Feels bad man. Feels real bad. permalink award report block reply\nMamapedia 4 points 9 hours ago Don't forget lazy!! permalink award report block reply\nneveser 2 points 6 hours ago \"No talent bum\"... the new deplorables? I think so! permalink award report block reply\nCrappydatum 2 points 6 hours ago Context? Nice museum BTW permalink award report block reply ReleasetheList 3 points 6 hours ago Trump called Americans talentless last night in an interview with fox in an attempt to defend flooding the country with H1B's. permalink parent award report block reply The_Nowhere_Man 1 points 3 hours ago Oh shit. Really? Got the sauce so I can send it to a few folks? If not I'm sure I'll find it later. permalink parent award report block reply ReleasetheList 1 points 3 hours ago https://patriots.win/p/1ARK9nOnup permalink parent award report block reply\nReleasetheList 3 points 6 hours ago Trump called Americans talentless last night in an interview with fox in an attempt to defend flooding the country with H1B's. permalink parent award report block reply The_Nowhere_Man 1 points 3 hours ago Oh shit. Really? Got the sauce so I can send it to a few folks? If not I'm sure I'll find it later. permalink parent award report block reply ReleasetheList 1 points 3 hours ago https://patriots.win/p/1ARK9nOnup permalink parent award report block reply\nThe_Nowhere_Man 1 points 3 hours ago Oh shit. Really? Got the sauce so I can send it to a few folks? If not I'm sure I'll find it later. permalink parent award report block reply ReleasetheList 1 points 3 hours ago https://patriots.win/p/1ARK9nOnup permalink parent award report block reply\nReleasetheList 1 points 3 hours ago https://patriots.win/p/1ARK9nOnup permalink parent award report block reply\nHawksendoom 2 points 8 hours ago GM! permalink award report block reply\ndelnaga 2 points 7 hours ago Speak for yourself fren. I’m a very talented bum. 🤣 permalink award report block reply\nChickapede 1 points 6 hours ago What if.... his comments are a distraction to start the debate on what is coming, meanwhile diverting attention because grand juries are about to drop a nuclear bomb on some big players?  We don't know everything he knows and I'll just wait to see what Caroline says to clarify things. permalink award report block reply\nJustAnotherPsyopNPC 1 points 3 hours ago Retard faggot 4 lyfe! permalink award report block reply\nDangerousAmerican76 0 points 7 hours ago Bruh he’s talking to out of touch old fucks clearly, I don’t feel betrayed, I think he’s stabbing in the dark to fix shit as we wild out, sometimes he just says shit to see how people react.\nComplaints about not being able to own a home, 50 year mortgage is gay af and debt slavery, I hope someone gets to him and tells him to increase deportation and the cost of housing will go down naturally. permalink award report block reply DangerousAmerican76 1 points 7 hours ago Let’s not fight but collaborate with one another We are all we have frens permalink parent award report block reply\nDangerousAmerican76 1 points 7 hours ago Let’s not fight but collaborate with one another We are all we have frens permalink parent award report block reply\nKiekhaeferSoldier 0 points 9 hours ago I BET I am not the only one here who believes this is what over half the posters here look like in real life...?   Amirite? permalink award report block reply Patriot4TN 1 points 8 hours ago Green and a frog? I would lean more towards  pasty white and 90lbs. permalink parent award report block reply\nPatriot4TN 1 points 8 hours ago Green and a frog? I would lean more towards  pasty white and 90lbs. permalink parent award report block reply\nUH60MAGA -1 points 7 hours ago sad rivetting sheet metal noises permalink award report block reply Parhelion12 3 points 7 hours ago This actually made me sad. Everything is echoes in the past. permalink parent award report block reply\nParhelion12 3 points 7 hours ago This actually made me sad. Everything is echoes in the past. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:38:59.883392Z"
}