{
  "id": "1ARK9l6v4s",
  "url": "https://patriots.win/p/1ARK9l6v4s/is-treason-still-a-thing-because/c",
  "content": "1020 Is Treason still a thing? Because if it is, we should have seen a LOT of arrests! posted 1 day ago by CatalystForChange 90 comments award share report block General Mike Flynn @GenFlynn • 1d . @POTUS @realDonaldTrump speaking for myself only, I would be fine if you arrested @BarackObama for TREASON. If what @DNIGabbard says is accurate, you have as your constitutional duty the authority to arrest him. Make America Great Again! Happy Veteran’s Day 🙏🏼🇺🇸 Jim Ferguson @JimFergusonUK • 3d 🚨 TULSI GABBARD: “OBAMA ORDERED THE OVERTHROW OF THE U.S. GOVERNMENT” 🚨 🔥 Only 38 seconds — and it changes everything. Former DNI Tulsi Gabbard just said it out loud: “Barack Hussein Obama ordered the overthrow of the United States government — on behalf of Hillary Clinton\n90 comments Sort by Top Top New Worst Old Save NotYourMan 67 points 1 day ago So much evidence, so few arrests! permalink award report block reply Steve56775 36 points 1 day ago And Bondi is STILL the AG. permalink parent award report block reply MAG_n_KAG 14 points 20 hours ago That's because she's doing a great job! 👍👍 permalink parent award report block reply EgregiousPhilbin 7 points 20 hours ago Sessions is advising her behind the scenes permalink parent award report block reply The_Return_of_User_x 7 points 23 hours ago \"Barry is on the Epstein list...\" Let's see if this speeds up the release of the Epstein list or slows down the prosecution of Obama. permalink parent award report block reply SupFrens 6 points 20 hours ago Trump is looking weak for not firing her. permalink parent award report block reply BigMikesChef 4 points 19 hours ago Extremely. She's wasted so much time. permalink parent award report block reply Awakened 4 points 19 hours ago She works for Trump and is doing what he wants. He keeps saying how pleased he is with her. It really isn't her fault. It's Trumps and we all gotta come to grips with that. permalink parent award report block reply makersmarx 1 points 19 hours ago Then why is he always begging her to do stuff? She may answer to someone else. 3 bad AGs in a row while Garland went after MAGA hard permalink parent award report block reply Awakened 5 points 18 hours ago Trump's the one who's saying she's doing great, not me. permalink parent award report block reply LoneWolf_86 8 points 1 day ago Zero, to be exact. permalink parent award report block reply PROCIsAsshoe -1 points 19 hours ago Comey and Bolton already were arrested. So, no, you're wrong. And Clapper and Brennan coming soon. Be less of a demoralizer mmk? permalink parent award report block reply chickeninoven 2 points 16 hours ago Neither Comey or Bolton was arrested. Charged yes, arrested no. permalink parent award report block reply justinkayz 0 points 12 hours ago Indictments are not arrests permalink parent award report block reply nolefthandshakes 6 points 20 hours ago you’re still worried about arrests? here’s 50 year mortgages, slaves. lmao permalink parent award report block reply berserkerbarrage 1 points 19 hours ago I'm still waiting for somebody to explain how making it easier to obtain 5 and 15 year mortgages as well as adding 50 year mortgages, i.e. providing people with more options, makes them slaves. permalink parent award report block reply nolefthandshakes 0 points 19 hours ago because it’s continuing the shitshow and home prices will continue to skyrocket so people have options to pay thousands more in interest! so many of this nation’s problems could be fixed simply by being serious about removing the insidious parasites that are illegals. but please, tell me how this is so good for the country. permalink parent award report block reply berserkerbarrage 0 points 19 hours ago You say that as if Trump hasn't already secured the borders and isn't deporting people as fast as legally possible. You probably believe the lie that Obama and Biden deported more people. Or maybe you don't believe it but you say it anyway because ultimately, the goal is to make Trump look bad. permalink parent award report block reply snoopy3210 1 points 23 hours ago That’s not even true. What they did is they EXAGGERATED the Russian influence after losing the election\nAND they sent CIA / MI6 agents (Carter Page, Chris Steele, Halper) to falsely LINK the Trump campaign to Russia. Carter Page went to Russia in July 2016\nas a member of Trump campaign when Steele was spreading lies about the Trump-Russia COLLUSION to the FBI. The CIA MI6 wanted the FBI to be triggered and to announce an investigation into the Trump campaign to make voters think there was something shady about Trump. Tulsi is helping the CIA turning it into simple Russian interference, but thats not the coup. The coup is the MI6 and CIA fabricated Russia COLLUSION. permalink parent award report block reply Daffy 0 points 20 hours ago Yeah, but two more weeks. permalink parent award report block reply load 2 more comments... MemphisMontoya71 29 points 1 day ago More Mike Flynn yelling at the clouds for things that will never happen.  Thats all our side does now, stompy foot tweeting and hopium chasing, and calling others doomers for seeing reality, that 1 year of this administration has not delivered on its campaign promises to MAGA, but spent its time delivering for other countries.  Fucking sick of the gaslighting. permalink award report block reply DickTick PRO 15 points 1 day ago Please tell me exactly what you expect a regular citizen to do that has no more power or rights than you do as a fellow citizen.... He works for the government in zero capacity.... permalink parent award report block reply MAGA-Fett -6 points 22 hours ago I still believe Flynn is a grifter.  He was on Obama guy and totally walked into the Russia hoax. He also had alternate electors in summer of 2024 just “in case” something happened to Trump. Don’t trust him at all. permalink parent award report block reply JBlaze056 -7 points 1 day ago It is especially irritating coming from Flynn who was offered any position he wanted in the administration, and who instead declined the offer so he could grift online. permalink parent award report block reply DickTick PRO 6 points 1 day ago I imagine it's probably got more to do with the fact that he doesn't want to risk putting his family through all of the same shit all over again only for their to be no potential pardon at the end of it next time because Trump will be gone by then..... permalink parent award report block reply Elencher 7 points 1 day ago Or because Flynn realizes this administration won't do shit and is compromised. permalink parent award report block reply USDMaga 1 points 19 hours ago Grift onlilne and get rich OR Work for govt, watch nothing be done and be jailed/prosecuted for doing nothing. permalink parent award report block reply MemphisMontoya71 0 points 1 day ago good point permalink parent award report block reply mikethemarine 15 points 24 hours ago Former DNI Tulsi Gabbard just said it out loud: WHY DOES I SAY FORMER? She stilling doing that job permalink award report block reply NoSteppyonmyPepe 6 points 23 hours ago This is my question! Is she no longer in the position? permalink parent award report block reply mikethemarine 6 points 23 hours ago yep, she still has the job and doing a good job of it, she's going nowhere permalink parent award report block reply EvJohn 5 points 19 hours ago Yep.  I WTFF-ed at that, too. permalink parent award report block reply monkadelic 1 points 19 hours ago I thought maybe she hadn't been confirmed so she was acting Director, and her time was up.  But looks like it was a typo, she's been confirmed. permalink parent award report block reply RejectoftheRepublic 12 points 1 day ago Maybe Mike Flynn should run for President in 28 since this Admin is too cowardly to do it themselves permalink award report block reply CatalystForChange OP 7 points 1 day ago https://patriots.win/p/1ARK5BGb6P/general-mike-flynn-says-if-mike-/c permalink parent award report block reply Build_Back_Bankrupt 5 points 20 hours ago That wouldn't make him the first General to become POTUS, the first POTUS was a General. permalink parent award report block reply BigMikesChef 2 points 19 hours ago Eisenhower. permalink parent award report block reply TexasDusty 1 points 16 hours ago I am suspicious because the Qtards like him so much. Anything they touch I don’t trust. permalink parent award report block reply Magma_Biscuit 10 points 1 day ago Trump is being blocked by activist judges on everything he is trying to do, that’s the problem. It’s like the dems are trying to make him go full on dictator at this point permalink award report block reply Steve56775 8 points 1 day ago He needs to. Force the Supreme Court to do their job and reign in these rogue judges. permalink parent award report block reply trumpORbust 4 points 23 hours ago They need to nuke the fillabuster, MAGA policies into law, then put the fillabuster back. I suspect the fillabuster was the biggest thing motivating the Dems to conceed permalink parent award report block reply monkadelic 1 points 19 hours ago it was the ONLY thing.  They had no other real pressure to open the government besides Trump securing elections.  Can't have that, it would be the death of their party.  Don't let the theater fool you, Chucky personally approved the dems who were allowed to cross the isle. permalink parent award report block reply MemphisMontoya71 5 points 1 day ago Judges don't stop Democrats from doing what they want. permalink parent award report block reply berserkerbarrage 1 points 19 hours ago Did you have a point or...? permalink parent award report block reply spezisacuckold 9 points 1 day ago 10 years crickets permalink award report block reply PepePinochet 8 points 23 hours ago Former DNI... Wtf? Tulsi is still DNI https://www.dni.gov/index.php/who-we-are/leadership/director-of-national-intelligence permalink award report block reply captflerbus 6 points 20 hours ago Former? permalink award report block reply Trooph-Hurts 4 points 1 day ago Treason is not an official act permalink award report block reply birddogz 4 points 1 day ago The best Blondie can do is another Fox interview permalink award report block reply friarfox 4 points 1 day ago It takes someone having your back to enforce. You trust the GOP? permalink award report block reply Magma_Biscuit 6 points 1 day ago I would rather step on a rattlesnake than trust the GOP. permalink parent award report block reply MElfers4473 4 points 22 hours ago “Former DNI” ????? permalink award report block reply jimboonie 3 points 1 day ago That’s an easy answer: No. Treason is not still a thing. That’s abundantly clear. permalink award report block reply Antemalagon 2 points 20 hours ago Alot of executions permalink award report block reply JesusTheOnlyWay 2 points 19 hours ago The fallout with Elon was a bad sign. Then of course, Epstein. But if you can't put all your chips in with what Elon was trying to do, I don't want you involved in government. Doge was exactly what was needed to neuter the government and save Western society permalink award report block reply Emperorvoid 2 points 20 hours ago DO IT! ARREST BARRY. TRY HIM FOR TREASON. PUBLICLY EXECUTE TRAITORS! permalink award report block reply TexasDusty 1 points 16 hours ago Have any realistic ideas? permalink parent award report block reply SimaYi 2 points 20 hours ago It's not a thing. \"Treason\" can only happen when you have a country, not an economic zone. permalink award report block reply POTUS_DonnieJ 2 points 19 hours ago The fact that General Flynn is not an official part of the administration is a shame. permalink award report block reply Patriot4TN 2 points 20 hours ago It's only treason when a conservative is involved. You know, people like you and me. Republicans have never had the balls to use the rule of law. permalink award report block reply Choppermagic 2 points 23 hours ago for god's sake, arrest people! they will all turn on each other if you actually do something permalink award report block reply bananafone 2 points 1 day ago Yawn permalink award report block reply MAGALADON9 2 points 19 hours ago Article III of the U.S. Constitution defines treason as levying war against the United States or adhering and providing aid or comfort to its enemies. So before you start shouting treason understand you really mean sedition. Where is the War in the literal sense not in some poetic sense, in the meaning the framers intended?  There isn't. Who is the enemies and in a constitutional law sense this means foreign nations. Not people who aren't real Americans or people that like blue hair. Be exact with your words permalink award report block reply starjello 2 points 17 hours ago I don't blame General Flynn for speaking out. Trump absolutely threw him under the bus taking the side of that snake Pence. I'll never forgive the Q retards for saying General Flynn was part of the Q team when it was Pence as the point man for the operation for the CIA permalink award report block reply TexasDusty 1 points 16 hours ago That’s an interesting theory. Can you share more about it? That would explain a few things. permalink parent award report block reply starjello 1 points 16 hours ago Go back and look at the Space Force press conference Pence had with Chris Miller the Acting Secretary of Defense in December of 2020. Also certain things I am not prepared to bring up at this time.  I wish I could but it is treading on dangerous territory. permalink parent award report block reply Justjayce 2 points 19 hours ago Fire Bondi now permalink award report block reply DCYR66 2 points 1 day ago Don’t worry the DOJ will look into it.😂 permalink award report block reply RudeFrog 2 points 7 hours ago For some reason (Epstein files) nothing is being done! I wonder what it could be(Epstein)? (It's the Epstein files) What could possibly stop someone from seeking justice for this? They try to kill you multiple times, have you arrested charged with made up crimes, steal your whole first presidency! What could possibly stop someone in the relentless pursuit of justice for that? (It's the Epstein files) permalink award report block reply CatalystForChange OP 1 points 3 hours ago Republicans believe that the files have been tampered and most of the evidence were erased during Biden administration permalink parent award report block reply patrioticwinning3 2 points 19 hours ago Apparently not...Bondi is doing a \"great job\" remember?  Who is slipping Trump retard juice!? permalink award report block reply TexasDusty 1 points 16 hours ago Nothing will be done. Nothing. permalink award report block reply 1LoathsomeDove 1 points 9 hours ago Ya know ...\nIn my frontier subdivision, it took 5 LOA (landowners association) Directors over a year to bring a rogue secretary/treasurer to heel.\nThe Articles of Incorporation dictated that the LOA was a \"road maintenance\" association.  Nothing more. For over a decade, voting for Officers was in violation of the Community Documents and state statute. It took a year before we retrieved our LOA's records from being (illegally) stored in another state.  The day after they were returned, the Sheriff arrived to ask us about our 'theft' of those records. I called the rogue director 'a flea' and said the board was tired of scratching the itch and going forward I would squish any fleas instead of entertaining their circus.  Sheriff arrived to discuss my 'death threat'. It took a year for us to stop payments for maintenance and repairs for a 'community well' when our truth in lending disclosure clearly stated, 'Community Well: N/A\" & 'Owners must dig their own well' and to return to an unedited 'plat map'.\n(edited in violation of statute). Bondi et.al. face a rogue BoD ... infinity. Slow and steady.  Do you want it fast or do you want it right? Interestingly, the Director that originally objected to payment for a community well (starting the year-long battle) ... went rogue himself. Be careful what you wish for ..... permalink award report block reply MAGA-Fett 1 points 22 hours ago Meh, SCOTUS pretty much ruled ex-Prez can’t be held accountable for actions they take in office.  Nothing will be done. permalink award report block reply SNOWBREAKS 1 points 19 hours ago wake me up when anything happens ever permalink award report block reply TheJakeFroggy 1 points 1 day ago Does Flynn not have Trump's ear and the ability to directly contact him himself in any way? Does he not at least have associates who have Trump's ear? It makes me curious that he feels the need to constantly tag Trump on X. In fact, it makes me concerned, is it even possible to contact the Trump administration? Tagging Trump and others in his administration on X doesn't apppear to get their attention. How are we as his base supposed to inform him about the things that need to be done? permalink award report block reply TrumpSaysNoMAGA4u 1 points 23 hours ago Comment removed upon the user being banned. permalink parent award report block reply barwhack 1 points 24 hours ago Gay retarded faggotry is a thing. permalink award report block reply Bldg_2019 1 points 19 hours ago “Former DNI” Tulsi Gabbard? 🤔 permalink award report block reply michealr24 1 points 23 hours ago Then fucking do something permalink award report block reply CatalystForChange OP 1 points 19 hours ago I think the expectation is for DOJ to do something. Everybody else would just say things. Unfortunately for us, DOJ is happy with appearing on Fox and looking pretty. permalink parent award report block reply Bratts99 1 points 19 hours ago TREASON! permalink award report block reply hazelknut 1 points 15 hours ago I'll say it, he doesn't have the balls. and before you say 'Bondi', remember, she works for him. permalink award report block reply Mhmm2MoreWeeks 0 points 18 hours ago Yes, but Trump and his administration appear to want to become Accomplices after the fact. permalink award report block reply JoeMcCarthyWasRight 0 points 1 day ago I’m so fucking tired of hearing from this guy. No doubt in my mind that if given the opportunity to work at a position of power under Trump he’d shit the bed the same way as Kash and Bongino. Faggot birds of a feather. permalink award report block reply Nick-Kerr -1 points 1 day ago former DNI Go fuck yourself. permalink award report block reply Be_The_Change 0 points 1 day ago Comment removed by community moderators. permalink award report block reply\nNotYourMan 67 points 1 day ago So much evidence, so few arrests! permalink award report block reply Steve56775 36 points 1 day ago And Bondi is STILL the AG. permalink parent award report block reply MAG_n_KAG 14 points 20 hours ago That's because she's doing a great job! 👍👍 permalink parent award report block reply EgregiousPhilbin 7 points 20 hours ago Sessions is advising her behind the scenes permalink parent award report block reply The_Return_of_User_x 7 points 23 hours ago \"Barry is on the Epstein list...\" Let's see if this speeds up the release of the Epstein list or slows down the prosecution of Obama. permalink parent award report block reply SupFrens 6 points 20 hours ago Trump is looking weak for not firing her. permalink parent award report block reply BigMikesChef 4 points 19 hours ago Extremely. She's wasted so much time. permalink parent award report block reply Awakened 4 points 19 hours ago She works for Trump and is doing what he wants. He keeps saying how pleased he is with her. It really isn't her fault. It's Trumps and we all gotta come to grips with that. permalink parent award report block reply makersmarx 1 points 19 hours ago Then why is he always begging her to do stuff? She may answer to someone else. 3 bad AGs in a row while Garland went after MAGA hard permalink parent award report block reply Awakened 5 points 18 hours ago Trump's the one who's saying she's doing great, not me. permalink parent award report block reply LoneWolf_86 8 points 1 day ago Zero, to be exact. permalink parent award report block reply PROCIsAsshoe -1 points 19 hours ago Comey and Bolton already were arrested. So, no, you're wrong. And Clapper and Brennan coming soon. Be less of a demoralizer mmk? permalink parent award report block reply chickeninoven 2 points 16 hours ago Neither Comey or Bolton was arrested. Charged yes, arrested no. permalink parent award report block reply justinkayz 0 points 12 hours ago Indictments are not arrests permalink parent award report block reply nolefthandshakes 6 points 20 hours ago you’re still worried about arrests? here’s 50 year mortgages, slaves. lmao permalink parent award report block reply berserkerbarrage 1 points 19 hours ago I'm still waiting for somebody to explain how making it easier to obtain 5 and 15 year mortgages as well as adding 50 year mortgages, i.e. providing people with more options, makes them slaves. permalink parent award report block reply nolefthandshakes 0 points 19 hours ago because it’s continuing the shitshow and home prices will continue to skyrocket so people have options to pay thousands more in interest! so many of this nation’s problems could be fixed simply by being serious about removing the insidious parasites that are illegals. but please, tell me how this is so good for the country. permalink parent award report block reply berserkerbarrage 0 points 19 hours ago You say that as if Trump hasn't already secured the borders and isn't deporting people as fast as legally possible. You probably believe the lie that Obama and Biden deported more people. Or maybe you don't believe it but you say it anyway because ultimately, the goal is to make Trump look bad. permalink parent award report block reply snoopy3210 1 points 23 hours ago That’s not even true. What they did is they EXAGGERATED the Russian influence after losing the election\nAND they sent CIA / MI6 agents (Carter Page, Chris Steele, Halper) to falsely LINK the Trump campaign to Russia. Carter Page went to Russia in July 2016\nas a member of Trump campaign when Steele was spreading lies about the Trump-Russia COLLUSION to the FBI. The CIA MI6 wanted the FBI to be triggered and to announce an investigation into the Trump campaign to make voters think there was something shady about Trump. Tulsi is helping the CIA turning it into simple Russian interference, but thats not the coup. The coup is the MI6 and CIA fabricated Russia COLLUSION. permalink parent award report block reply Daffy 0 points 20 hours ago Yeah, but two more weeks. permalink parent award report block reply load 2 more comments...\nSteve56775 36 points 1 day ago And Bondi is STILL the AG. permalink parent award report block reply MAG_n_KAG 14 points 20 hours ago That's because she's doing a great job! 👍👍 permalink parent award report block reply EgregiousPhilbin 7 points 20 hours ago Sessions is advising her behind the scenes permalink parent award report block reply The_Return_of_User_x 7 points 23 hours ago \"Barry is on the Epstein list...\" Let's see if this speeds up the release of the Epstein list or slows down the prosecution of Obama. permalink parent award report block reply SupFrens 6 points 20 hours ago Trump is looking weak for not firing her. permalink parent award report block reply BigMikesChef 4 points 19 hours ago Extremely. She's wasted so much time. permalink parent award report block reply Awakened 4 points 19 hours ago She works for Trump and is doing what he wants. He keeps saying how pleased he is with her. It really isn't her fault. It's Trumps and we all gotta come to grips with that. permalink parent award report block reply makersmarx 1 points 19 hours ago Then why is he always begging her to do stuff? She may answer to someone else. 3 bad AGs in a row while Garland went after MAGA hard permalink parent award report block reply Awakened 5 points 18 hours ago Trump's the one who's saying she's doing great, not me. permalink parent award report block reply\nMAG_n_KAG 14 points 20 hours ago That's because she's doing a great job! 👍👍 permalink parent award report block reply EgregiousPhilbin 7 points 20 hours ago Sessions is advising her behind the scenes permalink parent award report block reply\nEgregiousPhilbin 7 points 20 hours ago Sessions is advising her behind the scenes permalink parent award report block reply\nThe_Return_of_User_x 7 points 23 hours ago \"Barry is on the Epstein list...\" Let's see if this speeds up the release of the Epstein list or slows down the prosecution of Obama. permalink parent award report block reply\nSupFrens 6 points 20 hours ago Trump is looking weak for not firing her. permalink parent award report block reply BigMikesChef 4 points 19 hours ago Extremely. She's wasted so much time. permalink parent award report block reply\nBigMikesChef 4 points 19 hours ago Extremely. She's wasted so much time. permalink parent award report block reply\nAwakened 4 points 19 hours ago She works for Trump and is doing what he wants. He keeps saying how pleased he is with her. It really isn't her fault. It's Trumps and we all gotta come to grips with that. permalink parent award report block reply makersmarx 1 points 19 hours ago Then why is he always begging her to do stuff? She may answer to someone else. 3 bad AGs in a row while Garland went after MAGA hard permalink parent award report block reply Awakened 5 points 18 hours ago Trump's the one who's saying she's doing great, not me. permalink parent award report block reply\nmakersmarx 1 points 19 hours ago Then why is he always begging her to do stuff? She may answer to someone else. 3 bad AGs in a row while Garland went after MAGA hard permalink parent award report block reply Awakened 5 points 18 hours ago Trump's the one who's saying she's doing great, not me. permalink parent award report block reply\nAwakened 5 points 18 hours ago Trump's the one who's saying she's doing great, not me. permalink parent award report block reply\nLoneWolf_86 8 points 1 day ago Zero, to be exact. permalink parent award report block reply PROCIsAsshoe -1 points 19 hours ago Comey and Bolton already were arrested. So, no, you're wrong. And Clapper and Brennan coming soon. Be less of a demoralizer mmk? permalink parent award report block reply chickeninoven 2 points 16 hours ago Neither Comey or Bolton was arrested. Charged yes, arrested no. permalink parent award report block reply justinkayz 0 points 12 hours ago Indictments are not arrests permalink parent award report block reply\nPROCIsAsshoe -1 points 19 hours ago Comey and Bolton already were arrested. So, no, you're wrong. And Clapper and Brennan coming soon. Be less of a demoralizer mmk? permalink parent award report block reply chickeninoven 2 points 16 hours ago Neither Comey or Bolton was arrested. Charged yes, arrested no. permalink parent award report block reply justinkayz 0 points 12 hours ago Indictments are not arrests permalink parent award report block reply\nchickeninoven 2 points 16 hours ago Neither Comey or Bolton was arrested. Charged yes, arrested no. permalink parent award report block reply\njustinkayz 0 points 12 hours ago Indictments are not arrests permalink parent award report block reply\nnolefthandshakes 6 points 20 hours ago you’re still worried about arrests? here’s 50 year mortgages, slaves. lmao permalink parent award report block reply berserkerbarrage 1 points 19 hours ago I'm still waiting for somebody to explain how making it easier to obtain 5 and 15 year mortgages as well as adding 50 year mortgages, i.e. providing people with more options, makes them slaves. permalink parent award report block reply nolefthandshakes 0 points 19 hours ago because it’s continuing the shitshow and home prices will continue to skyrocket so people have options to pay thousands more in interest! so many of this nation’s problems could be fixed simply by being serious about removing the insidious parasites that are illegals. but please, tell me how this is so good for the country. permalink parent award report block reply berserkerbarrage 0 points 19 hours ago You say that as if Trump hasn't already secured the borders and isn't deporting people as fast as legally possible. You probably believe the lie that Obama and Biden deported more people. Or maybe you don't believe it but you say it anyway because ultimately, the goal is to make Trump look bad. permalink parent award report block reply\nberserkerbarrage 1 points 19 hours ago I'm still waiting for somebody to explain how making it easier to obtain 5 and 15 year mortgages as well as adding 50 year mortgages, i.e. providing people with more options, makes them slaves. permalink parent award report block reply nolefthandshakes 0 points 19 hours ago because it’s continuing the shitshow and home prices will continue to skyrocket so people have options to pay thousands more in interest! so many of this nation’s problems could be fixed simply by being serious about removing the insidious parasites that are illegals. but please, tell me how this is so good for the country. permalink parent award report block reply berserkerbarrage 0 points 19 hours ago You say that as if Trump hasn't already secured the borders and isn't deporting people as fast as legally possible. You probably believe the lie that Obama and Biden deported more people. Or maybe you don't believe it but you say it anyway because ultimately, the goal is to make Trump look bad. permalink parent award report block reply\nnolefthandshakes 0 points 19 hours ago because it’s continuing the shitshow and home prices will continue to skyrocket so people have options to pay thousands more in interest! so many of this nation’s problems could be fixed simply by being serious about removing the insidious parasites that are illegals. but please, tell me how this is so good for the country. permalink parent award report block reply berserkerbarrage 0 points 19 hours ago You say that as if Trump hasn't already secured the borders and isn't deporting people as fast as legally possible. You probably believe the lie that Obama and Biden deported more people. Or maybe you don't believe it but you say it anyway because ultimately, the goal is to make Trump look bad. permalink parent award report block reply\nberserkerbarrage 0 points 19 hours ago You say that as if Trump hasn't already secured the borders and isn't deporting people as fast as legally possible. You probably believe the lie that Obama and Biden deported more people. Or maybe you don't believe it but you say it anyway because ultimately, the goal is to make Trump look bad. permalink parent award report block reply\nsnoopy3210 1 points 23 hours ago That’s not even true. What they did is they EXAGGERATED the Russian influence after losing the election\nAND they sent CIA / MI6 agents (Carter Page, Chris Steele, Halper) to falsely LINK the Trump campaign to Russia. Carter Page went to Russia in July 2016\nas a member of Trump campaign when Steele was spreading lies about the Trump-Russia COLLUSION to the FBI. The CIA MI6 wanted the FBI to be triggered and to announce an investigation into the Trump campaign to make voters think there was something shady about Trump. Tulsi is helping the CIA turning it into simple Russian interference, but thats not the coup. The coup is the MI6 and CIA fabricated Russia COLLUSION. permalink parent award report block reply\nDaffy 0 points 20 hours ago Yeah, but two more weeks. permalink parent award report block reply\nMemphisMontoya71 29 points 1 day ago More Mike Flynn yelling at the clouds for things that will never happen.  Thats all our side does now, stompy foot tweeting and hopium chasing, and calling others doomers for seeing reality, that 1 year of this administration has not delivered on its campaign promises to MAGA, but spent its time delivering for other countries.  Fucking sick of the gaslighting. permalink award report block reply DickTick PRO 15 points 1 day ago Please tell me exactly what you expect a regular citizen to do that has no more power or rights than you do as a fellow citizen.... He works for the government in zero capacity.... permalink parent award report block reply MAGA-Fett -6 points 22 hours ago I still believe Flynn is a grifter.  He was on Obama guy and totally walked into the Russia hoax. He also had alternate electors in summer of 2024 just “in case” something happened to Trump. Don’t trust him at all. permalink parent award report block reply JBlaze056 -7 points 1 day ago It is especially irritating coming from Flynn who was offered any position he wanted in the administration, and who instead declined the offer so he could grift online. permalink parent award report block reply DickTick PRO 6 points 1 day ago I imagine it's probably got more to do with the fact that he doesn't want to risk putting his family through all of the same shit all over again only for their to be no potential pardon at the end of it next time because Trump will be gone by then..... permalink parent award report block reply Elencher 7 points 1 day ago Or because Flynn realizes this administration won't do shit and is compromised. permalink parent award report block reply USDMaga 1 points 19 hours ago Grift onlilne and get rich OR Work for govt, watch nothing be done and be jailed/prosecuted for doing nothing. permalink parent award report block reply MemphisMontoya71 0 points 1 day ago good point permalink parent award report block reply\nDickTick PRO 15 points 1 day ago Please tell me exactly what you expect a regular citizen to do that has no more power or rights than you do as a fellow citizen.... He works for the government in zero capacity.... permalink parent award report block reply\nMAGA-Fett -6 points 22 hours ago I still believe Flynn is a grifter.  He was on Obama guy and totally walked into the Russia hoax. He also had alternate electors in summer of 2024 just “in case” something happened to Trump. Don’t trust him at all. permalink parent award report block reply\nJBlaze056 -7 points 1 day ago It is especially irritating coming from Flynn who was offered any position he wanted in the administration, and who instead declined the offer so he could grift online. permalink parent award report block reply DickTick PRO 6 points 1 day ago I imagine it's probably got more to do with the fact that he doesn't want to risk putting his family through all of the same shit all over again only for their to be no potential pardon at the end of it next time because Trump will be gone by then..... permalink parent award report block reply Elencher 7 points 1 day ago Or because Flynn realizes this administration won't do shit and is compromised. permalink parent award report block reply USDMaga 1 points 19 hours ago Grift onlilne and get rich OR Work for govt, watch nothing be done and be jailed/prosecuted for doing nothing. permalink parent award report block reply MemphisMontoya71 0 points 1 day ago good point permalink parent award report block reply\nDickTick PRO 6 points 1 day ago I imagine it's probably got more to do with the fact that he doesn't want to risk putting his family through all of the same shit all over again only for their to be no potential pardon at the end of it next time because Trump will be gone by then..... permalink parent award report block reply Elencher 7 points 1 day ago Or because Flynn realizes this administration won't do shit and is compromised. permalink parent award report block reply\nElencher 7 points 1 day ago Or because Flynn realizes this administration won't do shit and is compromised. permalink parent award report block reply\nUSDMaga 1 points 19 hours ago Grift onlilne and get rich OR Work for govt, watch nothing be done and be jailed/prosecuted for doing nothing. permalink parent award report block reply\nMemphisMontoya71 0 points 1 day ago good point permalink parent award report block reply\nmikethemarine 15 points 24 hours ago Former DNI Tulsi Gabbard just said it out loud: WHY DOES I SAY FORMER? She stilling doing that job permalink award report block reply NoSteppyonmyPepe 6 points 23 hours ago This is my question! Is she no longer in the position? permalink parent award report block reply mikethemarine 6 points 23 hours ago yep, she still has the job and doing a good job of it, she's going nowhere permalink parent award report block reply EvJohn 5 points 19 hours ago Yep.  I WTFF-ed at that, too. permalink parent award report block reply monkadelic 1 points 19 hours ago I thought maybe she hadn't been confirmed so she was acting Director, and her time was up.  But looks like it was a typo, she's been confirmed. permalink parent award report block reply\nNoSteppyonmyPepe 6 points 23 hours ago This is my question! Is she no longer in the position? permalink parent award report block reply mikethemarine 6 points 23 hours ago yep, she still has the job and doing a good job of it, she's going nowhere permalink parent award report block reply\nmikethemarine 6 points 23 hours ago yep, she still has the job and doing a good job of it, she's going nowhere permalink parent award report block reply\nEvJohn 5 points 19 hours ago Yep.  I WTFF-ed at that, too. permalink parent award report block reply\nmonkadelic 1 points 19 hours ago I thought maybe she hadn't been confirmed so she was acting Director, and her time was up.  But looks like it was a typo, she's been confirmed. permalink parent award report block reply\nRejectoftheRepublic 12 points 1 day ago Maybe Mike Flynn should run for President in 28 since this Admin is too cowardly to do it themselves permalink award report block reply CatalystForChange OP 7 points 1 day ago https://patriots.win/p/1ARK5BGb6P/general-mike-flynn-says-if-mike-/c permalink parent award report block reply Build_Back_Bankrupt 5 points 20 hours ago That wouldn't make him the first General to become POTUS, the first POTUS was a General. permalink parent award report block reply BigMikesChef 2 points 19 hours ago Eisenhower. permalink parent award report block reply TexasDusty 1 points 16 hours ago I am suspicious because the Qtards like him so much. Anything they touch I don’t trust. permalink parent award report block reply\nCatalystForChange OP 7 points 1 day ago https://patriots.win/p/1ARK5BGb6P/general-mike-flynn-says-if-mike-/c permalink parent award report block reply\nBuild_Back_Bankrupt 5 points 20 hours ago That wouldn't make him the first General to become POTUS, the first POTUS was a General. permalink parent award report block reply BigMikesChef 2 points 19 hours ago Eisenhower. permalink parent award report block reply\nBigMikesChef 2 points 19 hours ago Eisenhower. permalink parent award report block reply\nTexasDusty 1 points 16 hours ago I am suspicious because the Qtards like him so much. Anything they touch I don’t trust. permalink parent award report block reply\nMagma_Biscuit 10 points 1 day ago Trump is being blocked by activist judges on everything he is trying to do, that’s the problem. It’s like the dems are trying to make him go full on dictator at this point permalink award report block reply Steve56775 8 points 1 day ago He needs to. Force the Supreme Court to do their job and reign in these rogue judges. permalink parent award report block reply trumpORbust 4 points 23 hours ago They need to nuke the fillabuster, MAGA policies into law, then put the fillabuster back. I suspect the fillabuster was the biggest thing motivating the Dems to conceed permalink parent award report block reply monkadelic 1 points 19 hours ago it was the ONLY thing.  They had no other real pressure to open the government besides Trump securing elections.  Can't have that, it would be the death of their party.  Don't let the theater fool you, Chucky personally approved the dems who were allowed to cross the isle. permalink parent award report block reply MemphisMontoya71 5 points 1 day ago Judges don't stop Democrats from doing what they want. permalink parent award report block reply berserkerbarrage 1 points 19 hours ago Did you have a point or...? permalink parent award report block reply\nSteve56775 8 points 1 day ago He needs to. Force the Supreme Court to do their job and reign in these rogue judges. permalink parent award report block reply trumpORbust 4 points 23 hours ago They need to nuke the fillabuster, MAGA policies into law, then put the fillabuster back. I suspect the fillabuster was the biggest thing motivating the Dems to conceed permalink parent award report block reply monkadelic 1 points 19 hours ago it was the ONLY thing.  They had no other real pressure to open the government besides Trump securing elections.  Can't have that, it would be the death of their party.  Don't let the theater fool you, Chucky personally approved the dems who were allowed to cross the isle. permalink parent award report block reply\ntrumpORbust 4 points 23 hours ago They need to nuke the fillabuster, MAGA policies into law, then put the fillabuster back. I suspect the fillabuster was the biggest thing motivating the Dems to conceed permalink parent award report block reply monkadelic 1 points 19 hours ago it was the ONLY thing.  They had no other real pressure to open the government besides Trump securing elections.  Can't have that, it would be the death of their party.  Don't let the theater fool you, Chucky personally approved the dems who were allowed to cross the isle. permalink parent award report block reply\nmonkadelic 1 points 19 hours ago it was the ONLY thing.  They had no other real pressure to open the government besides Trump securing elections.  Can't have that, it would be the death of their party.  Don't let the theater fool you, Chucky personally approved the dems who were allowed to cross the isle. permalink parent award report block reply\nMemphisMontoya71 5 points 1 day ago Judges don't stop Democrats from doing what they want. permalink parent award report block reply berserkerbarrage 1 points 19 hours ago Did you have a point or...? permalink parent award report block reply\nberserkerbarrage 1 points 19 hours ago Did you have a point or...? permalink parent award report block reply\nspezisacuckold 9 points 1 day ago 10 years crickets permalink award report block reply\nPepePinochet 8 points 23 hours ago Former DNI... Wtf? Tulsi is still DNI https://www.dni.gov/index.php/who-we-are/leadership/director-of-national-intelligence permalink award report block reply\ncaptflerbus 6 points 20 hours ago Former? permalink award report block reply\nTrooph-Hurts 4 points 1 day ago Treason is not an official act permalink award report block reply\nbirddogz 4 points 1 day ago The best Blondie can do is another Fox interview permalink award report block reply\nfriarfox 4 points 1 day ago It takes someone having your back to enforce. You trust the GOP? permalink award report block reply Magma_Biscuit 6 points 1 day ago I would rather step on a rattlesnake than trust the GOP. permalink parent award report block reply\nMagma_Biscuit 6 points 1 day ago I would rather step on a rattlesnake than trust the GOP. permalink parent award report block reply\nMElfers4473 4 points 22 hours ago “Former DNI” ????? permalink award report block reply\njimboonie 3 points 1 day ago That’s an easy answer: No. Treason is not still a thing. That’s abundantly clear. permalink award report block reply\nAntemalagon 2 points 20 hours ago Alot of executions permalink award report block reply\nJesusTheOnlyWay 2 points 19 hours ago The fallout with Elon was a bad sign. Then of course, Epstein. But if you can't put all your chips in with what Elon was trying to do, I don't want you involved in government. Doge was exactly what was needed to neuter the government and save Western society permalink award report block reply\nEmperorvoid 2 points 20 hours ago DO IT! ARREST BARRY. TRY HIM FOR TREASON. PUBLICLY EXECUTE TRAITORS! permalink award report block reply TexasDusty 1 points 16 hours ago Have any realistic ideas? permalink parent award report block reply\nTexasDusty 1 points 16 hours ago Have any realistic ideas? permalink parent award report block reply\nSimaYi 2 points 20 hours ago It's not a thing. \"Treason\" can only happen when you have a country, not an economic zone. permalink award report block reply\nPOTUS_DonnieJ 2 points 19 hours ago The fact that General Flynn is not an official part of the administration is a shame. permalink award report block reply\nPatriot4TN 2 points 20 hours ago It's only treason when a conservative is involved. You know, people like you and me. Republicans have never had the balls to use the rule of law. permalink award report block reply\nChoppermagic 2 points 23 hours ago for god's sake, arrest people! they will all turn on each other if you actually do something permalink award report block reply\nbananafone 2 points 1 day ago Yawn permalink award report block reply\nMAGALADON9 2 points 19 hours ago Article III of the U.S. Constitution defines treason as levying war against the United States or adhering and providing aid or comfort to its enemies. So before you start shouting treason understand you really mean sedition. Where is the War in the literal sense not in some poetic sense, in the meaning the framers intended?  There isn't. Who is the enemies and in a constitutional law sense this means foreign nations. Not people who aren't real Americans or people that like blue hair. Be exact with your words permalink award report block reply\nstarjello 2 points 17 hours ago I don't blame General Flynn for speaking out. Trump absolutely threw him under the bus taking the side of that snake Pence. I'll never forgive the Q retards for saying General Flynn was part of the Q team when it was Pence as the point man for the operation for the CIA permalink award report block reply TexasDusty 1 points 16 hours ago That’s an interesting theory. Can you share more about it? That would explain a few things. permalink parent award report block reply starjello 1 points 16 hours ago Go back and look at the Space Force press conference Pence had with Chris Miller the Acting Secretary of Defense in December of 2020. Also certain things I am not prepared to bring up at this time.  I wish I could but it is treading on dangerous territory. permalink parent award report block reply\nTexasDusty 1 points 16 hours ago That’s an interesting theory. Can you share more about it? That would explain a few things. permalink parent award report block reply starjello 1 points 16 hours ago Go back and look at the Space Force press conference Pence had with Chris Miller the Acting Secretary of Defense in December of 2020. Also certain things I am not prepared to bring up at this time.  I wish I could but it is treading on dangerous territory. permalink parent award report block reply\nstarjello 1 points 16 hours ago Go back and look at the Space Force press conference Pence had with Chris Miller the Acting Secretary of Defense in December of 2020. Also certain things I am not prepared to bring up at this time.  I wish I could but it is treading on dangerous territory. permalink parent award report block reply\nJustjayce 2 points 19 hours ago Fire Bondi now permalink award report block reply\nDCYR66 2 points 1 day ago Don’t worry the DOJ will look into it.😂 permalink award report block reply\nRudeFrog 2 points 7 hours ago For some reason (Epstein files) nothing is being done! I wonder what it could be(Epstein)? (It's the Epstein files) What could possibly stop someone from seeking justice for this? They try to kill you multiple times, have you arrested charged with made up crimes, steal your whole first presidency! What could possibly stop someone in the relentless pursuit of justice for that? (It's the Epstein files) permalink award report block reply CatalystForChange OP 1 points 3 hours ago Republicans believe that the files have been tampered and most of the evidence were erased during Biden administration permalink parent award report block reply\nCatalystForChange OP 1 points 3 hours ago Republicans believe that the files have been tampered and most of the evidence were erased during Biden administration permalink parent award report block reply\npatrioticwinning3 2 points 19 hours ago Apparently not...Bondi is doing a \"great job\" remember?  Who is slipping Trump retard juice!? permalink award report block reply\nTexasDusty 1 points 16 hours ago Nothing will be done. Nothing. permalink award report block reply\n1LoathsomeDove 1 points 9 hours ago Ya know ...\nIn my frontier subdivision, it took 5 LOA (landowners association) Directors over a year to bring a rogue secretary/treasurer to heel.\nThe Articles of Incorporation dictated that the LOA was a \"road maintenance\" association.  Nothing more. For over a decade, voting for Officers was in violation of the Community Documents and state statute. It took a year before we retrieved our LOA's records from being (illegally) stored in another state.  The day after they were returned, the Sheriff arrived to ask us about our 'theft' of those records. I called the rogue director 'a flea' and said the board was tired of scratching the itch and going forward I would squish any fleas instead of entertaining their circus.  Sheriff arrived to discuss my 'death threat'. It took a year for us to stop payments for maintenance and repairs for a 'community well' when our truth in lending disclosure clearly stated, 'Community Well: N/A\" & 'Owners must dig their own well' and to return to an unedited 'plat map'.\n(edited in violation of statute). Bondi et.al. face a rogue BoD ... infinity. Slow and steady.  Do you want it fast or do you want it right? Interestingly, the Director that originally objected to payment for a community well (starting the year-long battle) ... went rogue himself. Be careful what you wish for ..... permalink award report block reply\nMAGA-Fett 1 points 22 hours ago Meh, SCOTUS pretty much ruled ex-Prez can’t be held accountable for actions they take in office.  Nothing will be done. permalink award report block reply\nSNOWBREAKS 1 points 19 hours ago wake me up when anything happens ever permalink award report block reply\nTheJakeFroggy 1 points 1 day ago Does Flynn not have Trump's ear and the ability to directly contact him himself in any way? Does he not at least have associates who have Trump's ear? It makes me curious that he feels the need to constantly tag Trump on X. In fact, it makes me concerned, is it even possible to contact the Trump administration? Tagging Trump and others in his administration on X doesn't apppear to get their attention. How are we as his base supposed to inform him about the things that need to be done? permalink award report block reply TrumpSaysNoMAGA4u 1 points 23 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nTrumpSaysNoMAGA4u 1 points 23 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nbarwhack 1 points 24 hours ago Gay retarded faggotry is a thing. permalink award report block reply\nBldg_2019 1 points 19 hours ago “Former DNI” Tulsi Gabbard? 🤔 permalink award report block reply\nmichealr24 1 points 23 hours ago Then fucking do something permalink award report block reply CatalystForChange OP 1 points 19 hours ago I think the expectation is for DOJ to do something. Everybody else would just say things. Unfortunately for us, DOJ is happy with appearing on Fox and looking pretty. permalink parent award report block reply\nCatalystForChange OP 1 points 19 hours ago I think the expectation is for DOJ to do something. Everybody else would just say things. Unfortunately for us, DOJ is happy with appearing on Fox and looking pretty. permalink parent award report block reply\nBratts99 1 points 19 hours ago TREASON! permalink award report block reply\nhazelknut 1 points 15 hours ago I'll say it, he doesn't have the balls. and before you say 'Bondi', remember, she works for him. permalink award report block reply\nMhmm2MoreWeeks 0 points 18 hours ago Yes, but Trump and his administration appear to want to become Accomplices after the fact. permalink award report block reply\nJoeMcCarthyWasRight 0 points 1 day ago I’m so fucking tired of hearing from this guy. No doubt in my mind that if given the opportunity to work at a position of power under Trump he’d shit the bed the same way as Kash and Bongino. Faggot birds of a feather. permalink award report block reply\nNick-Kerr -1 points 1 day ago former DNI Go fuck yourself. permalink award report block reply\nBe_The_Change 0 points 1 day ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:46:18.170439Z"
}