{
  "id": "8184966",
  "title": "80Bad Faith MIGGASposted7 hours agobynewestofnew10 commentsawardsharereportblock",
  "url": "https://patriots.win/p/1ARK9mHmuE/bad-faith-miggas/c",
  "content": "80 Bad Faith MIGGAS posted 7 hours ago by newestofnew 10 comments award share report block Just recently a zionist publicist said at an event that the current low approval for zionism in democrats is confusing because the tribe are natural allies of liberals. That every liberal cause in this country has been championed by the tribe: feminism, labor movement, new deal and great society programs. Which should make us wonder if their ethnicity and traditions make them naturally align with the left, why are they trying so hard to gatekeep and control who is allowed on the right? Controlled Opposition. Why is it that when the right gets power they get nothing done that aligns with our goals and our principals? Controlled Opposition. The tribe is naturally aligned with the left so their goal is to make the Republican Party, and the right, as distasteful and ineffective as possible. They want democrats and the left to win. This all became glaringly obvious recently. When disagreement formed they didn't respectfully disagree with their friends and compatriots, no they went on an over the top barrage of crude insults and complete disrespectful displays of their true nature: they don't share any principals with the right and that has been made clear in disagreement. Their goal was to commandeer the right with donations and prominent media personalities, to wear the right like a skin suit to push voters back to democrats because the left and it's causes is where their loyalty naturally falls. Look at trumps recent answers to populist questions, his current set of advisors and cabinet members, and it would become clear that the intention is to force errors and a loss in 28. Why would they launch a civil war over a trivial media personality on the eve of an election? Their goal was to force a loss in this election. We cannot reconcile with this group after these betrayals because they have proved that they were never part of our group to begin with, not even in trumps big tent. They are liberals at heart and hate us. That is also why this Trump forum, an AIPAC limited hangout founded by a Tel Aviv Ted Cruz supporter, has always been overrun with liberal and leftist trolls. It's not a failure of moderation it's a feature. The leftist trolls are sanctioned and encouraged because they are the voice of the ownership.\n10 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style ahamrbond 12 points 6 hours ago Marx and Engels were Jewish. Lenin and Trotsky too (one of them was only half Jewish). Mao had Jewish advisors, I found out. And I don't know what percentage of our Marxist college professors are Jewish, but I'll bet it's high.\nOnly 2% of the US is Jewish, but 50% of donations to the Democrat party come from Jewish donors (like Soros and whatnot).\nMost of the Jews on the left are secular (non-religious); this is something Charlie Kirk talked about. He said that they have a lot of explaining to do lol (the context was the left turning against Israel).\nIt goes even deeper.\nIf you look up who started the transgender movement, of course most of them are Jewish. If you look up who runs the biggest porn sites, a lot of Jewish names pop up. If you want to know who runs the media, movies, CNN etc. look it up. You'll see that Jewish people are way over represented. And if you want to know where DEI in the corporate world came from, you have to look at BlackRock, which is run by Jewish people. To be clear, this is not some Jewish conspiracy where all the Jews are in on it. If anything, most Jews end up being the primary victims of whatever is going on. But something is definitely going on. And I don't like that we can't talk about it. permalink award report block reply AgnosticTemplar 6 points 6 hours ago Trump and the MAGA brand only dips their toes in nationalism, which as you point out is controlled opposition. In practice it's the same globalist bullshit that treats nations as economic zones and their people as interchangeable laborers. No homeland for anyone other than the jews, the zionist shills are even going so far as to now say you don't have the right to even live in the city you grew up in. permalink award report block reply Givesgunstogrannies 5 points 6 hours ago They fear Nationalism, because they are a nomadic people, loyal first and foremost to themselves.  Maybe they should be scared that America may become the 110th country, but they brought it upon themselves. permalink parent award report block reply RudeFrog 5 points 6 hours ago They run the GOP so good luck finding any candidates who agree with you, you only get to choose from their chosen skin suit permalink award report block reply DarthEP 2 points 5 hours ago Pinko Commie Bastards. The Lot Of Them. permalink award report block reply Friendly_B 0 points 7 hours ago Trump hosted the new Ark of the Covenant at Mar-a-Lago for months. He knows something you don't know. permalink award report block reply newestofnew OP 6 points 7 hours ago I know that Christ is king. The ark of the covenant faded into obscurity because there is a new and everlasting covenant. No need for a new temple, no need for a holy of holies. The ultimate sacrifice has already been made. permalink parent award report block reply x79q3pb 6 points 7 hours ago He knows something you don't know If you could try not falling for every single grain of hopium, that would be fantastic. permalink parent award report block reply VanDeKoik -6 points 7 hours ago I swear either this shit is just a troll or some of you seriously need to be on the funny farm. permalink award report block reply newestofnew OP 7 points 7 hours ago proved the point. all they have is insults and gaslighting. permalink parent award report block reply Female 5 points 6 hours ago 2 month old baby account permalink parent award report block reply Be_The_Change 1 points 7 hours ago Comment removed by community moderators. permalink award report block reply\nahamrbond 12 points 6 hours ago Marx and Engels were Jewish. Lenin and Trotsky too (one of them was only half Jewish). Mao had Jewish advisors, I found out. And I don't know what percentage of our Marxist college professors are Jewish, but I'll bet it's high.\nOnly 2% of the US is Jewish, but 50% of donations to the Democrat party come from Jewish donors (like Soros and whatnot).\nMost of the Jews on the left are secular (non-religious); this is something Charlie Kirk talked about. He said that they have a lot of explaining to do lol (the context was the left turning against Israel).\nIt goes even deeper.\nIf you look up who started the transgender movement, of course most of them are Jewish. If you look up who runs the biggest porn sites, a lot of Jewish names pop up. If you want to know who runs the media, movies, CNN etc. look it up. You'll see that Jewish people are way over represented. And if you want to know where DEI in the corporate world came from, you have to look at BlackRock, which is run by Jewish people. To be clear, this is not some Jewish conspiracy where all the Jews are in on it. If anything, most Jews end up being the primary victims of whatever is going on. But something is definitely going on. And I don't like that we can't talk about it. permalink award report block reply\nAgnosticTemplar 6 points 6 hours ago Trump and the MAGA brand only dips their toes in nationalism, which as you point out is controlled opposition. In practice it's the same globalist bullshit that treats nations as economic zones and their people as interchangeable laborers. No homeland for anyone other than the jews, the zionist shills are even going so far as to now say you don't have the right to even live in the city you grew up in. permalink award report block reply Givesgunstogrannies 5 points 6 hours ago They fear Nationalism, because they are a nomadic people, loyal first and foremost to themselves.  Maybe they should be scared that America may become the 110th country, but they brought it upon themselves. permalink parent award report block reply\nGivesgunstogrannies 5 points 6 hours ago They fear Nationalism, because they are a nomadic people, loyal first and foremost to themselves.  Maybe they should be scared that America may become the 110th country, but they brought it upon themselves. permalink parent award report block reply\nRudeFrog 5 points 6 hours ago They run the GOP so good luck finding any candidates who agree with you, you only get to choose from their chosen skin suit permalink award report block reply\nDarthEP 2 points 5 hours ago Pinko Commie Bastards. The Lot Of Them. permalink award report block reply\nFriendly_B 0 points 7 hours ago Trump hosted the new Ark of the Covenant at Mar-a-Lago for months. He knows something you don't know. permalink award report block reply newestofnew OP 6 points 7 hours ago I know that Christ is king. The ark of the covenant faded into obscurity because there is a new and everlasting covenant. No need for a new temple, no need for a holy of holies. The ultimate sacrifice has already been made. permalink parent award report block reply x79q3pb 6 points 7 hours ago He knows something you don't know If you could try not falling for every single grain of hopium, that would be fantastic. permalink parent award report block reply\nnewestofnew OP 6 points 7 hours ago I know that Christ is king. The ark of the covenant faded into obscurity because there is a new and everlasting covenant. No need for a new temple, no need for a holy of holies. The ultimate sacrifice has already been made. permalink parent award report block reply\nx79q3pb 6 points 7 hours ago He knows something you don't know If you could try not falling for every single grain of hopium, that would be fantastic. permalink parent award report block reply\nVanDeKoik -6 points 7 hours ago I swear either this shit is just a troll or some of you seriously need to be on the funny farm. permalink award report block reply newestofnew OP 7 points 7 hours ago proved the point. all they have is insults and gaslighting. permalink parent award report block reply Female 5 points 6 hours ago 2 month old baby account permalink parent award report block reply\nnewestofnew OP 7 points 7 hours ago proved the point. all they have is insults and gaslighting. permalink parent award report block reply\nFemale 5 points 6 hours ago 2 month old baby account permalink parent award report block reply\nBe_The_Change 1 points 7 hours ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T19:53:28.035428Z"
}