{
  "id": "1ARK591SM7",
  "url": "https://patriots.win/p/1ARK591SM7/reflection-a-gift-from-god-now-m/c",
  "content": "399 Reflection- a gift from God... now many would say Sadam did similar... but at the same time he was literally a dictator  - kinda goes with the territory posted 3 days ago by GenWashington 12 comments award share download report block\n12 comments Sort by Top Top New Worst Old Save GTHAYS 8 points 3 days ago At least Saddam liked women. permalink award report block reply HOSEQ 3 points 3 days ago Yeah, but he kept the Muslims and Islam under control, kept them from getting too stupid and going Full Jihad.... When the U.S. Govt Murdered Saddam, there was no longer a dam to keep Islam at bay, nothing to stop them from going 100% Stupid, and now here we are with NYC making a Muslim into Mayor, even though they can easily see what Islam has done to London and Europe.... permalink parent award report block reply GTHAYS 4 points 3 days ago I would agree our track record in the Middle East has been shit forever.  Even when we win, what do we gain from it?  Nothing.  I guess our sons are not that important to the MIC and the US Government. permalink parent award report block reply HOSEQ 1 points 2 days ago Oh but they sure are to the U.S. Govt., an to the Fed Res Banking Cartel.... It's just a theory, BUT, I believe, that somewhere in all the Paperwork between the U.S. Govt., an the Fed Res, there's a Soldiers/Sailors Life Insurance Scam happening, where, During War time for each American Soldier or sailor Killed, the \"\"National Debt\"\" is lowered by something stupid, like $50,000.00 Dollars, which is calculated every 16 Weeks or some such ODDBALL Time Table.... Like what Walmart does with New Employees, or Apparently does.... permalink parent award report block reply deleted 5 points 3 days ago SPEDMan64 2 points 3 days ago \"A\" brick? I'd be quite fine with a wall collapse. permalink parent award report block reply Surfsup 3 points 3 days ago Pasty gay permalink award report block reply billybaldwin2 3 points 3 days ago Didn't Sadam have his congress shoot other members of congress that were against him? There were documentaries about it floating around in late 2020. permalink award report block reply LordKuroTheGreat 5 points 3 days ago Who cares? It's not like it happened in our country, and that's how things operate in muslim countries (which is also why any politician importing them wholesale needs to be stripped of citizenship and exiled). Maybe those guys sucked anyway for all we know. permalink parent award report block reply Surfsup 3 points 3 days ago Likely propaganda permalink parent award report block reply GenWashington OP 3 points 3 days ago Yes isn't that what a dictator does? permalink parent award report block reply SPEDMan64 1 points 3 days ago I think if you pay for the \"benevolent\" badge on your dictator certificate that you don't have to kill people but you are still obligated to imprison them for a reasonable length of time (using the dictator schedule, of course). permalink parent award report block reply\nGTHAYS 8 points 3 days ago At least Saddam liked women. permalink award report block reply HOSEQ 3 points 3 days ago Yeah, but he kept the Muslims and Islam under control, kept them from getting too stupid and going Full Jihad.... When the U.S. Govt Murdered Saddam, there was no longer a dam to keep Islam at bay, nothing to stop them from going 100% Stupid, and now here we are with NYC making a Muslim into Mayor, even though they can easily see what Islam has done to London and Europe.... permalink parent award report block reply GTHAYS 4 points 3 days ago I would agree our track record in the Middle East has been shit forever.  Even when we win, what do we gain from it?  Nothing.  I guess our sons are not that important to the MIC and the US Government. permalink parent award report block reply HOSEQ 1 points 2 days ago Oh but they sure are to the U.S. Govt., an to the Fed Res Banking Cartel.... It's just a theory, BUT, I believe, that somewhere in all the Paperwork between the U.S. Govt., an the Fed Res, there's a Soldiers/Sailors Life Insurance Scam happening, where, During War time for each American Soldier or sailor Killed, the \"\"National Debt\"\" is lowered by something stupid, like $50,000.00 Dollars, which is calculated every 16 Weeks or some such ODDBALL Time Table.... Like what Walmart does with New Employees, or Apparently does.... permalink parent award report block reply\nHOSEQ 3 points 3 days ago Yeah, but he kept the Muslims and Islam under control, kept them from getting too stupid and going Full Jihad.... When the U.S. Govt Murdered Saddam, there was no longer a dam to keep Islam at bay, nothing to stop them from going 100% Stupid, and now here we are with NYC making a Muslim into Mayor, even though they can easily see what Islam has done to London and Europe.... permalink parent award report block reply GTHAYS 4 points 3 days ago I would agree our track record in the Middle East has been shit forever.  Even when we win, what do we gain from it?  Nothing.  I guess our sons are not that important to the MIC and the US Government. permalink parent award report block reply HOSEQ 1 points 2 days ago Oh but they sure are to the U.S. Govt., an to the Fed Res Banking Cartel.... It's just a theory, BUT, I believe, that somewhere in all the Paperwork between the U.S. Govt., an the Fed Res, there's a Soldiers/Sailors Life Insurance Scam happening, where, During War time for each American Soldier or sailor Killed, the \"\"National Debt\"\" is lowered by something stupid, like $50,000.00 Dollars, which is calculated every 16 Weeks or some such ODDBALL Time Table.... Like what Walmart does with New Employees, or Apparently does.... permalink parent award report block reply\nGTHAYS 4 points 3 days ago I would agree our track record in the Middle East has been shit forever.  Even when we win, what do we gain from it?  Nothing.  I guess our sons are not that important to the MIC and the US Government. permalink parent award report block reply HOSEQ 1 points 2 days ago Oh but they sure are to the U.S. Govt., an to the Fed Res Banking Cartel.... It's just a theory, BUT, I believe, that somewhere in all the Paperwork between the U.S. Govt., an the Fed Res, there's a Soldiers/Sailors Life Insurance Scam happening, where, During War time for each American Soldier or sailor Killed, the \"\"National Debt\"\" is lowered by something stupid, like $50,000.00 Dollars, which is calculated every 16 Weeks or some such ODDBALL Time Table.... Like what Walmart does with New Employees, or Apparently does.... permalink parent award report block reply\nHOSEQ 1 points 2 days ago Oh but they sure are to the U.S. Govt., an to the Fed Res Banking Cartel.... It's just a theory, BUT, I believe, that somewhere in all the Paperwork between the U.S. Govt., an the Fed Res, there's a Soldiers/Sailors Life Insurance Scam happening, where, During War time for each American Soldier or sailor Killed, the \"\"National Debt\"\" is lowered by something stupid, like $50,000.00 Dollars, which is calculated every 16 Weeks or some such ODDBALL Time Table.... Like what Walmart does with New Employees, or Apparently does.... permalink parent award report block reply\ndeleted 5 points 3 days ago SPEDMan64 2 points 3 days ago \"A\" brick? I'd be quite fine with a wall collapse. permalink parent award report block reply\nSPEDMan64 2 points 3 days ago \"A\" brick? I'd be quite fine with a wall collapse. permalink parent award report block reply\nSurfsup 3 points 3 days ago Pasty gay permalink award report block reply\nbillybaldwin2 3 points 3 days ago Didn't Sadam have his congress shoot other members of congress that were against him? There were documentaries about it floating around in late 2020. permalink award report block reply LordKuroTheGreat 5 points 3 days ago Who cares? It's not like it happened in our country, and that's how things operate in muslim countries (which is also why any politician importing them wholesale needs to be stripped of citizenship and exiled). Maybe those guys sucked anyway for all we know. permalink parent award report block reply Surfsup 3 points 3 days ago Likely propaganda permalink parent award report block reply GenWashington OP 3 points 3 days ago Yes isn't that what a dictator does? permalink parent award report block reply SPEDMan64 1 points 3 days ago I think if you pay for the \"benevolent\" badge on your dictator certificate that you don't have to kill people but you are still obligated to imprison them for a reasonable length of time (using the dictator schedule, of course). permalink parent award report block reply\nLordKuroTheGreat 5 points 3 days ago Who cares? It's not like it happened in our country, and that's how things operate in muslim countries (which is also why any politician importing them wholesale needs to be stripped of citizenship and exiled). Maybe those guys sucked anyway for all we know. permalink parent award report block reply\nSurfsup 3 points 3 days ago Likely propaganda permalink parent award report block reply\nGenWashington OP 3 points 3 days ago Yes isn't that what a dictator does? permalink parent award report block reply SPEDMan64 1 points 3 days ago I think if you pay for the \"benevolent\" badge on your dictator certificate that you don't have to kill people but you are still obligated to imprison them for a reasonable length of time (using the dictator schedule, of course). permalink parent award report block reply\nSPEDMan64 1 points 3 days ago I think if you pay for the \"benevolent\" badge on your dictator certificate that you don't have to kill people but you are still obligated to imprison them for a reasonable length of time (using the dictator schedule, of course). permalink parent award report block reply"
}