{
  "id": "1ARK514gNf",
  "url": "https://patriots.win/p/1ARK514gNf/tucker-lindsey-graham-can-be-rel/c",
  "content": "455 Tucker: \"Lindsey Graham can be relied upon at every public event, every photo opportunity, every time you run into him on the street, to be calling for the murder of somebody. Killing is the point of Lindsey Graham's political career. It's all about killing people.” posted 6 days ago by StopCorruptionDC 22 comments award share download report block\n22 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style WoeToYou 6 points 6 days ago Neocons gonna neocon 🤷🏼‍♂️ permalink award report block reply shadypollster 4 points 6 days ago Could be something worse. Maybe he is a Satanist like the Order of Set where every human death they cause is a sacrifice to Satan. permalink parent award report block reply WoeToYou 4 points 6 days ago He’s evil. The details don’t really matter at that point. permalink parent award report block reply shadypollster 2 points 6 days ago Yeah for sure. Never gonna forget him gloating about how our dollars were \"well spent....well spent killing Russians\" wtf type of ghoul shit is that.. permalink parent award report block reply YaharaRiver 0 points 6 days ago Qatarlson will bury them with his mouth! Exaggeration to the point of crazy — “every” public event, “every” photo opportunity, “every” time you run into him on the street… ya …okay 🙄 That’s Murder in an information war. Stabby stabby stabby with your cutting accusations. permalink parent award report block reply WoeToYou 1 points 6 days ago Kosher Conservative. permalink parent award report block reply 556x45mm 6 points 6 days ago Keep exposing these old guard neocons. Purge them from the party and replace with young MAGA types. permalink award report block reply NewGovModOnDutyBans -1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Dallasguy 4 points 6 days ago Homosexuals are naturally violent. permalink award report block reply YaharaRiver 1 points 6 days ago it is my understanding that the NON-homosexuals throw them off the roofs.  But your observation makes quite a bit more sense 😂😂 permalink parent award report block reply Throwingway22 3 points 6 days ago If you want to get rid of Graham, you should look at why Graham has the influence he does instead of complaining about what he leverages that influence towards. You can like everything that Thomas Massie and Rand Paul say they support, but their actions are the reason that people like Graham have so much power. Rand Paul got kicked out of the negotiations for the BBB because he was being an incalcitrant pain in the ass. Instead of getting something, anything at all, he gained precisely zero ground--in fact you can argue he lost ground--in pursuit of his goals. Because he was a guaranteed no vote, someone like Graham's vote is more valuable and Graham knows that he can get a little something for voting yes. And then, what, it gets floated that it's Nancy Mace that is going to challenge Graham for his seat? Just a waste of time. Demand better representation from the people you think are better than Graham and Graham will have a lot less influence. permalink award report block reply keeman 1 points 6 days ago The compromise between poison and food is just poison.  The reason conservatism constantly loses ground is that progressives and globalists never moderate their demands.  No matter how much you give them they demand more.  Compromise is the slow road to communism. permalink parent award report block reply Throwingway22 3 points 6 days ago Progressives took everything in increments for decades. They slowly took over by compromising over and over and over again until we get to the point of sterilizing teens. Barack Obama was running on a platform of civil unions, opposed to gay marriage. It's just complete ignorance of how we got where we are to say what you said. Massie and Pauls solution to your food analogy is that it's better to starve demanding a steak than be satisfied with a bit of spam for a meal. permalink parent award report block reply snoopy3210 0 points 6 days ago Graham is CIA. He has a whole team working for him and illegally helping him versus other senators. That’s it. permalink parent award report block reply Throwingway22 0 points 6 days ago Someone you can work with is more valuable than someone you can't work with. That's it. If you want to get rid of graham, set your expectations higher for people you agree with more. A guaranteed no vote is a de facto Democrat regardless of what they claim their reasons are. permalink parent award report block reply snoopy3210 0 points 6 days ago Graham tried to get Trump impeached and convicted in the senate after J6, by giving Trump five lawyers from south carolina who demanded Trump to accept some blame for J6. If Trump had not fired the Graham lawyers, he would have been convicted and gone. You can’t work with traitors. permalink parent award report block reply Throwingway22 1 points 6 days ago And yet, Paul got kicked out of negotiations and Graham voted yes and got something. I.e. graham could be worked with. You don't help your cause by starting from a position of complete denial. permalink parent award report block reply MegoThor 1 points 6 days ago Killing and sucking dicks. permalink award report block reply Soulrecycler 1 points 6 days ago ole ladybug will burn down your empire to rule over your ashes permalink award report block reply lifeisahologram 0 points 6 days ago Lindsey has on multiple occasions gleefully expressed interest in wanting to kill people, or people already killed. Hes also said that capital police were given guns and was mad they didn’t murder and kill every J6er. permalink award report block reply Deplora -5 points 6 days ago Tucker would eagerly say the same thing about Trump if his calculations showed he could make more money by saying that. permalink award report block reply fjobb 7 points 6 days ago How about we just stick with what he did say rather than the words you want to put in his mouth. permalink parent award report block reply\nWoeToYou 6 points 6 days ago Neocons gonna neocon 🤷🏼‍♂️ permalink award report block reply shadypollster 4 points 6 days ago Could be something worse. Maybe he is a Satanist like the Order of Set where every human death they cause is a sacrifice to Satan. permalink parent award report block reply WoeToYou 4 points 6 days ago He’s evil. The details don’t really matter at that point. permalink parent award report block reply shadypollster 2 points 6 days ago Yeah for sure. Never gonna forget him gloating about how our dollars were \"well spent....well spent killing Russians\" wtf type of ghoul shit is that.. permalink parent award report block reply YaharaRiver 0 points 6 days ago Qatarlson will bury them with his mouth! Exaggeration to the point of crazy — “every” public event, “every” photo opportunity, “every” time you run into him on the street… ya …okay 🙄 That’s Murder in an information war. Stabby stabby stabby with your cutting accusations. permalink parent award report block reply WoeToYou 1 points 6 days ago Kosher Conservative. permalink parent award report block reply\nshadypollster 4 points 6 days ago Could be something worse. Maybe he is a Satanist like the Order of Set where every human death they cause is a sacrifice to Satan. permalink parent award report block reply WoeToYou 4 points 6 days ago He’s evil. The details don’t really matter at that point. permalink parent award report block reply shadypollster 2 points 6 days ago Yeah for sure. Never gonna forget him gloating about how our dollars were \"well spent....well spent killing Russians\" wtf type of ghoul shit is that.. permalink parent award report block reply\nWoeToYou 4 points 6 days ago He’s evil. The details don’t really matter at that point. permalink parent award report block reply shadypollster 2 points 6 days ago Yeah for sure. Never gonna forget him gloating about how our dollars were \"well spent....well spent killing Russians\" wtf type of ghoul shit is that.. permalink parent award report block reply\nshadypollster 2 points 6 days ago Yeah for sure. Never gonna forget him gloating about how our dollars were \"well spent....well spent killing Russians\" wtf type of ghoul shit is that.. permalink parent award report block reply\nYaharaRiver 0 points 6 days ago Qatarlson will bury them with his mouth! Exaggeration to the point of crazy — “every” public event, “every” photo opportunity, “every” time you run into him on the street… ya …okay 🙄 That’s Murder in an information war. Stabby stabby stabby with your cutting accusations. permalink parent award report block reply WoeToYou 1 points 6 days ago Kosher Conservative. permalink parent award report block reply\nWoeToYou 1 points 6 days ago Kosher Conservative. permalink parent award report block reply\n556x45mm 6 points 6 days ago Keep exposing these old guard neocons. Purge them from the party and replace with young MAGA types. permalink award report block reply NewGovModOnDutyBans -1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nNewGovModOnDutyBans -1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nDallasguy 4 points 6 days ago Homosexuals are naturally violent. permalink award report block reply YaharaRiver 1 points 6 days ago it is my understanding that the NON-homosexuals throw them off the roofs.  But your observation makes quite a bit more sense 😂😂 permalink parent award report block reply\nYaharaRiver 1 points 6 days ago it is my understanding that the NON-homosexuals throw them off the roofs.  But your observation makes quite a bit more sense 😂😂 permalink parent award report block reply\nThrowingway22 3 points 6 days ago If you want to get rid of Graham, you should look at why Graham has the influence he does instead of complaining about what he leverages that influence towards. You can like everything that Thomas Massie and Rand Paul say they support, but their actions are the reason that people like Graham have so much power. Rand Paul got kicked out of the negotiations for the BBB because he was being an incalcitrant pain in the ass. Instead of getting something, anything at all, he gained precisely zero ground--in fact you can argue he lost ground--in pursuit of his goals. Because he was a guaranteed no vote, someone like Graham's vote is more valuable and Graham knows that he can get a little something for voting yes. And then, what, it gets floated that it's Nancy Mace that is going to challenge Graham for his seat? Just a waste of time. Demand better representation from the people you think are better than Graham and Graham will have a lot less influence. permalink award report block reply keeman 1 points 6 days ago The compromise between poison and food is just poison.  The reason conservatism constantly loses ground is that progressives and globalists never moderate their demands.  No matter how much you give them they demand more.  Compromise is the slow road to communism. permalink parent award report block reply Throwingway22 3 points 6 days ago Progressives took everything in increments for decades. They slowly took over by compromising over and over and over again until we get to the point of sterilizing teens. Barack Obama was running on a platform of civil unions, opposed to gay marriage. It's just complete ignorance of how we got where we are to say what you said. Massie and Pauls solution to your food analogy is that it's better to starve demanding a steak than be satisfied with a bit of spam for a meal. permalink parent award report block reply snoopy3210 0 points 6 days ago Graham is CIA. He has a whole team working for him and illegally helping him versus other senators. That’s it. permalink parent award report block reply Throwingway22 0 points 6 days ago Someone you can work with is more valuable than someone you can't work with. That's it. If you want to get rid of graham, set your expectations higher for people you agree with more. A guaranteed no vote is a de facto Democrat regardless of what they claim their reasons are. permalink parent award report block reply snoopy3210 0 points 6 days ago Graham tried to get Trump impeached and convicted in the senate after J6, by giving Trump five lawyers from south carolina who demanded Trump to accept some blame for J6. If Trump had not fired the Graham lawyers, he would have been convicted and gone. You can’t work with traitors. permalink parent award report block reply Throwingway22 1 points 6 days ago And yet, Paul got kicked out of negotiations and Graham voted yes and got something. I.e. graham could be worked with. You don't help your cause by starting from a position of complete denial. permalink parent award report block reply\nkeeman 1 points 6 days ago The compromise between poison and food is just poison.  The reason conservatism constantly loses ground is that progressives and globalists never moderate their demands.  No matter how much you give them they demand more.  Compromise is the slow road to communism. permalink parent award report block reply Throwingway22 3 points 6 days ago Progressives took everything in increments for decades. They slowly took over by compromising over and over and over again until we get to the point of sterilizing teens. Barack Obama was running on a platform of civil unions, opposed to gay marriage. It's just complete ignorance of how we got where we are to say what you said. Massie and Pauls solution to your food analogy is that it's better to starve demanding a steak than be satisfied with a bit of spam for a meal. permalink parent award report block reply\nThrowingway22 3 points 6 days ago Progressives took everything in increments for decades. They slowly took over by compromising over and over and over again until we get to the point of sterilizing teens. Barack Obama was running on a platform of civil unions, opposed to gay marriage. It's just complete ignorance of how we got where we are to say what you said. Massie and Pauls solution to your food analogy is that it's better to starve demanding a steak than be satisfied with a bit of spam for a meal. permalink parent award report block reply\nsnoopy3210 0 points 6 days ago Graham is CIA. He has a whole team working for him and illegally helping him versus other senators. That’s it. permalink parent award report block reply Throwingway22 0 points 6 days ago Someone you can work with is more valuable than someone you can't work with. That's it. If you want to get rid of graham, set your expectations higher for people you agree with more. A guaranteed no vote is a de facto Democrat regardless of what they claim their reasons are. permalink parent award report block reply snoopy3210 0 points 6 days ago Graham tried to get Trump impeached and convicted in the senate after J6, by giving Trump five lawyers from south carolina who demanded Trump to accept some blame for J6. If Trump had not fired the Graham lawyers, he would have been convicted and gone. You can’t work with traitors. permalink parent award report block reply Throwingway22 1 points 6 days ago And yet, Paul got kicked out of negotiations and Graham voted yes and got something. I.e. graham could be worked with. You don't help your cause by starting from a position of complete denial. permalink parent award report block reply\nThrowingway22 0 points 6 days ago Someone you can work with is more valuable than someone you can't work with. That's it. If you want to get rid of graham, set your expectations higher for people you agree with more. A guaranteed no vote is a de facto Democrat regardless of what they claim their reasons are. permalink parent award report block reply snoopy3210 0 points 6 days ago Graham tried to get Trump impeached and convicted in the senate after J6, by giving Trump five lawyers from south carolina who demanded Trump to accept some blame for J6. If Trump had not fired the Graham lawyers, he would have been convicted and gone. You can’t work with traitors. permalink parent award report block reply Throwingway22 1 points 6 days ago And yet, Paul got kicked out of negotiations and Graham voted yes and got something. I.e. graham could be worked with. You don't help your cause by starting from a position of complete denial. permalink parent award report block reply\nsnoopy3210 0 points 6 days ago Graham tried to get Trump impeached and convicted in the senate after J6, by giving Trump five lawyers from south carolina who demanded Trump to accept some blame for J6. If Trump had not fired the Graham lawyers, he would have been convicted and gone. You can’t work with traitors. permalink parent award report block reply Throwingway22 1 points 6 days ago And yet, Paul got kicked out of negotiations and Graham voted yes and got something. I.e. graham could be worked with. You don't help your cause by starting from a position of complete denial. permalink parent award report block reply\nThrowingway22 1 points 6 days ago And yet, Paul got kicked out of negotiations and Graham voted yes and got something. I.e. graham could be worked with. You don't help your cause by starting from a position of complete denial. permalink parent award report block reply\nMegoThor 1 points 6 days ago Killing and sucking dicks. permalink award report block reply\nSoulrecycler 1 points 6 days ago ole ladybug will burn down your empire to rule over your ashes permalink award report block reply\nlifeisahologram 0 points 6 days ago Lindsey has on multiple occasions gleefully expressed interest in wanting to kill people, or people already killed. Hes also said that capital police were given guns and was mad they didn’t murder and kill every J6er. permalink award report block reply\nDeplora -5 points 6 days ago Tucker would eagerly say the same thing about Trump if his calculations showed he could make more money by saying that. permalink award report block reply fjobb 7 points 6 days ago How about we just stick with what he did say rather than the words you want to put in his mouth. permalink parent award report block reply\nfjobb 7 points 6 days ago How about we just stick with what he did say rather than the words you want to put in his mouth. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:09:24.451669Z"
}