{
  "id": "1ARK9is378",
  "url": "https://patriots.win/p/1ARK9is378/sit-down-and-let-the-adults-hand/c",
  "content": "356 Sit down and let the adults handle this, Lieawatha. posted 2 days ago by KuzoKevin 6 comments award share download report block\n6 comments Sort by Top Top New Worst Old Save KuzoKevin OP 5 points 2 days ago Link - https://twitter.com/k_ovfefe2/status/1988024845926625386 permalink award report block reply KuzoKevin OP 5 points 2 days ago Democrats have never created anything that makes things cheaper.  Either out of pocket or via taxes, it always costs us more. permalink award report block reply Abovethefray 2 points 2 days ago Fucking democrats... always with the 'fighting'  something.  Fucking relax for a minute, will you? permalink award report block reply rebuildingMyself 1 points 1 day ago Right after that shit went live, we had a full company meeting to go over just how more expensive it was going to be for everybody. Tye company's hands were tied and we all just had to deal with it and either reduce benefits or eat the cost. permalink award report block reply TrumpMagaNoBama 1 points 2 days ago STFU Lie-a-Watha and get back in teepee!  Shut Front Hole! permalink award report block reply blitzstrasse 1 points 1 day ago So that's what being punched in the trachea looks like. permalink award report block reply\nKuzoKevin OP 5 points 2 days ago Link - https://twitter.com/k_ovfefe2/status/1988024845926625386 permalink award report block reply\nKuzoKevin OP 5 points 2 days ago Democrats have never created anything that makes things cheaper.  Either out of pocket or via taxes, it always costs us more. permalink award report block reply\nAbovethefray 2 points 2 days ago Fucking democrats... always with the 'fighting'  something.  Fucking relax for a minute, will you? permalink award report block reply\nrebuildingMyself 1 points 1 day ago Right after that shit went live, we had a full company meeting to go over just how more expensive it was going to be for everybody. Tye company's hands were tied and we all just had to deal with it and either reduce benefits or eat the cost. permalink award report block reply\nTrumpMagaNoBama 1 points 2 days ago STFU Lie-a-Watha and get back in teepee!  Shut Front Hole! permalink award report block reply\nblitzstrasse 1 points 1 day ago So that's what being punched in the trachea looks like. permalink award report block reply",
  "fetched_at": "2025-11-12T23:07:27.991759Z"
}