{
  "id": "8175228",
  "title": "1199West Virginia State Senator Chris Rose (@ChrisRoseWV) has introduced a resolution inviting 27 co",
  "url": "https://patriots.win/p/1ARK56j0ci/west-virginia-state-senator-chri/c",
  "content": "1199 West Virginia State Senator Chris Rose (@ChrisRoseWV) has introduced a resolution inviting 27 counties in Virginia and 3 in Maryland to join the State of West Virginia posted 5 days ago by Mr_Rightside 104 comments award share download report block\n104 comments Sort by Top Top New Worst Old Save lothrop_evola 101 points 5 days ago Super-West Virginia. permalink award report block reply deleted 74 points 5 days ago RocksCanOnlyWait 35 points 5 days ago East West Virginia permalink parent award report block reply Skogin 22 points 5 days ago Virginia vs Fronthole permalink parent award report block reply LookFatty 6 points 5 days ago Bonus permalink parent award report block reply bigdickhangsright 5 points 5 days ago My goodness that'd be hilarious. permalink parent award report block reply MasterChief08 11 points 5 days ago Based Virginia. In Latin that is Virginia Basis. Greater Virginia also works. permalink parent award report block reply deleted 18 points 5 days ago Doritalos 8 points 5 days ago Virginia Optimus Maximus permalink parent award report block reply view 1 more comments... Tookens 6 points 5 days ago Sort of like Taiwan and West Taiwan. permalink parent award report block reply Rock9Head 4 points 4 days ago Or Swamp Virginia permalink parent award report block reply agremlinintheworks 3 points 4 days ago Just officially change the name to Best Virginia. permalink parent award report block reply 5DchessWatch 2 points 4 days ago Ooh I like that permalink parent award report block reply Krat 13 points 5 days ago Greater Virginia permalink parent award report block reply mullethawk 7 points 5 days ago Best Virginia permalink parent award report block reply Shitsbrokeyo 9 points 5 days ago They even used WV colors.\nSsE virginia permalink parent award report block reply SomecatsareMAGA 7 points 5 days ago Sounds good. permalink parent award report block reply breadbaker -24 points 5 days ago Nah. Every single county in Virginia would instantly lose property values if they joined WV. Virginia has very good colleges and very good high schools in NOVA. WV has a persistently underserved dental care community and a bulldozed off mountain tops. permalink parent award report block reply RexCollumSilvarum 20 points 5 days ago Every single county in Virginia would instantly lose property values if they joined WV. Good; less property tax for the residents to have to pay, and cheaper housing for people who want to become homeowners. permalink parent award report block reply thebassdude 3 points 4 days ago That's how I see it. permalink parent award report block reply breadbaker 0 points 4 days ago Please go ram your car into a tree, less car to insure. permalink parent award report block reply view 1 more comments... SanityGumby 11 points 4 days ago Literally makes no sense. Half the reason people want this is they keep putting trannies around their kids in schools permalink parent award report block reply carpetxparmesan 1 points 4 days ago Yeah, wait until they find out they have to vax their kids to send them to school in WV! permalink parent award report block reply breadbaker 1 points 4 days ago Trannies are the new gay. The uniparty loves the social wars. End the real wars. permalink parent award report block reply HazelHen 6 points 5 days ago Fool permalink parent award report block reply TheOutlawPepeWales 2 points 4 days ago They're not tops, they're the roots of mountains that have been eroding for a billion years, and nature turns them back into fields and forests soon after the mining is done but the ignorant urban ecodoomers don't learn about that in their ivory tower colleges. Who the hell wants to be ruled by people who think they know what's best for you but don't really know you at all? Now get off my lawn before I give you some free Appalachian dental care. permalink parent award report block reply carpetxparmesan 1 points 4 days ago You're right. But you're also not right. Tell me about the environmental disasters in the past 30 years. One of those hot potatoes is actively being passed around as \"I didn't do it\" because ALL the companies potentially involved never made enough money combined to fix the issue at present cost. One could make the argument people should not live in WV and it should be an industry-only state. In which case, fine, kick everyone out, don't let anyone live there and move on. But there are already so many trailers in the state, it's economically infeasible to \"buy out\" all the people. Even though most of WV land is already privately owned, funny enough. And you might still have water issues in other states down the line even if you chose to sacrifice the state. permalink parent award report block reply TheMAGAnificent 3 points 5 days ago 🎵 super West Virginiaaaaa, Mountain Mamaaaaaa🎵 permalink parent award report block reply load 4 more comments... XxxRDTPRNxxX 79 points 5 days ago This is the perfect time to remind the left that borders are just imaginary constructs anyways! permalink award report block reply utfanx2 23 points 5 days ago But don't dare cross them with an AR-15. permalink parent award report block reply XxxRDTPRNxxX 19 points 5 days ago That's right. A US citizen commits if a crime if \"ThEy CrOsSeD StAtE LiNEs\". But if you're a fat Guatemalan who just paid criminals $10k to sneak you into the country, You're home, and it's fine cause laws need to change! permalink parent award report block reply gravenspine 42 points 5 days ago Please add carroll county permalink award report block reply Spawnlingman 34 points 5 days ago Me sitting in carrol county right now cursing at this map. permalink parent award report block reply WisestGuru93 1 points 4 days ago Hahaha permalink parent award report block reply Yignuced 6 points 5 days ago Any chance for St Mary’s? permalink parent award report block reply SomecatsareMAGA 5 points 5 days ago It's there I think!! Please. permalink parent award report block reply NonbinaryPotatohead 5 points 5 days ago Big houses, big land! permalink parent award report block reply JDude151 4 points 5 days ago One can only hope, alas. If I see one more 'Courage is being a Carroll County Democrat' bumper sticker while I'm out and about, I'm gonna lose my last few marbles. permalink parent award report block reply load 1 more comments... Scatter-Shot 31 points 5 days ago I made this suggest the night of the election. There should be a nation wide redrawing of State borders to better reflect on the state's residents value and culture. Because right now, the borders drawn during the 19th century is not working in the 21st century. permalink award report block reply Filo76 16 points 5 days ago You’d end up with giant blue city states within the border of red rural / suburban states. I wonder how this would work on the long run. Blue cities might just go gang busters to get more senators. But there is a distinct lack of representation all over. Lots of blue cities control otherwise red states. (Chicago, portland; Seattle, etc) permalink parent award report block reply Scatter-Shot 10 points 5 days ago My main concern are representation and freedom of association. Representation in that rural conservative counties repeatedly get outvoted by liberal urban areas and big cities and Liberals are running the state with little regard for the right. At this point, you have to ask what is the point of staying in the state? Of course, people have taken root in their communities, so instead of moving to a red state, why not secede to the neighboring red state? I live in Vancouver, BC and it makes no sense that Washington's 2nd District is D+12 when up in Canada, that stretch of Canada along the US/Canada border are Conservatives. This is clear gerrymandering to dilute the Conservative areas with Bellingham. If Olympia continues to disenfranchise their Conservative residents, why not secede to Idaho? As for Freedom of association, I do not think the current method of the state the counties are seceding from have to agree to the secession. permalink parent award report block reply ChaplainTappman 2 points 4 days ago Constitutionally both state legislature have to get US congress permission to move lines. Obviously the losing state doesn't want to lose their gerrymandering territory. Solution is a convention of states. permalink parent award report block reply dukeofdoorcounty 3 points 4 days ago West Virginia didn't want to be a slave state so they left Virginia.  I don't see how the border can't be moved again permalink parent award report block reply Mr_Rightside OP 24 points 5 days ago https://x.com/TheCalvinCooli1/status/1986987357812498633 FOR IMMEDIATE RELEASE: West Virginia Senator Chris Rose Introduces Resolution Inviting Virginia and Maryland Counties to Join the Mountain State Maidsville, WV – November 5, 2025 – Today, West Virginia State Senator Chris Rose introduced a Senate Resolution inviting 27 counties from Virginia and three from Maryland to consider joining West Virginia, aiming to strengthen regional ties and promote shared Appalachian values. The resolution highlights the historical precedent set by West Virginia's formation in 1863, when counties separated from Virginia amid national division. It invites the Virginia counties of Alleghany, Augusta, Bath, Bland, Buchanan, Carroll, Clarke, Craig, Dickenson, Frederick, Giles, Grayson, Highland, Lee, Page, Patrick, Rappahannock, Rockingham, Russell, Scott, Shenandoah, Smyth, Tazewell, Warren, Washington, Wise, and Wythe, along with Maryland's Allegany, Garrett, and Washington counties, to explore unification. These areas share geographic, economic, cultural, and historical connections with West Virginia, including a strong Appalachian heritage, rural lifestyles, and a focus on individual liberties. Senator Rose emphasized that the move could address residents' concerns over policies in their current states that may not align with local priorities, such as Second Amendment rights, economic development, and rural representation. \"This resolution is about empowering communities to choose governance that truly reflects their values and needs,\" said Senator Rose. \"West Virginia was born from the spirit of self-determination, and we're extending that invitation to our neighbors who share our way of life. By uniting, we can foster economic growth, better infrastructure, and a stronger voice for Appalachia.\" The resolution notes that such a realignment would require approval from the Virginia and Maryland legislatures, as well as the U.S. Congress, under Article IV, Section 3 of the Constitution. It encourages discussions, referenda, and collaboration among residents, local governments, and state leaders. Copies of the resolution will be sent to the governors and legislative leaders of Virginia and Maryland, the specified county commissions, and West Virginia's congressional delegation. permalink award report block reply TheJakeFroggy 18 points 5 days ago I mean, considering the elections that just happened in Virginia, I'm sure that those parts of Virginia would love to be lumped with West Virginia instead. It'd almost be like saying fuck you to Jay Jones. permalink award report block reply Briankitis 16 points 5 days ago Just add NOVA to dc and that fixes Virginia permalink award report block reply neodanger 1 points 4 days ago 33 square miles of it once was part of DC permalink parent award report block reply UCantStumpTheTrump 12 points 5 days ago I can get behind this on a national level. All states that have major blue-infested counties essentially split off the blue areas and merge with their most conservative neighbor, hamstringing the Democrats’ industrial-scale election vote rigging in the metro areas permalink award report block reply wartooth6 8 points 5 days ago I've had similar thoughts for a while.  Many problems can probably be addressed by redrawing state lines, rather than secession or full blown civil war. permalink parent award report block reply JohnnyRotten 8 points 5 days ago And this will continue to happen until the SCOTUS strikes down Baker v Carr and Reynolds v Sims which gave the population centers total dominion over state politics.  Those two cases essentially declared the US Senate and similar geography based legislative bodies unconstitutional save for the fact that the Senate is defined in Article 1. permalink award report block reply Than0sIII 6 points 5 days ago Best Virginia. permalink award report block reply Haiti_kid 5 points 5 days ago VA will have no chance of ever going Red though. Maybe it already doesnt anyway. permalink award report block reply Dangerous 9 points 5 days ago It... was red. The outgoing governor is a Republican and the losing GOP candidate is his Lieutenant Governor. Both won elections to get those seats. EDIT to further this point, look up the story about Sage's law and the support it held. The entire problem in Virginia is Northern Virginia leading into DC, which is full of psychotic leftists and foreigners. permalink parent award report block reply TruthyBrat 3 points 5 days ago Absent a huge reduction in the Federal workforce, probably not. We can hope. permalink parent award report block reply For_All_Mankind 3 points 5 days ago Pointless. It won’t pass. Idk why they do this stuff. It literally is pointless. permalink award report block reply Tryhardneckbeard 2 points 5 days ago Because its worth reminding people that the current borders are dogshit.  Let the Metro Areas do Metro shit, let the rest of the country live on in peace without em. California and Texas need to be split in two for the good of the country.  Their metro areas hold hostage way too many Americans because of the Electoral Vote implications. permalink parent award report block reply breadbaker 1 points 5 days ago Pointless. It won’t pass. Idk why they do this stuff. It literally is pointless. It's the republican version of performing arts. permalink parent award report block reply possibletower 3 points 5 days ago Rename West Virginia while they're at it too to a cooler sounding name rather than having shitty Virginia in their state name permalink award report block reply sicarius 8 points 5 days ago West Virginia can change their name to Virginia, and Virginia can change its names to DC HomoSuburbia permalink parent award report block reply Redpilled2Depression 3 points 5 days ago If the Greater Idaho movement is successful, expect a wave of other states like here for redistricting efforts. permalink award report block reply SanityGumby 1 points 4 days ago I’d almost expect some PA counties near Pittsburgh to want to break off to WV and Ohio. permalink parent award report block reply MAGASQUAD 3 points 4 days ago State lines need to be completely redrawn. permalink award report block reply Shitsbrokeyo 3 points 5 days ago West coast has been trying to do this for over a decade.  Western WA into ID, northern CA into OR. permalink award report block reply rupok2 3 points 5 days ago Wv best virginia permalink award report block reply Dangerous 3 points 5 days ago This is extra funny when you understand why West Virginia exists at all kek Also a huge swath of potential western counties that would probably live to join this little movement are being excluded because of Albermarle, specifically the city of Charlottesville. permalink award report block reply Counterwhat 1 points 4 days ago Charlottesville is communist haven right now. They literally voted the main arsonist from the BLM soup to the school board to teach and set policy for the city kids. It's crazy this piece of garbage is what they want running the schools. I go to Charlottesville less and less. \"In early 2016, Bryant petitioned the Charlottesville City Council to remove the Robert E. Lee Statue and rename the park of the same name it was located in.\" https://cvillepedia.org/Zyahna_Bryant permalink parent award report block reply JackOfAllTirades 2 points 5 days ago By God. permalink award report block reply Tailgunnerjoe 2 points 4 days ago Maybe this can start a trend.  East California should petition to join Nevada permalink award report block reply SavingPrivateGrace 2 points 5 days ago Can't see it happening without a fight. permalink award report block reply spinometer2 2 points 5 days ago Every state should do this. Let's have a reshuffling of contiguous counties. Do it all at once. In fact, we should do it every 50 years.  And at the same time Congress gets a mandated complete refresh, not by term limits, just all new people must serve in that next Congress. Pass an amendment. Keep things interesting. permalink award report block reply Choppermagic 2 points 5 days ago Greater Virginia permalink award report block reply NoticesBugleOWO 2 points 5 days ago MECHA-VIRGINIA IS GO! permalink award report block reply dres3 2 points 5 days ago because of continuous boundaries or whatever the fine print is. the Top-yellow is likely to be a problem. permalink award report block reply Michalusmichalus 1 points 4 days ago I live in Allegany County. That's a top yellow county. We in Western MD have nothing in common with MoCo ( federal employee land) but, Moore Bullshit is trying to gerrymander those of us in the Appalachian Mountains into MoCo to flip the district. This is after it was fixed a few years ago in court. I posted an article a few days ago. permalink parent award report block reply journalist 2 points 5 days ago I see Loudoun County was left off the invitation…lol permalink award report block reply chickeninoven 3 points 4 days ago No Faggots Allowed permalink parent award report block reply texas4ever 2 points 5 days ago This stuff never happens. permalink award report block reply FromTheTopRope 1 points 5 days ago The North shall ride again! permalink award report block reply Chickenbaconpoutine 1 points 5 days ago Best Virginia permalink award report block reply patrioticwinning3 1 points 5 days ago Sounds like a plan! permalink award report block reply Freshasabreeze 1 points 4 days ago They should have included Western Pennsylvania, as well. With the exception of Pittsburgh, those folks would fit right in here! Trump country! permalink award report block reply DT170x 1 points 5 days ago Expand by one county,Please you soo close. permalink award report block reply RememberCharlieKirk 1 points 5 days ago Addendum: Change the name of the state, too. The naming of West Virginia gives the sense of a directional command, be that \"west of Virginia\" or like \"go west from Virginia,\" instead of a what it should be -- a declaration of a name -- thereby reducing West Virginia's standing of statehood as nothing but an auxiliary of another state. permalink award report block reply War_Hamster 1 points 4 days ago Fun idea, but only Constitutional if Virginia and/or Maryland agree to cede territory. Since that’s not happening, this is a dead issue just like New California and Greater Idaho are. But it does bring up an historical point. West Virginia was created when several counties split off from Virginia during the “civil war” without Virginia’s permission. If secession wasn’t legal, as Lincolnians claim, then West Virginia couldn’t exist legally. Also, West Virginia was admitted as a slave State, so that hole talking point about the war being about slavery doesn’t work either. permalink award report block reply 5DchessWatch 1 points 4 days ago It did not work for Idaho-Oregon ('greater idaho').  They had ONE county to go.  Only one, and it didn't happen.  I wanted it SO bad to happen.  I lived in portland for a year and it would be a good revenge for that whole shit experience. They should set a time limit to ratify, and if any counteis back out, make the project so that they can back out and the remaining counties still can join WVa permalink award report block reply Daffy 1 points 5 days ago Will never happen. Maryland and VA would lever allow the border change. permalink award report block reply Michalusmichalus 1 points 4 days ago It's not the first time this has been suggested. Western MD wrote letters about leaving when it was gerrymandered out of representation a few yrs back. Moore Bullshit is in the news intentionally gerrymandering again. permalink parent award report block reply rumathlete14 1 points 4 days ago I actually think all of west va and va should rejoin. I think together, we could combat against northern va. permalink award report block reply EffingWhiteMale 1 points 4 days ago In the words of media mogul and manipulator Elliot Carver from Tomorrow Never Dies, the most important question in any story is not the who, the what, where or when, but the why.  That is what seems to be missing from this post. permalink award report block reply Michalusmichalus 1 points 4 days ago I'm in Western MD, and we should go. We have nothing in common with federal employee land down by DC. permalink award report block reply stripperlover 1 points 4 days ago god that would be awesome. permalink award report block reply HyperboreanGodTwink 0 points 5 days ago Not to be a Debbie Doomer, but blue states will never agree to this for one simple reason: the reverse will never happen. Blue cities are usually in the center of states. In order for those counties to change hands there would need to be a huge carveout of land that doesn't agree in order to reach the cities. permalink award report block reply lizardo221 2 points 5 days ago Just to add, the states giving up counties have to agree to give them up. This is like asking slave masters to free their slaves. permalink parent award report block reply Michalusmichalus 1 points 4 days ago No, they prefer to gerrymander the people that disagree with them out of representation. permalink parent award report block reply lizardo221 0 points 4 days ago While I completely agree on why they gerrymander, that is not really relavent to what I was saying in this thread. I'm simply explaining mechanically why it is generally not possible for a red county to leave a blue state. permalink parent award report block reply Michalusmichalus 1 points 4 days ago You clearly forgot how the states got their shapes. It was due to the population required for statehood. permalink parent award report block reply view 1 more comments... Diversity_Fire -3 points 5 days ago Against the Constitution permalink award report block reply\nlothrop_evola 101 points 5 days ago Super-West Virginia. permalink award report block reply deleted 74 points 5 days ago RocksCanOnlyWait 35 points 5 days ago East West Virginia permalink parent award report block reply Skogin 22 points 5 days ago Virginia vs Fronthole permalink parent award report block reply LookFatty 6 points 5 days ago Bonus permalink parent award report block reply bigdickhangsright 5 points 5 days ago My goodness that'd be hilarious. permalink parent award report block reply MasterChief08 11 points 5 days ago Based Virginia. In Latin that is Virginia Basis. Greater Virginia also works. permalink parent award report block reply deleted 18 points 5 days ago Doritalos 8 points 5 days ago Virginia Optimus Maximus permalink parent award report block reply view 1 more comments... Tookens 6 points 5 days ago Sort of like Taiwan and West Taiwan. permalink parent award report block reply Rock9Head 4 points 4 days ago Or Swamp Virginia permalink parent award report block reply agremlinintheworks 3 points 4 days ago Just officially change the name to Best Virginia. permalink parent award report block reply 5DchessWatch 2 points 4 days ago Ooh I like that permalink parent award report block reply Krat 13 points 5 days ago Greater Virginia permalink parent award report block reply mullethawk 7 points 5 days ago Best Virginia permalink parent award report block reply Shitsbrokeyo 9 points 5 days ago They even used WV colors.\nSsE virginia permalink parent award report block reply SomecatsareMAGA 7 points 5 days ago Sounds good. permalink parent award report block reply breadbaker -24 points 5 days ago Nah. Every single county in Virginia would instantly lose property values if they joined WV. Virginia has very good colleges and very good high schools in NOVA. WV has a persistently underserved dental care community and a bulldozed off mountain tops. permalink parent award report block reply RexCollumSilvarum 20 points 5 days ago Every single county in Virginia would instantly lose property values if they joined WV. Good; less property tax for the residents to have to pay, and cheaper housing for people who want to become homeowners. permalink parent award report block reply thebassdude 3 points 4 days ago That's how I see it. permalink parent award report block reply breadbaker 0 points 4 days ago Please go ram your car into a tree, less car to insure. permalink parent award report block reply view 1 more comments... SanityGumby 11 points 4 days ago Literally makes no sense. Half the reason people want this is they keep putting trannies around their kids in schools permalink parent award report block reply carpetxparmesan 1 points 4 days ago Yeah, wait until they find out they have to vax their kids to send them to school in WV! permalink parent award report block reply breadbaker 1 points 4 days ago Trannies are the new gay. The uniparty loves the social wars. End the real wars. permalink parent award report block reply HazelHen 6 points 5 days ago Fool permalink parent award report block reply TheOutlawPepeWales 2 points 4 days ago They're not tops, they're the roots of mountains that have been eroding for a billion years, and nature turns them back into fields and forests soon after the mining is done but the ignorant urban ecodoomers don't learn about that in their ivory tower colleges. Who the hell wants to be ruled by people who think they know what's best for you but don't really know you at all? Now get off my lawn before I give you some free Appalachian dental care. permalink parent award report block reply carpetxparmesan 1 points 4 days ago You're right. But you're also not right. Tell me about the environmental disasters in the past 30 years. One of those hot potatoes is actively being passed around as \"I didn't do it\" because ALL the companies potentially involved never made enough money combined to fix the issue at present cost. One could make the argument people should not live in WV and it should be an industry-only state. In which case, fine, kick everyone out, don't let anyone live there and move on. But there are already so many trailers in the state, it's economically infeasible to \"buy out\" all the people. Even though most of WV land is already privately owned, funny enough. And you might still have water issues in other states down the line even if you chose to sacrifice the state. permalink parent award report block reply TheMAGAnificent 3 points 5 days ago 🎵 super West Virginiaaaaa, Mountain Mamaaaaaa🎵 permalink parent award report block reply load 4 more comments...\ndeleted 74 points 5 days ago RocksCanOnlyWait 35 points 5 days ago East West Virginia permalink parent award report block reply Skogin 22 points 5 days ago Virginia vs Fronthole permalink parent award report block reply LookFatty 6 points 5 days ago Bonus permalink parent award report block reply bigdickhangsright 5 points 5 days ago My goodness that'd be hilarious. permalink parent award report block reply MasterChief08 11 points 5 days ago Based Virginia. In Latin that is Virginia Basis. Greater Virginia also works. permalink parent award report block reply deleted 18 points 5 days ago Doritalos 8 points 5 days ago Virginia Optimus Maximus permalink parent award report block reply view 1 more comments... Tookens 6 points 5 days ago Sort of like Taiwan and West Taiwan. permalink parent award report block reply Rock9Head 4 points 4 days ago Or Swamp Virginia permalink parent award report block reply agremlinintheworks 3 points 4 days ago Just officially change the name to Best Virginia. permalink parent award report block reply 5DchessWatch 2 points 4 days ago Ooh I like that permalink parent award report block reply\nRocksCanOnlyWait 35 points 5 days ago East West Virginia permalink parent award report block reply Skogin 22 points 5 days ago Virginia vs Fronthole permalink parent award report block reply LookFatty 6 points 5 days ago Bonus permalink parent award report block reply bigdickhangsright 5 points 5 days ago My goodness that'd be hilarious. permalink parent award report block reply\nSkogin 22 points 5 days ago Virginia vs Fronthole permalink parent award report block reply LookFatty 6 points 5 days ago Bonus permalink parent award report block reply\nLookFatty 6 points 5 days ago Bonus permalink parent award report block reply\nbigdickhangsright 5 points 5 days ago My goodness that'd be hilarious. permalink parent award report block reply\nMasterChief08 11 points 5 days ago Based Virginia. In Latin that is Virginia Basis. Greater Virginia also works. permalink parent award report block reply deleted 18 points 5 days ago Doritalos 8 points 5 days ago Virginia Optimus Maximus permalink parent award report block reply view 1 more comments...\ndeleted 18 points 5 days ago Doritalos 8 points 5 days ago Virginia Optimus Maximus permalink parent award report block reply view 1 more comments...\nDoritalos 8 points 5 days ago Virginia Optimus Maximus permalink parent award report block reply view 1 more comments...\nTookens 6 points 5 days ago Sort of like Taiwan and West Taiwan. permalink parent award report block reply\nRock9Head 4 points 4 days ago Or Swamp Virginia permalink parent award report block reply\nagremlinintheworks 3 points 4 days ago Just officially change the name to Best Virginia. permalink parent award report block reply 5DchessWatch 2 points 4 days ago Ooh I like that permalink parent award report block reply\n5DchessWatch 2 points 4 days ago Ooh I like that permalink parent award report block reply\nKrat 13 points 5 days ago Greater Virginia permalink parent award report block reply mullethawk 7 points 5 days ago Best Virginia permalink parent award report block reply\nmullethawk 7 points 5 days ago Best Virginia permalink parent award report block reply\nShitsbrokeyo 9 points 5 days ago They even used WV colors.\nSsE virginia permalink parent award report block reply\nSomecatsareMAGA 7 points 5 days ago Sounds good. permalink parent award report block reply breadbaker -24 points 5 days ago Nah. Every single county in Virginia would instantly lose property values if they joined WV. Virginia has very good colleges and very good high schools in NOVA. WV has a persistently underserved dental care community and a bulldozed off mountain tops. permalink parent award report block reply RexCollumSilvarum 20 points 5 days ago Every single county in Virginia would instantly lose property values if they joined WV. Good; less property tax for the residents to have to pay, and cheaper housing for people who want to become homeowners. permalink parent award report block reply thebassdude 3 points 4 days ago That's how I see it. permalink parent award report block reply breadbaker 0 points 4 days ago Please go ram your car into a tree, less car to insure. permalink parent award report block reply view 1 more comments... SanityGumby 11 points 4 days ago Literally makes no sense. Half the reason people want this is they keep putting trannies around their kids in schools permalink parent award report block reply carpetxparmesan 1 points 4 days ago Yeah, wait until they find out they have to vax their kids to send them to school in WV! permalink parent award report block reply breadbaker 1 points 4 days ago Trannies are the new gay. The uniparty loves the social wars. End the real wars. permalink parent award report block reply HazelHen 6 points 5 days ago Fool permalink parent award report block reply TheOutlawPepeWales 2 points 4 days ago They're not tops, they're the roots of mountains that have been eroding for a billion years, and nature turns them back into fields and forests soon after the mining is done but the ignorant urban ecodoomers don't learn about that in their ivory tower colleges. Who the hell wants to be ruled by people who think they know what's best for you but don't really know you at all? Now get off my lawn before I give you some free Appalachian dental care. permalink parent award report block reply carpetxparmesan 1 points 4 days ago You're right. But you're also not right. Tell me about the environmental disasters in the past 30 years. One of those hot potatoes is actively being passed around as \"I didn't do it\" because ALL the companies potentially involved never made enough money combined to fix the issue at present cost. One could make the argument people should not live in WV and it should be an industry-only state. In which case, fine, kick everyone out, don't let anyone live there and move on. But there are already so many trailers in the state, it's economically infeasible to \"buy out\" all the people. Even though most of WV land is already privately owned, funny enough. And you might still have water issues in other states down the line even if you chose to sacrifice the state. permalink parent award report block reply\nbreadbaker -24 points 5 days ago Nah. Every single county in Virginia would instantly lose property values if they joined WV. Virginia has very good colleges and very good high schools in NOVA. WV has a persistently underserved dental care community and a bulldozed off mountain tops. permalink parent award report block reply RexCollumSilvarum 20 points 5 days ago Every single county in Virginia would instantly lose property values if they joined WV. Good; less property tax for the residents to have to pay, and cheaper housing for people who want to become homeowners. permalink parent award report block reply thebassdude 3 points 4 days ago That's how I see it. permalink parent award report block reply breadbaker 0 points 4 days ago Please go ram your car into a tree, less car to insure. permalink parent award report block reply view 1 more comments... SanityGumby 11 points 4 days ago Literally makes no sense. Half the reason people want this is they keep putting trannies around their kids in schools permalink parent award report block reply carpetxparmesan 1 points 4 days ago Yeah, wait until they find out they have to vax their kids to send them to school in WV! permalink parent award report block reply breadbaker 1 points 4 days ago Trannies are the new gay. The uniparty loves the social wars. End the real wars. permalink parent award report block reply HazelHen 6 points 5 days ago Fool permalink parent award report block reply TheOutlawPepeWales 2 points 4 days ago They're not tops, they're the roots of mountains that have been eroding for a billion years, and nature turns them back into fields and forests soon after the mining is done but the ignorant urban ecodoomers don't learn about that in their ivory tower colleges. Who the hell wants to be ruled by people who think they know what's best for you but don't really know you at all? Now get off my lawn before I give you some free Appalachian dental care. permalink parent award report block reply carpetxparmesan 1 points 4 days ago You're right. But you're also not right. Tell me about the environmental disasters in the past 30 years. One of those hot potatoes is actively being passed around as \"I didn't do it\" because ALL the companies potentially involved never made enough money combined to fix the issue at present cost. One could make the argument people should not live in WV and it should be an industry-only state. In which case, fine, kick everyone out, don't let anyone live there and move on. But there are already so many trailers in the state, it's economically infeasible to \"buy out\" all the people. Even though most of WV land is already privately owned, funny enough. And you might still have water issues in other states down the line even if you chose to sacrifice the state. permalink parent award report block reply\nRexCollumSilvarum 20 points 5 days ago Every single county in Virginia would instantly lose property values if they joined WV. Good; less property tax for the residents to have to pay, and cheaper housing for people who want to become homeowners. permalink parent award report block reply thebassdude 3 points 4 days ago That's how I see it. permalink parent award report block reply breadbaker 0 points 4 days ago Please go ram your car into a tree, less car to insure. permalink parent award report block reply view 1 more comments...\nthebassdude 3 points 4 days ago That's how I see it. permalink parent award report block reply\nbreadbaker 0 points 4 days ago Please go ram your car into a tree, less car to insure. permalink parent award report block reply view 1 more comments...\nSanityGumby 11 points 4 days ago Literally makes no sense. Half the reason people want this is they keep putting trannies around their kids in schools permalink parent award report block reply carpetxparmesan 1 points 4 days ago Yeah, wait until they find out they have to vax their kids to send them to school in WV! permalink parent award report block reply breadbaker 1 points 4 days ago Trannies are the new gay. The uniparty loves the social wars. End the real wars. permalink parent award report block reply\ncarpetxparmesan 1 points 4 days ago Yeah, wait until they find out they have to vax their kids to send them to school in WV! permalink parent award report block reply\nbreadbaker 1 points 4 days ago Trannies are the new gay. The uniparty loves the social wars. End the real wars. permalink parent award report block reply\nHazelHen 6 points 5 days ago Fool permalink parent award report block reply\nTheOutlawPepeWales 2 points 4 days ago They're not tops, they're the roots of mountains that have been eroding for a billion years, and nature turns them back into fields and forests soon after the mining is done but the ignorant urban ecodoomers don't learn about that in their ivory tower colleges. Who the hell wants to be ruled by people who think they know what's best for you but don't really know you at all? Now get off my lawn before I give you some free Appalachian dental care. permalink parent award report block reply carpetxparmesan 1 points 4 days ago You're right. But you're also not right. Tell me about the environmental disasters in the past 30 years. One of those hot potatoes is actively being passed around as \"I didn't do it\" because ALL the companies potentially involved never made enough money combined to fix the issue at present cost. One could make the argument people should not live in WV and it should be an industry-only state. In which case, fine, kick everyone out, don't let anyone live there and move on. But there are already so many trailers in the state, it's economically infeasible to \"buy out\" all the people. Even though most of WV land is already privately owned, funny enough. And you might still have water issues in other states down the line even if you chose to sacrifice the state. permalink parent award report block reply\ncarpetxparmesan 1 points 4 days ago You're right. But you're also not right. Tell me about the environmental disasters in the past 30 years. One of those hot potatoes is actively being passed around as \"I didn't do it\" because ALL the companies potentially involved never made enough money combined to fix the issue at present cost. One could make the argument people should not live in WV and it should be an industry-only state. In which case, fine, kick everyone out, don't let anyone live there and move on. But there are already so many trailers in the state, it's economically infeasible to \"buy out\" all the people. Even though most of WV land is already privately owned, funny enough. And you might still have water issues in other states down the line even if you chose to sacrifice the state. permalink parent award report block reply\nTheMAGAnificent 3 points 5 days ago 🎵 super West Virginiaaaaa, Mountain Mamaaaaaa🎵 permalink parent award report block reply\nXxxRDTPRNxxX 79 points 5 days ago This is the perfect time to remind the left that borders are just imaginary constructs anyways! permalink award report block reply utfanx2 23 points 5 days ago But don't dare cross them with an AR-15. permalink parent award report block reply XxxRDTPRNxxX 19 points 5 days ago That's right. A US citizen commits if a crime if \"ThEy CrOsSeD StAtE LiNEs\". But if you're a fat Guatemalan who just paid criminals $10k to sneak you into the country, You're home, and it's fine cause laws need to change! permalink parent award report block reply\nutfanx2 23 points 5 days ago But don't dare cross them with an AR-15. permalink parent award report block reply XxxRDTPRNxxX 19 points 5 days ago That's right. A US citizen commits if a crime if \"ThEy CrOsSeD StAtE LiNEs\". But if you're a fat Guatemalan who just paid criminals $10k to sneak you into the country, You're home, and it's fine cause laws need to change! permalink parent award report block reply\nXxxRDTPRNxxX 19 points 5 days ago That's right. A US citizen commits if a crime if \"ThEy CrOsSeD StAtE LiNEs\". But if you're a fat Guatemalan who just paid criminals $10k to sneak you into the country, You're home, and it's fine cause laws need to change! permalink parent award report block reply\ngravenspine 42 points 5 days ago Please add carroll county permalink award report block reply Spawnlingman 34 points 5 days ago Me sitting in carrol county right now cursing at this map. permalink parent award report block reply WisestGuru93 1 points 4 days ago Hahaha permalink parent award report block reply Yignuced 6 points 5 days ago Any chance for St Mary’s? permalink parent award report block reply SomecatsareMAGA 5 points 5 days ago It's there I think!! Please. permalink parent award report block reply NonbinaryPotatohead 5 points 5 days ago Big houses, big land! permalink parent award report block reply JDude151 4 points 5 days ago One can only hope, alas. If I see one more 'Courage is being a Carroll County Democrat' bumper sticker while I'm out and about, I'm gonna lose my last few marbles. permalink parent award report block reply load 1 more comments...\nSpawnlingman 34 points 5 days ago Me sitting in carrol county right now cursing at this map. permalink parent award report block reply WisestGuru93 1 points 4 days ago Hahaha permalink parent award report block reply\nWisestGuru93 1 points 4 days ago Hahaha permalink parent award report block reply\nYignuced 6 points 5 days ago Any chance for St Mary’s? permalink parent award report block reply\nSomecatsareMAGA 5 points 5 days ago It's there I think!! Please. permalink parent award report block reply\nNonbinaryPotatohead 5 points 5 days ago Big houses, big land! permalink parent award report block reply\nJDude151 4 points 5 days ago One can only hope, alas. If I see one more 'Courage is being a Carroll County Democrat' bumper sticker while I'm out and about, I'm gonna lose my last few marbles. permalink parent award report block reply\nScatter-Shot 31 points 5 days ago I made this suggest the night of the election. There should be a nation wide redrawing of State borders to better reflect on the state's residents value and culture. Because right now, the borders drawn during the 19th century is not working in the 21st century. permalink award report block reply Filo76 16 points 5 days ago You’d end up with giant blue city states within the border of red rural / suburban states. I wonder how this would work on the long run. Blue cities might just go gang busters to get more senators. But there is a distinct lack of representation all over. Lots of blue cities control otherwise red states. (Chicago, portland; Seattle, etc) permalink parent award report block reply Scatter-Shot 10 points 5 days ago My main concern are representation and freedom of association. Representation in that rural conservative counties repeatedly get outvoted by liberal urban areas and big cities and Liberals are running the state with little regard for the right. At this point, you have to ask what is the point of staying in the state? Of course, people have taken root in their communities, so instead of moving to a red state, why not secede to the neighboring red state? I live in Vancouver, BC and it makes no sense that Washington's 2nd District is D+12 when up in Canada, that stretch of Canada along the US/Canada border are Conservatives. This is clear gerrymandering to dilute the Conservative areas with Bellingham. If Olympia continues to disenfranchise their Conservative residents, why not secede to Idaho? As for Freedom of association, I do not think the current method of the state the counties are seceding from have to agree to the secession. permalink parent award report block reply ChaplainTappman 2 points 4 days ago Constitutionally both state legislature have to get US congress permission to move lines. Obviously the losing state doesn't want to lose their gerrymandering territory. Solution is a convention of states. permalink parent award report block reply dukeofdoorcounty 3 points 4 days ago West Virginia didn't want to be a slave state so they left Virginia.  I don't see how the border can't be moved again permalink parent award report block reply\nFilo76 16 points 5 days ago You’d end up with giant blue city states within the border of red rural / suburban states. I wonder how this would work on the long run. Blue cities might just go gang busters to get more senators. But there is a distinct lack of representation all over. Lots of blue cities control otherwise red states. (Chicago, portland; Seattle, etc) permalink parent award report block reply Scatter-Shot 10 points 5 days ago My main concern are representation and freedom of association. Representation in that rural conservative counties repeatedly get outvoted by liberal urban areas and big cities and Liberals are running the state with little regard for the right. At this point, you have to ask what is the point of staying in the state? Of course, people have taken root in their communities, so instead of moving to a red state, why not secede to the neighboring red state? I live in Vancouver, BC and it makes no sense that Washington's 2nd District is D+12 when up in Canada, that stretch of Canada along the US/Canada border are Conservatives. This is clear gerrymandering to dilute the Conservative areas with Bellingham. If Olympia continues to disenfranchise their Conservative residents, why not secede to Idaho? As for Freedom of association, I do not think the current method of the state the counties are seceding from have to agree to the secession. permalink parent award report block reply ChaplainTappman 2 points 4 days ago Constitutionally both state legislature have to get US congress permission to move lines. Obviously the losing state doesn't want to lose their gerrymandering territory. Solution is a convention of states. permalink parent award report block reply\nScatter-Shot 10 points 5 days ago My main concern are representation and freedom of association. Representation in that rural conservative counties repeatedly get outvoted by liberal urban areas and big cities and Liberals are running the state with little regard for the right. At this point, you have to ask what is the point of staying in the state? Of course, people have taken root in their communities, so instead of moving to a red state, why not secede to the neighboring red state? I live in Vancouver, BC and it makes no sense that Washington's 2nd District is D+12 when up in Canada, that stretch of Canada along the US/Canada border are Conservatives. This is clear gerrymandering to dilute the Conservative areas with Bellingham. If Olympia continues to disenfranchise their Conservative residents, why not secede to Idaho? As for Freedom of association, I do not think the current method of the state the counties are seceding from have to agree to the secession. permalink parent award report block reply ChaplainTappman 2 points 4 days ago Constitutionally both state legislature have to get US congress permission to move lines. Obviously the losing state doesn't want to lose their gerrymandering territory. Solution is a convention of states. permalink parent award report block reply\nChaplainTappman 2 points 4 days ago Constitutionally both state legislature have to get US congress permission to move lines. Obviously the losing state doesn't want to lose their gerrymandering territory. Solution is a convention of states. permalink parent award report block reply\ndukeofdoorcounty 3 points 4 days ago West Virginia didn't want to be a slave state so they left Virginia.  I don't see how the border can't be moved again permalink parent award report block reply\nMr_Rightside OP 24 points 5 days ago https://x.com/TheCalvinCooli1/status/1986987357812498633 FOR IMMEDIATE RELEASE: West Virginia Senator Chris Rose Introduces Resolution Inviting Virginia and Maryland Counties to Join the Mountain State Maidsville, WV – November 5, 2025 – Today, West Virginia State Senator Chris Rose introduced a Senate Resolution inviting 27 counties from Virginia and three from Maryland to consider joining West Virginia, aiming to strengthen regional ties and promote shared Appalachian values. The resolution highlights the historical precedent set by West Virginia's formation in 1863, when counties separated from Virginia amid national division. It invites the Virginia counties of Alleghany, Augusta, Bath, Bland, Buchanan, Carroll, Clarke, Craig, Dickenson, Frederick, Giles, Grayson, Highland, Lee, Page, Patrick, Rappahannock, Rockingham, Russell, Scott, Shenandoah, Smyth, Tazewell, Warren, Washington, Wise, and Wythe, along with Maryland's Allegany, Garrett, and Washington counties, to explore unification. These areas share geographic, economic, cultural, and historical connections with West Virginia, including a strong Appalachian heritage, rural lifestyles, and a focus on individual liberties. Senator Rose emphasized that the move could address residents' concerns over policies in their current states that may not align with local priorities, such as Second Amendment rights, economic development, and rural representation. \"This resolution is about empowering communities to choose governance that truly reflects their values and needs,\" said Senator Rose. \"West Virginia was born from the spirit of self-determination, and we're extending that invitation to our neighbors who share our way of life. By uniting, we can foster economic growth, better infrastructure, and a stronger voice for Appalachia.\" The resolution notes that such a realignment would require approval from the Virginia and Maryland legislatures, as well as the U.S. Congress, under Article IV, Section 3 of the Constitution. It encourages discussions, referenda, and collaboration among residents, local governments, and state leaders. Copies of the resolution will be sent to the governors and legislative leaders of Virginia and Maryland, the specified county commissions, and West Virginia's congressional delegation. permalink award report block reply\nTheJakeFroggy 18 points 5 days ago I mean, considering the elections that just happened in Virginia, I'm sure that those parts of Virginia would love to be lumped with West Virginia instead. It'd almost be like saying fuck you to Jay Jones. permalink award report block reply\nBriankitis 16 points 5 days ago Just add NOVA to dc and that fixes Virginia permalink award report block reply neodanger 1 points 4 days ago 33 square miles of it once was part of DC permalink parent award report block reply\nneodanger 1 points 4 days ago 33 square miles of it once was part of DC permalink parent award report block reply\nUCantStumpTheTrump 12 points 5 days ago I can get behind this on a national level. All states that have major blue-infested counties essentially split off the blue areas and merge with their most conservative neighbor, hamstringing the Democrats’ industrial-scale election vote rigging in the metro areas permalink award report block reply wartooth6 8 points 5 days ago I've had similar thoughts for a while.  Many problems can probably be addressed by redrawing state lines, rather than secession or full blown civil war. permalink parent award report block reply\nwartooth6 8 points 5 days ago I've had similar thoughts for a while.  Many problems can probably be addressed by redrawing state lines, rather than secession or full blown civil war. permalink parent award report block reply\nJohnnyRotten 8 points 5 days ago And this will continue to happen until the SCOTUS strikes down Baker v Carr and Reynolds v Sims which gave the population centers total dominion over state politics.  Those two cases essentially declared the US Senate and similar geography based legislative bodies unconstitutional save for the fact that the Senate is defined in Article 1. permalink award report block reply\nThan0sIII 6 points 5 days ago Best Virginia. permalink award report block reply\nHaiti_kid 5 points 5 days ago VA will have no chance of ever going Red though. Maybe it already doesnt anyway. permalink award report block reply Dangerous 9 points 5 days ago It... was red. The outgoing governor is a Republican and the losing GOP candidate is his Lieutenant Governor. Both won elections to get those seats. EDIT to further this point, look up the story about Sage's law and the support it held. The entire problem in Virginia is Northern Virginia leading into DC, which is full of psychotic leftists and foreigners. permalink parent award report block reply TruthyBrat 3 points 5 days ago Absent a huge reduction in the Federal workforce, probably not. We can hope. permalink parent award report block reply\nDangerous 9 points 5 days ago It... was red. The outgoing governor is a Republican and the losing GOP candidate is his Lieutenant Governor. Both won elections to get those seats. EDIT to further this point, look up the story about Sage's law and the support it held. The entire problem in Virginia is Northern Virginia leading into DC, which is full of psychotic leftists and foreigners. permalink parent award report block reply\nTruthyBrat 3 points 5 days ago Absent a huge reduction in the Federal workforce, probably not. We can hope. permalink parent award report block reply\nFor_All_Mankind 3 points 5 days ago Pointless. It won’t pass. Idk why they do this stuff. It literally is pointless. permalink award report block reply Tryhardneckbeard 2 points 5 days ago Because its worth reminding people that the current borders are dogshit.  Let the Metro Areas do Metro shit, let the rest of the country live on in peace without em. California and Texas need to be split in two for the good of the country.  Their metro areas hold hostage way too many Americans because of the Electoral Vote implications. permalink parent award report block reply breadbaker 1 points 5 days ago Pointless. It won’t pass. Idk why they do this stuff. It literally is pointless. It's the republican version of performing arts. permalink parent award report block reply\nTryhardneckbeard 2 points 5 days ago Because its worth reminding people that the current borders are dogshit.  Let the Metro Areas do Metro shit, let the rest of the country live on in peace without em. California and Texas need to be split in two for the good of the country.  Their metro areas hold hostage way too many Americans because of the Electoral Vote implications. permalink parent award report block reply\nbreadbaker 1 points 5 days ago Pointless. It won’t pass. Idk why they do this stuff. It literally is pointless. It's the republican version of performing arts. permalink parent award report block reply\npossibletower 3 points 5 days ago Rename West Virginia while they're at it too to a cooler sounding name rather than having shitty Virginia in their state name permalink award report block reply sicarius 8 points 5 days ago West Virginia can change their name to Virginia, and Virginia can change its names to DC HomoSuburbia permalink parent award report block reply\nsicarius 8 points 5 days ago West Virginia can change their name to Virginia, and Virginia can change its names to DC HomoSuburbia permalink parent award report block reply\nRedpilled2Depression 3 points 5 days ago If the Greater Idaho movement is successful, expect a wave of other states like here for redistricting efforts. permalink award report block reply SanityGumby 1 points 4 days ago I’d almost expect some PA counties near Pittsburgh to want to break off to WV and Ohio. permalink parent award report block reply\nSanityGumby 1 points 4 days ago I’d almost expect some PA counties near Pittsburgh to want to break off to WV and Ohio. permalink parent award report block reply\nMAGASQUAD 3 points 4 days ago State lines need to be completely redrawn. permalink award report block reply\nShitsbrokeyo 3 points 5 days ago West coast has been trying to do this for over a decade.  Western WA into ID, northern CA into OR. permalink award report block reply\nrupok2 3 points 5 days ago Wv best virginia permalink award report block reply\nDangerous 3 points 5 days ago This is extra funny when you understand why West Virginia exists at all kek Also a huge swath of potential western counties that would probably live to join this little movement are being excluded because of Albermarle, specifically the city of Charlottesville. permalink award report block reply Counterwhat 1 points 4 days ago Charlottesville is communist haven right now. They literally voted the main arsonist from the BLM soup to the school board to teach and set policy for the city kids. It's crazy this piece of garbage is what they want running the schools. I go to Charlottesville less and less. \"In early 2016, Bryant petitioned the Charlottesville City Council to remove the Robert E. Lee Statue and rename the park of the same name it was located in.\" https://cvillepedia.org/Zyahna_Bryant permalink parent award report block reply\nCounterwhat 1 points 4 days ago Charlottesville is communist haven right now. They literally voted the main arsonist from the BLM soup to the school board to teach and set policy for the city kids. It's crazy this piece of garbage is what they want running the schools. I go to Charlottesville less and less. \"In early 2016, Bryant petitioned the Charlottesville City Council to remove the Robert E. Lee Statue and rename the park of the same name it was located in.\" https://cvillepedia.org/Zyahna_Bryant permalink parent award report block reply\nJackOfAllTirades 2 points 5 days ago By God. permalink award report block reply\nTailgunnerjoe 2 points 4 days ago Maybe this can start a trend.  East California should petition to join Nevada permalink award report block reply\nSavingPrivateGrace 2 points 5 days ago Can't see it happening without a fight. permalink award report block reply\nspinometer2 2 points 5 days ago Every state should do this. Let's have a reshuffling of contiguous counties. Do it all at once. In fact, we should do it every 50 years.  And at the same time Congress gets a mandated complete refresh, not by term limits, just all new people must serve in that next Congress. Pass an amendment. Keep things interesting. permalink award report block reply\nChoppermagic 2 points 5 days ago Greater Virginia permalink award report block reply\nNoticesBugleOWO 2 points 5 days ago MECHA-VIRGINIA IS GO! permalink award report block reply\ndres3 2 points 5 days ago because of continuous boundaries or whatever the fine print is. the Top-yellow is likely to be a problem. permalink award report block reply Michalusmichalus 1 points 4 days ago I live in Allegany County. That's a top yellow county. We in Western MD have nothing in common with MoCo ( federal employee land) but, Moore Bullshit is trying to gerrymander those of us in the Appalachian Mountains into MoCo to flip the district. This is after it was fixed a few years ago in court. I posted an article a few days ago. permalink parent award report block reply\nMichalusmichalus 1 points 4 days ago I live in Allegany County. That's a top yellow county. We in Western MD have nothing in common with MoCo ( federal employee land) but, Moore Bullshit is trying to gerrymander those of us in the Appalachian Mountains into MoCo to flip the district. This is after it was fixed a few years ago in court. I posted an article a few days ago. permalink parent award report block reply\njournalist 2 points 5 days ago I see Loudoun County was left off the invitation…lol permalink award report block reply chickeninoven 3 points 4 days ago No Faggots Allowed permalink parent award report block reply\nchickeninoven 3 points 4 days ago No Faggots Allowed permalink parent award report block reply\ntexas4ever 2 points 5 days ago This stuff never happens. permalink award report block reply\nFromTheTopRope 1 points 5 days ago The North shall ride again! permalink award report block reply\nChickenbaconpoutine 1 points 5 days ago Best Virginia permalink award report block reply\npatrioticwinning3 1 points 5 days ago Sounds like a plan! permalink award report block reply\nFreshasabreeze 1 points 4 days ago They should have included Western Pennsylvania, as well. With the exception of Pittsburgh, those folks would fit right in here! Trump country! permalink award report block reply\nDT170x 1 points 5 days ago Expand by one county,Please you soo close. permalink award report block reply\nRememberCharlieKirk 1 points 5 days ago Addendum: Change the name of the state, too. The naming of West Virginia gives the sense of a directional command, be that \"west of Virginia\" or like \"go west from Virginia,\" instead of a what it should be -- a declaration of a name -- thereby reducing West Virginia's standing of statehood as nothing but an auxiliary of another state. permalink award report block reply\nWar_Hamster 1 points 4 days ago Fun idea, but only Constitutional if Virginia and/or Maryland agree to cede territory. Since that’s not happening, this is a dead issue just like New California and Greater Idaho are. But it does bring up an historical point. West Virginia was created when several counties split off from Virginia during the “civil war” without Virginia’s permission. If secession wasn’t legal, as Lincolnians claim, then West Virginia couldn’t exist legally. Also, West Virginia was admitted as a slave State, so that hole talking point about the war being about slavery doesn’t work either. permalink award report block reply\n5DchessWatch 1 points 4 days ago It did not work for Idaho-Oregon ('greater idaho').  They had ONE county to go.  Only one, and it didn't happen.  I wanted it SO bad to happen.  I lived in portland for a year and it would be a good revenge for that whole shit experience. They should set a time limit to ratify, and if any counteis back out, make the project so that they can back out and the remaining counties still can join WVa permalink award report block reply\nDaffy 1 points 5 days ago Will never happen. Maryland and VA would lever allow the border change. permalink award report block reply Michalusmichalus 1 points 4 days ago It's not the first time this has been suggested. Western MD wrote letters about leaving when it was gerrymandered out of representation a few yrs back. Moore Bullshit is in the news intentionally gerrymandering again. permalink parent award report block reply\nMichalusmichalus 1 points 4 days ago It's not the first time this has been suggested. Western MD wrote letters about leaving when it was gerrymandered out of representation a few yrs back. Moore Bullshit is in the news intentionally gerrymandering again. permalink parent award report block reply\nrumathlete14 1 points 4 days ago I actually think all of west va and va should rejoin. I think together, we could combat against northern va. permalink award report block reply\nEffingWhiteMale 1 points 4 days ago In the words of media mogul and manipulator Elliot Carver from Tomorrow Never Dies, the most important question in any story is not the who, the what, where or when, but the why.  That is what seems to be missing from this post. permalink award report block reply\nMichalusmichalus 1 points 4 days ago I'm in Western MD, and we should go. We have nothing in common with federal employee land down by DC. permalink award report block reply\nstripperlover 1 points 4 days ago god that would be awesome. permalink award report block reply\nHyperboreanGodTwink 0 points 5 days ago Not to be a Debbie Doomer, but blue states will never agree to this for one simple reason: the reverse will never happen. Blue cities are usually in the center of states. In order for those counties to change hands there would need to be a huge carveout of land that doesn't agree in order to reach the cities. permalink award report block reply lizardo221 2 points 5 days ago Just to add, the states giving up counties have to agree to give them up. This is like asking slave masters to free their slaves. permalink parent award report block reply Michalusmichalus 1 points 4 days ago No, they prefer to gerrymander the people that disagree with them out of representation. permalink parent award report block reply lizardo221 0 points 4 days ago While I completely agree on why they gerrymander, that is not really relavent to what I was saying in this thread. I'm simply explaining mechanically why it is generally not possible for a red county to leave a blue state. permalink parent award report block reply Michalusmichalus 1 points 4 days ago You clearly forgot how the states got their shapes. It was due to the population required for statehood. permalink parent award report block reply view 1 more comments...\nlizardo221 2 points 5 days ago Just to add, the states giving up counties have to agree to give them up. This is like asking slave masters to free their slaves. permalink parent award report block reply Michalusmichalus 1 points 4 days ago No, they prefer to gerrymander the people that disagree with them out of representation. permalink parent award report block reply lizardo221 0 points 4 days ago While I completely agree on why they gerrymander, that is not really relavent to what I was saying in this thread. I'm simply explaining mechanically why it is generally not possible for a red county to leave a blue state. permalink parent award report block reply Michalusmichalus 1 points 4 days ago You clearly forgot how the states got their shapes. It was due to the population required for statehood. permalink parent award report block reply view 1 more comments...\nMichalusmichalus 1 points 4 days ago No, they prefer to gerrymander the people that disagree with them out of representation. permalink parent award report block reply lizardo221 0 points 4 days ago While I completely agree on why they gerrymander, that is not really relavent to what I was saying in this thread. I'm simply explaining mechanically why it is generally not possible for a red county to leave a blue state. permalink parent award report block reply Michalusmichalus 1 points 4 days ago You clearly forgot how the states got their shapes. It was due to the population required for statehood. permalink parent award report block reply view 1 more comments...\nlizardo221 0 points 4 days ago While I completely agree on why they gerrymander, that is not really relavent to what I was saying in this thread. I'm simply explaining mechanically why it is generally not possible for a red county to leave a blue state. permalink parent award report block reply Michalusmichalus 1 points 4 days ago You clearly forgot how the states got their shapes. It was due to the population required for statehood. permalink parent award report block reply view 1 more comments...\nMichalusmichalus 1 points 4 days ago You clearly forgot how the states got their shapes. It was due to the population required for statehood. permalink parent award report block reply view 1 more comments...\nDiversity_Fire -3 points 5 days ago Against the Constitution permalink award report block reply",
  "fetched_at": "2025-11-12T20:16:16.001125Z"
}