{
  "id": "1ARK9nOFx3",
  "url": "https://patriots.win/p/1ARK9nOFx3/wtf-is-wrong-with-all-these-fuck/c",
  "content": "72 WTF is wrong with all these fucking muslims being elected here? posted 8 hours ago by wst4 14 comments award share download report block\n14 comments Sort by Top Top New Worst Old Save Around the Web Ostia 11 points 8 hours ago You’re either a complete moron who shouldn’t be allowed to speak in public, or a troll that shouldn’t allowed to speak in public. permalink award report block reply coiffeuse2 3 points 8 hours ago bot or troll? permalink parent award report block reply Ostia 3 points 8 hours ago Computers aren’t this stupid. permalink parent award report block reply Porkbut 0 points 7 hours ago Wow, bots yelling at each other which is more stupid, bukakke theater at its finest! permalink parent award report block reply coiffeuse2 8 points 8 hours ago Stolen elections have consequences.. it's time for legislation that if you're not born here you can't run for or be involved, or even donate to politics - period. Shall I write the resolution? permalink award report block reply C0drus 2 points 5 hours ago “Stolen elections have consequences” Apparently not 🙄 permalink parent award report block reply GhostOfTheRepublic 7 points 8 hours ago wrong brand of towel head, dude. permalink award report block reply SurfandTurf 3 points 8 hours ago You’re joking, right? permalink award report block reply HumblePepe 2 points 7 hours ago I don't know what's more sad. Your post or the people up voting it. He's a Sikh, not muslim. permalink award report block reply FreedomLubber 2 points 8 hours ago It’s part of the invasion plan permalink award report block reply Th0mas_Paine 1 points 7 hours ago Man I don't know. Also WTF was going on when that second airliner hit that world trade center tower on the same day another airliner hit a world trade center tower. People are just dumber now. Back then everyone recognized an obvious attack after just a couple planes. permalink award report block reply corntortilla 1 points 5 hours ago Are you stupid? permalink award report block reply Lurker404 1 points 7 hours ago It's funny how people used to put sikhs on a pedestal as \"one of the good ones\" and now they're nothing but another street shitting 3rd worlder. permalink award report block reply sleepinggiant 1 points 8 hours ago Thats a seik permalink award report block reply\nOstia 11 points 8 hours ago You’re either a complete moron who shouldn’t be allowed to speak in public, or a troll that shouldn’t allowed to speak in public. permalink award report block reply coiffeuse2 3 points 8 hours ago bot or troll? permalink parent award report block reply Ostia 3 points 8 hours ago Computers aren’t this stupid. permalink parent award report block reply Porkbut 0 points 7 hours ago Wow, bots yelling at each other which is more stupid, bukakke theater at its finest! permalink parent award report block reply\ncoiffeuse2 3 points 8 hours ago bot or troll? permalink parent award report block reply Ostia 3 points 8 hours ago Computers aren’t this stupid. permalink parent award report block reply\nOstia 3 points 8 hours ago Computers aren’t this stupid. permalink parent award report block reply\nPorkbut 0 points 7 hours ago Wow, bots yelling at each other which is more stupid, bukakke theater at its finest! permalink parent award report block reply\ncoiffeuse2 8 points 8 hours ago Stolen elections have consequences.. it's time for legislation that if you're not born here you can't run for or be involved, or even donate to politics - period. Shall I write the resolution? permalink award report block reply C0drus 2 points 5 hours ago “Stolen elections have consequences” Apparently not 🙄 permalink parent award report block reply\nC0drus 2 points 5 hours ago “Stolen elections have consequences” Apparently not 🙄 permalink parent award report block reply\nGhostOfTheRepublic 7 points 8 hours ago wrong brand of towel head, dude. permalink award report block reply\nSurfandTurf 3 points 8 hours ago You’re joking, right? permalink award report block reply\nHumblePepe 2 points 7 hours ago I don't know what's more sad. Your post or the people up voting it. He's a Sikh, not muslim. permalink award report block reply\nFreedomLubber 2 points 8 hours ago It’s part of the invasion plan permalink award report block reply\nTh0mas_Paine 1 points 7 hours ago Man I don't know. Also WTF was going on when that second airliner hit that world trade center tower on the same day another airliner hit a world trade center tower. People are just dumber now. Back then everyone recognized an obvious attack after just a couple planes. permalink award report block reply\ncorntortilla 1 points 5 hours ago Are you stupid? permalink award report block reply\nLurker404 1 points 7 hours ago It's funny how people used to put sikhs on a pedestal as \"one of the good ones\" and now they're nothing but another street shitting 3rd worlder. permalink award report block reply\nsleepinggiant 1 points 8 hours ago Thats a seik permalink award report block reply",
  "fetched_at": "2025-11-12T23:17:00.515956Z"
}