{
  "id": "1ARK9iqwv2",
  "url": "https://patriots.win/p/1ARK9iqwv2/we-didnt-say/c",
  "content": "753 We Didn't Say posted 2 days ago by Wizard_Glick 16 comments award share download report block\n16 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style magapatriot_pa 10 points 2 days ago The worst (people like Jose Ibarra, the \"Maryland Man\" Kill-More Abrego Garcia and all the other rapists and killers) should never have been here in the first place. The discussion has always been about the people who pick your lettuce and pretending otherwise is simply disingenuous permalink award report block reply Glory-Unto-God 9 points 2 days ago Deporting people such as them is silly. Declaring them outlaws and killing them is the correct course of action permalink parent award report block reply Standingoak 3 points 2 days ago Bet this would work good for clearing the last 10-20 %. ( Would need ear tags. But the bigger penalties for error would make it Interesting ) permalink parent award report block reply PeterThielAntiChrist 2 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink parent award report block reply Bubbahax 1 points 2 days ago Exactly.  They just turn around and come back at the first opportunity. permalink parent award report block reply patrioticwinning3 4 points 2 days ago EVERY!  SINGLE!  ONE! permalink award report block reply DeportThemAllForever 3 points 2 days ago 200% permalink parent award report block reply PeterThielAntiChrist 1 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink parent award report block reply ThisTrainHasNoBrakes 4 points 2 days ago ” you dropped this! permalink award report block reply Getelectedordietryin 3 points 2 days ago I voted for retribution and deporting whole families permalink award report block reply PeterThielAntiChrist 1 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink parent award report block reply Shaffro 2 points 2 days ago Deport them all! permalink award report block reply PeterThielAntiChrist 1 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink parent award report block reply PeterThielAntiChrist 1 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink award report block reply Psalm-118_24 1 points 1 day ago PLEASE, for the love of GOD, start deporting the islamists. permalink award report block reply barwhack 0 points 2 days ago We didn't say \"MIGA\", either. Nor \"Epstard killed himself\". Nor \"How about MORE AND LONGER-TERM debt\". Nor \"America Too\". permalink award report block reply\nmagapatriot_pa 10 points 2 days ago The worst (people like Jose Ibarra, the \"Maryland Man\" Kill-More Abrego Garcia and all the other rapists and killers) should never have been here in the first place. The discussion has always been about the people who pick your lettuce and pretending otherwise is simply disingenuous permalink award report block reply Glory-Unto-God 9 points 2 days ago Deporting people such as them is silly. Declaring them outlaws and killing them is the correct course of action permalink parent award report block reply Standingoak 3 points 2 days ago Bet this would work good for clearing the last 10-20 %. ( Would need ear tags. But the bigger penalties for error would make it Interesting ) permalink parent award report block reply PeterThielAntiChrist 2 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink parent award report block reply Bubbahax 1 points 2 days ago Exactly.  They just turn around and come back at the first opportunity. permalink parent award report block reply\nGlory-Unto-God 9 points 2 days ago Deporting people such as them is silly. Declaring them outlaws and killing them is the correct course of action permalink parent award report block reply Standingoak 3 points 2 days ago Bet this would work good for clearing the last 10-20 %. ( Would need ear tags. But the bigger penalties for error would make it Interesting ) permalink parent award report block reply PeterThielAntiChrist 2 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink parent award report block reply Bubbahax 1 points 2 days ago Exactly.  They just turn around and come back at the first opportunity. permalink parent award report block reply\nStandingoak 3 points 2 days ago Bet this would work good for clearing the last 10-20 %. ( Would need ear tags. But the bigger penalties for error would make it Interesting ) permalink parent award report block reply\nPeterThielAntiChrist 2 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink parent award report block reply\nBubbahax 1 points 2 days ago Exactly.  They just turn around and come back at the first opportunity. permalink parent award report block reply\npatrioticwinning3 4 points 2 days ago EVERY!  SINGLE!  ONE! permalink award report block reply DeportThemAllForever 3 points 2 days ago 200% permalink parent award report block reply PeterThielAntiChrist 1 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink parent award report block reply\nDeportThemAllForever 3 points 2 days ago 200% permalink parent award report block reply\nPeterThielAntiChrist 1 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink parent award report block reply\nThisTrainHasNoBrakes 4 points 2 days ago ” you dropped this! permalink award report block reply\nGetelectedordietryin 3 points 2 days ago I voted for retribution and deporting whole families permalink award report block reply PeterThielAntiChrist 1 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink parent award report block reply\nPeterThielAntiChrist 1 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink parent award report block reply\nShaffro 2 points 2 days ago Deport them all! permalink award report block reply PeterThielAntiChrist 1 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink parent award report block reply\nPeterThielAntiChrist 1 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink parent award report block reply\nPeterThielAntiChrist 1 points 2 days ago your'e going to get maybe 15% of them out in the time allotted. 1/2 will return. permalink award report block reply\nPsalm-118_24 1 points 1 day ago PLEASE, for the love of GOD, start deporting the islamists. permalink award report block reply\nbarwhack 0 points 2 days ago We didn't say \"MIGA\", either. Nor \"Epstard killed himself\". Nor \"How about MORE AND LONGER-TERM debt\". Nor \"America Too\". permalink award report block reply",
  "fetched_at": "2025-11-12T23:00:29.403026Z"
}