{
  "id": "8184692",
  "title": "275Washington will ensure she has a looooong, rewarding career after Trump.  All she has to do is NO",
  "url": "https://patriots.win/p/1ARK9mGxxS/washington-will-ensure-she-has-a/c",
  "content": "275 Washington will ensure she has a looooong, rewarding career after Trump.  All she has to do is NOTHING for just a little longer... 🚽   DRAIN THE SWAMP   🚽 posted 12 hours ago by weltallic 13 comments award share download report block\n13 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style jcd_007 15 points 11 hours ago Why can’t we get a decent AG? permalink award report block reply Metal4Freedom 14 points 11 hours ago Uniparty says no. permalink parent award report block reply TrumpPl4yedU 1 points 5 hours ago Comment removed upon the user being banned. permalink parent award report block reply -Evspra 13 points 11 hours ago she's in her current position cause she helped epstein in florida 🤷‍♂️ permalink award report block reply Duke442games 9 points 11 hours ago It's getting to the point where nearly everyone can see Trump sold us out. Very blackpilled after that H1b/600k Chinese student interview and the worthless people like Pam & Kash in the Trump administration. permalink award report block reply Shaffro 4 points 9 hours ago Every one of Trumps AG hire are useless. Look at how rapid Garland was. permalink award report block reply Schweddynadzbackup 3 points 6 hours ago A face held together with Bondo. \"Bondo Bondi\" if you will. permalink award report block reply wst4 1 points 5 hours ago Nailed it! permalink parent award report block reply Supersaying 2 points 8 hours ago I have chicks that look like dude’s fatigue. permalink award report block reply lifeisahologram 2 points 7 hours ago She’s mid 60s too right? Why do old people love being so old and useless in politics until they die? permalink award report block reply Briben 1 points 3 hours ago She only needs to hold out another year.  No special counsels appointed btw. permalink award report block reply IAmRetard 1 points 6 hours ago Sure looks like it permalink award report block reply wst4 1 points 5 hours ago Such a letdown, I want Alex Jones to replace her ASAP! permalink award report block reply Pats5x 1 points 4 hours ago it's really amazing how we had so much momentum, so much promise...and EVERYTHING changed the day he fucking bombed Iran.  It's been a \"complete and total\" downward spiral since then.  We're going to see a D+15-20 house come Jn 27, and what's trump going to do when he's impeached after he called us all assholes for wanting the Epstein files?  At this point, as a guy with a family, mortgage, etc., all I'm coming away with at this point is a strong investment portfolio and maybe 1,200 less in taxes from the big beautiful bullshit bill from Trump's second term. permalink award report block reply\njcd_007 15 points 11 hours ago Why can’t we get a decent AG? permalink award report block reply Metal4Freedom 14 points 11 hours ago Uniparty says no. permalink parent award report block reply TrumpPl4yedU 1 points 5 hours ago Comment removed upon the user being banned. permalink parent award report block reply\nMetal4Freedom 14 points 11 hours ago Uniparty says no. permalink parent award report block reply\nTrumpPl4yedU 1 points 5 hours ago Comment removed upon the user being banned. permalink parent award report block reply\n-Evspra 13 points 11 hours ago she's in her current position cause she helped epstein in florida 🤷‍♂️ permalink award report block reply\nDuke442games 9 points 11 hours ago It's getting to the point where nearly everyone can see Trump sold us out. Very blackpilled after that H1b/600k Chinese student interview and the worthless people like Pam & Kash in the Trump administration. permalink award report block reply\nShaffro 4 points 9 hours ago Every one of Trumps AG hire are useless. Look at how rapid Garland was. permalink award report block reply\nSchweddynadzbackup 3 points 6 hours ago A face held together with Bondo. \"Bondo Bondi\" if you will. permalink award report block reply wst4 1 points 5 hours ago Nailed it! permalink parent award report block reply\nwst4 1 points 5 hours ago Nailed it! permalink parent award report block reply\nSupersaying 2 points 8 hours ago I have chicks that look like dude’s fatigue. permalink award report block reply\nlifeisahologram 2 points 7 hours ago She’s mid 60s too right? Why do old people love being so old and useless in politics until they die? permalink award report block reply\nBriben 1 points 3 hours ago She only needs to hold out another year.  No special counsels appointed btw. permalink award report block reply\nIAmRetard 1 points 6 hours ago Sure looks like it permalink award report block reply\nwst4 1 points 5 hours ago Such a letdown, I want Alex Jones to replace her ASAP! permalink award report block reply\nPats5x 1 points 4 hours ago it's really amazing how we had so much momentum, so much promise...and EVERYTHING changed the day he fucking bombed Iran.  It's been a \"complete and total\" downward spiral since then.  We're going to see a D+15-20 house come Jn 27, and what's trump going to do when he's impeached after he called us all assholes for wanting the Epstein files?  At this point, as a guy with a family, mortgage, etc., all I'm coming away with at this point is a strong investment portfolio and maybe 1,200 less in taxes from the big beautiful bullshit bill from Trump's second term. permalink award report block reply"
}