{
  "id": "1ARK9mFrZ0",
  "url": "https://patriots.win/p/1ARK9mFrZ0/i-thought-that-antifa-was-declar/c",
  "content": "411 I Thought That Antifa Was Declared Domestic Terrorists. What the hell is going on? They only seem to be emboldened. SAVE AMERICA posted 21 hours ago by Hangemh1gh 24 comments award share report block\n24 comments Sort by Top Top New Worst Old Save Pepe_longcockings 32 points 21 hours ago Idk but i will always upvote Napolearm Blownapart permalink award report block reply Seatacjoe 10 points 17 hours ago 😂 permalink parent award report block reply Coprolite 17 points 20 hours ago And to think they tried to claim he was holding a cellphone. permalink award report block reply BlockWorks 11 points 20 hours ago They were holding radios in the re-release of E.T. permalink parent award report block reply ElevenMile 16 points 21 hours ago This is Kyle, right? I never looked at any of that video. Badass mf permalink award report block reply JustAnotherPsyopNPC 10 points 20 hours ago Summer of love had some crazy streams/footage. permalink parent award report block reply America_No_1 3 points 19 hours ago He really did try to get away and IMO should have fired long before he did. permalink parent award report block reply notCIA 3 points 18 hours ago It is. Glad he's ok these days. permalink parent award report block reply RYTHMICRIOT 12 points 21 hours ago Remember, Biden met with that fuck. Don't tell me it's coincidence. From the web: Joe Biden was photographed shaking hands with Gaige Grosskreutz, a participant in the 2020 Kenosha protests who was shot in the arm by Kyle Rittenhouse during the unrest.\nThe encounter occurred on April 22, 2022, and was shared on social media by journalist Michael Gallas, sparking controversy and criticism from conservative commentators.\nGrosskreutz testified during Rittenhouse’s trial that he had carried a loaded handgun to the protest and pointed it at Rittenhouse while advancing toward him, moments before being shot. permalink award report block reply DeanGus2 9 points 20 hours ago Saint Kyle showed us how many pedophiles are in antifa permalink award report block reply TheJakeFroggy 6 points 21 hours ago If the Trump admin won't crush them, then the Proud Boys and Oathkeepers will need to come back and do the job. permalink award report block reply Prandogolio 6 points 21 hours ago This is the only solution to communists destroying the nation.  You all know it's true. permalink award report block reply AL_Rise 5 points 20 hours ago Glorious pink mist permalink award report block reply Jodokon92 4 points 19 hours ago And he also killed a pedo and a wife beater. permalink award report block reply FateOfNorns 4 points 20 hours ago Maybe something to do with having a useless AG and that a certain bureau that resides within her department and that officially would lead domestic counter-terrorism efforts is run by a useless director who is controlled by a a hostile nation's honeypot and his bureau's staff is chock full of antifa fellow travellers. permalink award report block reply America_No_1 3 points 19 hours ago On the ground and cornered is about as textbook self defense as it gets...why did this even go to trial? permalink award report block reply GoldenSpirals 3 points 20 hours ago Did he change his name again after making the news with his new identity? permalink award report block reply SemperFidelis231 2 points 17 hours ago Yes, they were declared domestic terrorists. Problem is... That doesn't mean anything. There is no legal mechanism or weight behind labelling something a domestic terrorist organization. What DOES carry weight is labelling them as a foreign terrorist organization. That opens up fun and exciting options like the PATRIOT Act. permalink award report block reply FlyCatcher94 2 points 11 hours ago No one is going after them permalink award report block reply lifeisahologram 2 points 11 hours ago Love how he shot his dominant arm permalink award report block reply learntocode 2 points 16 hours ago GLOBOSHLOMO NEEDS A US CIVIL WAR permalink award report block reply learntocode 2 points 16 hours ago I am gonna start an H1B company to hire Indians to street fight Antifa. permalink award report block reply learntocode 1 points 16 hours ago Jokes is on you Globalists. Americans got outsourced, we dont go out and fight randos in the streets. permalink award report block reply SCHULTZ 0 points 21 hours ago Comment removed by community moderators. permalink award report block reply\nPepe_longcockings 32 points 21 hours ago Idk but i will always upvote Napolearm Blownapart permalink award report block reply Seatacjoe 10 points 17 hours ago 😂 permalink parent award report block reply\nSeatacjoe 10 points 17 hours ago 😂 permalink parent award report block reply\nCoprolite 17 points 20 hours ago And to think they tried to claim he was holding a cellphone. permalink award report block reply BlockWorks 11 points 20 hours ago They were holding radios in the re-release of E.T. permalink parent award report block reply\nBlockWorks 11 points 20 hours ago They were holding radios in the re-release of E.T. permalink parent award report block reply\nElevenMile 16 points 21 hours ago This is Kyle, right? I never looked at any of that video. Badass mf permalink award report block reply JustAnotherPsyopNPC 10 points 20 hours ago Summer of love had some crazy streams/footage. permalink parent award report block reply America_No_1 3 points 19 hours ago He really did try to get away and IMO should have fired long before he did. permalink parent award report block reply notCIA 3 points 18 hours ago It is. Glad he's ok these days. permalink parent award report block reply\nJustAnotherPsyopNPC 10 points 20 hours ago Summer of love had some crazy streams/footage. permalink parent award report block reply\nAmerica_No_1 3 points 19 hours ago He really did try to get away and IMO should have fired long before he did. permalink parent award report block reply\nnotCIA 3 points 18 hours ago It is. Glad he's ok these days. permalink parent award report block reply\nRYTHMICRIOT 12 points 21 hours ago Remember, Biden met with that fuck. Don't tell me it's coincidence. From the web: Joe Biden was photographed shaking hands with Gaige Grosskreutz, a participant in the 2020 Kenosha protests who was shot in the arm by Kyle Rittenhouse during the unrest.\nThe encounter occurred on April 22, 2022, and was shared on social media by journalist Michael Gallas, sparking controversy and criticism from conservative commentators.\nGrosskreutz testified during Rittenhouse’s trial that he had carried a loaded handgun to the protest and pointed it at Rittenhouse while advancing toward him, moments before being shot. permalink award report block reply\nDeanGus2 9 points 20 hours ago Saint Kyle showed us how many pedophiles are in antifa permalink award report block reply\nTheJakeFroggy 6 points 21 hours ago If the Trump admin won't crush them, then the Proud Boys and Oathkeepers will need to come back and do the job. permalink award report block reply\nPrandogolio 6 points 21 hours ago This is the only solution to communists destroying the nation.  You all know it's true. permalink award report block reply\nAL_Rise 5 points 20 hours ago Glorious pink mist permalink award report block reply\nJodokon92 4 points 19 hours ago And he also killed a pedo and a wife beater. permalink award report block reply\nFateOfNorns 4 points 20 hours ago Maybe something to do with having a useless AG and that a certain bureau that resides within her department and that officially would lead domestic counter-terrorism efforts is run by a useless director who is controlled by a a hostile nation's honeypot and his bureau's staff is chock full of antifa fellow travellers. permalink award report block reply\nAmerica_No_1 3 points 19 hours ago On the ground and cornered is about as textbook self defense as it gets...why did this even go to trial? permalink award report block reply\nGoldenSpirals 3 points 20 hours ago Did he change his name again after making the news with his new identity? permalink award report block reply\nSemperFidelis231 2 points 17 hours ago Yes, they were declared domestic terrorists. Problem is... That doesn't mean anything. There is no legal mechanism or weight behind labelling something a domestic terrorist organization. What DOES carry weight is labelling them as a foreign terrorist organization. That opens up fun and exciting options like the PATRIOT Act. permalink award report block reply\nFlyCatcher94 2 points 11 hours ago No one is going after them permalink award report block reply\nlifeisahologram 2 points 11 hours ago Love how he shot his dominant arm permalink award report block reply\nlearntocode 2 points 16 hours ago GLOBOSHLOMO NEEDS A US CIVIL WAR permalink award report block reply\nlearntocode 2 points 16 hours ago I am gonna start an H1B company to hire Indians to street fight Antifa. permalink award report block reply\nlearntocode 1 points 16 hours ago Jokes is on you Globalists. Americans got outsourced, we dont go out and fight randos in the streets. permalink award report block reply\nSCHULTZ 0 points 21 hours ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:15:23.975753Z"
}