{
  "id": "1ARK591is7",
  "url": "https://patriots.win/p/1ARK591is7/one-year-ago-today-trump-was-nam/c",
  "content": "505 One year ago today, Trump was named winner of Arizona, completing a clean sweep of all 7 swing states posted 3 days ago by couranto 4 comments award share download report block\n4 comments Sort by Top Top New Worst Old Save CleanUpPhillyTrump24 4 points 3 days ago That truly was a knife in the heart of the Dem/RINO vote fraud in AZ. It isn't a substitute for the FBI/DOJ prosecutions but it ripped their illusion of control away forever. All that hard work, all that risk, all of that money - and they still could not cheat hard enough. permalink award report block reply FretNoise14 3 points 3 days ago We have a long way to go in AZ.  Hobbs is a major problem, and the two senators from this state are an absolute embarrassment. permalink parent award report block reply Abovethefray 2 points 3 days ago Harris was a truly execrable candidate... those were good days. Now  however;  when are the employers of illegals going to be charged and fined?  Why is that not happening yet? permalink award report block reply Benjovi99 1 points 3 days ago Interesting...it was the first to call BIDEN IN 2020 BUT WHEN ITS TRUMP ITS THE LAST permalink award report block reply\nCleanUpPhillyTrump24 4 points 3 days ago That truly was a knife in the heart of the Dem/RINO vote fraud in AZ. It isn't a substitute for the FBI/DOJ prosecutions but it ripped their illusion of control away forever. All that hard work, all that risk, all of that money - and they still could not cheat hard enough. permalink award report block reply FretNoise14 3 points 3 days ago We have a long way to go in AZ.  Hobbs is a major problem, and the two senators from this state are an absolute embarrassment. permalink parent award report block reply\nFretNoise14 3 points 3 days ago We have a long way to go in AZ.  Hobbs is a major problem, and the two senators from this state are an absolute embarrassment. permalink parent award report block reply\nAbovethefray 2 points 3 days ago Harris was a truly execrable candidate... those were good days. Now  however;  when are the employers of illegals going to be charged and fined?  Why is that not happening yet? permalink award report block reply\nBenjovi99 1 points 3 days ago Interesting...it was the first to call BIDEN IN 2020 BUT WHEN ITS TRUMP ITS THE LAST permalink award report block reply",
  "fetched_at": "2025-11-12T20:46:02.395816Z"
}