{
  "id": "8185269",
  "title": "99They say diversity is our strength. Translation: diversity will be used to destroy Christian value",
  "url": "https://patriots.win/p/1ARK9nOG5J/they-say-diversity-is-our-streng/c",
  "content": "99 They say diversity is our strength. Translation: diversity will be used to destroy Christian values and traditions. posted 4 hours ago by truthtoday2022 6 comments award share download report block\n6 comments Sort by Top Top New Worst Old Save Elon Walked Away – Now We Know Why Read More Ads by Ad.Style MediumBase 6 points 4 hours ago When THEY say it, they mean themselves. It's their strength to use to try to make us knuckle under. permalink award report block reply GA_Logic 2 points 4 hours ago Never bend the knee to the ragheads. That only emboldens them. People forget that ragheads are considered Asian and just like other Asians they only understand might makes right. You have to show strength with any and all of their aggression that is what they respect alone. permalink award report block reply USDMaga 2 points 4 hours ago You aren't allowed to eat bacon in school because it \"offends\" them. However, they won't even let you have a Christmas festival. permalink award report block reply utfanx2 1 points 4 hours ago If islamic terrorists actually tried some mulled wine and sausage, they wouldn't be islamic anymore. permalink award report block reply NotYourMan 1 points 3 hours ago Cultural diversity doesn't work.  It never worked.  Diversity of thought within a culture does work.  But when liberals say \"diversity\" they mean \"take this person because of their race regardless of merit so that I can virtue signal other liberals.\" permalink award report block reply keeptherepublic1776 1 points 3 hours ago The world is heading to a dark place permalink award report block reply\nMediumBase 6 points 4 hours ago When THEY say it, they mean themselves. It's their strength to use to try to make us knuckle under. permalink award report block reply\nGA_Logic 2 points 4 hours ago Never bend the knee to the ragheads. That only emboldens them. People forget that ragheads are considered Asian and just like other Asians they only understand might makes right. You have to show strength with any and all of their aggression that is what they respect alone. permalink award report block reply\nUSDMaga 2 points 4 hours ago You aren't allowed to eat bacon in school because it \"offends\" them. However, they won't even let you have a Christmas festival. permalink award report block reply\nutfanx2 1 points 4 hours ago If islamic terrorists actually tried some mulled wine and sausage, they wouldn't be islamic anymore. permalink award report block reply\nNotYourMan 1 points 3 hours ago Cultural diversity doesn't work.  It never worked.  Diversity of thought within a culture does work.  But when liberals say \"diversity\" they mean \"take this person because of their race regardless of merit so that I can virtue signal other liberals.\" permalink award report block reply\nkeeptherepublic1776 1 points 3 hours ago The world is heading to a dark place permalink award report block reply"
}