{
  "id": "1ARK591SQC",
  "url": "https://patriots.win/p/1ARK591SQC/youtube-censorship-canada-orders/c",
  "content": "659 YOUTUBE CENSORSHIP: CANADA orders channels STRUCK DOWN!! posted 3 days ago by guywholikesDjtof2024 32 comments award share report block Real Talk Politks @realtalkpolitks • 4d YouTube has been falsely TERMINATING creators for “spam” and I’m one of them. They say it’s an “AI error.” But let’s be real, this isn’t a glitch. It’s censorship disguised as automation. ➤ My channel Real Talk Politiks was terminated shortly after CBC (Canada’s state-funded\n32 comments Sort by Top Top New Worst Old Save sobriquet 24 points 3 days ago If you connected your livelihood to YouTube without a backup plan, then you have no one to blame but yourself.  This applies doubly in 2025 when Google/YouTube have proven that they don't give a fuck, and don't owe you shit. Sorry, that sucks, but that's the influencer life. permalink award report block reply Bullet3250 21 points 3 days ago Everyone should be Running away from Youtube and running to Rumble and Getter and Twitter etc... Youtube is a disaster - not only do they deplatform serious players - they DON'T want to 'not deplatform them' If you are 'Right side' on Youtube... it's just a matter of time permalink parent award report block reply Klaus73 5 points 3 days ago Influencer days are numbered - I am seeing more and more AI generated \"influncers\" which made 5-10 channels a DAY usually full of bad news or news that is over a month old. permalink parent award report block reply imnotdeadyet 3 points 3 days ago Yep, and it may happen with their battle with Disney.  It is pissing a out of normies off. permalink parent award report block reply AlmostFullyDilated -1 points 3 days ago rumble sucks ass permalink parent award report block reply lash 1 points 3 days ago And they took Tether money... permalink parent award report block reply Nick-Kerr 2 points 3 days ago Similarly, if you live in Canada, you're retarded. permalink parent award report block reply PiratePatriot 2 points 3 days ago I've learned the savvy influencers have multiple strategies to deal with the censorship. tame versions of content on the leftist censorship platforms. using short highlights, reels with fun content to attract subscribers - build a personality cult following first before tackling the difficult concepts. Keep mixing up the fun with the difficult. more intense versions on the uncensored platforms. long form content, with receipts, explaining their positions. bro talk, to show it is not just the host/creator with these views. multiple accounts under similar names to flood out the clones attempting to hijack their brand/image. NEVER challenge a much larger influencer until they have their own solid cult personality followers to defend them in the comments. use obscure jokes to mock idealogue opponents before diving deep into the topic. (this is more subtle and not always in the same posts) etc.. many more methods. I'm sure there are books and master classes in how to do this. just my observations watching various youtubes etc who do this well. know the debating fallacies and how to  use them to advantage. https://en.wikipedia.org/wiki/List_of_fallacies permalink parent award report block reply MAGABOND 2 points 3 days ago Not much difference from hitching your entire survival on the whims of the government. We all do the same thing to an extent with all of our jobs, only we just go get a new one when we leave. permalink parent award report block reply sobriquet 1 points 3 days ago There's more truth to this than I care to admit. permalink parent award report block reply MAGABOND 2 points 3 days ago I don’t think I could survive the past how I am today, but I wish I was born in a tougher, yet simpler time. permalink parent award report block reply Bullet3250 12 points 3 days ago THis is just another MASSIVE OPPORTUNITY for Elon over at Twitter - to bury Youtube and Take all there channels. permalink award report block reply borisborscht 2 points 3 days ago I want to be at the mercy of an oligarch! permalink parent award report block reply joggin_noggin 2 points 3 days ago Techno-monarchy is probably preferable to the gay techno-oligarchy we're living in now. At least the monarch has an incentive to preserve his domain for future generations. The oligarchs just want to loot the treasury and suck dick. permalink parent award report block reply South_Florida_Guy 8 points 3 days ago If we're going to invade another country and force regime change it should be Canada permalink award report block reply Sgt_Hulka 7 points 3 days ago Agreed. And dont stop there.  Take it all the way back to their puppet masters in the UK.  I’m sure Russia and most of the rest of the world would be happy to either support us or stand down with all the fuckery the UK is responsible for. I’d wager even the UK people would join in to rid themselves of their corrupt parliament and royals once and for all. permalink parent award report block reply Belleoffreedom 1 points 3 days ago It's their country, and so far they are not as bad for sending us violence as Mexico. permalink parent award report block reply Klaus73 1 points 3 days ago Or you could deal with your own problems and be \"left alone\" or is the US actually the horde of oppressor's the left always claimed? permalink parent award report block reply Shmioighan 7 points 3 days ago \"Oh, the machine said so, not my fault or problem\" is going to be a much bigger and much more disastrous issue going forward than it is now. You'll never know if it was malicious or accident without either investing years of study to learn the means and methods, hiring the people that did that studying, or getting to a court where they actually know what they are ruling on. Assuming you survive it and whatever 'compensation' can be collected or sufficient. permalink award report block reply dontdrinksoy 4 points 3 days ago Yeah, Canada sucks. Bunch of commies are in charge. permalink award report block reply Smurfection 4 points 3 days ago Lefties have to censor because no one with two working neurons would vote for them or support them that was informed of their lies, propaganda and deceptions. permalink award report block reply Shih_Tabed 2 points 3 days ago Yeah pootube is pretty barren now.  They have the age verification in full effect.  Have to fork over your PII to see anything rated over G. permalink award report block reply nemonster 1 points 3 days ago Up and running permalink award report block reply guywholikesDjtof2024 OP 1 points 3 days ago Make Alberta a state already. permalink award report block reply Shmioighan 8 points 3 days ago I don't want any more of the new \"Canadians.\" permalink parent award report block reply RememberCharlieKirk 6 points 3 days ago Judging on the joke of a selection of MP candidates for certain ridings in Alberta, for all major political parties, that province is basically India 2.0 now. Does the USA really need more Indians? Saskatchewan might be a more appealing territory to claim. permalink parent award report block reply AlmostFullyDilated 2 points 3 days ago fuck everything canadian! even their geese fucking suck ass, except that clearly Canadian drink from the '90s permalink parent award report block reply AlmostFullyDilated -1 points 3 days ago no, fuck canada permalink parent award report block reply guywholikesDjtof2024 OP 3 points 3 days ago \"If we ignore catastrophe on our doorstep, we win!\" permalink parent award report block reply Spellmonger 1 points 3 days ago Thomas Jefferson wrote \"...for I have sworn upon the altar of God eternal hostility against every form of tyranny over the mind of man.\" permalink award report block reply AlmostFullyDilated -3 points 3 days ago cry me a river, faggot permalink award report block reply guywholikesDjtof2024 OP 3 points 3 days ago When you get censored, we'll be sure to use your empty insult on you. When you get censored, when your illogic comes back to bite you, what do you do? permalink parent award report block reply Nick-Kerr 1 points 3 days ago When you live in Canada, you asked for it, and we don't give a fuck, eh? permalink parent award report block reply\nsobriquet 24 points 3 days ago If you connected your livelihood to YouTube without a backup plan, then you have no one to blame but yourself.  This applies doubly in 2025 when Google/YouTube have proven that they don't give a fuck, and don't owe you shit. Sorry, that sucks, but that's the influencer life. permalink award report block reply Bullet3250 21 points 3 days ago Everyone should be Running away from Youtube and running to Rumble and Getter and Twitter etc... Youtube is a disaster - not only do they deplatform serious players - they DON'T want to 'not deplatform them' If you are 'Right side' on Youtube... it's just a matter of time permalink parent award report block reply Klaus73 5 points 3 days ago Influencer days are numbered - I am seeing more and more AI generated \"influncers\" which made 5-10 channels a DAY usually full of bad news or news that is over a month old. permalink parent award report block reply imnotdeadyet 3 points 3 days ago Yep, and it may happen with their battle with Disney.  It is pissing a out of normies off. permalink parent award report block reply AlmostFullyDilated -1 points 3 days ago rumble sucks ass permalink parent award report block reply lash 1 points 3 days ago And they took Tether money... permalink parent award report block reply Nick-Kerr 2 points 3 days ago Similarly, if you live in Canada, you're retarded. permalink parent award report block reply PiratePatriot 2 points 3 days ago I've learned the savvy influencers have multiple strategies to deal with the censorship. tame versions of content on the leftist censorship platforms. using short highlights, reels with fun content to attract subscribers - build a personality cult following first before tackling the difficult concepts. Keep mixing up the fun with the difficult. more intense versions on the uncensored platforms. long form content, with receipts, explaining their positions. bro talk, to show it is not just the host/creator with these views. multiple accounts under similar names to flood out the clones attempting to hijack their brand/image. NEVER challenge a much larger influencer until they have their own solid cult personality followers to defend them in the comments. use obscure jokes to mock idealogue opponents before diving deep into the topic. (this is more subtle and not always in the same posts) etc.. many more methods. I'm sure there are books and master classes in how to do this. just my observations watching various youtubes etc who do this well. know the debating fallacies and how to  use them to advantage. https://en.wikipedia.org/wiki/List_of_fallacies permalink parent award report block reply MAGABOND 2 points 3 days ago Not much difference from hitching your entire survival on the whims of the government. We all do the same thing to an extent with all of our jobs, only we just go get a new one when we leave. permalink parent award report block reply sobriquet 1 points 3 days ago There's more truth to this than I care to admit. permalink parent award report block reply MAGABOND 2 points 3 days ago I don’t think I could survive the past how I am today, but I wish I was born in a tougher, yet simpler time. permalink parent award report block reply\nBullet3250 21 points 3 days ago Everyone should be Running away from Youtube and running to Rumble and Getter and Twitter etc... Youtube is a disaster - not only do they deplatform serious players - they DON'T want to 'not deplatform them' If you are 'Right side' on Youtube... it's just a matter of time permalink parent award report block reply Klaus73 5 points 3 days ago Influencer days are numbered - I am seeing more and more AI generated \"influncers\" which made 5-10 channels a DAY usually full of bad news or news that is over a month old. permalink parent award report block reply imnotdeadyet 3 points 3 days ago Yep, and it may happen with their battle with Disney.  It is pissing a out of normies off. permalink parent award report block reply AlmostFullyDilated -1 points 3 days ago rumble sucks ass permalink parent award report block reply lash 1 points 3 days ago And they took Tether money... permalink parent award report block reply\nKlaus73 5 points 3 days ago Influencer days are numbered - I am seeing more and more AI generated \"influncers\" which made 5-10 channels a DAY usually full of bad news or news that is over a month old. permalink parent award report block reply\nimnotdeadyet 3 points 3 days ago Yep, and it may happen with their battle with Disney.  It is pissing a out of normies off. permalink parent award report block reply\nAlmostFullyDilated -1 points 3 days ago rumble sucks ass permalink parent award report block reply lash 1 points 3 days ago And they took Tether money... permalink parent award report block reply\nlash 1 points 3 days ago And they took Tether money... permalink parent award report block reply\nNick-Kerr 2 points 3 days ago Similarly, if you live in Canada, you're retarded. permalink parent award report block reply\nPiratePatriot 2 points 3 days ago I've learned the savvy influencers have multiple strategies to deal with the censorship. tame versions of content on the leftist censorship platforms. using short highlights, reels with fun content to attract subscribers - build a personality cult following first before tackling the difficult concepts. Keep mixing up the fun with the difficult. more intense versions on the uncensored platforms. long form content, with receipts, explaining their positions. bro talk, to show it is not just the host/creator with these views. multiple accounts under similar names to flood out the clones attempting to hijack their brand/image. NEVER challenge a much larger influencer until they have their own solid cult personality followers to defend them in the comments. use obscure jokes to mock idealogue opponents before diving deep into the topic. (this is more subtle and not always in the same posts) etc.. many more methods. I'm sure there are books and master classes in how to do this. just my observations watching various youtubes etc who do this well. know the debating fallacies and how to  use them to advantage. https://en.wikipedia.org/wiki/List_of_fallacies permalink parent award report block reply\nMAGABOND 2 points 3 days ago Not much difference from hitching your entire survival on the whims of the government. We all do the same thing to an extent with all of our jobs, only we just go get a new one when we leave. permalink parent award report block reply sobriquet 1 points 3 days ago There's more truth to this than I care to admit. permalink parent award report block reply MAGABOND 2 points 3 days ago I don’t think I could survive the past how I am today, but I wish I was born in a tougher, yet simpler time. permalink parent award report block reply\nsobriquet 1 points 3 days ago There's more truth to this than I care to admit. permalink parent award report block reply MAGABOND 2 points 3 days ago I don’t think I could survive the past how I am today, but I wish I was born in a tougher, yet simpler time. permalink parent award report block reply\nMAGABOND 2 points 3 days ago I don’t think I could survive the past how I am today, but I wish I was born in a tougher, yet simpler time. permalink parent award report block reply\nBullet3250 12 points 3 days ago THis is just another MASSIVE OPPORTUNITY for Elon over at Twitter - to bury Youtube and Take all there channels. permalink award report block reply borisborscht 2 points 3 days ago I want to be at the mercy of an oligarch! permalink parent award report block reply joggin_noggin 2 points 3 days ago Techno-monarchy is probably preferable to the gay techno-oligarchy we're living in now. At least the monarch has an incentive to preserve his domain for future generations. The oligarchs just want to loot the treasury and suck dick. permalink parent award report block reply\nborisborscht 2 points 3 days ago I want to be at the mercy of an oligarch! permalink parent award report block reply joggin_noggin 2 points 3 days ago Techno-monarchy is probably preferable to the gay techno-oligarchy we're living in now. At least the monarch has an incentive to preserve his domain for future generations. The oligarchs just want to loot the treasury and suck dick. permalink parent award report block reply\njoggin_noggin 2 points 3 days ago Techno-monarchy is probably preferable to the gay techno-oligarchy we're living in now. At least the monarch has an incentive to preserve his domain for future generations. The oligarchs just want to loot the treasury and suck dick. permalink parent award report block reply\nSouth_Florida_Guy 8 points 3 days ago If we're going to invade another country and force regime change it should be Canada permalink award report block reply Sgt_Hulka 7 points 3 days ago Agreed. And dont stop there.  Take it all the way back to their puppet masters in the UK.  I’m sure Russia and most of the rest of the world would be happy to either support us or stand down with all the fuckery the UK is responsible for. I’d wager even the UK people would join in to rid themselves of their corrupt parliament and royals once and for all. permalink parent award report block reply Belleoffreedom 1 points 3 days ago It's their country, and so far they are not as bad for sending us violence as Mexico. permalink parent award report block reply Klaus73 1 points 3 days ago Or you could deal with your own problems and be \"left alone\" or is the US actually the horde of oppressor's the left always claimed? permalink parent award report block reply\nSgt_Hulka 7 points 3 days ago Agreed. And dont stop there.  Take it all the way back to their puppet masters in the UK.  I’m sure Russia and most of the rest of the world would be happy to either support us or stand down with all the fuckery the UK is responsible for. I’d wager even the UK people would join in to rid themselves of their corrupt parliament and royals once and for all. permalink parent award report block reply\nBelleoffreedom 1 points 3 days ago It's their country, and so far they are not as bad for sending us violence as Mexico. permalink parent award report block reply\nKlaus73 1 points 3 days ago Or you could deal with your own problems and be \"left alone\" or is the US actually the horde of oppressor's the left always claimed? permalink parent award report block reply\nShmioighan 7 points 3 days ago \"Oh, the machine said so, not my fault or problem\" is going to be a much bigger and much more disastrous issue going forward than it is now. You'll never know if it was malicious or accident without either investing years of study to learn the means and methods, hiring the people that did that studying, or getting to a court where they actually know what they are ruling on. Assuming you survive it and whatever 'compensation' can be collected or sufficient. permalink award report block reply\ndontdrinksoy 4 points 3 days ago Yeah, Canada sucks. Bunch of commies are in charge. permalink award report block reply\nSmurfection 4 points 3 days ago Lefties have to censor because no one with two working neurons would vote for them or support them that was informed of their lies, propaganda and deceptions. permalink award report block reply\nShih_Tabed 2 points 3 days ago Yeah pootube is pretty barren now.  They have the age verification in full effect.  Have to fork over your PII to see anything rated over G. permalink award report block reply\nnemonster 1 points 3 days ago Up and running permalink award report block reply\nguywholikesDjtof2024 OP 1 points 3 days ago Make Alberta a state already. permalink award report block reply Shmioighan 8 points 3 days ago I don't want any more of the new \"Canadians.\" permalink parent award report block reply RememberCharlieKirk 6 points 3 days ago Judging on the joke of a selection of MP candidates for certain ridings in Alberta, for all major political parties, that province is basically India 2.0 now. Does the USA really need more Indians? Saskatchewan might be a more appealing territory to claim. permalink parent award report block reply AlmostFullyDilated 2 points 3 days ago fuck everything canadian! even their geese fucking suck ass, except that clearly Canadian drink from the '90s permalink parent award report block reply AlmostFullyDilated -1 points 3 days ago no, fuck canada permalink parent award report block reply guywholikesDjtof2024 OP 3 points 3 days ago \"If we ignore catastrophe on our doorstep, we win!\" permalink parent award report block reply\nShmioighan 8 points 3 days ago I don't want any more of the new \"Canadians.\" permalink parent award report block reply\nRememberCharlieKirk 6 points 3 days ago Judging on the joke of a selection of MP candidates for certain ridings in Alberta, for all major political parties, that province is basically India 2.0 now. Does the USA really need more Indians? Saskatchewan might be a more appealing territory to claim. permalink parent award report block reply AlmostFullyDilated 2 points 3 days ago fuck everything canadian! even their geese fucking suck ass, except that clearly Canadian drink from the '90s permalink parent award report block reply\nAlmostFullyDilated 2 points 3 days ago fuck everything canadian! even their geese fucking suck ass, except that clearly Canadian drink from the '90s permalink parent award report block reply\nAlmostFullyDilated -1 points 3 days ago no, fuck canada permalink parent award report block reply guywholikesDjtof2024 OP 3 points 3 days ago \"If we ignore catastrophe on our doorstep, we win!\" permalink parent award report block reply\nguywholikesDjtof2024 OP 3 points 3 days ago \"If we ignore catastrophe on our doorstep, we win!\" permalink parent award report block reply\nSpellmonger 1 points 3 days ago Thomas Jefferson wrote \"...for I have sworn upon the altar of God eternal hostility against every form of tyranny over the mind of man.\" permalink award report block reply\nAlmostFullyDilated -3 points 3 days ago cry me a river, faggot permalink award report block reply guywholikesDjtof2024 OP 3 points 3 days ago When you get censored, we'll be sure to use your empty insult on you. When you get censored, when your illogic comes back to bite you, what do you do? permalink parent award report block reply Nick-Kerr 1 points 3 days ago When you live in Canada, you asked for it, and we don't give a fuck, eh? permalink parent award report block reply\nguywholikesDjtof2024 OP 3 points 3 days ago When you get censored, we'll be sure to use your empty insult on you. When you get censored, when your illogic comes back to bite you, what do you do? permalink parent award report block reply Nick-Kerr 1 points 3 days ago When you live in Canada, you asked for it, and we don't give a fuck, eh? permalink parent award report block reply\nNick-Kerr 1 points 3 days ago When you live in Canada, you asked for it, and we don't give a fuck, eh? permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:10:38.156469Z"
}