{
  "id": "1ARK5BGJmw",
  "url": "https://patriots.win/p/1ARK5BGJmw/christians-fighting-back-this-is/c",
  "content": "737 Christians fighting back. This is the way. posted 3 days ago by goodtimebox 44 comments award share report block Islam Invasion 🚨 @IslamInvasion • 4d Church fighting back with the church bells! They’re intentionally disrespecting us and arranging their prayers in front of our churches; yet, we must fight back and teach them a lesson! Be too tolerant, and we will lose!\n44 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno YaharaRiver 54 points 3 days ago The most beautiful sound in the world is church bells disrupting the blasphemy of pisslamic disrespect for the Lord God Almighty. permalink award report block reply lovemylibs 18 points 3 days ago True church bells ring at a frequency of 432 HZ. It is a soothing and spiritual frequency. Most modern music is played in a 440 HZ frequency. permalink parent award report block reply HeavyMetalPatriot 12 points 3 days ago Another beautiful sound would be gunfire blasting apart the pisslams trying to take America for their demon lord. permalink parent award report block reply YaharaRiver 3 points 3 days ago tsk tsk What a mess! They can be neutralized in much cleaner ways. permalink parent award report block reply lixa 2 points 3 days ago Hungy lions? permalink parent award report block reply Shih_Tabed 1 points 2 days ago Chained up in a quarry with endless stones.  Gotta make sure shit's not haram. permalink parent award report block reply fskfsk 33 points 3 days ago What they need is loudspeakers blasting \"Mohammed was a pedophile!  Mohammed was a mass murderer!  Mohammed was a fraud and liar!\" permalink award report block reply HumblePepe 17 points 3 days ago He got zutted, lol permalink parent award report block reply Neonentity 3 points 3 days ago All night! permalink parent award report block reply 2Fangz 6 points 3 days ago A fleet of Blackstones sizzling infinite rashers of bacon! permalink parent award report block reply suckmycorona 5 points 3 days ago Baaaaahaha.  Sound of a goat btw,  lol permalink parent award report block reply 1_Badcop 3 points 3 days ago They know. They choose to worship him and his demon-god anyway. permalink parent award report block reply Neonentity 2 points 3 days ago Cover for their own antics. permalink parent award report block reply Apersonofinterest 26 points 3 days ago They’ll just burn the church down because nothing will happen to them and Christians won’t retaliate by burning their mosques down. permalink award report block reply realeagle 15 points 3 days ago Wow, they were owned, weren't they permalink award report block reply sobriquet 17 points 3 days ago So many fightings. Much powerful. Wow. permalink parent award report block reply GoldenEarz 11 points 3 days ago Stand in front of them saying, \"Bow down to Jesus! Yes, bow down before your Lord Jesus!\" permalink award report block reply Comanche_Moon 10 points 3 days ago I'd be pitching out cat turds and bacon on all of their heads. permalink award report block reply 1_Badcop 14 points 3 days ago Dog turds. They hate dogs. WTF kind of people hate dogs anyway? permalink parent award report block reply TrumpAndGodWin 9 points 3 days ago Their pedo prophet was probably raping a screaming crying child and the dog bit him while instinctively trying to protect it. permalink parent award report block reply Prussian_Pepe 2 points 3 days ago Sounds probable. permalink parent award report block reply Neonentity 7 points 3 days ago Dogs are usually excellent judges of character. permalink parent award report block reply Nomad899 8 points 3 days ago Should hold a pig roast 5 times a day to feed the masses permalink award report block reply AynRand22 8 points 3 days ago Turn it up 🎶🎶🎵🎶 permalink award report block reply Crappydatum 7 points 3 days ago If the Christians had faith, they'd be praying in front of the mosque permalink award report block reply Run_over_Antifa 21 points 3 days ago We don't do that. We get pushed and then the Crusades happen. It's hard being a high IQ civilized culture, it takes a lot to push us over the edge but when it happens it's brutal. permalink parent award report block reply UnderHisWings 5 points 3 days ago Exactly. permalink parent award report block reply Your-personal-FBI 6 points 3 days ago Pork BBQ! permalink award report block reply DemPanicAtTheDisco 5 points 3 days ago Put a pig statue in the direction they must prey on the church property. Then if they try it take pictures and post on social media \"These Muslims have converted to Pigianity\" permalink award report block reply Batting1000 5 points 3 days ago I visited the Middle East several years ago. I was abruptly woken up at like 6 AM because of the \"call to prayer\" from the mosques. It was truly one of the most obnoxious, annoying, and grating sounds I've ever heard. It was like someone strangling a cat mixed with someone drunk off his ass trying to yodel. permalink award report block reply Megaboom2025 5 points 3 days ago Tolerance is an excuse to let evil be evil permalink award report block reply yummy_yumm_yumms 4 points 3 days ago That's it? Bring out the fucking water cannons! permalink award report block reply MediaBro 4 points 3 days ago This is just plain stupid. permalink award report block reply 1_Badcop 13 points 3 days ago Agreed. Allowing muslims in your country to begin with, is just plain stupid. permalink parent award report block reply susanBmanthony 3 points 3 days ago yeah we're gettin' 'em, soldiers of Christ! too bad the church bells don't stop mass sodomy of our children... this is the way though! permalink award report block reply TearsAficionado 2 points 3 days ago Super-soakers with pig blood. permalink award report block reply lixa 2 points 3 days ago Blast the Our Father on speakers so loud it blows their mats away like it blew women's clothes off in Italian Job. permalink award report block reply JesusIsMyGod114 2 points 3 days ago Unleash some pigs there permalink award report block reply God-is-good 1 points 2 days ago The battle began with bells permalink award report block reply Mike_Hoxbigg 1 points 2 days ago They should be dumping bacon grease on them simultaneously to cleanse their stench from the streets. permalink award report block reply Boomstikchik 1 points 3 days ago You gotta love it! You know those low IQs can't concentrate with the Christian bells ringing true! 😆\nThis is the way!! Christ is King! permalink award report block reply Counterwhat 1 points 3 days ago You could do more. Don't let the alone. Spread holy water. Say the bible verses that cast put demons. Read the rosary. Or plainly tell them to get the fuck out of the way and to go back to their hole. Call friends play classical music. Have a women's choir sing holy songs. Just do more. If you don't defend your religion they will impose theirs. permalink award report block reply RizzlieDoodad 1 points 2 days ago Spray em with a hose permalink award report block reply\nYaharaRiver 54 points 3 days ago The most beautiful sound in the world is church bells disrupting the blasphemy of pisslamic disrespect for the Lord God Almighty. permalink award report block reply lovemylibs 18 points 3 days ago True church bells ring at a frequency of 432 HZ. It is a soothing and spiritual frequency. Most modern music is played in a 440 HZ frequency. permalink parent award report block reply HeavyMetalPatriot 12 points 3 days ago Another beautiful sound would be gunfire blasting apart the pisslams trying to take America for their demon lord. permalink parent award report block reply YaharaRiver 3 points 3 days ago tsk tsk What a mess! They can be neutralized in much cleaner ways. permalink parent award report block reply lixa 2 points 3 days ago Hungy lions? permalink parent award report block reply Shih_Tabed 1 points 2 days ago Chained up in a quarry with endless stones.  Gotta make sure shit's not haram. permalink parent award report block reply\nlovemylibs 18 points 3 days ago True church bells ring at a frequency of 432 HZ. It is a soothing and spiritual frequency. Most modern music is played in a 440 HZ frequency. permalink parent award report block reply\nHeavyMetalPatriot 12 points 3 days ago Another beautiful sound would be gunfire blasting apart the pisslams trying to take America for their demon lord. permalink parent award report block reply YaharaRiver 3 points 3 days ago tsk tsk What a mess! They can be neutralized in much cleaner ways. permalink parent award report block reply lixa 2 points 3 days ago Hungy lions? permalink parent award report block reply Shih_Tabed 1 points 2 days ago Chained up in a quarry with endless stones.  Gotta make sure shit's not haram. permalink parent award report block reply\nYaharaRiver 3 points 3 days ago tsk tsk What a mess! They can be neutralized in much cleaner ways. permalink parent award report block reply lixa 2 points 3 days ago Hungy lions? permalink parent award report block reply Shih_Tabed 1 points 2 days ago Chained up in a quarry with endless stones.  Gotta make sure shit's not haram. permalink parent award report block reply\nlixa 2 points 3 days ago Hungy lions? permalink parent award report block reply Shih_Tabed 1 points 2 days ago Chained up in a quarry with endless stones.  Gotta make sure shit's not haram. permalink parent award report block reply\nShih_Tabed 1 points 2 days ago Chained up in a quarry with endless stones.  Gotta make sure shit's not haram. permalink parent award report block reply\nfskfsk 33 points 3 days ago What they need is loudspeakers blasting \"Mohammed was a pedophile!  Mohammed was a mass murderer!  Mohammed was a fraud and liar!\" permalink award report block reply HumblePepe 17 points 3 days ago He got zutted, lol permalink parent award report block reply Neonentity 3 points 3 days ago All night! permalink parent award report block reply 2Fangz 6 points 3 days ago A fleet of Blackstones sizzling infinite rashers of bacon! permalink parent award report block reply suckmycorona 5 points 3 days ago Baaaaahaha.  Sound of a goat btw,  lol permalink parent award report block reply 1_Badcop 3 points 3 days ago They know. They choose to worship him and his demon-god anyway. permalink parent award report block reply Neonentity 2 points 3 days ago Cover for their own antics. permalink parent award report block reply\nHumblePepe 17 points 3 days ago He got zutted, lol permalink parent award report block reply Neonentity 3 points 3 days ago All night! permalink parent award report block reply\nNeonentity 3 points 3 days ago All night! permalink parent award report block reply\n2Fangz 6 points 3 days ago A fleet of Blackstones sizzling infinite rashers of bacon! permalink parent award report block reply\nsuckmycorona 5 points 3 days ago Baaaaahaha.  Sound of a goat btw,  lol permalink parent award report block reply\n1_Badcop 3 points 3 days ago They know. They choose to worship him and his demon-god anyway. permalink parent award report block reply Neonentity 2 points 3 days ago Cover for their own antics. permalink parent award report block reply\nNeonentity 2 points 3 days ago Cover for their own antics. permalink parent award report block reply\nApersonofinterest 26 points 3 days ago They’ll just burn the church down because nothing will happen to them and Christians won’t retaliate by burning their mosques down. permalink award report block reply\nrealeagle 15 points 3 days ago Wow, they were owned, weren't they permalink award report block reply sobriquet 17 points 3 days ago So many fightings. Much powerful. Wow. permalink parent award report block reply\nsobriquet 17 points 3 days ago So many fightings. Much powerful. Wow. permalink parent award report block reply\nGoldenEarz 11 points 3 days ago Stand in front of them saying, \"Bow down to Jesus! Yes, bow down before your Lord Jesus!\" permalink award report block reply\nComanche_Moon 10 points 3 days ago I'd be pitching out cat turds and bacon on all of their heads. permalink award report block reply 1_Badcop 14 points 3 days ago Dog turds. They hate dogs. WTF kind of people hate dogs anyway? permalink parent award report block reply TrumpAndGodWin 9 points 3 days ago Their pedo prophet was probably raping a screaming crying child and the dog bit him while instinctively trying to protect it. permalink parent award report block reply Prussian_Pepe 2 points 3 days ago Sounds probable. permalink parent award report block reply Neonentity 7 points 3 days ago Dogs are usually excellent judges of character. permalink parent award report block reply\n1_Badcop 14 points 3 days ago Dog turds. They hate dogs. WTF kind of people hate dogs anyway? permalink parent award report block reply TrumpAndGodWin 9 points 3 days ago Their pedo prophet was probably raping a screaming crying child and the dog bit him while instinctively trying to protect it. permalink parent award report block reply Prussian_Pepe 2 points 3 days ago Sounds probable. permalink parent award report block reply Neonentity 7 points 3 days ago Dogs are usually excellent judges of character. permalink parent award report block reply\nTrumpAndGodWin 9 points 3 days ago Their pedo prophet was probably raping a screaming crying child and the dog bit him while instinctively trying to protect it. permalink parent award report block reply Prussian_Pepe 2 points 3 days ago Sounds probable. permalink parent award report block reply\nPrussian_Pepe 2 points 3 days ago Sounds probable. permalink parent award report block reply\nNeonentity 7 points 3 days ago Dogs are usually excellent judges of character. permalink parent award report block reply\nNomad899 8 points 3 days ago Should hold a pig roast 5 times a day to feed the masses permalink award report block reply\nAynRand22 8 points 3 days ago Turn it up 🎶🎶🎵🎶 permalink award report block reply\nCrappydatum 7 points 3 days ago If the Christians had faith, they'd be praying in front of the mosque permalink award report block reply Run_over_Antifa 21 points 3 days ago We don't do that. We get pushed and then the Crusades happen. It's hard being a high IQ civilized culture, it takes a lot to push us over the edge but when it happens it's brutal. permalink parent award report block reply UnderHisWings 5 points 3 days ago Exactly. permalink parent award report block reply\nRun_over_Antifa 21 points 3 days ago We don't do that. We get pushed and then the Crusades happen. It's hard being a high IQ civilized culture, it takes a lot to push us over the edge but when it happens it's brutal. permalink parent award report block reply UnderHisWings 5 points 3 days ago Exactly. permalink parent award report block reply\nUnderHisWings 5 points 3 days ago Exactly. permalink parent award report block reply\nYour-personal-FBI 6 points 3 days ago Pork BBQ! permalink award report block reply\nDemPanicAtTheDisco 5 points 3 days ago Put a pig statue in the direction they must prey on the church property. Then if they try it take pictures and post on social media \"These Muslims have converted to Pigianity\" permalink award report block reply\nBatting1000 5 points 3 days ago I visited the Middle East several years ago. I was abruptly woken up at like 6 AM because of the \"call to prayer\" from the mosques. It was truly one of the most obnoxious, annoying, and grating sounds I've ever heard. It was like someone strangling a cat mixed with someone drunk off his ass trying to yodel. permalink award report block reply\nMegaboom2025 5 points 3 days ago Tolerance is an excuse to let evil be evil permalink award report block reply\nyummy_yumm_yumms 4 points 3 days ago That's it? Bring out the fucking water cannons! permalink award report block reply\nMediaBro 4 points 3 days ago This is just plain stupid. permalink award report block reply 1_Badcop 13 points 3 days ago Agreed. Allowing muslims in your country to begin with, is just plain stupid. permalink parent award report block reply\n1_Badcop 13 points 3 days ago Agreed. Allowing muslims in your country to begin with, is just plain stupid. permalink parent award report block reply\nsusanBmanthony 3 points 3 days ago yeah we're gettin' 'em, soldiers of Christ! too bad the church bells don't stop mass sodomy of our children... this is the way though! permalink award report block reply\nTearsAficionado 2 points 3 days ago Super-soakers with pig blood. permalink award report block reply\nlixa 2 points 3 days ago Blast the Our Father on speakers so loud it blows their mats away like it blew women's clothes off in Italian Job. permalink award report block reply\nJesusIsMyGod114 2 points 3 days ago Unleash some pigs there permalink award report block reply\nGod-is-good 1 points 2 days ago The battle began with bells permalink award report block reply\nMike_Hoxbigg 1 points 2 days ago They should be dumping bacon grease on them simultaneously to cleanse their stench from the streets. permalink award report block reply\nBoomstikchik 1 points 3 days ago You gotta love it! You know those low IQs can't concentrate with the Christian bells ringing true! 😆\nThis is the way!! Christ is King! permalink award report block reply\nCounterwhat 1 points 3 days ago You could do more. Don't let the alone. Spread holy water. Say the bible verses that cast put demons. Read the rosary. Or plainly tell them to get the fuck out of the way and to go back to their hole. Call friends play classical music. Have a women's choir sing holy songs. Just do more. If you don't defend your religion they will impose theirs. permalink award report block reply\nRizzlieDoodad 1 points 2 days ago Spray em with a hose permalink award report block reply",
  "fetched_at": "2025-11-12T22:48:19.042496Z"
}