{
  "id": "1ARK9nNyy0",
  "url": "https://patriots.win/p/1ARK9nNyy0/breaking--nyt-doing-a-russia-hoa/c",
  "content": "36 BREAKING:  NYT doing a Russia Hoax type attack again using Epstein emails that prove absolutely nothing (archive.ph) posted 9 hours ago by redditadminssuckit 6 comments award share report block archive.ph\n6 comments Sort by Top Top New Worst Old Save Around the Web Hair Grows Back in A Few Days! At Any Stage of Baldness HaloGrow 16BeatsAOne 2 points 9 hours ago So are you trying to convince me that these \"very damaging\" emails had just been discovered now?  And that Clinton, Biden and/or Harris did not release this game-breaking trove over the last three General Elections to maximally hurt GEOTUS?  Really?  Yawn. permalink award report block reply redditadminssuckit OP 1 points 9 hours ago You mean \"they\"  not me.. right? permalink parent award report block reply Datamancer 2 points 9 hours ago This has less to do with President Trump and more to do with demoralizing the base even further.   This is about 2026.   If the left can keep MAGA at home, then they have the opportunity to flip both the house and senate. If that happens MAGA is dead. Trump will be hounded and impeached for the remaining 24 months and Vance has almost no chance if winning the general in 2028.    Loss of all three will basically doom the judiciary and refill the swamp to overflow. permalink award report block reply Treatt 1 points 9 hours ago They've also kept MAGA at home more successfully than anyone before who has ever tried to take away our right to Peacefully assemble permalink parent award report block reply FusionBlack 1 points 9 hours ago If there were any connections of Trump and improprieties it would have been out long ago. permalink award report block reply SleepyHead1 1 points 9 hours ago Comment removed by community filter, pending further review. permalink award report block reply\n16BeatsAOne 2 points 9 hours ago So are you trying to convince me that these \"very damaging\" emails had just been discovered now?  And that Clinton, Biden and/or Harris did not release this game-breaking trove over the last three General Elections to maximally hurt GEOTUS?  Really?  Yawn. permalink award report block reply redditadminssuckit OP 1 points 9 hours ago You mean \"they\"  not me.. right? permalink parent award report block reply\nredditadminssuckit OP 1 points 9 hours ago You mean \"they\"  not me.. right? permalink parent award report block reply\nDatamancer 2 points 9 hours ago This has less to do with President Trump and more to do with demoralizing the base even further.   This is about 2026.   If the left can keep MAGA at home, then they have the opportunity to flip both the house and senate. If that happens MAGA is dead. Trump will be hounded and impeached for the remaining 24 months and Vance has almost no chance if winning the general in 2028.    Loss of all three will basically doom the judiciary and refill the swamp to overflow. permalink award report block reply Treatt 1 points 9 hours ago They've also kept MAGA at home more successfully than anyone before who has ever tried to take away our right to Peacefully assemble permalink parent award report block reply\nTreatt 1 points 9 hours ago They've also kept MAGA at home more successfully than anyone before who has ever tried to take away our right to Peacefully assemble permalink parent award report block reply\nFusionBlack 1 points 9 hours ago If there were any connections of Trump and improprieties it would have been out long ago. permalink award report block reply\nSleepyHead1 1 points 9 hours ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T23:30:08.226524Z"
}