{
  "id": "1ARK9nNhzE",
  "url": "https://patriots.win/p/1ARK9nNhzE/has-anyone-noticed-the-media-ign/c",
  "content": "330 Has Anyone Noticed the Media Ignores Susie Wiles? posted 9 hours ago by flashersenpai 47 comments award share report block Suntanned Greek Immigrant @GreekNME • 1d Susie Wiles is not in the news at all unlike any of the past Trump chief of staffs, which means the swamp in DC via its  DC press handmaidens views her as an ally.\n47 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style nuhbin3 23 points 9 hours ago stop noticing!!!!!!!!! just enjoy your Chinese student visas, Indian truck drivers, greater Israel project and 50yr mortgages and when Republicans lose the next election just blame Tucker Carlson like a good boy ok! permalink award report block reply MastaJoda 9 points 8 hours ago ☝We are here, while Trump is sucking off terrorists in the White House and bailing out Argentinean farmers while American farmers struggle to operate and compete with foriegn competitors that are sponsored by our own govt. Wake tf up, cultists!!! permalink parent award report block reply BBvarn 1 points 5 hours ago Liberal Female Bot site, I am heading to the real Donald/win site. permalink parent award report block reply Mhmm2MoreWeeks -2 points 59 minutes ago Actually the JEW HATERS are PRECISELY the way to undermine MAGA in the next election and its working. Normies want nothing to do with Racists, and quietly run away. Just like this website, it used to be amazing. Upvoted stickies to 5000++ but today, as always happens with Jew Hater sites, its a fraction of that, and a Jew Hate echo chamber like a 4Chan or Gab. You fool yourselves into thinking you have numbers enough to matter but do not. What you all are really is a useful idiot of your political foes who control you by race the same way a Prison Warden controls a prison by race. YOU ARE UNDER CONTROL. It does not matter if you think so or not as it is self evident. Your emotions and hate are the levers your enemies use to steer you, and you will never ever learn. permalink parent award report block reply flashersenpai OP 18 points 9 hours ago Compare her treatment to the treatment of RFK, Hegseth, Gaetz, or Tulsi. Wiles, Rollins were ignored. Pulte is ignored. Kash and Bongino are ignored now. Seems like most of the criticism of substance is coming from the right. permalink award report block reply B-2StealthTrump 5 points 8 hours ago Rubio confirmed 99-0. Ignored. Beware. permalink parent award report block reply Standingoak 3 points 6 hours ago Involved with Politics.  Beware. \"We are from the Government, we're here to help\".   Run. permalink parent award report block reply B-2StealthTrump 2 points 6 hours ago Yes. Also true. permalink parent award report block reply MastaJoda -1 points 8 hours ago lol ''the right'' permalink parent award report block reply T471 12 points 9 hours ago After the last 5 days, I'm convinced of this. Promises made promises kept need to have an asterisk after them that says if Israel and Susie allows it. permalink award report block reply SpeekFreely 7 points 9 hours ago She worked in the Reagan admin, it’s odd how similar the two campaigns resemble one another https://x.com/RonaldReagan/status/1854699974501843433 Note that Susie worked in the Reagan Dep of Labor which oversees immigration policy. permalink award report block reply MastaJoda 5 points 8 hours ago Yup, like Reagan, Trump abandoned AF in his 2nd term after a failed assassination attempt. Coincidence?? permalink parent award report block reply flashersenpai OP 0 points 8 hours ago damn wtf bruh permalink parent award report block reply Mulletgunning 7 points 8 hours ago Been calling her out since day one. Many here sucked her crusty crotch and still do. That bitch is poison to MAGA AF permalink award report block reply DenturesNancy 7 points 9 hours ago Wiles was selected to be POTUS.  Trump is not in charge, just an empty vessel like Joe permalink award report block reply KuzoKevin 4 points 9 hours ago Bull shit.  She's not in the news because she won't talk to them, which is a good thing. permalink award report block reply JoePlumber 8 points 9 hours ago Nah, she's the great filter that is the one in Trump's ear. She's the former Netanyahu staffer, former DeSantis staffer, etc. she is not MAGA and never was. She may not talk to them but they also aren't attacking her which absolutely is evidence she is on the establishment's side. permalink parent award report block reply KuzoKevin -4 points 9 hours ago You are judging her based on zero actual information. Fuck off, retard. permalink parent award report block reply JoePlumber 8 points 8 hours ago The fact she worked for Netanyahu? The fact she worked for DeSantis? That's actual information. Couple it with the way the media is handling her with kids gloves and Trump has completely lost touch with the MAGA base.... You seem very defensive though .. permalink parent award report block reply Mulletgunning 4 points 8 hours ago Her and Pam  are scissor sisters for Big Pharma also,both need to be yeeted yesterday. permalink parent award report block reply KuzoKevin 0 points 8 hours ago You seem very offensive with zero information to back up your theory. permalink parent award report block reply view 5 more comments... LORDFALCONE 2 points 8 hours ago You're defending her based on zero actual information. Just going off your feelings. You fuck off permalink parent award report block reply KuzoKevin -1 points 8 hours ago You're attacking her with made up bullshit.  That's why I'm defending her. Bring some receipts to back your claims and I'm open to discussion Making shit up is cowardly. permalink parent award report block reply KiekhaeferSoldier 2 points 7 hours ago Agree... she tells 'em to fuck off. permalink parent award report block reply blue5707 0 points 9 hours ago THIS permalink parent award report block reply SoL-Chi -1 points 8 hours ago No dude. She's clearly a Chinese spy according to his moron. permalink parent award report block reply SoulSnipper 3 points 8 hours ago Oh fuck off, it means they aren't getting anything because she's doing her job unlike some of the media whores in the cabinet permalink award report block reply Constantin2024 2 points 5 hours ago That might explain a lot of Trump's anti-American stances these days. permalink award report block reply flopperdog 2 points 6 hours ago Susie Wiles is the devil whispering in Trump's ear permalink award report block reply blueballs43 1 points 1 hour ago OBVIOUSLY \"U\" WHO EVER \"U\" ARE KNOWS NOTHING ABOUT MS WILES! permalink award report block reply SoL-Chi 1 points 8 hours ago I swear people here are becoming more and more retarded lately. permalink award report block reply Grindelwald 1 points 9 hours ago She doesn’t do hiring anymore. permalink award report block reply Wildwind 1 points 5 hours ago She is the swamp. A jewish swamp and I do believe that main person who advises Trump, along with many  others that she has formed around her. Trump really needs to wake the hell up. Fire the useless blond in the DOJ, fire Kash, nether  of them are doing their jobs. Also work on the military that still has more dei returds. Weed every last one of them out thats dei. Fire Susie Wiles. Start arresting traitors in congress. Hell arrest the treasonous governors, mayors, and stop funding every colleges, and every high school, including  grade schools. Trump do your job. permalink award report block reply Obambi 1 points 6 hours ago Always a woman or a J involved in everything bad permalink award report block reply TenaciousDT 0 points 2 hours ago You can easily notice the israeli shills in this thread pedes, Susie Wiles is swamp as EASILY evidenced by the fact that she WORKED FOR NETANYAHU just 5 short years ago. What more could you possibly need? permalink award report block reply onemanshow 0 points 8 hours ago She’s the chief of staff and doesn’t do media appearances. What we have here is simply forum sliding and astroturfing from Reddit cloaked as maga. permalink award report block reply onemanshow -1 points 8 hours ago OP your post history is sus permalink award report block reply flashersenpai OP 3 points 8 hours ago it's the trump admin that's sus tbh Susie Wiles was never MAGA, neither is Sergio Gor but at least he's out of the HR department permalink parent award report block reply onemanshow 0 points 6 hours ago The Trump admin is sus, that’s the purpose of your post? permalink parent award report block reply\nnuhbin3 23 points 9 hours ago stop noticing!!!!!!!!! just enjoy your Chinese student visas, Indian truck drivers, greater Israel project and 50yr mortgages and when Republicans lose the next election just blame Tucker Carlson like a good boy ok! permalink award report block reply MastaJoda 9 points 8 hours ago ☝We are here, while Trump is sucking off terrorists in the White House and bailing out Argentinean farmers while American farmers struggle to operate and compete with foriegn competitors that are sponsored by our own govt. Wake tf up, cultists!!! permalink parent award report block reply BBvarn 1 points 5 hours ago Liberal Female Bot site, I am heading to the real Donald/win site. permalink parent award report block reply Mhmm2MoreWeeks -2 points 59 minutes ago Actually the JEW HATERS are PRECISELY the way to undermine MAGA in the next election and its working. Normies want nothing to do with Racists, and quietly run away. Just like this website, it used to be amazing. Upvoted stickies to 5000++ but today, as always happens with Jew Hater sites, its a fraction of that, and a Jew Hate echo chamber like a 4Chan or Gab. You fool yourselves into thinking you have numbers enough to matter but do not. What you all are really is a useful idiot of your political foes who control you by race the same way a Prison Warden controls a prison by race. YOU ARE UNDER CONTROL. It does not matter if you think so or not as it is self evident. Your emotions and hate are the levers your enemies use to steer you, and you will never ever learn. permalink parent award report block reply\nMastaJoda 9 points 8 hours ago ☝We are here, while Trump is sucking off terrorists in the White House and bailing out Argentinean farmers while American farmers struggle to operate and compete with foriegn competitors that are sponsored by our own govt. Wake tf up, cultists!!! permalink parent award report block reply\nBBvarn 1 points 5 hours ago Liberal Female Bot site, I am heading to the real Donald/win site. permalink parent award report block reply\nMhmm2MoreWeeks -2 points 59 minutes ago Actually the JEW HATERS are PRECISELY the way to undermine MAGA in the next election and its working. Normies want nothing to do with Racists, and quietly run away. Just like this website, it used to be amazing. Upvoted stickies to 5000++ but today, as always happens with Jew Hater sites, its a fraction of that, and a Jew Hate echo chamber like a 4Chan or Gab. You fool yourselves into thinking you have numbers enough to matter but do not. What you all are really is a useful idiot of your political foes who control you by race the same way a Prison Warden controls a prison by race. YOU ARE UNDER CONTROL. It does not matter if you think so or not as it is self evident. Your emotions and hate are the levers your enemies use to steer you, and you will never ever learn. permalink parent award report block reply\nflashersenpai OP 18 points 9 hours ago Compare her treatment to the treatment of RFK, Hegseth, Gaetz, or Tulsi. Wiles, Rollins were ignored. Pulte is ignored. Kash and Bongino are ignored now. Seems like most of the criticism of substance is coming from the right. permalink award report block reply B-2StealthTrump 5 points 8 hours ago Rubio confirmed 99-0. Ignored. Beware. permalink parent award report block reply Standingoak 3 points 6 hours ago Involved with Politics.  Beware. \"We are from the Government, we're here to help\".   Run. permalink parent award report block reply B-2StealthTrump 2 points 6 hours ago Yes. Also true. permalink parent award report block reply MastaJoda -1 points 8 hours ago lol ''the right'' permalink parent award report block reply\nB-2StealthTrump 5 points 8 hours ago Rubio confirmed 99-0. Ignored. Beware. permalink parent award report block reply Standingoak 3 points 6 hours ago Involved with Politics.  Beware. \"We are from the Government, we're here to help\".   Run. permalink parent award report block reply B-2StealthTrump 2 points 6 hours ago Yes. Also true. permalink parent award report block reply\nStandingoak 3 points 6 hours ago Involved with Politics.  Beware. \"We are from the Government, we're here to help\".   Run. permalink parent award report block reply B-2StealthTrump 2 points 6 hours ago Yes. Also true. permalink parent award report block reply\nB-2StealthTrump 2 points 6 hours ago Yes. Also true. permalink parent award report block reply\nMastaJoda -1 points 8 hours ago lol ''the right'' permalink parent award report block reply\nT471 12 points 9 hours ago After the last 5 days, I'm convinced of this. Promises made promises kept need to have an asterisk after them that says if Israel and Susie allows it. permalink award report block reply\nSpeekFreely 7 points 9 hours ago She worked in the Reagan admin, it’s odd how similar the two campaigns resemble one another https://x.com/RonaldReagan/status/1854699974501843433 Note that Susie worked in the Reagan Dep of Labor which oversees immigration policy. permalink award report block reply MastaJoda 5 points 8 hours ago Yup, like Reagan, Trump abandoned AF in his 2nd term after a failed assassination attempt. Coincidence?? permalink parent award report block reply flashersenpai OP 0 points 8 hours ago damn wtf bruh permalink parent award report block reply\nMastaJoda 5 points 8 hours ago Yup, like Reagan, Trump abandoned AF in his 2nd term after a failed assassination attempt. Coincidence?? permalink parent award report block reply\nflashersenpai OP 0 points 8 hours ago damn wtf bruh permalink parent award report block reply\nMulletgunning 7 points 8 hours ago Been calling her out since day one. Many here sucked her crusty crotch and still do. That bitch is poison to MAGA AF permalink award report block reply\nDenturesNancy 7 points 9 hours ago Wiles was selected to be POTUS.  Trump is not in charge, just an empty vessel like Joe permalink award report block reply\nKuzoKevin 4 points 9 hours ago Bull shit.  She's not in the news because she won't talk to them, which is a good thing. permalink award report block reply JoePlumber 8 points 9 hours ago Nah, she's the great filter that is the one in Trump's ear. She's the former Netanyahu staffer, former DeSantis staffer, etc. she is not MAGA and never was. She may not talk to them but they also aren't attacking her which absolutely is evidence she is on the establishment's side. permalink parent award report block reply KuzoKevin -4 points 9 hours ago You are judging her based on zero actual information. Fuck off, retard. permalink parent award report block reply JoePlumber 8 points 8 hours ago The fact she worked for Netanyahu? The fact she worked for DeSantis? That's actual information. Couple it with the way the media is handling her with kids gloves and Trump has completely lost touch with the MAGA base.... You seem very defensive though .. permalink parent award report block reply Mulletgunning 4 points 8 hours ago Her and Pam  are scissor sisters for Big Pharma also,both need to be yeeted yesterday. permalink parent award report block reply KuzoKevin 0 points 8 hours ago You seem very offensive with zero information to back up your theory. permalink parent award report block reply view 5 more comments... LORDFALCONE 2 points 8 hours ago You're defending her based on zero actual information. Just going off your feelings. You fuck off permalink parent award report block reply KuzoKevin -1 points 8 hours ago You're attacking her with made up bullshit.  That's why I'm defending her. Bring some receipts to back your claims and I'm open to discussion Making shit up is cowardly. permalink parent award report block reply KiekhaeferSoldier 2 points 7 hours ago Agree... she tells 'em to fuck off. permalink parent award report block reply blue5707 0 points 9 hours ago THIS permalink parent award report block reply SoL-Chi -1 points 8 hours ago No dude. She's clearly a Chinese spy according to his moron. permalink parent award report block reply\nJoePlumber 8 points 9 hours ago Nah, she's the great filter that is the one in Trump's ear. She's the former Netanyahu staffer, former DeSantis staffer, etc. she is not MAGA and never was. She may not talk to them but they also aren't attacking her which absolutely is evidence she is on the establishment's side. permalink parent award report block reply KuzoKevin -4 points 9 hours ago You are judging her based on zero actual information. Fuck off, retard. permalink parent award report block reply JoePlumber 8 points 8 hours ago The fact she worked for Netanyahu? The fact she worked for DeSantis? That's actual information. Couple it with the way the media is handling her with kids gloves and Trump has completely lost touch with the MAGA base.... You seem very defensive though .. permalink parent award report block reply Mulletgunning 4 points 8 hours ago Her and Pam  are scissor sisters for Big Pharma also,both need to be yeeted yesterday. permalink parent award report block reply KuzoKevin 0 points 8 hours ago You seem very offensive with zero information to back up your theory. permalink parent award report block reply view 5 more comments... LORDFALCONE 2 points 8 hours ago You're defending her based on zero actual information. Just going off your feelings. You fuck off permalink parent award report block reply KuzoKevin -1 points 8 hours ago You're attacking her with made up bullshit.  That's why I'm defending her. Bring some receipts to back your claims and I'm open to discussion Making shit up is cowardly. permalink parent award report block reply\nKuzoKevin -4 points 9 hours ago You are judging her based on zero actual information. Fuck off, retard. permalink parent award report block reply JoePlumber 8 points 8 hours ago The fact she worked for Netanyahu? The fact she worked for DeSantis? That's actual information. Couple it with the way the media is handling her with kids gloves and Trump has completely lost touch with the MAGA base.... You seem very defensive though .. permalink parent award report block reply Mulletgunning 4 points 8 hours ago Her and Pam  are scissor sisters for Big Pharma also,both need to be yeeted yesterday. permalink parent award report block reply KuzoKevin 0 points 8 hours ago You seem very offensive with zero information to back up your theory. permalink parent award report block reply view 5 more comments... LORDFALCONE 2 points 8 hours ago You're defending her based on zero actual information. Just going off your feelings. You fuck off permalink parent award report block reply KuzoKevin -1 points 8 hours ago You're attacking her with made up bullshit.  That's why I'm defending her. Bring some receipts to back your claims and I'm open to discussion Making shit up is cowardly. permalink parent award report block reply\nJoePlumber 8 points 8 hours ago The fact she worked for Netanyahu? The fact she worked for DeSantis? That's actual information. Couple it with the way the media is handling her with kids gloves and Trump has completely lost touch with the MAGA base.... You seem very defensive though .. permalink parent award report block reply Mulletgunning 4 points 8 hours ago Her and Pam  are scissor sisters for Big Pharma also,both need to be yeeted yesterday. permalink parent award report block reply KuzoKevin 0 points 8 hours ago You seem very offensive with zero information to back up your theory. permalink parent award report block reply view 5 more comments...\nMulletgunning 4 points 8 hours ago Her and Pam  are scissor sisters for Big Pharma also,both need to be yeeted yesterday. permalink parent award report block reply\nKuzoKevin 0 points 8 hours ago You seem very offensive with zero information to back up your theory. permalink parent award report block reply view 5 more comments...\nLORDFALCONE 2 points 8 hours ago You're defending her based on zero actual information. Just going off your feelings. You fuck off permalink parent award report block reply KuzoKevin -1 points 8 hours ago You're attacking her with made up bullshit.  That's why I'm defending her. Bring some receipts to back your claims and I'm open to discussion Making shit up is cowardly. permalink parent award report block reply\nKuzoKevin -1 points 8 hours ago You're attacking her with made up bullshit.  That's why I'm defending her. Bring some receipts to back your claims and I'm open to discussion Making shit up is cowardly. permalink parent award report block reply\nKiekhaeferSoldier 2 points 7 hours ago Agree... she tells 'em to fuck off. permalink parent award report block reply\nblue5707 0 points 9 hours ago THIS permalink parent award report block reply\nSoL-Chi -1 points 8 hours ago No dude. She's clearly a Chinese spy according to his moron. permalink parent award report block reply\nSoulSnipper 3 points 8 hours ago Oh fuck off, it means they aren't getting anything because she's doing her job unlike some of the media whores in the cabinet permalink award report block reply\nConstantin2024 2 points 5 hours ago That might explain a lot of Trump's anti-American stances these days. permalink award report block reply\nflopperdog 2 points 6 hours ago Susie Wiles is the devil whispering in Trump's ear permalink award report block reply\nblueballs43 1 points 1 hour ago OBVIOUSLY \"U\" WHO EVER \"U\" ARE KNOWS NOTHING ABOUT MS WILES! permalink award report block reply\nSoL-Chi 1 points 8 hours ago I swear people here are becoming more and more retarded lately. permalink award report block reply\nGrindelwald 1 points 9 hours ago She doesn’t do hiring anymore. permalink award report block reply\nWildwind 1 points 5 hours ago She is the swamp. A jewish swamp and I do believe that main person who advises Trump, along with many  others that she has formed around her. Trump really needs to wake the hell up. Fire the useless blond in the DOJ, fire Kash, nether  of them are doing their jobs. Also work on the military that still has more dei returds. Weed every last one of them out thats dei. Fire Susie Wiles. Start arresting traitors in congress. Hell arrest the treasonous governors, mayors, and stop funding every colleges, and every high school, including  grade schools. Trump do your job. permalink award report block reply\nObambi 1 points 6 hours ago Always a woman or a J involved in everything bad permalink award report block reply\nTenaciousDT 0 points 2 hours ago You can easily notice the israeli shills in this thread pedes, Susie Wiles is swamp as EASILY evidenced by the fact that she WORKED FOR NETANYAHU just 5 short years ago. What more could you possibly need? permalink award report block reply\nonemanshow 0 points 8 hours ago She’s the chief of staff and doesn’t do media appearances. What we have here is simply forum sliding and astroturfing from Reddit cloaked as maga. permalink award report block reply\nonemanshow -1 points 8 hours ago OP your post history is sus permalink award report block reply flashersenpai OP 3 points 8 hours ago it's the trump admin that's sus tbh Susie Wiles was never MAGA, neither is Sergio Gor but at least he's out of the HR department permalink parent award report block reply onemanshow 0 points 6 hours ago The Trump admin is sus, that’s the purpose of your post? permalink parent award report block reply\nflashersenpai OP 3 points 8 hours ago it's the trump admin that's sus tbh Susie Wiles was never MAGA, neither is Sergio Gor but at least he's out of the HR department permalink parent award report block reply onemanshow 0 points 6 hours ago The Trump admin is sus, that’s the purpose of your post? permalink parent award report block reply\nonemanshow 0 points 6 hours ago The Trump admin is sus, that’s the purpose of your post? permalink parent award report block reply",
  "fetched_at": "2025-11-12T22:58:28.639812Z"
}