{
  "id": "1ARK590MA4",
  "url": "https://patriots.win/p/1ARK590MA4/cut-food-stamps-by-50-for-bmi-ob/c",
  "content": "249 Cut food stamps by 50% for BMI OBESE, and 75% for morbidly obese posted 4 days ago by Diversity_Fire 17 comments award share report block Wall Street Mav @WallStreetMav • 4d I have come to the conclusion that for at least 50% of the recipients, SNAP food stamps EBT is incredibly unhealthy and likely kiIIing these people with morbid obesity and other related chronic illnesses. We should massively reduce eligibility for SNAP.\n17 comments Sort by Top Top New Worst Old Save Elon Walked Away – Now We Know Why Read More Ads by Ad.Style Marat1792 10 points 4 days ago What gets me about the whole damn thing is that food is already effectively free. Grain prices are so low that a lot of farmers didn't grow anything this year. If people could buy food at market rates, you could literally feed your whole family for the month by checking your sofa for loose change. But instead a loaf of chemistry class bread is heading to 3 dollars. We don't have an affordability problem. We have a racketeering problem. permalink award report block reply utfanx2 4 points 4 days ago Also a regulatory problem or a entrepreneurial problem. permalink parent award report block reply Harvestsmiles 3 points 4 days ago Also a knowledge of how to cook at home problem. permalink parent award report block reply RedStoneDeepState 2 points 4 days ago f people could buy food at market rates I can get a 50 pound bag of flour for just under 20 bucks. A bushel of wheat is 60 pounds and about ~5.50. You are paying for processing, which if you have ever seen a flour mill... its worth that cost. Still fucking cheap. Salt is 50 cents for a pound. Just under 20 bucks plus 50 cents... say 20 dollars 50 pounds of flour becomes about 100 pounds of bread. So with an existing yeast source, that is 20 dollars per 100 pounds of bread. Bread isnt expensive because of \"racketeering\" its expensive because bread goes bad easily and is labor/equipment intensive. permalink parent award report block reply Marat1792 1 points 4 days ago I have tried writing a response a couple of times now. I love looking at all the nitty gritty numbers, so it is easy for me to get side tracked. Here is the reality as I see it. No regular working man in the entire value chain is making more money. Farmers are actually being paid less. The truckers on the farms around me are mostly south africans who are being paid in room and board. The grain elevators and mills are making less money than they were even last year. The grocery stores are still making their same margins. And if we are being totally honest, I SERIOUSLY doubt the people at the bread factories are making any more money than they were last year. But the bread keeps going up in cost even though the input cost is lower. The only thing we are left to assume is that the bread company is increasing their margin because they know they can squeeze us. Same with everything else at the grocery store. permalink parent award report block reply TrumpAndGodWin 1 points 3 days ago For poor bastards with celiac disease they're raped for gf bread that's around $7 for a pathetic loaf. permalink parent award report block reply Pede 4 points 4 days ago I prefer someone just eyeballing it. No weighing, no tape, just fucking look like a normal person and say, yeah you're too fat, here's a multivitamin, don't eat for 3 months. Then check back. permalink award report block reply desertflower 3 points 4 days ago Get a job and learn how  cook from scratch. permalink award report block reply DingleBalls 3 points 4 days ago BMI is a bullshit unit of measurement though. Just say fat. permalink award report block reply Diversity_Fire OP 2 points 4 days ago This bitch is faster than she is tall permalink parent award report block reply barwhack 2 points 4 days ago Weigh-in every month. permalink award report block reply Greenhills 1 points 4 days ago Well for sure food stamps shouldn’t be eligible for anything and be worth $5k per person per month. I thought they were to augment. permalink award report block reply Ch3f4554551n 1 points 4 days ago 100% if you are 1 pound overweight. Want dat EBT, bitch? Get your big ass on the scale. permalink award report block reply Shih_Tabed 1 points 4 days ago To thwart all those who intentionally disabled their bodies to get benefits, they should just have to check into a gym and complete a program to become able bodied.  It would be a huge boon for public health across the board.  Yeah, PE class comes back to haunt them!  Once deemed able, the old system (Obama lifted) that limited able bodied adults without dependents (ABAWD) to 3 months of benefits in a 3 year period should take effect again.  It would be more beneficial to just stay in shape rather than have to go through all of this again. permalink award report block reply keeman 1 points 3 days ago Cut food stamps 100% by following the constitution. permalink award report block reply HanginChad 1 points 4 days ago I didn't eat anything today either, nothing yesterday, or the day before. Tomorrow I may just have some bone broth for the whole day. It's not that bad. Nothing to panic about and she's got a lot more reserves than I do. Just relax don't think about the hunger, you get used to it and doesn't get worse after a certain point. permalink award report block reply TrumpAndGodWin 1 points 3 days ago 5htp supplements can prevent hunger, but don't let your blood sugar drop too low. permalink parent award report block reply\nMarat1792 10 points 4 days ago What gets me about the whole damn thing is that food is already effectively free. Grain prices are so low that a lot of farmers didn't grow anything this year. If people could buy food at market rates, you could literally feed your whole family for the month by checking your sofa for loose change. But instead a loaf of chemistry class bread is heading to 3 dollars. We don't have an affordability problem. We have a racketeering problem. permalink award report block reply utfanx2 4 points 4 days ago Also a regulatory problem or a entrepreneurial problem. permalink parent award report block reply Harvestsmiles 3 points 4 days ago Also a knowledge of how to cook at home problem. permalink parent award report block reply RedStoneDeepState 2 points 4 days ago f people could buy food at market rates I can get a 50 pound bag of flour for just under 20 bucks. A bushel of wheat is 60 pounds and about ~5.50. You are paying for processing, which if you have ever seen a flour mill... its worth that cost. Still fucking cheap. Salt is 50 cents for a pound. Just under 20 bucks plus 50 cents... say 20 dollars 50 pounds of flour becomes about 100 pounds of bread. So with an existing yeast source, that is 20 dollars per 100 pounds of bread. Bread isnt expensive because of \"racketeering\" its expensive because bread goes bad easily and is labor/equipment intensive. permalink parent award report block reply Marat1792 1 points 4 days ago I have tried writing a response a couple of times now. I love looking at all the nitty gritty numbers, so it is easy for me to get side tracked. Here is the reality as I see it. No regular working man in the entire value chain is making more money. Farmers are actually being paid less. The truckers on the farms around me are mostly south africans who are being paid in room and board. The grain elevators and mills are making less money than they were even last year. The grocery stores are still making their same margins. And if we are being totally honest, I SERIOUSLY doubt the people at the bread factories are making any more money than they were last year. But the bread keeps going up in cost even though the input cost is lower. The only thing we are left to assume is that the bread company is increasing their margin because they know they can squeeze us. Same with everything else at the grocery store. permalink parent award report block reply TrumpAndGodWin 1 points 3 days ago For poor bastards with celiac disease they're raped for gf bread that's around $7 for a pathetic loaf. permalink parent award report block reply\nutfanx2 4 points 4 days ago Also a regulatory problem or a entrepreneurial problem. permalink parent award report block reply Harvestsmiles 3 points 4 days ago Also a knowledge of how to cook at home problem. permalink parent award report block reply\nHarvestsmiles 3 points 4 days ago Also a knowledge of how to cook at home problem. permalink parent award report block reply\nRedStoneDeepState 2 points 4 days ago f people could buy food at market rates I can get a 50 pound bag of flour for just under 20 bucks. A bushel of wheat is 60 pounds and about ~5.50. You are paying for processing, which if you have ever seen a flour mill... its worth that cost. Still fucking cheap. Salt is 50 cents for a pound. Just under 20 bucks plus 50 cents... say 20 dollars 50 pounds of flour becomes about 100 pounds of bread. So with an existing yeast source, that is 20 dollars per 100 pounds of bread. Bread isnt expensive because of \"racketeering\" its expensive because bread goes bad easily and is labor/equipment intensive. permalink parent award report block reply Marat1792 1 points 4 days ago I have tried writing a response a couple of times now. I love looking at all the nitty gritty numbers, so it is easy for me to get side tracked. Here is the reality as I see it. No regular working man in the entire value chain is making more money. Farmers are actually being paid less. The truckers on the farms around me are mostly south africans who are being paid in room and board. The grain elevators and mills are making less money than they were even last year. The grocery stores are still making their same margins. And if we are being totally honest, I SERIOUSLY doubt the people at the bread factories are making any more money than they were last year. But the bread keeps going up in cost even though the input cost is lower. The only thing we are left to assume is that the bread company is increasing their margin because they know they can squeeze us. Same with everything else at the grocery store. permalink parent award report block reply\nMarat1792 1 points 4 days ago I have tried writing a response a couple of times now. I love looking at all the nitty gritty numbers, so it is easy for me to get side tracked. Here is the reality as I see it. No regular working man in the entire value chain is making more money. Farmers are actually being paid less. The truckers on the farms around me are mostly south africans who are being paid in room and board. The grain elevators and mills are making less money than they were even last year. The grocery stores are still making their same margins. And if we are being totally honest, I SERIOUSLY doubt the people at the bread factories are making any more money than they were last year. But the bread keeps going up in cost even though the input cost is lower. The only thing we are left to assume is that the bread company is increasing their margin because they know they can squeeze us. Same with everything else at the grocery store. permalink parent award report block reply\nTrumpAndGodWin 1 points 3 days ago For poor bastards with celiac disease they're raped for gf bread that's around $7 for a pathetic loaf. permalink parent award report block reply\nPede 4 points 4 days ago I prefer someone just eyeballing it. No weighing, no tape, just fucking look like a normal person and say, yeah you're too fat, here's a multivitamin, don't eat for 3 months. Then check back. permalink award report block reply\ndesertflower 3 points 4 days ago Get a job and learn how  cook from scratch. permalink award report block reply\nDingleBalls 3 points 4 days ago BMI is a bullshit unit of measurement though. Just say fat. permalink award report block reply Diversity_Fire OP 2 points 4 days ago This bitch is faster than she is tall permalink parent award report block reply\nDiversity_Fire OP 2 points 4 days ago This bitch is faster than she is tall permalink parent award report block reply\nbarwhack 2 points 4 days ago Weigh-in every month. permalink award report block reply\nGreenhills 1 points 4 days ago Well for sure food stamps shouldn’t be eligible for anything and be worth $5k per person per month. I thought they were to augment. permalink award report block reply\nCh3f4554551n 1 points 4 days ago 100% if you are 1 pound overweight. Want dat EBT, bitch? Get your big ass on the scale. permalink award report block reply\nShih_Tabed 1 points 4 days ago To thwart all those who intentionally disabled their bodies to get benefits, they should just have to check into a gym and complete a program to become able bodied.  It would be a huge boon for public health across the board.  Yeah, PE class comes back to haunt them!  Once deemed able, the old system (Obama lifted) that limited able bodied adults without dependents (ABAWD) to 3 months of benefits in a 3 year period should take effect again.  It would be more beneficial to just stay in shape rather than have to go through all of this again. permalink award report block reply\nkeeman 1 points 3 days ago Cut food stamps 100% by following the constitution. permalink award report block reply\nHanginChad 1 points 4 days ago I didn't eat anything today either, nothing yesterday, or the day before. Tomorrow I may just have some bone broth for the whole day. It's not that bad. Nothing to panic about and she's got a lot more reserves than I do. Just relax don't think about the hunger, you get used to it and doesn't get worse after a certain point. permalink award report block reply TrumpAndGodWin 1 points 3 days ago 5htp supplements can prevent hunger, but don't let your blood sugar drop too low. permalink parent award report block reply\nTrumpAndGodWin 1 points 3 days ago 5htp supplements can prevent hunger, but don't let your blood sugar drop too low. permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:44:56.870046Z"
}