{
  "id": "8185518",
  "title": "78Trump needs to fire her asapposted3 hours agobyAntenna19 commentsawardsharereportblock",
  "url": "https://patriots.win/p/1ARK9nP4tk/trump-needs-to-fire-her-asap/c",
  "content": "106 Trump needs to fire her asap posted 7 hours ago by Antenna 19 comments award share report block ihatetyrants @ihatetyrants • 10h @Kaizerrev Trump needs to fire her asap\n19 comments Sort by Top Top New Worst Old Save FudgyFudgeBots 13 points 7 hours ago Susie and Blondi need to go. Susie is the gatekeeper who decides what information is passed to Trump and who gets an audience with him. Remember all the people that thought Mattis and kelly were \"based\" and some of us intuitive people said dont trust them, along with Pence.  i'm one of them and i'mtelling you that this women is up to no good. Blondi is just a useless beauty queen. permalink award report block reply Belleoffreedom 4 points 7 hours ago Dunno about Susie, but who the hell do you think is responsible for all those wins at the appellate level and the SCOTUS?  I love DJT to pieces, but the legal mind that is winning these cases and who set up DOGE to be bulletproof sure as hell was not him. permalink parent award report block reply MAGALADON9 3 points 6 hours ago We can get messages to him through the post i just did. permalink parent award report block reply Callsign_Fox1 11 points 7 hours ago She ain't going anywhere. permalink award report block reply spez_this 3 points 6 hours ago Yeah. She's been with him from the start. Unlikely he'll dump her unless there is a huge falling out. permalink parent award report block reply TrumpWonByALandslide 9 points 7 hours ago He needed to fire her 10 months ago... permalink award report block reply HamPrepper 5 points 7 hours ago Ok let’s be real. How many leaks have you seen in this administration? I’ll answer for you 0.0 How many in Trump 1.0? Infinity - 1. That’s her job and she is crushing it. permalink award report block reply shadypollster 2 points 7 hours ago Good analysis. permalink parent award report block reply Callsign_Fox1 1 points 7 hours ago Just putting out a theory. She has Trump hermetically sealed in a jar. Sure no leaks, but nothing goes in either without going through her. And well, we all know how that's going. permalink parent award report block reply South_Florida_Guy 3 points 6 hours ago Women don't belong in these positions at all permalink award report block reply DirtyDiaperJoe 2 points 6 hours ago I'm a woman and I completely agree with you.  We don't belong anywhere near government positions.  Period. permalink parent award report block reply MAGALADON9 3 points 6 hours ago He is crashing like some enormous starship weirdly slowly permalink award report block reply Grindelwald 3 points 7 hours ago Everyone is trying to tell Trump what to do.  How many posts have we seen saying something like this. permalink award report block reply Belleoffreedom 5 points 7 hours ago Where do they come from? permalink parent award report block reply Grindelwald 4 points 7 hours ago Paid actors.  Across the world sitting in boiler rooms pretending to be MAGA but spreading dissent.  It is a huge game being played. permalink parent award report block reply vongregormench 2 points 6 hours ago Are you going to give a reason or are you just going to tell us what a chief of staff does? permalink award report block reply SoulSnipper 2 points 6 hours ago Psy-ops are coming thick and fast. Always a sign that President Trump is about to drop a nuke. Pathetic how people believe these unsourced made up fantasies permalink award report block reply JoeMcCarthyWasRight 2 points 6 hours ago Is she in his head like that little fuck from Men in Black? Suzie isn’t the problem. It’s Trump. I’m sick of bailing him out with the “snakes around him giving him bad advice” he’s smart enough to know the words coming out of his mouth are everything 2015 Trump stood for. It’s not too late for Trump to fix this but goddamn I’m I heartbroken by these last few weeks. permalink award report block reply MAGALADON9 2 points 6 hours ago Get this message to djt through the following groups. You will have to add the \"bold\" with \"**\" yourself tho. Copy and paste this in other threads. GET ON THESE GUYS RADAR. CONTACT DIRECTLY. DJT OBSERVES THEM. LET THEM KNOW YOUR STRONG DISAPPOINTMENT AND DISAPPROVAL - EXAGGERATE A BIT. Rasmussen Reports Email: info@rasmussenreports.com ; Web form at rasmussenreports.com/contact_us Trump tweets their data weekly; say \"For Scott Rasmussen: My take on [issue].\" Trafalgar Group Form: thetrafalgargroup.org/contact; Phone: 202-810-2123 Robert Cahaly (lead) briefs Trump allies; emphasize GOP alignment. John McLaughlin Email: info@mclaughlinonline.com ; Phone: 305-894-1020 Trump's go-to; reference \"for John McLaughlin re: Trump priorities.\" TIPP Form: tippingpointpolls.com/contact; Email: info@tippingpointpolls.com ... if you actually give a fuck make a call. Send emails. permalink award report block reply Goozmania 1 points 7 hours ago He can't fire his boss... permalink award report block reply TrumpRideorDie74 1 points 1 hour ago He has too many women in his cabinet. They always bring strife to anything laid before them. permalink award report block reply\nFudgyFudgeBots 13 points 7 hours ago Susie and Blondi need to go. Susie is the gatekeeper who decides what information is passed to Trump and who gets an audience with him. Remember all the people that thought Mattis and kelly were \"based\" and some of us intuitive people said dont trust them, along with Pence.  i'm one of them and i'mtelling you that this women is up to no good. Blondi is just a useless beauty queen. permalink award report block reply Belleoffreedom 4 points 7 hours ago Dunno about Susie, but who the hell do you think is responsible for all those wins at the appellate level and the SCOTUS?  I love DJT to pieces, but the legal mind that is winning these cases and who set up DOGE to be bulletproof sure as hell was not him. permalink parent award report block reply MAGALADON9 3 points 6 hours ago We can get messages to him through the post i just did. permalink parent award report block reply\nBelleoffreedom 4 points 7 hours ago Dunno about Susie, but who the hell do you think is responsible for all those wins at the appellate level and the SCOTUS?  I love DJT to pieces, but the legal mind that is winning these cases and who set up DOGE to be bulletproof sure as hell was not him. permalink parent award report block reply\nMAGALADON9 3 points 6 hours ago We can get messages to him through the post i just did. permalink parent award report block reply\nCallsign_Fox1 11 points 7 hours ago She ain't going anywhere. permalink award report block reply spez_this 3 points 6 hours ago Yeah. She's been with him from the start. Unlikely he'll dump her unless there is a huge falling out. permalink parent award report block reply\nspez_this 3 points 6 hours ago Yeah. She's been with him from the start. Unlikely he'll dump her unless there is a huge falling out. permalink parent award report block reply\nTrumpWonByALandslide 9 points 7 hours ago He needed to fire her 10 months ago... permalink award report block reply\nHamPrepper 5 points 7 hours ago Ok let’s be real. How many leaks have you seen in this administration? I’ll answer for you 0.0 How many in Trump 1.0? Infinity - 1. That’s her job and she is crushing it. permalink award report block reply shadypollster 2 points 7 hours ago Good analysis. permalink parent award report block reply Callsign_Fox1 1 points 7 hours ago Just putting out a theory. She has Trump hermetically sealed in a jar. Sure no leaks, but nothing goes in either without going through her. And well, we all know how that's going. permalink parent award report block reply\nshadypollster 2 points 7 hours ago Good analysis. permalink parent award report block reply\nCallsign_Fox1 1 points 7 hours ago Just putting out a theory. She has Trump hermetically sealed in a jar. Sure no leaks, but nothing goes in either without going through her. And well, we all know how that's going. permalink parent award report block reply\nSouth_Florida_Guy 3 points 6 hours ago Women don't belong in these positions at all permalink award report block reply DirtyDiaperJoe 2 points 6 hours ago I'm a woman and I completely agree with you.  We don't belong anywhere near government positions.  Period. permalink parent award report block reply\nDirtyDiaperJoe 2 points 6 hours ago I'm a woman and I completely agree with you.  We don't belong anywhere near government positions.  Period. permalink parent award report block reply\nMAGALADON9 3 points 6 hours ago He is crashing like some enormous starship weirdly slowly permalink award report block reply\nGrindelwald 3 points 7 hours ago Everyone is trying to tell Trump what to do.  How many posts have we seen saying something like this. permalink award report block reply Belleoffreedom 5 points 7 hours ago Where do they come from? permalink parent award report block reply Grindelwald 4 points 7 hours ago Paid actors.  Across the world sitting in boiler rooms pretending to be MAGA but spreading dissent.  It is a huge game being played. permalink parent award report block reply\nBelleoffreedom 5 points 7 hours ago Where do they come from? permalink parent award report block reply Grindelwald 4 points 7 hours ago Paid actors.  Across the world sitting in boiler rooms pretending to be MAGA but spreading dissent.  It is a huge game being played. permalink parent award report block reply\nGrindelwald 4 points 7 hours ago Paid actors.  Across the world sitting in boiler rooms pretending to be MAGA but spreading dissent.  It is a huge game being played. permalink parent award report block reply\nvongregormench 2 points 6 hours ago Are you going to give a reason or are you just going to tell us what a chief of staff does? permalink award report block reply\nSoulSnipper 2 points 6 hours ago Psy-ops are coming thick and fast. Always a sign that President Trump is about to drop a nuke. Pathetic how people believe these unsourced made up fantasies permalink award report block reply\nJoeMcCarthyWasRight 2 points 6 hours ago Is she in his head like that little fuck from Men in Black? Suzie isn’t the problem. It’s Trump. I’m sick of bailing him out with the “snakes around him giving him bad advice” he’s smart enough to know the words coming out of his mouth are everything 2015 Trump stood for. It’s not too late for Trump to fix this but goddamn I’m I heartbroken by these last few weeks. permalink award report block reply\nMAGALADON9 2 points 6 hours ago Get this message to djt through the following groups. You will have to add the \"bold\" with \"**\" yourself tho. Copy and paste this in other threads. GET ON THESE GUYS RADAR. CONTACT DIRECTLY. DJT OBSERVES THEM. LET THEM KNOW YOUR STRONG DISAPPOINTMENT AND DISAPPROVAL - EXAGGERATE A BIT. Rasmussen Reports Email: info@rasmussenreports.com ; Web form at rasmussenreports.com/contact_us Trump tweets their data weekly; say \"For Scott Rasmussen: My take on [issue].\" Trafalgar Group Form: thetrafalgargroup.org/contact; Phone: 202-810-2123 Robert Cahaly (lead) briefs Trump allies; emphasize GOP alignment. John McLaughlin Email: info@mclaughlinonline.com ; Phone: 305-894-1020 Trump's go-to; reference \"for John McLaughlin re: Trump priorities.\" TIPP Form: tippingpointpolls.com/contact; Email: info@tippingpointpolls.com ... if you actually give a fuck make a call. Send emails. permalink award report block reply\nGoozmania 1 points 7 hours ago He can't fire his boss... permalink award report block reply\nTrumpRideorDie74 1 points 1 hour ago He has too many women in his cabinet. They always bring strife to anything laid before them. permalink award report block reply",
  "fetched_at": "2025-11-12T23:46:18.207569Z"
}