{
  "id": "1ARK53K5yd",
  "url": "https://patriots.win/p/1ARK53K5yd/republicans-in-wisconsin-introdu/c",
  "content": "528 Republicans in Wisconsin introduced a new bill that will ALLOW individuals to SUE health care providers for performing chemical and surgical castrations on CHILDREN. THIS MUST PASS PROTECT THE CHILDREN. Republicans have a majority in the House (54-45) and Senate (18-15). posted 6 days ago by Mr_Rightside 6 comments award share report block Libs of TikTok @libsoftiktok • 6d JUST IN: Republicans in Wisconsin introduced a new bill that will ALLOW individuals to SUE health care providers for performing chemical and surgical castrations on CHILDREN. THIS MUST PASS PROTECT THE CHILDREN\n6 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget ColonelKlink 3 points 6 days ago They should be in prison. permalink award report block reply Tim_Berframer 3 points 6 days ago Many of the Dims who voted against this bill keep their penises in the freezer. permalink award report block reply GhostOfTheRepublic 2 points 6 days ago Don’t care!!  Secure the vote.  Clean up the voter rolls.  Remove illegals.  Re-district and undo Dem gerrymandering. Everything else will follow. permalink award report block reply Mungo 1 points 6 days ago It won’t pass. If it does the Dem Governor will veto it.\nAnd I surprised they even brought it up. The Wisconsin “Republicans” are all pathetic Rinos. permalink award report block reply Trump4Infinity 1 points 6 days ago This is their build up to the midterms. They're going to start promoting hard core legislation they know can't pass. The Democrats will then get to use it and spin for their propaganda and get to run on \"I'm not a monster\" (they are) and lock up congress and the states and wait till Trump's out, then back to normal. permalink parent award report block reply mikethemarine 1 points 6 days ago smart move the doctors won't take a chance of getting sued down the road permalink award report block reply\nColonelKlink 3 points 6 days ago They should be in prison. permalink award report block reply\nTim_Berframer 3 points 6 days ago Many of the Dims who voted against this bill keep their penises in the freezer. permalink award report block reply\nGhostOfTheRepublic 2 points 6 days ago Don’t care!!  Secure the vote.  Clean up the voter rolls.  Remove illegals.  Re-district and undo Dem gerrymandering. Everything else will follow. permalink award report block reply\nMungo 1 points 6 days ago It won’t pass. If it does the Dem Governor will veto it.\nAnd I surprised they even brought it up. The Wisconsin “Republicans” are all pathetic Rinos. permalink award report block reply Trump4Infinity 1 points 6 days ago This is their build up to the midterms. They're going to start promoting hard core legislation they know can't pass. The Democrats will then get to use it and spin for their propaganda and get to run on \"I'm not a monster\" (they are) and lock up congress and the states and wait till Trump's out, then back to normal. permalink parent award report block reply\nTrump4Infinity 1 points 6 days ago This is their build up to the midterms. They're going to start promoting hard core legislation they know can't pass. The Democrats will then get to use it and spin for their propaganda and get to run on \"I'm not a monster\" (they are) and lock up congress and the states and wait till Trump's out, then back to normal. permalink parent award report block reply\nmikethemarine 1 points 6 days ago smart move the doctors won't take a chance of getting sued down the road permalink award report block reply",
  "fetched_at": "2025-11-12T21:17:07.562289Z"
}