{
  "id": "1ARK57smFt",
  "url": "https://patriots.win/p/1ARK57smFt/a-50-year-mortgage-will-not-lowe/c",
  "content": "281 A 50 year mortgage will not lower home prices, it will raise them because sellers will ALWAYS price based on what monthly payment buyers can afford. posted 4 days ago by BlackPilledMAGA 55 comments award share report block Lower the monthly payment with a 50 year mortgage and sellers will immediately raise their sales prices to the point where the monthly payment would be right at the maximum buyers can afford to pay. That means home prices go UP massively. Great for a wealthy real estate tycoon like Trump, horrible for the average buyer. This would not open the door to home ownership for millions, it would close the door on them.\n55 comments Sort by Top Top New Worst Old Save loooooof 12 points 4 days ago Being permanent usury chattel.  \"You will own nothing and be happy\". permalink award report block reply Patriot4TN 4 points 4 days ago That rolls around in 2030. permalink parent award report block reply E-dantes 2 points 4 days ago This exactly. permalink parent award report block reply CleanUpPhillyTrump24 1 points 4 days ago I'd do it. Then I'd pay it off sooner. So long as the interest rates are not exorbitant. permalink parent award report block reply loooooof 2 points 4 days ago The point is, it shouldn't have to be an alternative used as a 'fix'. permalink parent award report block reply MasterChief 11 points 4 days ago Show me a relatively new house the average person can afford that will last 50 years... I'll wait. permalink award report block reply HockeyMom4Trump 1 points 4 days ago New? I doubt that exists. Construction looks pretty concerning these days. permalink parent award report block reply E-dantes 0 points 4 days ago They don't exist, and haven't for some time. permalink parent award report block reply Crappydatum 11 points 4 days ago Downvoted for economies illiteracy permalink award report block reply JohnN 8 points 4 days ago 100%. The market will determine home prices.  After that, interest rates will determine monthly payment. permalink parent award report block reply SirPokeSmottington 4 points 4 days ago Downvoted for economies illiteracy Lol, it doesn't matter. Most everyone here is like a leftist, just on the right. Meaning, the FIRST THING THEY SEE, is a fact. Nothing else is able to erase that fact, and we constantly birth new retards. Yeah... the housing market isn't doctors or Walmart. 50 year mortgage, CANNOT affect the prices. A house cannot be worth more than the neighborhood it is in. $/sf rules. permalink parent award report block reply RustySheckelford 7 points 4 days ago But will banks give out inflated loans above the homes  actuall value? permalink award report block reply SurfandTurf 6 points 4 days ago Great point. Probably not. permalink parent award report block reply tralbolh 5 points 4 days ago Yes. If the last 25 years are any indication, definitely permalink parent award report block reply Avenatti2020 2 points 4 days ago They’ll give out loans for the actual value then the buyers can make up the rest with cash. Once one buyer does this in a neighborhood, appraisers then have a comp they can base higher value on for other homes in the neighborhood. That then justifies to a lender the new benchmark value. Essentially just need one person paying over market value to drive up all prices. Won’t happen to the same degree of covid years, but we will see rising prices with 50 year loans. permalink parent award report block reply Datamancer 7 points 4 days ago If what you are saying is accurate, than home prices would already be falling because the market cannot afford them. permalink award report block reply thunderpussy 1 points 4 days ago Not when you have plenty of corporate investors picking up the slack..... permalink parent award report block reply PatriotTech 4 points 4 days ago Or punish flippers and residential realestate investments. Ban investment firms from owning residential property and encouragement home ownership through reduced interest rates and reduction of capital gains when selling homes.\nFor every year you own your house, when selling any profit is taxes reduced by 1% for each year you owned the home for homes under 2 million and income under 500k. Gov interest rate reduction program of .25% for new homebuyers for each year not late on mortgage payments. permalink award report block reply Crappydatum 3 points 4 days ago As of 1993, the Japanese have 100 year mortgages https://www.sciencedirect.com/science/article/abs/pii/1061951895900047 permalink award report block reply E-dantes 0 points 4 days ago Wage slavery? permalink parent award report block reply Crappydatum 1 points 4 days ago Housing got incredibly high, wages didn't track. The theory was (and still is) that you'd pay a slightly more affordable payment and pass it on when you sold. In fact a secondary market appeared for folks wanting to take over those payments permalink parent award report block reply E-dantes 1 points 4 days ago Lol. Yeah, because I wanna tack on another 200,000 dollars from an underwater loan I've been paying on for 15 years to another loan, while some othe schmuck takes a licking on a house that's built to last 10 years, with a loan for another fifty years? Fuck off with that moronic bullshit. Keep playing fortnite. It'll make you rich! permalink parent award report block reply Crappydatum 1 points 3 days ago Sorry Charlie I've owned 9 houses so far, paid every one of them off. Several are still paying me income and I've put 5 in my children's names. Ymmv permalink parent award report block reply view 5 more comments... keeman 2 points 4 days ago At some point, Trump will implement so much socialism that we won't need Democrats anymore.  We should be ending Fannie and Freddie, but here we are talking about giving them more power.  The swamp must be thrilled. permalink award report block reply Zadok 2 points 4 days ago Totally agree with you.  Home purchase is based on what you can afford, determined by monthly payment. permalink award report block reply E-dantes 0 points 4 days ago Based on one 3rd of your yearly income. You forgot that part. permalink parent award report block reply E-dantes 1 points 4 days ago It's not even closing the door. It's us telling everyone around us, including our children \"why the fuck would I sign a contract that's nearly 2/3 of my entire lifespan,  oh, and can I please add property taxes on top, pretty please?\" That will destroy not one generations motivation or thought for even pursuing homeownership, but potentially three to four generations from now saying \"FUCK THAT!\". permalink award report block reply RealmanPwns 1 points 4 days ago Makes no sense.  Seller and Bank giving Mortgage are not same people (most of the time) So seller has no interest in what monthly payment is. permalink award report block reply HockeyMom4Trump 1 points 4 days ago This is a ridiculous idea. Like college, home ownership is not for everyone. permalink award report block reply 2016TrumpMAGA 1 points 4 days ago This. permalink award report block reply RedFoxOnFire 1 points 4 days ago You'll have to put your retirement on hold in order to pay your house off. permalink award report block reply E-dantes 1 points 4 days ago There won't be a retirement. permalink parent award report block reply NoFats 1 points 4 days ago Everyone should read The Jungle. Home ownership has always been like this. permalink award report block reply booblitchutz 1 points 4 days ago Imagine how long it would take to even touch the principal. This is just renting with a big down payment. permalink award report block reply RiffFantastic 1 points 4 days ago Agreed. Trump needs to back away from this idea quickly. permalink award report block reply PepesJusticeBoner 1 points 4 days ago Doesn't make sense that a 50 year mortgage applicant would pay a penny more than a traditional 30 year mortgage applicant. The seller is just looking for the highest offer and is oblivious unless the buyer mentions they have cash for a quick and easy closing. But I agree that a 50 year mortgage will not lower home prices. Just like a 10 year auto loan doesn't lower vehicle prices. And as others said these new homes and vehicles and such are not built to last. They'll fall apart before the loan is paid off. Happy we bought an older home and know how to make repairs. Hard to fix a whole house that wasn't built properly in 2025 with all the Chinese materials of questionable quality. permalink award report block reply astralentity 1 points 4 days ago If I sell mine, I won't adjust the price like that.  People can get mad all they want that I won't raise my price. EDIT:  These home buyer outfits, if they keep it up, I'll counter offer with $10M. permalink award report block reply LolitaExpressPilot 1 points 4 days ago Sellers price based on monthly payment buyers can afford? That doesn't even kind of make sense. Are you smoking crack? permalink award report block reply RINO_fatigue 1 points 4 days ago I HATE TRUMP HE IS A TOTAL RETARD!!!\nI KNOW WAY MORE ABOUT THE REAL ESTATE BUSINESS THAN HIM!!!\nGIBE ME DAT HOUSE FO FREE!!!\nt. OP if you're so brilliant in the real estate business then how come you can't afford a house? permalink award report block reply Crappydatum 3 points 4 days ago 🤣🤣🤓 permalink parent award report block reply Patriot4TN 2 points 4 days ago Inquiring minds want to know. permalink parent award report block reply E-dantes 0 points 4 days ago Oh, I don't know, maybe because illegals bought them all with my tax dollars, meanwhile the dollar has lost more than 50% of its value since I was fucking born? Just maybe. You fucking retard. Fuck you permalink parent award report block reply HairSniffer 1 points 4 days ago Longer mortgages could bring more competing buyers.  That could result in higher market prices. permalink award report block reply Krat 1 points 4 days ago Its already closed to them because they did nothing as hubdreds of millions looted them dry and are now competing for every resource: free food, free medical, free school, and more permalink award report block reply corntortilla 1 points 4 days ago Home prices are not set by mortgage rates or sellers. Offer prices are set by comps and final price is set by buyers. Homes only sell for what buyers are willing to pay. Op is illiterate. permalink award report block reply RealmanPwns 0 points 4 days ago It will cost more interest thus more money over length of mortgage. permalink award report block reply RealmanPwns 0 points 4 days ago Extra Interest vs. 30-Year\n30-Year\n$2,080 monthly payment -\n$409,662 50-Year\n$1,950 monthly payment -\n$764,139 $354,477 extra Saves 130 dollars a month  but Interest Kills permalink award report block reply Sicsempertyrannis76 1 points 4 days ago and this is before the property taxes, and homeowners insurance goes up during the 50 years permalink parent award report block reply AllisterTwo 1 points 4 days ago People don't care, there are people right now buying houses with 15 and 30 year mortgages that are literally costing them nearly twice as much vs what they would have paid just 4 years ago! The total interest paid on a $300,000 mortgage over 30 years at a the current give or take 6.3% interest rate would be approximately $350,013...  AKA more than doubled the actual price of the house!!!  Total cost of $300K house $650,013... The total interest paid on a $300,000 mortgage over 30 years at the 2.9% interest rate found in 2021 is approximately $136,962...  Total cost of $300K house $436,962... permalink parent award report block reply redditadminssuckit -2 points 4 days ago I'm tired of hearing this argument. Unless your last car loan was 12 or 24 months, then you're a hypocrite. By the way, nobody's forcing anyone to take a 50-year loan. There are certain geographic areas where it might make sense and there's nothing preventing a person from prepaying and amortizing it over a shorter period. Why the hell would anyone want less choice? permalink award report block reply\nloooooof 12 points 4 days ago Being permanent usury chattel.  \"You will own nothing and be happy\". permalink award report block reply Patriot4TN 4 points 4 days ago That rolls around in 2030. permalink parent award report block reply E-dantes 2 points 4 days ago This exactly. permalink parent award report block reply CleanUpPhillyTrump24 1 points 4 days ago I'd do it. Then I'd pay it off sooner. So long as the interest rates are not exorbitant. permalink parent award report block reply loooooof 2 points 4 days ago The point is, it shouldn't have to be an alternative used as a 'fix'. permalink parent award report block reply\nPatriot4TN 4 points 4 days ago That rolls around in 2030. permalink parent award report block reply\nE-dantes 2 points 4 days ago This exactly. permalink parent award report block reply\nCleanUpPhillyTrump24 1 points 4 days ago I'd do it. Then I'd pay it off sooner. So long as the interest rates are not exorbitant. permalink parent award report block reply loooooof 2 points 4 days ago The point is, it shouldn't have to be an alternative used as a 'fix'. permalink parent award report block reply\nloooooof 2 points 4 days ago The point is, it shouldn't have to be an alternative used as a 'fix'. permalink parent award report block reply\nMasterChief 11 points 4 days ago Show me a relatively new house the average person can afford that will last 50 years... I'll wait. permalink award report block reply HockeyMom4Trump 1 points 4 days ago New? I doubt that exists. Construction looks pretty concerning these days. permalink parent award report block reply E-dantes 0 points 4 days ago They don't exist, and haven't for some time. permalink parent award report block reply\nHockeyMom4Trump 1 points 4 days ago New? I doubt that exists. Construction looks pretty concerning these days. permalink parent award report block reply\nE-dantes 0 points 4 days ago They don't exist, and haven't for some time. permalink parent award report block reply\nCrappydatum 11 points 4 days ago Downvoted for economies illiteracy permalink award report block reply JohnN 8 points 4 days ago 100%. The market will determine home prices.  After that, interest rates will determine monthly payment. permalink parent award report block reply SirPokeSmottington 4 points 4 days ago Downvoted for economies illiteracy Lol, it doesn't matter. Most everyone here is like a leftist, just on the right. Meaning, the FIRST THING THEY SEE, is a fact. Nothing else is able to erase that fact, and we constantly birth new retards. Yeah... the housing market isn't doctors or Walmart. 50 year mortgage, CANNOT affect the prices. A house cannot be worth more than the neighborhood it is in. $/sf rules. permalink parent award report block reply\nJohnN 8 points 4 days ago 100%. The market will determine home prices.  After that, interest rates will determine monthly payment. permalink parent award report block reply\nSirPokeSmottington 4 points 4 days ago Downvoted for economies illiteracy Lol, it doesn't matter. Most everyone here is like a leftist, just on the right. Meaning, the FIRST THING THEY SEE, is a fact. Nothing else is able to erase that fact, and we constantly birth new retards. Yeah... the housing market isn't doctors or Walmart. 50 year mortgage, CANNOT affect the prices. A house cannot be worth more than the neighborhood it is in. $/sf rules. permalink parent award report block reply\nRustySheckelford 7 points 4 days ago But will banks give out inflated loans above the homes  actuall value? permalink award report block reply SurfandTurf 6 points 4 days ago Great point. Probably not. permalink parent award report block reply tralbolh 5 points 4 days ago Yes. If the last 25 years are any indication, definitely permalink parent award report block reply Avenatti2020 2 points 4 days ago They’ll give out loans for the actual value then the buyers can make up the rest with cash. Once one buyer does this in a neighborhood, appraisers then have a comp they can base higher value on for other homes in the neighborhood. That then justifies to a lender the new benchmark value. Essentially just need one person paying over market value to drive up all prices. Won’t happen to the same degree of covid years, but we will see rising prices with 50 year loans. permalink parent award report block reply\nSurfandTurf 6 points 4 days ago Great point. Probably not. permalink parent award report block reply\ntralbolh 5 points 4 days ago Yes. If the last 25 years are any indication, definitely permalink parent award report block reply\nAvenatti2020 2 points 4 days ago They’ll give out loans for the actual value then the buyers can make up the rest with cash. Once one buyer does this in a neighborhood, appraisers then have a comp they can base higher value on for other homes in the neighborhood. That then justifies to a lender the new benchmark value. Essentially just need one person paying over market value to drive up all prices. Won’t happen to the same degree of covid years, but we will see rising prices with 50 year loans. permalink parent award report block reply\nDatamancer 7 points 4 days ago If what you are saying is accurate, than home prices would already be falling because the market cannot afford them. permalink award report block reply thunderpussy 1 points 4 days ago Not when you have plenty of corporate investors picking up the slack..... permalink parent award report block reply\nthunderpussy 1 points 4 days ago Not when you have plenty of corporate investors picking up the slack..... permalink parent award report block reply\nPatriotTech 4 points 4 days ago Or punish flippers and residential realestate investments. Ban investment firms from owning residential property and encouragement home ownership through reduced interest rates and reduction of capital gains when selling homes.\nFor every year you own your house, when selling any profit is taxes reduced by 1% for each year you owned the home for homes under 2 million and income under 500k. Gov interest rate reduction program of .25% for new homebuyers for each year not late on mortgage payments. permalink award report block reply\nCrappydatum 3 points 4 days ago As of 1993, the Japanese have 100 year mortgages https://www.sciencedirect.com/science/article/abs/pii/1061951895900047 permalink award report block reply E-dantes 0 points 4 days ago Wage slavery? permalink parent award report block reply Crappydatum 1 points 4 days ago Housing got incredibly high, wages didn't track. The theory was (and still is) that you'd pay a slightly more affordable payment and pass it on when you sold. In fact a secondary market appeared for folks wanting to take over those payments permalink parent award report block reply E-dantes 1 points 4 days ago Lol. Yeah, because I wanna tack on another 200,000 dollars from an underwater loan I've been paying on for 15 years to another loan, while some othe schmuck takes a licking on a house that's built to last 10 years, with a loan for another fifty years? Fuck off with that moronic bullshit. Keep playing fortnite. It'll make you rich! permalink parent award report block reply Crappydatum 1 points 3 days ago Sorry Charlie I've owned 9 houses so far, paid every one of them off. Several are still paying me income and I've put 5 in my children's names. Ymmv permalink parent award report block reply view 5 more comments...\nE-dantes 0 points 4 days ago Wage slavery? permalink parent award report block reply Crappydatum 1 points 4 days ago Housing got incredibly high, wages didn't track. The theory was (and still is) that you'd pay a slightly more affordable payment and pass it on when you sold. In fact a secondary market appeared for folks wanting to take over those payments permalink parent award report block reply E-dantes 1 points 4 days ago Lol. Yeah, because I wanna tack on another 200,000 dollars from an underwater loan I've been paying on for 15 years to another loan, while some othe schmuck takes a licking on a house that's built to last 10 years, with a loan for another fifty years? Fuck off with that moronic bullshit. Keep playing fortnite. It'll make you rich! permalink parent award report block reply Crappydatum 1 points 3 days ago Sorry Charlie I've owned 9 houses so far, paid every one of them off. Several are still paying me income and I've put 5 in my children's names. Ymmv permalink parent award report block reply view 5 more comments...\nCrappydatum 1 points 4 days ago Housing got incredibly high, wages didn't track. The theory was (and still is) that you'd pay a slightly more affordable payment and pass it on when you sold. In fact a secondary market appeared for folks wanting to take over those payments permalink parent award report block reply E-dantes 1 points 4 days ago Lol. Yeah, because I wanna tack on another 200,000 dollars from an underwater loan I've been paying on for 15 years to another loan, while some othe schmuck takes a licking on a house that's built to last 10 years, with a loan for another fifty years? Fuck off with that moronic bullshit. Keep playing fortnite. It'll make you rich! permalink parent award report block reply Crappydatum 1 points 3 days ago Sorry Charlie I've owned 9 houses so far, paid every one of them off. Several are still paying me income and I've put 5 in my children's names. Ymmv permalink parent award report block reply view 5 more comments...\nE-dantes 1 points 4 days ago Lol. Yeah, because I wanna tack on another 200,000 dollars from an underwater loan I've been paying on for 15 years to another loan, while some othe schmuck takes a licking on a house that's built to last 10 years, with a loan for another fifty years? Fuck off with that moronic bullshit. Keep playing fortnite. It'll make you rich! permalink parent award report block reply Crappydatum 1 points 3 days ago Sorry Charlie I've owned 9 houses so far, paid every one of them off. Several are still paying me income and I've put 5 in my children's names. Ymmv permalink parent award report block reply view 5 more comments...\nCrappydatum 1 points 3 days ago Sorry Charlie I've owned 9 houses so far, paid every one of them off. Several are still paying me income and I've put 5 in my children's names. Ymmv permalink parent award report block reply view 5 more comments...\nkeeman 2 points 4 days ago At some point, Trump will implement so much socialism that we won't need Democrats anymore.  We should be ending Fannie and Freddie, but here we are talking about giving them more power.  The swamp must be thrilled. permalink award report block reply\nZadok 2 points 4 days ago Totally agree with you.  Home purchase is based on what you can afford, determined by monthly payment. permalink award report block reply E-dantes 0 points 4 days ago Based on one 3rd of your yearly income. You forgot that part. permalink parent award report block reply\nE-dantes 0 points 4 days ago Based on one 3rd of your yearly income. You forgot that part. permalink parent award report block reply\nE-dantes 1 points 4 days ago It's not even closing the door. It's us telling everyone around us, including our children \"why the fuck would I sign a contract that's nearly 2/3 of my entire lifespan,  oh, and can I please add property taxes on top, pretty please?\" That will destroy not one generations motivation or thought for even pursuing homeownership, but potentially three to four generations from now saying \"FUCK THAT!\". permalink award report block reply\nRealmanPwns 1 points 4 days ago Makes no sense.  Seller and Bank giving Mortgage are not same people (most of the time) So seller has no interest in what monthly payment is. permalink award report block reply\nHockeyMom4Trump 1 points 4 days ago This is a ridiculous idea. Like college, home ownership is not for everyone. permalink award report block reply\n2016TrumpMAGA 1 points 4 days ago This. permalink award report block reply\nRedFoxOnFire 1 points 4 days ago You'll have to put your retirement on hold in order to pay your house off. permalink award report block reply E-dantes 1 points 4 days ago There won't be a retirement. permalink parent award report block reply\nE-dantes 1 points 4 days ago There won't be a retirement. permalink parent award report block reply\nNoFats 1 points 4 days ago Everyone should read The Jungle. Home ownership has always been like this. permalink award report block reply\nbooblitchutz 1 points 4 days ago Imagine how long it would take to even touch the principal. This is just renting with a big down payment. permalink award report block reply\nRiffFantastic 1 points 4 days ago Agreed. Trump needs to back away from this idea quickly. permalink award report block reply\nPepesJusticeBoner 1 points 4 days ago Doesn't make sense that a 50 year mortgage applicant would pay a penny more than a traditional 30 year mortgage applicant. The seller is just looking for the highest offer and is oblivious unless the buyer mentions they have cash for a quick and easy closing. But I agree that a 50 year mortgage will not lower home prices. Just like a 10 year auto loan doesn't lower vehicle prices. And as others said these new homes and vehicles and such are not built to last. They'll fall apart before the loan is paid off. Happy we bought an older home and know how to make repairs. Hard to fix a whole house that wasn't built properly in 2025 with all the Chinese materials of questionable quality. permalink award report block reply\nastralentity 1 points 4 days ago If I sell mine, I won't adjust the price like that.  People can get mad all they want that I won't raise my price. EDIT:  These home buyer outfits, if they keep it up, I'll counter offer with $10M. permalink award report block reply\nLolitaExpressPilot 1 points 4 days ago Sellers price based on monthly payment buyers can afford? That doesn't even kind of make sense. Are you smoking crack? permalink award report block reply\nRINO_fatigue 1 points 4 days ago I HATE TRUMP HE IS A TOTAL RETARD!!!\nI KNOW WAY MORE ABOUT THE REAL ESTATE BUSINESS THAN HIM!!!\nGIBE ME DAT HOUSE FO FREE!!!\nt. OP if you're so brilliant in the real estate business then how come you can't afford a house? permalink award report block reply Crappydatum 3 points 4 days ago 🤣🤣🤓 permalink parent award report block reply Patriot4TN 2 points 4 days ago Inquiring minds want to know. permalink parent award report block reply E-dantes 0 points 4 days ago Oh, I don't know, maybe because illegals bought them all with my tax dollars, meanwhile the dollar has lost more than 50% of its value since I was fucking born? Just maybe. You fucking retard. Fuck you permalink parent award report block reply\nCrappydatum 3 points 4 days ago 🤣🤣🤓 permalink parent award report block reply\nPatriot4TN 2 points 4 days ago Inquiring minds want to know. permalink parent award report block reply\nE-dantes 0 points 4 days ago Oh, I don't know, maybe because illegals bought them all with my tax dollars, meanwhile the dollar has lost more than 50% of its value since I was fucking born? Just maybe. You fucking retard. Fuck you permalink parent award report block reply\nHairSniffer 1 points 4 days ago Longer mortgages could bring more competing buyers.  That could result in higher market prices. permalink award report block reply\nKrat 1 points 4 days ago Its already closed to them because they did nothing as hubdreds of millions looted them dry and are now competing for every resource: free food, free medical, free school, and more permalink award report block reply\ncorntortilla 1 points 4 days ago Home prices are not set by mortgage rates or sellers. Offer prices are set by comps and final price is set by buyers. Homes only sell for what buyers are willing to pay. Op is illiterate. permalink award report block reply\nRealmanPwns 0 points 4 days ago It will cost more interest thus more money over length of mortgage. permalink award report block reply\nRealmanPwns 0 points 4 days ago Extra Interest vs. 30-Year\n30-Year\n$2,080 monthly payment -\n$409,662 50-Year\n$1,950 monthly payment -\n$764,139 $354,477 extra Saves 130 dollars a month  but Interest Kills permalink award report block reply Sicsempertyrannis76 1 points 4 days ago and this is before the property taxes, and homeowners insurance goes up during the 50 years permalink parent award report block reply AllisterTwo 1 points 4 days ago People don't care, there are people right now buying houses with 15 and 30 year mortgages that are literally costing them nearly twice as much vs what they would have paid just 4 years ago! The total interest paid on a $300,000 mortgage over 30 years at a the current give or take 6.3% interest rate would be approximately $350,013...  AKA more than doubled the actual price of the house!!!  Total cost of $300K house $650,013... The total interest paid on a $300,000 mortgage over 30 years at the 2.9% interest rate found in 2021 is approximately $136,962...  Total cost of $300K house $436,962... permalink parent award report block reply\nSicsempertyrannis76 1 points 4 days ago and this is before the property taxes, and homeowners insurance goes up during the 50 years permalink parent award report block reply\nAllisterTwo 1 points 4 days ago People don't care, there are people right now buying houses with 15 and 30 year mortgages that are literally costing them nearly twice as much vs what they would have paid just 4 years ago! The total interest paid on a $300,000 mortgage over 30 years at a the current give or take 6.3% interest rate would be approximately $350,013...  AKA more than doubled the actual price of the house!!!  Total cost of $300K house $650,013... The total interest paid on a $300,000 mortgage over 30 years at the 2.9% interest rate found in 2021 is approximately $136,962...  Total cost of $300K house $436,962... permalink parent award report block reply\nredditadminssuckit -2 points 4 days ago I'm tired of hearing this argument. Unless your last car loan was 12 or 24 months, then you're a hypocrite. By the way, nobody's forcing anyone to take a 50-year loan. There are certain geographic areas where it might make sense and there's nothing preventing a person from prepaying and amortizing it over a shorter period. Why the hell would anyone want less choice? permalink award report block reply",
  "fetched_at": "2025-11-12T23:04:59.555903Z"
}