{
  "id": "8175790",
  "title": "1125These Swedish stats are insane. 1st and 2nd generation migrants make up virtually all of the cou",
  "url": "https://patriots.win/p/1ARK56kOKe/these-swedish-stats-are-insane-1/c",
  "content": "1125 These Swedish stats are insane. 1st and 2nd generation migrants make up virtually all of the country's organised crime, and around four-fifths of street gangs and other crime networks. \nSweden could literally push the switch and fix everything. posted 4 days ago by IlhansBrother 52 comments award share download report block\n52 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno Deplorable556 43 points 4 days ago please save sweden. some of the most beautiful women are from sweden. REAL women, with all the goods. not them fake gayboys in a wig. permalink award report block reply Lelleck 25 points 4 days ago They are allowed to vote and this is what they voted for. permalink parent award report block reply BlippiIsAPedo 12 points 4 days ago Lol oh you permalink parent award report block reply tarballs 7 points 4 days ago They've been brainwashed and indoctrinated and \"democracy\" is regularly rigged bullshit, sure, but western capitalist welfare states like Sweden are not the USSR. They have free right to gather together, to turn off the TV, to get on a soapbox and preach in public (the worst they can do is put you in a temporary timeout box). They could've formed parties more right-wing than the Swedish Democrats and voted for them, they can put pressure on their police to stop being traitors, they can create a counterpart girl to Greta Thunberg. They can make immigrants feel unwelcome, they can stop buying their kebabs and their shwarma. They can smack their hysterical women and get them under control. But they don't. Their children get crushed by islamic trucks in Stockholm, and they do NOTHING. They know that there are grownass rapefugee men posing as teenagers in order to attend school, and they do NOTHING. They go to sleep to the sound of balkan grenades popping off in gang wars. Based, self-loving Europeans are so few in number and so hated by the rest of society, all they can do is hang out in the woods and work out. Americans literally care more about European countries, and Australia, than the Europeans themselves. We show concern and try to get them to wake up and they tell us, \"Oh STFU seppo, I'm so sick of you fat burger inhalers telling us about our country! You don't know shit! Turn off Fox News! Idiot!\" This is who they are and how they choose to live. permalink parent award report block reply AfrikaanerBoer 6 points 4 days ago Search:  BARBARA LERNER-SPECTRE permalink parent award report block reply BidenShowerDrool 3 points 4 days ago thanks for this. She is one of the founding \"Academics\" and \"Movements\" in the migrational destruction and blackifying of Europe. why is it that behind all these ill conceived and nation destroying plans there always is a big piece of the  structure is formed by one very small demographic who staunchly back each other regardless of dangerous and deathly the outcomes. permalink parent award report block reply American-Patriot 4 points 4 days ago This is why we need to ban the 19th amendment and it's equivalent across the world. Never again. permalink parent award report block reply Aquamine-Amarine -5 points 4 days ago Do you have proof? No, you don't, you're just sexist and falsely assuming someone's voting habits. Men aren't exactly innocent here either. Leftists from both sexes voted for this shit. permalink parent award report block reply PoliticsAreBlank 8 points 4 days ago https://en.wikipedia.org/wiki/2022_Swedish_general_election#Voter_demographics The proof is in the voting demographics. permalink parent award report block reply Jack_NC 3 points 4 days ago yes, liberals of both sexes vote for liberalism. But women vote liberal in far, FAR greater numbers. nearly 2x. All that's missing to this three-panel cartoon is a final \"Save me, feminism!\" as the country burns around them. permalink parent award report block reply TheFozz 2 points 4 days ago You walk around a Swedish City and every White Swedish girl you see is easily an 8-10. The nose people saw this and said \"nah, let's import millions of shit-skins and ruin this place.\" permalink parent award report block reply GenWashington 1 points 4 days ago Side note... the most beautiful are not blonds that is hollywood and propaganda. Not kidding permalink parent award report block reply ForgottenUsername 1 points 4 days ago All the goods except common sense.      Just like everywhere in the west, they were trained not to have children, so misplace that empathy onto worst people permalink parent award report block reply HoodooOperator 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply Jack_NC 27 points 4 days ago This is cultural suicide. In just 20 years, a proud nation killed itself because that one final statistic spells doom for Sweden -- 27% of the population is immigrants. There is no recovery from this without door-to-door sweeps and eviction or genocide. The entire world would back the immigrants and far too many Swedes still support unlimited immigration. edit: the irony is, in order to save itself, Sweden would have to harden and become something very different. If they do not, they will perish. If they do, they will emerge with a hardened culture utterly unlike Sweden of the 1970s-1990s. Either way, Sweden is now dead, the endgame is here, and it is only a matter of time. It pains me to say this because I remember Sweden as a cultural paradise in the 70s. Sweden will be just a concept in a few years, a footnote in world history textbooks. permalink award report block reply airgag 7 points 4 days ago Door-to-door sweeps are nothing impossible, last time in happened in Europe is less than one hundred years ago. permalink parent award report block reply Jack_NC 9 points 4 days ago Oh, they're definitely possible, I'm not denying that. But in order for that to happen, Swedes will have to harden up A LOT! Their easygoing peaceful culture will have to transform radically into a militaristic, aggressive one of self-preservation with a deep distrust of foreign influence and a willingness to unleash violence that exceeds that of the invaders. That is a quite a change. But then -- here is the truly difficult part -- once the threat is removed, it must retreat from this position and return to it's \"old self\". That may be impossible. permalink parent award report block reply breadbaker 3 points 4 days ago They can't. It's called the Zlatan problem. Those people are Swedes. That is what Swedes are now, a more violent nation than it was 30 years ago. permalink parent award report block reply bobbacringo 2 points 4 days ago This is also America's future. Our civilization comes from us being white. We are a specific ethnic group. Letting in foreigners destroys civilization. permalink parent award report block reply SteveRogers42 2 points 4 days ago Didn’t they used to be Vikings? permalink parent award report block reply rebuildingMyself 19 points 4 days ago Before the complete browning of that country, never forget that it was coined \"the Saudi Arabia of Feminism\". To destroy a White nation, you must first corrupt the women for a generation. They stop having babies, then the same govt solves the problem they created by importing in the 3rd world to help pay for all the socialism. Shortsighted and emotional as hell but suicidal empathy is what destroys a White nation. permalink award report block reply BlippiIsAPedo 7 points 4 days ago The last line is a joke. Importing the third world is for White genocide. Not for paying for socialism permalink parent award report block reply Aquamine-Amarine 3 points 4 days ago Corrupt them via the education system. It's the weapon they use. And it's perfect, because parents willingly hand their children over! permalink parent award report block reply atomisten 16 points 4 days ago and these are old stats. after that it  became way worse. for the past couple of years there are 200+ EXPLOSIONS done by gangs/terrorists per year. 200+. yes. official data by government despite them trying to hide a lot of things. permalink award report block reply Bullet3250 9 points 4 days ago 'Grenade Attack Capital of the World' permalink parent award report block reply infinitysupreme 11 points 4 days ago Swedish politics is infested with anti-Christian anti-white anti-Western scum and traitors. We have a lot of those, too. permalink award report block reply barwhack 11 points 4 days ago OR Hear me out now... or Sweden could arrest the statistician . 😀 permalink award report block reply Jack_NC 5 points 4 days ago They have already shown they will arrest dentists who correctly identify invaders (\"immigrants\") as adults, and not children. Arresting statisticians is an easy pivot. permalink parent award report block reply Yignuced 9 points 4 days ago It’s racist not to let foreigners rape your women and blow up your cities. permalink award report block reply KuzoKevin 7 points 4 days ago Close the border, deport who you can, and build more prisons for those who can't be deported. permalink award report block reply learntocode 5 points 4 days ago Why has NATO and the EU, funded and protected and organized by U.S. military and diplomatic and media and direct financial support, been flooded with Ottoman subjects? Our U.S. regime has helped in this Ottoman flood of Europe. permalink award report block reply Taqiyya_Mockingbird 4 points 4 days ago Close the gates! permalink award report block reply HockeyMom4Trump 4 points 4 days ago Too many scared to be called racist so they let their towns get infested. permalink award report block reply Carterslvrpilz 3 points 4 days ago Liberal women are destroying the western world. permalink award report block reply Wexit-Delecto 3 points 4 days ago “Swedish gangs” wasn’t a thing until Sweden imported gangs. permalink award report block reply YouEssAye 3 points 4 days ago Today I learned Sweden has outlaw motorcycle clubs. Maybe I'm just an ignorant American, but I find that interesting for some reason. I can't picture a swedish hell's angels dude permalink award report block reply Crappydatum 1 points 4 days ago Maybe they dress like Vikings? permalink parent award report block reply MediaBro 3 points 4 days ago But then the Swedish women will be bored and the Swedish men will have to entertain them and no one wants that. permalink award report block reply raptormissle 3 points 4 days ago The people that imported them need to be physically accountable. permalink award report block reply Craken303 3 points 4 days ago Where button? Or switch? I press. permalink award report block reply TerdFurguson 2 points 4 days ago If \"pushing the switch\" means a total stop on non-white immigration and mass deportations of first- and second-generation immigrants, I believe every white country could push it and fix damn near everything. permalink award report block reply Crappydatum 2 points 4 days ago The USA has these same percentages If anyone was brave enough to publish them permalink award report block reply SmartyPants 2 points 4 days ago So could we. permalink award report block reply vongregormench 1 points 4 days ago More Swedes in outlaw motorcycle gangs, probably most of them are anti immigrant gangs with a little bit of side crime. permalink award report block reply Jack_NC 1 points 4 days ago I had never considered this angle. Honestly, it's the only hopeful thing I've read about Sweden in quite some time. permalink parent award report block reply canadianhere 1 points 4 days ago Sweden Yes! permalink award report block reply feral-toes 1 points 3 days ago The people who believed that \"race is a social construct\" are experiencing society is a racial construct permalink award report block reply mcoulton 1 points 4 days ago they need to go after the criminals and deport them after sentencing and make it a 20 year sentence for reentering sweden, permalink award report block reply Meister_Bockmist 1 points 4 days ago Never trust a country where its people are baked in small wooden huts in winter and that make furniture out of sintered breadcrumbs. permalink award report block reply joeblow2020 1 points 4 days ago I actually had no idea that Swedish immigrant outlaw motorcycle gang crime was a thing. permalink award report block reply Iremembermypassword 1 points 4 days ago But that would be Racist! permalink award report block reply Fakehistory2 1 points 4 days ago \"Push the switch\" = electric chair for criminals. I agree. permalink award report block reply HoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nDeplorable556 43 points 4 days ago please save sweden. some of the most beautiful women are from sweden. REAL women, with all the goods. not them fake gayboys in a wig. permalink award report block reply Lelleck 25 points 4 days ago They are allowed to vote and this is what they voted for. permalink parent award report block reply BlippiIsAPedo 12 points 4 days ago Lol oh you permalink parent award report block reply tarballs 7 points 4 days ago They've been brainwashed and indoctrinated and \"democracy\" is regularly rigged bullshit, sure, but western capitalist welfare states like Sweden are not the USSR. They have free right to gather together, to turn off the TV, to get on a soapbox and preach in public (the worst they can do is put you in a temporary timeout box). They could've formed parties more right-wing than the Swedish Democrats and voted for them, they can put pressure on their police to stop being traitors, they can create a counterpart girl to Greta Thunberg. They can make immigrants feel unwelcome, they can stop buying their kebabs and their shwarma. They can smack their hysterical women and get them under control. But they don't. Their children get crushed by islamic trucks in Stockholm, and they do NOTHING. They know that there are grownass rapefugee men posing as teenagers in order to attend school, and they do NOTHING. They go to sleep to the sound of balkan grenades popping off in gang wars. Based, self-loving Europeans are so few in number and so hated by the rest of society, all they can do is hang out in the woods and work out. Americans literally care more about European countries, and Australia, than the Europeans themselves. We show concern and try to get them to wake up and they tell us, \"Oh STFU seppo, I'm so sick of you fat burger inhalers telling us about our country! You don't know shit! Turn off Fox News! Idiot!\" This is who they are and how they choose to live. permalink parent award report block reply AfrikaanerBoer 6 points 4 days ago Search:  BARBARA LERNER-SPECTRE permalink parent award report block reply BidenShowerDrool 3 points 4 days ago thanks for this. She is one of the founding \"Academics\" and \"Movements\" in the migrational destruction and blackifying of Europe. why is it that behind all these ill conceived and nation destroying plans there always is a big piece of the  structure is formed by one very small demographic who staunchly back each other regardless of dangerous and deathly the outcomes. permalink parent award report block reply American-Patriot 4 points 4 days ago This is why we need to ban the 19th amendment and it's equivalent across the world. Never again. permalink parent award report block reply Aquamine-Amarine -5 points 4 days ago Do you have proof? No, you don't, you're just sexist and falsely assuming someone's voting habits. Men aren't exactly innocent here either. Leftists from both sexes voted for this shit. permalink parent award report block reply PoliticsAreBlank 8 points 4 days ago https://en.wikipedia.org/wiki/2022_Swedish_general_election#Voter_demographics The proof is in the voting demographics. permalink parent award report block reply Jack_NC 3 points 4 days ago yes, liberals of both sexes vote for liberalism. But women vote liberal in far, FAR greater numbers. nearly 2x. All that's missing to this three-panel cartoon is a final \"Save me, feminism!\" as the country burns around them. permalink parent award report block reply TheFozz 2 points 4 days ago You walk around a Swedish City and every White Swedish girl you see is easily an 8-10. The nose people saw this and said \"nah, let's import millions of shit-skins and ruin this place.\" permalink parent award report block reply GenWashington 1 points 4 days ago Side note... the most beautiful are not blonds that is hollywood and propaganda. Not kidding permalink parent award report block reply ForgottenUsername 1 points 4 days ago All the goods except common sense.      Just like everywhere in the west, they were trained not to have children, so misplace that empathy onto worst people permalink parent award report block reply HoodooOperator 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nLelleck 25 points 4 days ago They are allowed to vote and this is what they voted for. permalink parent award report block reply BlippiIsAPedo 12 points 4 days ago Lol oh you permalink parent award report block reply tarballs 7 points 4 days ago They've been brainwashed and indoctrinated and \"democracy\" is regularly rigged bullshit, sure, but western capitalist welfare states like Sweden are not the USSR. They have free right to gather together, to turn off the TV, to get on a soapbox and preach in public (the worst they can do is put you in a temporary timeout box). They could've formed parties more right-wing than the Swedish Democrats and voted for them, they can put pressure on their police to stop being traitors, they can create a counterpart girl to Greta Thunberg. They can make immigrants feel unwelcome, they can stop buying their kebabs and their shwarma. They can smack their hysterical women and get them under control. But they don't. Their children get crushed by islamic trucks in Stockholm, and they do NOTHING. They know that there are grownass rapefugee men posing as teenagers in order to attend school, and they do NOTHING. They go to sleep to the sound of balkan grenades popping off in gang wars. Based, self-loving Europeans are so few in number and so hated by the rest of society, all they can do is hang out in the woods and work out. Americans literally care more about European countries, and Australia, than the Europeans themselves. We show concern and try to get them to wake up and they tell us, \"Oh STFU seppo, I'm so sick of you fat burger inhalers telling us about our country! You don't know shit! Turn off Fox News! Idiot!\" This is who they are and how they choose to live. permalink parent award report block reply AfrikaanerBoer 6 points 4 days ago Search:  BARBARA LERNER-SPECTRE permalink parent award report block reply BidenShowerDrool 3 points 4 days ago thanks for this. She is one of the founding \"Academics\" and \"Movements\" in the migrational destruction and blackifying of Europe. why is it that behind all these ill conceived and nation destroying plans there always is a big piece of the  structure is formed by one very small demographic who staunchly back each other regardless of dangerous and deathly the outcomes. permalink parent award report block reply American-Patriot 4 points 4 days ago This is why we need to ban the 19th amendment and it's equivalent across the world. Never again. permalink parent award report block reply Aquamine-Amarine -5 points 4 days ago Do you have proof? No, you don't, you're just sexist and falsely assuming someone's voting habits. Men aren't exactly innocent here either. Leftists from both sexes voted for this shit. permalink parent award report block reply PoliticsAreBlank 8 points 4 days ago https://en.wikipedia.org/wiki/2022_Swedish_general_election#Voter_demographics The proof is in the voting demographics. permalink parent award report block reply Jack_NC 3 points 4 days ago yes, liberals of both sexes vote for liberalism. But women vote liberal in far, FAR greater numbers. nearly 2x. All that's missing to this three-panel cartoon is a final \"Save me, feminism!\" as the country burns around them. permalink parent award report block reply\nBlippiIsAPedo 12 points 4 days ago Lol oh you permalink parent award report block reply tarballs 7 points 4 days ago They've been brainwashed and indoctrinated and \"democracy\" is regularly rigged bullshit, sure, but western capitalist welfare states like Sweden are not the USSR. They have free right to gather together, to turn off the TV, to get on a soapbox and preach in public (the worst they can do is put you in a temporary timeout box). They could've formed parties more right-wing than the Swedish Democrats and voted for them, they can put pressure on their police to stop being traitors, they can create a counterpart girl to Greta Thunberg. They can make immigrants feel unwelcome, they can stop buying their kebabs and their shwarma. They can smack their hysterical women and get them under control. But they don't. Their children get crushed by islamic trucks in Stockholm, and they do NOTHING. They know that there are grownass rapefugee men posing as teenagers in order to attend school, and they do NOTHING. They go to sleep to the sound of balkan grenades popping off in gang wars. Based, self-loving Europeans are so few in number and so hated by the rest of society, all they can do is hang out in the woods and work out. Americans literally care more about European countries, and Australia, than the Europeans themselves. We show concern and try to get them to wake up and they tell us, \"Oh STFU seppo, I'm so sick of you fat burger inhalers telling us about our country! You don't know shit! Turn off Fox News! Idiot!\" This is who they are and how they choose to live. permalink parent award report block reply AfrikaanerBoer 6 points 4 days ago Search:  BARBARA LERNER-SPECTRE permalink parent award report block reply BidenShowerDrool 3 points 4 days ago thanks for this. She is one of the founding \"Academics\" and \"Movements\" in the migrational destruction and blackifying of Europe. why is it that behind all these ill conceived and nation destroying plans there always is a big piece of the  structure is formed by one very small demographic who staunchly back each other regardless of dangerous and deathly the outcomes. permalink parent award report block reply\ntarballs 7 points 4 days ago They've been brainwashed and indoctrinated and \"democracy\" is regularly rigged bullshit, sure, but western capitalist welfare states like Sweden are not the USSR. They have free right to gather together, to turn off the TV, to get on a soapbox and preach in public (the worst they can do is put you in a temporary timeout box). They could've formed parties more right-wing than the Swedish Democrats and voted for them, they can put pressure on their police to stop being traitors, they can create a counterpart girl to Greta Thunberg. They can make immigrants feel unwelcome, they can stop buying their kebabs and their shwarma. They can smack their hysterical women and get them under control. But they don't. Their children get crushed by islamic trucks in Stockholm, and they do NOTHING. They know that there are grownass rapefugee men posing as teenagers in order to attend school, and they do NOTHING. They go to sleep to the sound of balkan grenades popping off in gang wars. Based, self-loving Europeans are so few in number and so hated by the rest of society, all they can do is hang out in the woods and work out. Americans literally care more about European countries, and Australia, than the Europeans themselves. We show concern and try to get them to wake up and they tell us, \"Oh STFU seppo, I'm so sick of you fat burger inhalers telling us about our country! You don't know shit! Turn off Fox News! Idiot!\" This is who they are and how they choose to live. permalink parent award report block reply\nAfrikaanerBoer 6 points 4 days ago Search:  BARBARA LERNER-SPECTRE permalink parent award report block reply BidenShowerDrool 3 points 4 days ago thanks for this. She is one of the founding \"Academics\" and \"Movements\" in the migrational destruction and blackifying of Europe. why is it that behind all these ill conceived and nation destroying plans there always is a big piece of the  structure is formed by one very small demographic who staunchly back each other regardless of dangerous and deathly the outcomes. permalink parent award report block reply\nBidenShowerDrool 3 points 4 days ago thanks for this. She is one of the founding \"Academics\" and \"Movements\" in the migrational destruction and blackifying of Europe. why is it that behind all these ill conceived and nation destroying plans there always is a big piece of the  structure is formed by one very small demographic who staunchly back each other regardless of dangerous and deathly the outcomes. permalink parent award report block reply\nAmerican-Patriot 4 points 4 days ago This is why we need to ban the 19th amendment and it's equivalent across the world. Never again. permalink parent award report block reply\nAquamine-Amarine -5 points 4 days ago Do you have proof? No, you don't, you're just sexist and falsely assuming someone's voting habits. Men aren't exactly innocent here either. Leftists from both sexes voted for this shit. permalink parent award report block reply PoliticsAreBlank 8 points 4 days ago https://en.wikipedia.org/wiki/2022_Swedish_general_election#Voter_demographics The proof is in the voting demographics. permalink parent award report block reply Jack_NC 3 points 4 days ago yes, liberals of both sexes vote for liberalism. But women vote liberal in far, FAR greater numbers. nearly 2x. All that's missing to this three-panel cartoon is a final \"Save me, feminism!\" as the country burns around them. permalink parent award report block reply\nPoliticsAreBlank 8 points 4 days ago https://en.wikipedia.org/wiki/2022_Swedish_general_election#Voter_demographics The proof is in the voting demographics. permalink parent award report block reply\nJack_NC 3 points 4 days ago yes, liberals of both sexes vote for liberalism. But women vote liberal in far, FAR greater numbers. nearly 2x. All that's missing to this three-panel cartoon is a final \"Save me, feminism!\" as the country burns around them. permalink parent award report block reply\nTheFozz 2 points 4 days ago You walk around a Swedish City and every White Swedish girl you see is easily an 8-10. The nose people saw this and said \"nah, let's import millions of shit-skins and ruin this place.\" permalink parent award report block reply\nGenWashington 1 points 4 days ago Side note... the most beautiful are not blonds that is hollywood and propaganda. Not kidding permalink parent award report block reply\nForgottenUsername 1 points 4 days ago All the goods except common sense.      Just like everywhere in the west, they were trained not to have children, so misplace that empathy onto worst people permalink parent award report block reply\nHoodooOperator 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nJack_NC 27 points 4 days ago This is cultural suicide. In just 20 years, a proud nation killed itself because that one final statistic spells doom for Sweden -- 27% of the population is immigrants. There is no recovery from this without door-to-door sweeps and eviction or genocide. The entire world would back the immigrants and far too many Swedes still support unlimited immigration. edit: the irony is, in order to save itself, Sweden would have to harden and become something very different. If they do not, they will perish. If they do, they will emerge with a hardened culture utterly unlike Sweden of the 1970s-1990s. Either way, Sweden is now dead, the endgame is here, and it is only a matter of time. It pains me to say this because I remember Sweden as a cultural paradise in the 70s. Sweden will be just a concept in a few years, a footnote in world history textbooks. permalink award report block reply airgag 7 points 4 days ago Door-to-door sweeps are nothing impossible, last time in happened in Europe is less than one hundred years ago. permalink parent award report block reply Jack_NC 9 points 4 days ago Oh, they're definitely possible, I'm not denying that. But in order for that to happen, Swedes will have to harden up A LOT! Their easygoing peaceful culture will have to transform radically into a militaristic, aggressive one of self-preservation with a deep distrust of foreign influence and a willingness to unleash violence that exceeds that of the invaders. That is a quite a change. But then -- here is the truly difficult part -- once the threat is removed, it must retreat from this position and return to it's \"old self\". That may be impossible. permalink parent award report block reply breadbaker 3 points 4 days ago They can't. It's called the Zlatan problem. Those people are Swedes. That is what Swedes are now, a more violent nation than it was 30 years ago. permalink parent award report block reply bobbacringo 2 points 4 days ago This is also America's future. Our civilization comes from us being white. We are a specific ethnic group. Letting in foreigners destroys civilization. permalink parent award report block reply SteveRogers42 2 points 4 days ago Didn’t they used to be Vikings? permalink parent award report block reply\nairgag 7 points 4 days ago Door-to-door sweeps are nothing impossible, last time in happened in Europe is less than one hundred years ago. permalink parent award report block reply Jack_NC 9 points 4 days ago Oh, they're definitely possible, I'm not denying that. But in order for that to happen, Swedes will have to harden up A LOT! Their easygoing peaceful culture will have to transform radically into a militaristic, aggressive one of self-preservation with a deep distrust of foreign influence and a willingness to unleash violence that exceeds that of the invaders. That is a quite a change. But then -- here is the truly difficult part -- once the threat is removed, it must retreat from this position and return to it's \"old self\". That may be impossible. permalink parent award report block reply breadbaker 3 points 4 days ago They can't. It's called the Zlatan problem. Those people are Swedes. That is what Swedes are now, a more violent nation than it was 30 years ago. permalink parent award report block reply\nJack_NC 9 points 4 days ago Oh, they're definitely possible, I'm not denying that. But in order for that to happen, Swedes will have to harden up A LOT! Their easygoing peaceful culture will have to transform radically into a militaristic, aggressive one of self-preservation with a deep distrust of foreign influence and a willingness to unleash violence that exceeds that of the invaders. That is a quite a change. But then -- here is the truly difficult part -- once the threat is removed, it must retreat from this position and return to it's \"old self\". That may be impossible. permalink parent award report block reply breadbaker 3 points 4 days ago They can't. It's called the Zlatan problem. Those people are Swedes. That is what Swedes are now, a more violent nation than it was 30 years ago. permalink parent award report block reply\nbreadbaker 3 points 4 days ago They can't. It's called the Zlatan problem. Those people are Swedes. That is what Swedes are now, a more violent nation than it was 30 years ago. permalink parent award report block reply\nbobbacringo 2 points 4 days ago This is also America's future. Our civilization comes from us being white. We are a specific ethnic group. Letting in foreigners destroys civilization. permalink parent award report block reply\nSteveRogers42 2 points 4 days ago Didn’t they used to be Vikings? permalink parent award report block reply\nrebuildingMyself 19 points 4 days ago Before the complete browning of that country, never forget that it was coined \"the Saudi Arabia of Feminism\". To destroy a White nation, you must first corrupt the women for a generation. They stop having babies, then the same govt solves the problem they created by importing in the 3rd world to help pay for all the socialism. Shortsighted and emotional as hell but suicidal empathy is what destroys a White nation. permalink award report block reply BlippiIsAPedo 7 points 4 days ago The last line is a joke. Importing the third world is for White genocide. Not for paying for socialism permalink parent award report block reply Aquamine-Amarine 3 points 4 days ago Corrupt them via the education system. It's the weapon they use. And it's perfect, because parents willingly hand their children over! permalink parent award report block reply\nBlippiIsAPedo 7 points 4 days ago The last line is a joke. Importing the third world is for White genocide. Not for paying for socialism permalink parent award report block reply\nAquamine-Amarine 3 points 4 days ago Corrupt them via the education system. It's the weapon they use. And it's perfect, because parents willingly hand their children over! permalink parent award report block reply\natomisten 16 points 4 days ago and these are old stats. after that it  became way worse. for the past couple of years there are 200+ EXPLOSIONS done by gangs/terrorists per year. 200+. yes. official data by government despite them trying to hide a lot of things. permalink award report block reply Bullet3250 9 points 4 days ago 'Grenade Attack Capital of the World' permalink parent award report block reply\nBullet3250 9 points 4 days ago 'Grenade Attack Capital of the World' permalink parent award report block reply\ninfinitysupreme 11 points 4 days ago Swedish politics is infested with anti-Christian anti-white anti-Western scum and traitors. We have a lot of those, too. permalink award report block reply\nbarwhack 11 points 4 days ago OR Hear me out now... or Sweden could arrest the statistician . 😀 permalink award report block reply Jack_NC 5 points 4 days ago They have already shown they will arrest dentists who correctly identify invaders (\"immigrants\") as adults, and not children. Arresting statisticians is an easy pivot. permalink parent award report block reply\nJack_NC 5 points 4 days ago They have already shown they will arrest dentists who correctly identify invaders (\"immigrants\") as adults, and not children. Arresting statisticians is an easy pivot. permalink parent award report block reply\nYignuced 9 points 4 days ago It’s racist not to let foreigners rape your women and blow up your cities. permalink award report block reply\nKuzoKevin 7 points 4 days ago Close the border, deport who you can, and build more prisons for those who can't be deported. permalink award report block reply\nlearntocode 5 points 4 days ago Why has NATO and the EU, funded and protected and organized by U.S. military and diplomatic and media and direct financial support, been flooded with Ottoman subjects? Our U.S. regime has helped in this Ottoman flood of Europe. permalink award report block reply\nTaqiyya_Mockingbird 4 points 4 days ago Close the gates! permalink award report block reply\nHockeyMom4Trump 4 points 4 days ago Too many scared to be called racist so they let their towns get infested. permalink award report block reply\nCarterslvrpilz 3 points 4 days ago Liberal women are destroying the western world. permalink award report block reply\nWexit-Delecto 3 points 4 days ago “Swedish gangs” wasn’t a thing until Sweden imported gangs. permalink award report block reply\nYouEssAye 3 points 4 days ago Today I learned Sweden has outlaw motorcycle clubs. Maybe I'm just an ignorant American, but I find that interesting for some reason. I can't picture a swedish hell's angels dude permalink award report block reply Crappydatum 1 points 4 days ago Maybe they dress like Vikings? permalink parent award report block reply\nCrappydatum 1 points 4 days ago Maybe they dress like Vikings? permalink parent award report block reply\nMediaBro 3 points 4 days ago But then the Swedish women will be bored and the Swedish men will have to entertain them and no one wants that. permalink award report block reply\nraptormissle 3 points 4 days ago The people that imported them need to be physically accountable. permalink award report block reply\nCraken303 3 points 4 days ago Where button? Or switch? I press. permalink award report block reply\nTerdFurguson 2 points 4 days ago If \"pushing the switch\" means a total stop on non-white immigration and mass deportations of first- and second-generation immigrants, I believe every white country could push it and fix damn near everything. permalink award report block reply\nCrappydatum 2 points 4 days ago The USA has these same percentages If anyone was brave enough to publish them permalink award report block reply\nSmartyPants 2 points 4 days ago So could we. permalink award report block reply\nvongregormench 1 points 4 days ago More Swedes in outlaw motorcycle gangs, probably most of them are anti immigrant gangs with a little bit of side crime. permalink award report block reply Jack_NC 1 points 4 days ago I had never considered this angle. Honestly, it's the only hopeful thing I've read about Sweden in quite some time. permalink parent award report block reply\nJack_NC 1 points 4 days ago I had never considered this angle. Honestly, it's the only hopeful thing I've read about Sweden in quite some time. permalink parent award report block reply\ncanadianhere 1 points 4 days ago Sweden Yes! permalink award report block reply\nferal-toes 1 points 3 days ago The people who believed that \"race is a social construct\" are experiencing society is a racial construct permalink award report block reply\nmcoulton 1 points 4 days ago they need to go after the criminals and deport them after sentencing and make it a 20 year sentence for reentering sweden, permalink award report block reply\nMeister_Bockmist 1 points 4 days ago Never trust a country where its people are baked in small wooden huts in winter and that make furniture out of sintered breadcrumbs. permalink award report block reply\njoeblow2020 1 points 4 days ago I actually had no idea that Swedish immigrant outlaw motorcycle gang crime was a thing. permalink award report block reply\nIremembermypassword 1 points 4 days ago But that would be Racist! permalink award report block reply\nFakehistory2 1 points 4 days ago \"Push the switch\" = electric chair for criminals. I agree. permalink award report block reply\nHoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:22:11.607265Z"
}