{
  "id": "1ARK9nPM99",
  "url": "https://patriots.win/p/1ARK9nPM99/watch-video--this-is-dearborn-mi/c",
  "content": "822 WATCH VIDEO - \"This is Dearborn, Michigan. Nearly all of the people in this video have visas or legalized citizenship.\" posted 3 hours ago by bleeje 164 comments award share report block End Wokeness @EndWokeness • 6h This is Dearborn, Michigan. Nearly all of the people in this video have visas or legalized citizenship.\n164 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget ninabobby 99 points 3 hours ago Wow I’m so glad we give the military trillions of dollars to “protect us”. permalink award report block reply MastaJoda 34 points 3 hours ago Save us from Iran by importing jihadis!🤡👍 permalink parent award report block reply MissingTrump 13 points 3 hours ago Jasmine Crockett said this is good and called soft power. permalink parent award report block reply SPEDMan64 6 points 2 hours ago She needs to be soft-powered in the face. permalink parent award report block reply AlmostFullyDilated 1 points 1 hour ago Comment removed by community moderators. permalink parent award report block reply GatoradeJeb 6 points 2 hours ago Importing pajeets to build misisles permalink parent award report block reply AfrikaanerBoer 2 points 21 minutes ago HOLOCAUST THEM ALL ☪️🔜 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 permalink parent award report block reply Oleander 23 points 3 hours ago They (and the government as a whole) will be used against us, in the not too distant future. Unless their plan of peacefully genociding us continues unabated, of course, then they will just laugh at how dumb we are to let our people die off willingly. permalink parent award report block reply OrdJFellow 13 points 2 hours ago \"White people will be ethnically cleansed BUT it  will be done so LEGALLY. Just like the founding fathers envisioned.\" permalink parent award report block reply yodayoda 1 points 21 minutes ago as long as it's legal, that's all we seem to care about. permalink parent award report block reply NukeTheTroons 14 points 3 hours ago And thank god for Isreal fighting them over there for us! Imagine how many there would be if it wasn’t for Isreal… oh wait permalink parent award report block reply TrumpYouMagaFrenner -5 points 2 hours ago I mean Israel has helped get rid of them? Not sure what youre confused about. permalink parent award report block reply NutPsaki 7 points 2 hours ago Yeah they got rid of them from their region of the world and now they’re over here permalink parent award report block reply TrumpYouMagaFrenner -2 points 2 hours ago But they extinguished them period. That means there's less no matter where they are. permalink parent award report block reply view 1 more comments... Ancientpeople -6 points 2 hours ago People like you are either stupid or simply malicious with your obsession over Israel....Islam is literally invading the west with intent to impose Sharia law and your dumbness tries to deflect the conversation onto Israel permalink parent award report block reply NukeTheTroons 5 points 2 hours ago Yeah that’s the fucking point. They aren’t doing shit for us. Democrats and “certain people” who happen to have some of the most power in the country have brought them in. permalink parent award report block reply TrumpYouMagaFrenner 3 points 2 hours ago So was Israel committing genocide against Gaza or not? permalink parent award report block reply Ancientpeople 3 points 1 hour ago And who has been bringing them to Europe ? permalink parent award report block reply Treefiddydiddy 2 points 1 hour ago and why is jizlam invading the west ? because soros / mayorkas / spectre and countless other isreal firsters want them to be the 'broom of europe'.....as stated online and available on video by rabbi david touitou......you disingenuous shit spreader permalink parent award report block reply Ancientpeople 0 points 1 hour ago Soros is as anti Israel and anti God as they come permalink parent award report block reply GatoradeJeb 9 points 2 hours ago Im so glad trump wants to import more of these via h1b because americans are too dumb to build missiles permalink parent award report block reply Lelleck 3 points 2 hours ago And is joking around with one of the worst of them… It feels like this is his Arafat/Clinton moment… permalink parent award report block reply keeman 3 points 2 hours ago I'm guessing very few of these have jobs.  They will be \"refugees\" of various sorts and will be sucking at the taxpayer teat. permalink parent award report block reply MasterChief08 3 points 3 hours ago Obama permalink parent award report block reply rebuildingMyself 2 points 2 hours ago He didn't start it in that specific case but he damn well added to it permalink parent award report block reply load 5 more comments... PatriotSkorzeny 43 points 3 hours ago Yes. They want moslems in every corner they can put them. It’s disappointing. permalink award report block reply Prandogolio 18 points 3 hours ago Disappointing? permalink parent award report block reply MyGrandpa4 5 points 3 hours ago You know, women as second class. permalink parent award report block reply RedCapNation 6 points 3 hours ago They are. That’s the only thing Muslims do right. permalink parent award report block reply brainphreeze 11 points 3 hours ago Obama did this permalink parent award report block reply MastaJoda 8 points 3 hours ago Nome is bragging about it... permalink parent award report block reply SickofItall 4 points 2 hours ago No he didn't This was happening long before he was even in politics....it goes back to the tail end of Bush Sr into Clinton. permalink parent award report block reply MoldyLocksNesMonste 1 points 17 minutes ago Goes back to Henry Ford importing them permalink parent award report block reply henri_derelicte 34 points 3 hours ago If we want to save our country, we’re not simply going to have to deport illegal immigrants, we’re going to have to strip certain people of legal status/citizenship and send them back as well. Targeting this latter group will make it very easy to turn America into a 80-90% White country again, and it also means that people like Letitia James, Maxine Waters, Barack Obama, etc. can be stripped of their citizenship and deported. permalink award report block reply Ostia 6 points 3 hours ago Will never happen. We’d be kicked out of power before we could even get any of it accomplished, due to flagrantly violating the constitution, the moment we started the policy of deporting legal residents and citizens. permalink parent award report block reply Elencher 6 points 3 hours ago Then we die, and that's why the future is balkanization. If we can't make this happen through the existing governmental structures, then those structures are on borrowed time. We'll have to reform along different lines and redefine citizenship. permalink parent award report block reply SutopSutolf 1 points 2 hours ago No. We just die. Good luck. permalink parent award report block reply Flying_Pede_121 2 points 1 hour ago lol, history says otherwise. The Spanish kicked the Muslims out. It’s happened before and will happen again. permalink parent award report block reply view 1 more comments... mikejones 1 points 2 hours ago I mean 300+ million people in North America. Went from 13 states to 50 states. Sure 250 years ago you could say certain things. Now you just overwhelm the population and use their laws against them and soon you overrule them. permalink parent award report block reply Ostia -1 points 2 hours ago Yeah, man, we must destroy the constitution to save it. So much for all the constitution talk we’ve spent decades spouting. permalink parent award report block reply Elencher 3 points 2 hours ago See you're retarded like my cousin. I tried this though experiment on him. So these muslims are all given legal citizenship, and they all vote legally, and they all vote for sharia, then clearly we must accept sharia because that's the constitutional process right? No, not at all. The constitution isn't fucking magic, it's downstream of the culture. If the culture has been polluted then the constitution doesn't work anymore. Take for example the concept of jury of your peers. If your peers are blacks who will punish all whites and acquit all blacks, then does this principle work anymore? permalink parent award report block reply view 4 more comments... Parhelion12 3 points 2 hours ago Hence.... no ballot box permalink parent award report block reply flashersenpai 1 points 2 hours ago due to flagrantly violating the constitution never stopped the government before, has it? and don't combine legal residents and citizens as though they have the same rights permalink parent award report block reply Ostia 0 points 2 hours ago Uh… They do. permalink parent award report block reply Formerlurker92 0 points 2 hours ago If theres no way to have it happen other than violence, I pray it happens while I'm still young and capable of it permalink parent award report block reply Ostia -1 points 2 hours ago You’re not even older enough to know what you’re talking about, what it was like before your time, or what you think you’re fighting for. permalink parent award report block reply henri_derelicte 0 points 2 hours ago Listen pal, you can either save your country or follow the constitution to the letter. I, for one, do not believe the constitution is a suicide pact permalink parent award report block reply Ostia 0 points 2 hours ago Cool, be sure to let the democrats know that possibility is on the table for them as well and say goodbye to your guns, gas vehicles, and freedom of speech. You’re every single thing the worst of the left accuses us of being. You justify their existence. permalink parent award report block reply mikejones 1 points 2 hours ago The thing is it is way hard to deport compared to let in. When it comes to deporting, those who got in illegally will use our system against us to stop deporting. We are basically screwed. permalink parent award report block reply PatriotGames 1 points 1 hour ago A lot of the people in that video were born in Dearborn MI. Just saying... the problem is already harder than you imagine. permalink parent award report block reply henri_derelicte 1 points 17 minutes ago You basically have to take over the courts to the point that where someone like Clarence Thomas looks like a moderate, or even a liberal compared to the people to the right of him. permalink parent award report block reply GoldenEarz 20 points 3 hours ago Where are all the American flags? permalink award report block reply MEME-SUPREME 23 points 3 hours ago They burned all of them. permalink parent award report block reply DeplorachuIChooseYou 16 points 3 hours ago This country is looking more and more like the UK permalink award report block reply Oleander 5 points 3 hours ago It's worse. The demographics are much worse. Only thing that's better is that we aren't getting locked up for memes yet. And sure we have guns too, but that hasn't stopped the invasion. We just end up with a lot of armed feral niggrs and terrorists and that's it really. permalink parent award report block reply rebuildingMyself 2 points 2 hours ago Any and all freedoms we still have over UK will go with the next Democrat president and Congress. They see UK abusing its own people to protect invaders and get extremely jealous permalink parent award report block reply Tyrone_biggums 1 points 1 hour ago Definitely not worse permalink parent award report block reply Oleander 1 points 1 hour ago We are a lot less white than Europe. And that's just right now - how about when a Democrat gets in next, and we have mass amnesty and abolished ICE? permalink parent award report block reply mikejones 0 points 2 hours ago You talk to anyone that grew up in the country and then moved to the city. They will be like I grew up around 100% white people and after moving to the city, now I go places and I am the only white person there. permalink parent award report block reply rebuildingMyself 4 points 3 hours ago UK is just where we'll be in ten years tops. They jumped ahead of us because we bucked and elected Trump instead of Uniparty A vs Uniparty B. Trump isnt perfect by any means but one thing he did was throw a wrench in their plans to swarm the country with brown parasites. But one of our biggest cities just fell to a communist Muslim just like London fell before.  It will take a lot of work and violence to recover that city, but it's doubtful as anyone with means will flee the city in the next few years as the diversity and socialism hot their pocketbook or their faces via sucker punch. While you can point and laugh , that only means the city falls further and further to the left and we'll all eventually be subsidizing it via federal bailouts. permalink parent award report block reply GA_Logic 13 points 3 hours ago Well to be accurate there could be those with refugee status which is currently being revoked by the Trump administration (eg Syria) But yes legal immigration is a problem just like illegal immigration. permalink award report block reply FusionBlack 23 points 3 hours ago Legal is even worse.  You can deport illegals. permalink parent award report block reply Roadcruiser2 17 points 3 hours ago Chinese American Pede here. There are too many hostile foreigners. We need to suspend immigration. permalink parent award report block reply deleted -3 points 3 hours ago NadlersNads 5 points 3 hours ago Sorry about your future edited gene pool permalink parent award report block reply CheeseAndOnion 3 points 2 hours ago Im sure she is rubbing off on your son if ya know what i mean lol permalink parent award report block reply SpellingContable 2 points 3 hours ago She probably does. permalink parent award report block reply SutopSutolf 2 points 2 hours ago You better hope she rubs him hard. Might be the only future he has. permalink parent award report block reply DeaduponArousal 7 points 3 hours ago All immigration involving non white Christians needs to go. permalink parent award report block reply GatoradeJeb 3 points 2 hours ago And trump just said he wants to import more h1b like in the pic because americans too dumb to build missiles permalink parent award report block reply FearGodTheAlmighty 13 points 3 hours ago Antifa, middle east division permalink award report block reply airborne3502 9 points 3 hours ago Glad we fought them over there so they didn't come here. permalink award report block reply ninabobby 3 points 3 hours ago Bomb more countries! Let in millions more refugees who hate us! Are you feeling safe yet? permalink parent award report block reply Goatboy66 9 points 3 hours ago MOAB permalink award report block reply OldGamerGuy79 4 points 3 hours ago Mini-gun permalink parent award report block reply JoeMcCarthyWasRight 8 points 3 hours ago That’s some talent right there, huh Trump. permalink award report block reply RBFace 7 points 3 hours ago Why aren't these people being deported? Why are these people increasing in numbers in Texas? When Trump made his mid-east tour did he make some deal to allow and not deport these vermin? Punjeets and Muslims never seem to be the ones getting deported. There is a simple solution to this problem but our government won't do anything about it. I'm sorry,  I'm having a hard time understanding why Trump and his administration refuse to do shit about this. permalink award report block reply NutPsaki 2 points 2 hours ago Because he’s a cucked boomer pussy permalink parent award report block reply Treefiddydiddy 0 points 1 hour ago with his nuts firmly in net and yahoos fist sadly permalink parent award report block reply fightfightfightx 6 points 3 hours ago thank the bergs, steins, and roths for this shit starting to think the history books were all projection, because no one today even comes close to how evil they are permalink award report block reply NutPsaki 3 points 2 hours ago Starting to believe the exact opposite of what history books tell us permalink parent award report block reply Formerlurker92 6 points 2 hours ago Denaturalize and deport them anyway. Fuck foreign powers colonizing my home permalink award report block reply Redpilled2Depression 6 points 3 hours ago And they all laugh at us for being stupid enough to let them in permalink award report block reply Bilbobaggins 5 points 2 hours ago Remember fight them over there so we don’t have to here? Turns out the truth was ‘fight them over there so we can declare them all asylum seekers and import them’ permalink award report block reply TheMustacheBandit 5 points 3 hours ago Disgusting and horrific.  We are cooked. permalink award report block reply mikejones 1 points 2 hours ago America was lucky. Huge, surrounded by water. Canada is frozen so not many people lived there early on. Mexico was Mexico. Then over last 40 years bribes happened and many people came over and jobs left. Then 40 years later if you try to do anything about it you are called a racist and say you are breaking the law. So there is no winning. permalink parent award report block reply TwoArizonaPedes 5 points 3 hours ago FIGHT BACK. It begins by getting together a group of like-minded patriots. Start with your church and your friends and grow from there. Set up a phone tree. Use burner phones. Don't text. Organize, coordinate, think, be creative! You already know how to respond to their street-blocking \"prayers.\" Pick a name or organization and get involved. permalink award report block reply LetFreedomRing 2 points 3 hours ago They made Christians weak by believing that Jesus would welcome everyone... What happened to people who would have fought the Crusades in this day and age?? permalink parent award report block reply TwoArizonaPedes 1 points 29 minutes ago Don't believe the lying legacy media. We're here and fighting. Join us! permalink parent award report block reply MEME-SUPREME 5 points 3 hours ago This will end well. permalink award report block reply Markosis17 4 points 3 hours ago What in the actual fuck! permalink award report block reply Senaleb 4 points 3 hours ago Don't you feel culturally enriched? permalink award report block reply RickSanchezC137 4 points 3 hours ago Deport them all permalink award report block reply spezisacuckold 4 points 2 hours ago TROJAN HORSE INVASION permalink award report block reply Saxonlady 3 points 3 hours ago For years I've been told by many here that UK is a shithole. Whilst I never disagreed, I'm very sad that while some were watching what was happening here, they did nothing to stop this from also happening in America. permalink award report block reply RedStoneDeepState 2 points 1 hour ago This is a small part of the Detroit metro. The reason people don't care is because Arabs make better neighbors than the blacks in Detroit, and they are displacing the blacks.  It is actively making Detroit less of a shithole. permalink parent award report block reply Saxonlady 1 points 51 minutes ago Interesting. So when all the blacks are gone and it's just muslims and whites, do the whites know they will be displaced next? permalink parent award report block reply RedStoneDeepState 1 points 43 minutes ago It's Michigan. Being \"displaced\" isn't the problem, farmland is cheap to expand. permalink parent award report block reply VladtheTickler 3 points 3 hours ago Thanks, Obama. permalink award report block reply dodgetimes2 1 points 2 hours ago As much as I fucking hate that faggot tranny lover this predates Obama. I’m from the SE Michigan area and played sports against Dearborn back in the 90’s. Even back then their HS football team were calling audibles in Arabic. Of course it’s gotten even worse but this was happening before that Muslim faggot. permalink parent award report block reply VladtheTickler 1 points 1 hour ago There were some, but not nearly the numbers as in post-Bushjr/Obama.  Competing for a mayoral seat was unthinkable back then. permalink parent award report block reply CheeseAndOnion 0 points 2 hours ago Well he is Moslem after all what did u expect permalink parent award report block reply Owmyballz 3 points 2 hours ago Get them the fuck out of the United States now. permalink award report block reply Underpants 3 points 3 hours ago Can we build a wall around it? permalink award report block reply CT-PATRIOT 3 points 2 hours ago Commonly known as DearbornIstan Michigan permalink award report block reply Treefiddydiddy 2 points 1 hour ago gee thanks obummer etc permalink award report block reply CaptainWinston 2 points 3 hours ago Looks. AI AF permalink award report block reply GreyKnight 2 points 3 hours ago I used to wonder why they were so many wars, atrocities and genocides throughout history…now I get it. permalink award report block reply CheeseAndOnion 2 points 3 hours ago Deport permalink award report block reply irescreams 2 points 2 hours ago This is White country, Muslim invaders need to go back to their shitholes and take their flags with them. permalink award report block reply LetFreedomRing 2 points 3 hours ago Why didn't our people fight back? Americans have been conditioned to believe that if we fight back we're somehow racist. It's not racist to want to preserve the American way of life. It's not racist to fight people who want you dead. permalink award report block reply Oleander 2 points 3 hours ago I don't give a shit if it's racist anymore. The browns and blacks would gladly watch whites (who are a vanishing minority in this world) die. The fact that you or anyone cares whether it's \"racist\" is how we got here. The term \"racism\" is a weapon exclusively directed at whites and no one else. It is an albatross we must be free from immediately, or we will die. It's not hyperbole, the whole world and half of our own are rooting for our extinction. permalink parent award report block reply RedStoneDeepState 1 points 1 hour ago This is a small part of the Detroit metro. The reason people don't care is because Arabs make better neighbors than the blacks in Detroit, and they are displacing the blacks. It is actively making Detroit less of a shithole. permalink parent award report block reply bleeje OP 2 points 3 hours ago Thanks for sticky, mods permalink award report block reply SoL-Chi 2 points 1 hour ago Fn crazy. permalink award report block reply Rerun1Central 2 points 2 hours ago retards in Michigan say... 'but the middle eastern bakery is so good'... like fuck off we have perfectly good polish & greek bakeries all over metro detroit permalink award report block reply TexasBrowncoat 2 points 2 hours ago Naturalized citizenship can be revoked through a process called denaturalization, which typically occurs if an individual obtained citizenship by concealing material facts or through willful misrepresentation. Additionally, citizenship may be revoked if the individual is found to have committed certain crimes or affiliated with specific organizations that preclude naturalization. permalink award report block reply cherbui 2 points 2 hours ago legal invasion promoted by democrat party permalink award report block reply RedStoneDeepState 1 points 1 hour ago This is promoted by Republicans as well. permalink parent award report block reply Dev404 2 points 1 hour ago Our government has been subsidizing an invasion of our country while calling us racist if we don't let them do it. Feminism was their tool to get mainstream acceptance of this invasion. permalink award report block reply dudebro 2 points 1 hour ago \"Immigration is okay as long as it's legal!\" - boomer republicans permalink award report block reply mateus 2 points 2 hours ago Seeing this should as care the bejeebers out of everyone. permalink award report block reply Polarix 2 points 2 hours ago Future NYC permalink award report block reply FORMERCHILDSTAR 2 points 2 hours ago I don't see orthodox Islam as a religion, it's more of a subversive militant organization hiding as a religion. Secular Muslims are tolerable in numbers that can assimilate, but vast numbers of devout Muslims with ideals contrary to the USA Constitution and individual liberty are destructive to societal cohesion. permalink award report block reply newuser8 2 points 37 minutes ago I fucking hate boomers that allow this shit. permalink award report block reply TrumpWin 2 points 1 hour ago American people won't go for another Iraq so the deep state is bringing the invaders here permalink award report block reply Snek_Plissken 2 points 2 hours ago 40% of those residents are in SNAP. They imported the third world and the government takes care of them. permalink award report block reply Logan051361 2 points 2 hours ago This one I can Confirm. They will put all their wives on snap. some of these fucks have 5 wives permalink parent award report block reply Snek_Plissken 1 points 2 hours ago At some point, the various AIs will stop answering questions regarding the severity of government programs. It’s funny because the states are reimbursed for this and everyone pays for the democrat grift. permalink parent award report block reply America101 2 points 49 minutes ago This is really scary and the downfall of America. Muslins are taking over Minnesota, Texas and now New York. They have a plan and it is working. permalink award report block reply Shitsbrokeyo 2 points 2 hours ago No reason for this. permalink award report block reply Skabliggum2 2 points 35 minutes ago I never understood why Michigan.  Many are from hot, arid regions and they all pick Michigan? permalink award report block reply Svaap 2 points 2 hours ago God save us.  Really. permalink award report block reply 20MagnusKonrad20 2 points 2 hours ago What is with all the women upholding this? If i'm to understand that Islam opresses women, why are so many of them participating and promoting it? permalink award report block reply RedStoneDeepState 1 points 1 hour ago Islam barely oppresses women. permalink parent award report block reply FirstOfHisName 2 points 3 hours ago All wearing black like the good guys... right? permalink award report block reply keeman 2 points 2 hours ago How many are living off government charity?  Maybe end that. permalink award report block reply DontTreadOnSnek 2 points 3 hours ago It's a race between Michigan and Minnesota as to which one becomes the first caliphate state. permalink award report block reply Michalusmichalus 2 points 32 minutes ago I call that drop shipped gerrymandering. It's how Ilhar Omar got her district. permalink award report block reply AlmostFullyDilated 2 points 1 hour ago nuke them from orbit permalink award report block reply RedFoxOnFire 2 points 32 minutes ago America: \"If you criticize Israel then you'll face criminal charges.\" Also America: \"We need to import more people who hate jews.\" Make it make sense. permalink award report block reply tlorsung 2 points 2 hours ago Dearborn better not get ANY Federal money and limited State funds! That includes any welfare/EBT/SNAP!    Muslims prove you can be self-sustainable without a Christian!!!! permalink award report block reply Live_free_or_die_55 2 points 2 hours ago Deport them all Now ‼️‼️‼️ permalink award report block reply Freefertilizer 2 points 2 hours ago sickening permalink award report block reply Doubleu1992 2 points 2 hours ago We lost, we are weak losers that let pedophiles take us over. Look on the mirror and call yourself a cuck fag cuz that’s what we are. A real man would kick these pedos out permalink award report block reply Zeleskys_WH_Clothing 1 points 6 minutes ago \"These are just the people here to train us and leave... so we can become high skilled workers, make more money and send that money overseas so we can fight the real enemy, which is Iran and Russia.\" - U.S. Government permalink award report block reply 2FBIAgents1Cup 1 points 1 hour ago You had a chance here for another airplane disaster here and you blew it..... just sayin.... permalink award report block reply redditadminssuckit 1 points 2 hours ago Where are flamethrowers when you need them? permalink award report block reply ImYourHuckleberry24 1 points 2 hours ago FUCK TRUMP FOR ALLOWING THIS permalink award report block reply PotatusHead 0 points 2 hours ago DEPORTED. Byee.... permalink parent award report block reply ImYourHuckleberry24 1 points 1 hour ago Zero Fucks Given permalink parent award report block reply learntocode 1 points 2 hours ago You mad at them or the people who paid them to be here? permalink award report block reply Oodles 1 points 2 hours ago Import the third world, become the third world permalink award report block reply DiamondDroid 1 points 1 hour ago Won't it be sad if Dearborn had a toxic train disaster like East Palestine handled with the same incompetence as the Otto Penn administration, toxic chemical spills, and poisonous gas and smoke and polluted ground water. Or maybe a Lahina fire. Or maybe something new like a plague of stampeding pigs. That would be sooooo... sad . permalink award report block reply TrumpYouMagaFrenner 0 points 2 hours ago Remember all the no kings rally? This is a small insignificant percentage of people. Dont doom permalink award report block reply PotatusHead -1 points 2 hours ago So? permalink award report block reply\nninabobby 99 points 3 hours ago Wow I’m so glad we give the military trillions of dollars to “protect us”. permalink award report block reply MastaJoda 34 points 3 hours ago Save us from Iran by importing jihadis!🤡👍 permalink parent award report block reply MissingTrump 13 points 3 hours ago Jasmine Crockett said this is good and called soft power. permalink parent award report block reply SPEDMan64 6 points 2 hours ago She needs to be soft-powered in the face. permalink parent award report block reply AlmostFullyDilated 1 points 1 hour ago Comment removed by community moderators. permalink parent award report block reply GatoradeJeb 6 points 2 hours ago Importing pajeets to build misisles permalink parent award report block reply AfrikaanerBoer 2 points 21 minutes ago HOLOCAUST THEM ALL ☪️🔜 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 permalink parent award report block reply Oleander 23 points 3 hours ago They (and the government as a whole) will be used against us, in the not too distant future. Unless their plan of peacefully genociding us continues unabated, of course, then they will just laugh at how dumb we are to let our people die off willingly. permalink parent award report block reply OrdJFellow 13 points 2 hours ago \"White people will be ethnically cleansed BUT it  will be done so LEGALLY. Just like the founding fathers envisioned.\" permalink parent award report block reply yodayoda 1 points 21 minutes ago as long as it's legal, that's all we seem to care about. permalink parent award report block reply NukeTheTroons 14 points 3 hours ago And thank god for Isreal fighting them over there for us! Imagine how many there would be if it wasn’t for Isreal… oh wait permalink parent award report block reply TrumpYouMagaFrenner -5 points 2 hours ago I mean Israel has helped get rid of them? Not sure what youre confused about. permalink parent award report block reply NutPsaki 7 points 2 hours ago Yeah they got rid of them from their region of the world and now they’re over here permalink parent award report block reply TrumpYouMagaFrenner -2 points 2 hours ago But they extinguished them period. That means there's less no matter where they are. permalink parent award report block reply view 1 more comments... Ancientpeople -6 points 2 hours ago People like you are either stupid or simply malicious with your obsession over Israel....Islam is literally invading the west with intent to impose Sharia law and your dumbness tries to deflect the conversation onto Israel permalink parent award report block reply NukeTheTroons 5 points 2 hours ago Yeah that’s the fucking point. They aren’t doing shit for us. Democrats and “certain people” who happen to have some of the most power in the country have brought them in. permalink parent award report block reply TrumpYouMagaFrenner 3 points 2 hours ago So was Israel committing genocide against Gaza or not? permalink parent award report block reply Ancientpeople 3 points 1 hour ago And who has been bringing them to Europe ? permalink parent award report block reply Treefiddydiddy 2 points 1 hour ago and why is jizlam invading the west ? because soros / mayorkas / spectre and countless other isreal firsters want them to be the 'broom of europe'.....as stated online and available on video by rabbi david touitou......you disingenuous shit spreader permalink parent award report block reply Ancientpeople 0 points 1 hour ago Soros is as anti Israel and anti God as they come permalink parent award report block reply GatoradeJeb 9 points 2 hours ago Im so glad trump wants to import more of these via h1b because americans are too dumb to build missiles permalink parent award report block reply Lelleck 3 points 2 hours ago And is joking around with one of the worst of them… It feels like this is his Arafat/Clinton moment… permalink parent award report block reply keeman 3 points 2 hours ago I'm guessing very few of these have jobs.  They will be \"refugees\" of various sorts and will be sucking at the taxpayer teat. permalink parent award report block reply MasterChief08 3 points 3 hours ago Obama permalink parent award report block reply rebuildingMyself 2 points 2 hours ago He didn't start it in that specific case but he damn well added to it permalink parent award report block reply load 5 more comments...\nMastaJoda 34 points 3 hours ago Save us from Iran by importing jihadis!🤡👍 permalink parent award report block reply MissingTrump 13 points 3 hours ago Jasmine Crockett said this is good and called soft power. permalink parent award report block reply SPEDMan64 6 points 2 hours ago She needs to be soft-powered in the face. permalink parent award report block reply AlmostFullyDilated 1 points 1 hour ago Comment removed by community moderators. permalink parent award report block reply GatoradeJeb 6 points 2 hours ago Importing pajeets to build misisles permalink parent award report block reply AfrikaanerBoer 2 points 21 minutes ago HOLOCAUST THEM ALL ☪️🔜 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 permalink parent award report block reply\nMissingTrump 13 points 3 hours ago Jasmine Crockett said this is good and called soft power. permalink parent award report block reply SPEDMan64 6 points 2 hours ago She needs to be soft-powered in the face. permalink parent award report block reply AlmostFullyDilated 1 points 1 hour ago Comment removed by community moderators. permalink parent award report block reply\nSPEDMan64 6 points 2 hours ago She needs to be soft-powered in the face. permalink parent award report block reply\nAlmostFullyDilated 1 points 1 hour ago Comment removed by community moderators. permalink parent award report block reply\nGatoradeJeb 6 points 2 hours ago Importing pajeets to build misisles permalink parent award report block reply AfrikaanerBoer 2 points 21 minutes ago HOLOCAUST THEM ALL ☪️🔜 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 permalink parent award report block reply\nAfrikaanerBoer 2 points 21 minutes ago HOLOCAUST THEM ALL ☪️🔜 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 permalink parent award report block reply\nOleander 23 points 3 hours ago They (and the government as a whole) will be used against us, in the not too distant future. Unless their plan of peacefully genociding us continues unabated, of course, then they will just laugh at how dumb we are to let our people die off willingly. permalink parent award report block reply OrdJFellow 13 points 2 hours ago \"White people will be ethnically cleansed BUT it  will be done so LEGALLY. Just like the founding fathers envisioned.\" permalink parent award report block reply yodayoda 1 points 21 minutes ago as long as it's legal, that's all we seem to care about. permalink parent award report block reply\nOrdJFellow 13 points 2 hours ago \"White people will be ethnically cleansed BUT it  will be done so LEGALLY. Just like the founding fathers envisioned.\" permalink parent award report block reply yodayoda 1 points 21 minutes ago as long as it's legal, that's all we seem to care about. permalink parent award report block reply\nyodayoda 1 points 21 minutes ago as long as it's legal, that's all we seem to care about. permalink parent award report block reply\nNukeTheTroons 14 points 3 hours ago And thank god for Isreal fighting them over there for us! Imagine how many there would be if it wasn’t for Isreal… oh wait permalink parent award report block reply TrumpYouMagaFrenner -5 points 2 hours ago I mean Israel has helped get rid of them? Not sure what youre confused about. permalink parent award report block reply NutPsaki 7 points 2 hours ago Yeah they got rid of them from their region of the world and now they’re over here permalink parent award report block reply TrumpYouMagaFrenner -2 points 2 hours ago But they extinguished them period. That means there's less no matter where they are. permalink parent award report block reply view 1 more comments... Ancientpeople -6 points 2 hours ago People like you are either stupid or simply malicious with your obsession over Israel....Islam is literally invading the west with intent to impose Sharia law and your dumbness tries to deflect the conversation onto Israel permalink parent award report block reply NukeTheTroons 5 points 2 hours ago Yeah that’s the fucking point. They aren’t doing shit for us. Democrats and “certain people” who happen to have some of the most power in the country have brought them in. permalink parent award report block reply TrumpYouMagaFrenner 3 points 2 hours ago So was Israel committing genocide against Gaza or not? permalink parent award report block reply Ancientpeople 3 points 1 hour ago And who has been bringing them to Europe ? permalink parent award report block reply Treefiddydiddy 2 points 1 hour ago and why is jizlam invading the west ? because soros / mayorkas / spectre and countless other isreal firsters want them to be the 'broom of europe'.....as stated online and available on video by rabbi david touitou......you disingenuous shit spreader permalink parent award report block reply Ancientpeople 0 points 1 hour ago Soros is as anti Israel and anti God as they come permalink parent award report block reply\nTrumpYouMagaFrenner -5 points 2 hours ago I mean Israel has helped get rid of them? Not sure what youre confused about. permalink parent award report block reply NutPsaki 7 points 2 hours ago Yeah they got rid of them from their region of the world and now they’re over here permalink parent award report block reply TrumpYouMagaFrenner -2 points 2 hours ago But they extinguished them period. That means there's less no matter where they are. permalink parent award report block reply view 1 more comments...\nNutPsaki 7 points 2 hours ago Yeah they got rid of them from their region of the world and now they’re over here permalink parent award report block reply TrumpYouMagaFrenner -2 points 2 hours ago But they extinguished them period. That means there's less no matter where they are. permalink parent award report block reply view 1 more comments...\nTrumpYouMagaFrenner -2 points 2 hours ago But they extinguished them period. That means there's less no matter where they are. permalink parent award report block reply view 1 more comments...\nAncientpeople -6 points 2 hours ago People like you are either stupid or simply malicious with your obsession over Israel....Islam is literally invading the west with intent to impose Sharia law and your dumbness tries to deflect the conversation onto Israel permalink parent award report block reply NukeTheTroons 5 points 2 hours ago Yeah that’s the fucking point. They aren’t doing shit for us. Democrats and “certain people” who happen to have some of the most power in the country have brought them in. permalink parent award report block reply TrumpYouMagaFrenner 3 points 2 hours ago So was Israel committing genocide against Gaza or not? permalink parent award report block reply Ancientpeople 3 points 1 hour ago And who has been bringing them to Europe ? permalink parent award report block reply Treefiddydiddy 2 points 1 hour ago and why is jizlam invading the west ? because soros / mayorkas / spectre and countless other isreal firsters want them to be the 'broom of europe'.....as stated online and available on video by rabbi david touitou......you disingenuous shit spreader permalink parent award report block reply Ancientpeople 0 points 1 hour ago Soros is as anti Israel and anti God as they come permalink parent award report block reply\nNukeTheTroons 5 points 2 hours ago Yeah that’s the fucking point. They aren’t doing shit for us. Democrats and “certain people” who happen to have some of the most power in the country have brought them in. permalink parent award report block reply TrumpYouMagaFrenner 3 points 2 hours ago So was Israel committing genocide against Gaza or not? permalink parent award report block reply Ancientpeople 3 points 1 hour ago And who has been bringing them to Europe ? permalink parent award report block reply\nTrumpYouMagaFrenner 3 points 2 hours ago So was Israel committing genocide against Gaza or not? permalink parent award report block reply\nAncientpeople 3 points 1 hour ago And who has been bringing them to Europe ? permalink parent award report block reply\nTreefiddydiddy 2 points 1 hour ago and why is jizlam invading the west ? because soros / mayorkas / spectre and countless other isreal firsters want them to be the 'broom of europe'.....as stated online and available on video by rabbi david touitou......you disingenuous shit spreader permalink parent award report block reply Ancientpeople 0 points 1 hour ago Soros is as anti Israel and anti God as they come permalink parent award report block reply\nAncientpeople 0 points 1 hour ago Soros is as anti Israel and anti God as they come permalink parent award report block reply\nGatoradeJeb 9 points 2 hours ago Im so glad trump wants to import more of these via h1b because americans are too dumb to build missiles permalink parent award report block reply Lelleck 3 points 2 hours ago And is joking around with one of the worst of them… It feels like this is his Arafat/Clinton moment… permalink parent award report block reply keeman 3 points 2 hours ago I'm guessing very few of these have jobs.  They will be \"refugees\" of various sorts and will be sucking at the taxpayer teat. permalink parent award report block reply\nLelleck 3 points 2 hours ago And is joking around with one of the worst of them… It feels like this is his Arafat/Clinton moment… permalink parent award report block reply\nkeeman 3 points 2 hours ago I'm guessing very few of these have jobs.  They will be \"refugees\" of various sorts and will be sucking at the taxpayer teat. permalink parent award report block reply\nMasterChief08 3 points 3 hours ago Obama permalink parent award report block reply rebuildingMyself 2 points 2 hours ago He didn't start it in that specific case but he damn well added to it permalink parent award report block reply\nrebuildingMyself 2 points 2 hours ago He didn't start it in that specific case but he damn well added to it permalink parent award report block reply\nPatriotSkorzeny 43 points 3 hours ago Yes. They want moslems in every corner they can put them. It’s disappointing. permalink award report block reply Prandogolio 18 points 3 hours ago Disappointing? permalink parent award report block reply MyGrandpa4 5 points 3 hours ago You know, women as second class. permalink parent award report block reply RedCapNation 6 points 3 hours ago They are. That’s the only thing Muslims do right. permalink parent award report block reply brainphreeze 11 points 3 hours ago Obama did this permalink parent award report block reply MastaJoda 8 points 3 hours ago Nome is bragging about it... permalink parent award report block reply SickofItall 4 points 2 hours ago No he didn't This was happening long before he was even in politics....it goes back to the tail end of Bush Sr into Clinton. permalink parent award report block reply MoldyLocksNesMonste 1 points 17 minutes ago Goes back to Henry Ford importing them permalink parent award report block reply\nPrandogolio 18 points 3 hours ago Disappointing? permalink parent award report block reply MyGrandpa4 5 points 3 hours ago You know, women as second class. permalink parent award report block reply RedCapNation 6 points 3 hours ago They are. That’s the only thing Muslims do right. permalink parent award report block reply\nMyGrandpa4 5 points 3 hours ago You know, women as second class. permalink parent award report block reply RedCapNation 6 points 3 hours ago They are. That’s the only thing Muslims do right. permalink parent award report block reply\nRedCapNation 6 points 3 hours ago They are. That’s the only thing Muslims do right. permalink parent award report block reply\nbrainphreeze 11 points 3 hours ago Obama did this permalink parent award report block reply MastaJoda 8 points 3 hours ago Nome is bragging about it... permalink parent award report block reply SickofItall 4 points 2 hours ago No he didn't This was happening long before he was even in politics....it goes back to the tail end of Bush Sr into Clinton. permalink parent award report block reply MoldyLocksNesMonste 1 points 17 minutes ago Goes back to Henry Ford importing them permalink parent award report block reply\nMastaJoda 8 points 3 hours ago Nome is bragging about it... permalink parent award report block reply\nSickofItall 4 points 2 hours ago No he didn't This was happening long before he was even in politics....it goes back to the tail end of Bush Sr into Clinton. permalink parent award report block reply MoldyLocksNesMonste 1 points 17 minutes ago Goes back to Henry Ford importing them permalink parent award report block reply\nMoldyLocksNesMonste 1 points 17 minutes ago Goes back to Henry Ford importing them permalink parent award report block reply\nhenri_derelicte 34 points 3 hours ago If we want to save our country, we’re not simply going to have to deport illegal immigrants, we’re going to have to strip certain people of legal status/citizenship and send them back as well. Targeting this latter group will make it very easy to turn America into a 80-90% White country again, and it also means that people like Letitia James, Maxine Waters, Barack Obama, etc. can be stripped of their citizenship and deported. permalink award report block reply Ostia 6 points 3 hours ago Will never happen. We’d be kicked out of power before we could even get any of it accomplished, due to flagrantly violating the constitution, the moment we started the policy of deporting legal residents and citizens. permalink parent award report block reply Elencher 6 points 3 hours ago Then we die, and that's why the future is balkanization. If we can't make this happen through the existing governmental structures, then those structures are on borrowed time. We'll have to reform along different lines and redefine citizenship. permalink parent award report block reply SutopSutolf 1 points 2 hours ago No. We just die. Good luck. permalink parent award report block reply Flying_Pede_121 2 points 1 hour ago lol, history says otherwise. The Spanish kicked the Muslims out. It’s happened before and will happen again. permalink parent award report block reply view 1 more comments... mikejones 1 points 2 hours ago I mean 300+ million people in North America. Went from 13 states to 50 states. Sure 250 years ago you could say certain things. Now you just overwhelm the population and use their laws against them and soon you overrule them. permalink parent award report block reply Ostia -1 points 2 hours ago Yeah, man, we must destroy the constitution to save it. So much for all the constitution talk we’ve spent decades spouting. permalink parent award report block reply Elencher 3 points 2 hours ago See you're retarded like my cousin. I tried this though experiment on him. So these muslims are all given legal citizenship, and they all vote legally, and they all vote for sharia, then clearly we must accept sharia because that's the constitutional process right? No, not at all. The constitution isn't fucking magic, it's downstream of the culture. If the culture has been polluted then the constitution doesn't work anymore. Take for example the concept of jury of your peers. If your peers are blacks who will punish all whites and acquit all blacks, then does this principle work anymore? permalink parent award report block reply view 4 more comments... Parhelion12 3 points 2 hours ago Hence.... no ballot box permalink parent award report block reply flashersenpai 1 points 2 hours ago due to flagrantly violating the constitution never stopped the government before, has it? and don't combine legal residents and citizens as though they have the same rights permalink parent award report block reply Ostia 0 points 2 hours ago Uh… They do. permalink parent award report block reply Formerlurker92 0 points 2 hours ago If theres no way to have it happen other than violence, I pray it happens while I'm still young and capable of it permalink parent award report block reply Ostia -1 points 2 hours ago You’re not even older enough to know what you’re talking about, what it was like before your time, or what you think you’re fighting for. permalink parent award report block reply henri_derelicte 0 points 2 hours ago Listen pal, you can either save your country or follow the constitution to the letter. I, for one, do not believe the constitution is a suicide pact permalink parent award report block reply Ostia 0 points 2 hours ago Cool, be sure to let the democrats know that possibility is on the table for them as well and say goodbye to your guns, gas vehicles, and freedom of speech. You’re every single thing the worst of the left accuses us of being. You justify their existence. permalink parent award report block reply mikejones 1 points 2 hours ago The thing is it is way hard to deport compared to let in. When it comes to deporting, those who got in illegally will use our system against us to stop deporting. We are basically screwed. permalink parent award report block reply PatriotGames 1 points 1 hour ago A lot of the people in that video were born in Dearborn MI. Just saying... the problem is already harder than you imagine. permalink parent award report block reply henri_derelicte 1 points 17 minutes ago You basically have to take over the courts to the point that where someone like Clarence Thomas looks like a moderate, or even a liberal compared to the people to the right of him. permalink parent award report block reply\nOstia 6 points 3 hours ago Will never happen. We’d be kicked out of power before we could even get any of it accomplished, due to flagrantly violating the constitution, the moment we started the policy of deporting legal residents and citizens. permalink parent award report block reply Elencher 6 points 3 hours ago Then we die, and that's why the future is balkanization. If we can't make this happen through the existing governmental structures, then those structures are on borrowed time. We'll have to reform along different lines and redefine citizenship. permalink parent award report block reply SutopSutolf 1 points 2 hours ago No. We just die. Good luck. permalink parent award report block reply Flying_Pede_121 2 points 1 hour ago lol, history says otherwise. The Spanish kicked the Muslims out. It’s happened before and will happen again. permalink parent award report block reply view 1 more comments... mikejones 1 points 2 hours ago I mean 300+ million people in North America. Went from 13 states to 50 states. Sure 250 years ago you could say certain things. Now you just overwhelm the population and use their laws against them and soon you overrule them. permalink parent award report block reply Ostia -1 points 2 hours ago Yeah, man, we must destroy the constitution to save it. So much for all the constitution talk we’ve spent decades spouting. permalink parent award report block reply Elencher 3 points 2 hours ago See you're retarded like my cousin. I tried this though experiment on him. So these muslims are all given legal citizenship, and they all vote legally, and they all vote for sharia, then clearly we must accept sharia because that's the constitutional process right? No, not at all. The constitution isn't fucking magic, it's downstream of the culture. If the culture has been polluted then the constitution doesn't work anymore. Take for example the concept of jury of your peers. If your peers are blacks who will punish all whites and acquit all blacks, then does this principle work anymore? permalink parent award report block reply view 4 more comments... Parhelion12 3 points 2 hours ago Hence.... no ballot box permalink parent award report block reply flashersenpai 1 points 2 hours ago due to flagrantly violating the constitution never stopped the government before, has it? and don't combine legal residents and citizens as though they have the same rights permalink parent award report block reply Ostia 0 points 2 hours ago Uh… They do. permalink parent award report block reply Formerlurker92 0 points 2 hours ago If theres no way to have it happen other than violence, I pray it happens while I'm still young and capable of it permalink parent award report block reply Ostia -1 points 2 hours ago You’re not even older enough to know what you’re talking about, what it was like before your time, or what you think you’re fighting for. permalink parent award report block reply henri_derelicte 0 points 2 hours ago Listen pal, you can either save your country or follow the constitution to the letter. I, for one, do not believe the constitution is a suicide pact permalink parent award report block reply Ostia 0 points 2 hours ago Cool, be sure to let the democrats know that possibility is on the table for them as well and say goodbye to your guns, gas vehicles, and freedom of speech. You’re every single thing the worst of the left accuses us of being. You justify their existence. permalink parent award report block reply\nElencher 6 points 3 hours ago Then we die, and that's why the future is balkanization. If we can't make this happen through the existing governmental structures, then those structures are on borrowed time. We'll have to reform along different lines and redefine citizenship. permalink parent award report block reply SutopSutolf 1 points 2 hours ago No. We just die. Good luck. permalink parent award report block reply Flying_Pede_121 2 points 1 hour ago lol, history says otherwise. The Spanish kicked the Muslims out. It’s happened before and will happen again. permalink parent award report block reply view 1 more comments... mikejones 1 points 2 hours ago I mean 300+ million people in North America. Went from 13 states to 50 states. Sure 250 years ago you could say certain things. Now you just overwhelm the population and use their laws against them and soon you overrule them. permalink parent award report block reply Ostia -1 points 2 hours ago Yeah, man, we must destroy the constitution to save it. So much for all the constitution talk we’ve spent decades spouting. permalink parent award report block reply Elencher 3 points 2 hours ago See you're retarded like my cousin. I tried this though experiment on him. So these muslims are all given legal citizenship, and they all vote legally, and they all vote for sharia, then clearly we must accept sharia because that's the constitutional process right? No, not at all. The constitution isn't fucking magic, it's downstream of the culture. If the culture has been polluted then the constitution doesn't work anymore. Take for example the concept of jury of your peers. If your peers are blacks who will punish all whites and acquit all blacks, then does this principle work anymore? permalink parent award report block reply view 4 more comments...\nSutopSutolf 1 points 2 hours ago No. We just die. Good luck. permalink parent award report block reply Flying_Pede_121 2 points 1 hour ago lol, history says otherwise. The Spanish kicked the Muslims out. It’s happened before and will happen again. permalink parent award report block reply view 1 more comments... mikejones 1 points 2 hours ago I mean 300+ million people in North America. Went from 13 states to 50 states. Sure 250 years ago you could say certain things. Now you just overwhelm the population and use their laws against them and soon you overrule them. permalink parent award report block reply\nFlying_Pede_121 2 points 1 hour ago lol, history says otherwise. The Spanish kicked the Muslims out. It’s happened before and will happen again. permalink parent award report block reply view 1 more comments...\nmikejones 1 points 2 hours ago I mean 300+ million people in North America. Went from 13 states to 50 states. Sure 250 years ago you could say certain things. Now you just overwhelm the population and use their laws against them and soon you overrule them. permalink parent award report block reply\nOstia -1 points 2 hours ago Yeah, man, we must destroy the constitution to save it. So much for all the constitution talk we’ve spent decades spouting. permalink parent award report block reply Elencher 3 points 2 hours ago See you're retarded like my cousin. I tried this though experiment on him. So these muslims are all given legal citizenship, and they all vote legally, and they all vote for sharia, then clearly we must accept sharia because that's the constitutional process right? No, not at all. The constitution isn't fucking magic, it's downstream of the culture. If the culture has been polluted then the constitution doesn't work anymore. Take for example the concept of jury of your peers. If your peers are blacks who will punish all whites and acquit all blacks, then does this principle work anymore? permalink parent award report block reply view 4 more comments...\nElencher 3 points 2 hours ago See you're retarded like my cousin. I tried this though experiment on him. So these muslims are all given legal citizenship, and they all vote legally, and they all vote for sharia, then clearly we must accept sharia because that's the constitutional process right? No, not at all. The constitution isn't fucking magic, it's downstream of the culture. If the culture has been polluted then the constitution doesn't work anymore. Take for example the concept of jury of your peers. If your peers are blacks who will punish all whites and acquit all blacks, then does this principle work anymore? permalink parent award report block reply view 4 more comments...\nParhelion12 3 points 2 hours ago Hence.... no ballot box permalink parent award report block reply\nflashersenpai 1 points 2 hours ago due to flagrantly violating the constitution never stopped the government before, has it? and don't combine legal residents and citizens as though they have the same rights permalink parent award report block reply Ostia 0 points 2 hours ago Uh… They do. permalink parent award report block reply\nOstia 0 points 2 hours ago Uh… They do. permalink parent award report block reply\nFormerlurker92 0 points 2 hours ago If theres no way to have it happen other than violence, I pray it happens while I'm still young and capable of it permalink parent award report block reply Ostia -1 points 2 hours ago You’re not even older enough to know what you’re talking about, what it was like before your time, or what you think you’re fighting for. permalink parent award report block reply\nOstia -1 points 2 hours ago You’re not even older enough to know what you’re talking about, what it was like before your time, or what you think you’re fighting for. permalink parent award report block reply\nhenri_derelicte 0 points 2 hours ago Listen pal, you can either save your country or follow the constitution to the letter. I, for one, do not believe the constitution is a suicide pact permalink parent award report block reply Ostia 0 points 2 hours ago Cool, be sure to let the democrats know that possibility is on the table for them as well and say goodbye to your guns, gas vehicles, and freedom of speech. You’re every single thing the worst of the left accuses us of being. You justify their existence. permalink parent award report block reply\nOstia 0 points 2 hours ago Cool, be sure to let the democrats know that possibility is on the table for them as well and say goodbye to your guns, gas vehicles, and freedom of speech. You’re every single thing the worst of the left accuses us of being. You justify their existence. permalink parent award report block reply\nmikejones 1 points 2 hours ago The thing is it is way hard to deport compared to let in. When it comes to deporting, those who got in illegally will use our system against us to stop deporting. We are basically screwed. permalink parent award report block reply\nPatriotGames 1 points 1 hour ago A lot of the people in that video were born in Dearborn MI. Just saying... the problem is already harder than you imagine. permalink parent award report block reply henri_derelicte 1 points 17 minutes ago You basically have to take over the courts to the point that where someone like Clarence Thomas looks like a moderate, or even a liberal compared to the people to the right of him. permalink parent award report block reply\nhenri_derelicte 1 points 17 minutes ago You basically have to take over the courts to the point that where someone like Clarence Thomas looks like a moderate, or even a liberal compared to the people to the right of him. permalink parent award report block reply\nGoldenEarz 20 points 3 hours ago Where are all the American flags? permalink award report block reply MEME-SUPREME 23 points 3 hours ago They burned all of them. permalink parent award report block reply\nMEME-SUPREME 23 points 3 hours ago They burned all of them. permalink parent award report block reply\nDeplorachuIChooseYou 16 points 3 hours ago This country is looking more and more like the UK permalink award report block reply Oleander 5 points 3 hours ago It's worse. The demographics are much worse. Only thing that's better is that we aren't getting locked up for memes yet. And sure we have guns too, but that hasn't stopped the invasion. We just end up with a lot of armed feral niggrs and terrorists and that's it really. permalink parent award report block reply rebuildingMyself 2 points 2 hours ago Any and all freedoms we still have over UK will go with the next Democrat president and Congress. They see UK abusing its own people to protect invaders and get extremely jealous permalink parent award report block reply Tyrone_biggums 1 points 1 hour ago Definitely not worse permalink parent award report block reply Oleander 1 points 1 hour ago We are a lot less white than Europe. And that's just right now - how about when a Democrat gets in next, and we have mass amnesty and abolished ICE? permalink parent award report block reply mikejones 0 points 2 hours ago You talk to anyone that grew up in the country and then moved to the city. They will be like I grew up around 100% white people and after moving to the city, now I go places and I am the only white person there. permalink parent award report block reply rebuildingMyself 4 points 3 hours ago UK is just where we'll be in ten years tops. They jumped ahead of us because we bucked and elected Trump instead of Uniparty A vs Uniparty B. Trump isnt perfect by any means but one thing he did was throw a wrench in their plans to swarm the country with brown parasites. But one of our biggest cities just fell to a communist Muslim just like London fell before.  It will take a lot of work and violence to recover that city, but it's doubtful as anyone with means will flee the city in the next few years as the diversity and socialism hot their pocketbook or their faces via sucker punch. While you can point and laugh , that only means the city falls further and further to the left and we'll all eventually be subsidizing it via federal bailouts. permalink parent award report block reply\nOleander 5 points 3 hours ago It's worse. The demographics are much worse. Only thing that's better is that we aren't getting locked up for memes yet. And sure we have guns too, but that hasn't stopped the invasion. We just end up with a lot of armed feral niggrs and terrorists and that's it really. permalink parent award report block reply rebuildingMyself 2 points 2 hours ago Any and all freedoms we still have over UK will go with the next Democrat president and Congress. They see UK abusing its own people to protect invaders and get extremely jealous permalink parent award report block reply Tyrone_biggums 1 points 1 hour ago Definitely not worse permalink parent award report block reply Oleander 1 points 1 hour ago We are a lot less white than Europe. And that's just right now - how about when a Democrat gets in next, and we have mass amnesty and abolished ICE? permalink parent award report block reply mikejones 0 points 2 hours ago You talk to anyone that grew up in the country and then moved to the city. They will be like I grew up around 100% white people and after moving to the city, now I go places and I am the only white person there. permalink parent award report block reply\nrebuildingMyself 2 points 2 hours ago Any and all freedoms we still have over UK will go with the next Democrat president and Congress. They see UK abusing its own people to protect invaders and get extremely jealous permalink parent award report block reply\nTyrone_biggums 1 points 1 hour ago Definitely not worse permalink parent award report block reply Oleander 1 points 1 hour ago We are a lot less white than Europe. And that's just right now - how about when a Democrat gets in next, and we have mass amnesty and abolished ICE? permalink parent award report block reply\nOleander 1 points 1 hour ago We are a lot less white than Europe. And that's just right now - how about when a Democrat gets in next, and we have mass amnesty and abolished ICE? permalink parent award report block reply\nmikejones 0 points 2 hours ago You talk to anyone that grew up in the country and then moved to the city. They will be like I grew up around 100% white people and after moving to the city, now I go places and I am the only white person there. permalink parent award report block reply\nrebuildingMyself 4 points 3 hours ago UK is just where we'll be in ten years tops. They jumped ahead of us because we bucked and elected Trump instead of Uniparty A vs Uniparty B. Trump isnt perfect by any means but one thing he did was throw a wrench in their plans to swarm the country with brown parasites. But one of our biggest cities just fell to a communist Muslim just like London fell before.  It will take a lot of work and violence to recover that city, but it's doubtful as anyone with means will flee the city in the next few years as the diversity and socialism hot their pocketbook or their faces via sucker punch. While you can point and laugh , that only means the city falls further and further to the left and we'll all eventually be subsidizing it via federal bailouts. permalink parent award report block reply\nGA_Logic 13 points 3 hours ago Well to be accurate there could be those with refugee status which is currently being revoked by the Trump administration (eg Syria) But yes legal immigration is a problem just like illegal immigration. permalink award report block reply FusionBlack 23 points 3 hours ago Legal is even worse.  You can deport illegals. permalink parent award report block reply Roadcruiser2 17 points 3 hours ago Chinese American Pede here. There are too many hostile foreigners. We need to suspend immigration. permalink parent award report block reply deleted -3 points 3 hours ago NadlersNads 5 points 3 hours ago Sorry about your future edited gene pool permalink parent award report block reply CheeseAndOnion 3 points 2 hours ago Im sure she is rubbing off on your son if ya know what i mean lol permalink parent award report block reply SpellingContable 2 points 3 hours ago She probably does. permalink parent award report block reply SutopSutolf 2 points 2 hours ago You better hope she rubs him hard. Might be the only future he has. permalink parent award report block reply DeaduponArousal 7 points 3 hours ago All immigration involving non white Christians needs to go. permalink parent award report block reply GatoradeJeb 3 points 2 hours ago And trump just said he wants to import more h1b like in the pic because americans too dumb to build missiles permalink parent award report block reply\nFusionBlack 23 points 3 hours ago Legal is even worse.  You can deport illegals. permalink parent award report block reply Roadcruiser2 17 points 3 hours ago Chinese American Pede here. There are too many hostile foreigners. We need to suspend immigration. permalink parent award report block reply deleted -3 points 3 hours ago NadlersNads 5 points 3 hours ago Sorry about your future edited gene pool permalink parent award report block reply CheeseAndOnion 3 points 2 hours ago Im sure she is rubbing off on your son if ya know what i mean lol permalink parent award report block reply SpellingContable 2 points 3 hours ago She probably does. permalink parent award report block reply SutopSutolf 2 points 2 hours ago You better hope she rubs him hard. Might be the only future he has. permalink parent award report block reply\nRoadcruiser2 17 points 3 hours ago Chinese American Pede here. There are too many hostile foreigners. We need to suspend immigration. permalink parent award report block reply deleted -3 points 3 hours ago NadlersNads 5 points 3 hours ago Sorry about your future edited gene pool permalink parent award report block reply CheeseAndOnion 3 points 2 hours ago Im sure she is rubbing off on your son if ya know what i mean lol permalink parent award report block reply SpellingContable 2 points 3 hours ago She probably does. permalink parent award report block reply SutopSutolf 2 points 2 hours ago You better hope she rubs him hard. Might be the only future he has. permalink parent award report block reply\ndeleted -3 points 3 hours ago NadlersNads 5 points 3 hours ago Sorry about your future edited gene pool permalink parent award report block reply CheeseAndOnion 3 points 2 hours ago Im sure she is rubbing off on your son if ya know what i mean lol permalink parent award report block reply SpellingContable 2 points 3 hours ago She probably does. permalink parent award report block reply SutopSutolf 2 points 2 hours ago You better hope she rubs him hard. Might be the only future he has. permalink parent award report block reply\nNadlersNads 5 points 3 hours ago Sorry about your future edited gene pool permalink parent award report block reply\nCheeseAndOnion 3 points 2 hours ago Im sure she is rubbing off on your son if ya know what i mean lol permalink parent award report block reply\nSpellingContable 2 points 3 hours ago She probably does. permalink parent award report block reply\nSutopSutolf 2 points 2 hours ago You better hope she rubs him hard. Might be the only future he has. permalink parent award report block reply\nDeaduponArousal 7 points 3 hours ago All immigration involving non white Christians needs to go. permalink parent award report block reply\nGatoradeJeb 3 points 2 hours ago And trump just said he wants to import more h1b like in the pic because americans too dumb to build missiles permalink parent award report block reply\nFearGodTheAlmighty 13 points 3 hours ago Antifa, middle east division permalink award report block reply\nairborne3502 9 points 3 hours ago Glad we fought them over there so they didn't come here. permalink award report block reply ninabobby 3 points 3 hours ago Bomb more countries! Let in millions more refugees who hate us! Are you feeling safe yet? permalink parent award report block reply\nninabobby 3 points 3 hours ago Bomb more countries! Let in millions more refugees who hate us! Are you feeling safe yet? permalink parent award report block reply\nGoatboy66 9 points 3 hours ago MOAB permalink award report block reply OldGamerGuy79 4 points 3 hours ago Mini-gun permalink parent award report block reply\nOldGamerGuy79 4 points 3 hours ago Mini-gun permalink parent award report block reply\nJoeMcCarthyWasRight 8 points 3 hours ago That’s some talent right there, huh Trump. permalink award report block reply\nRBFace 7 points 3 hours ago Why aren't these people being deported? Why are these people increasing in numbers in Texas? When Trump made his mid-east tour did he make some deal to allow and not deport these vermin? Punjeets and Muslims never seem to be the ones getting deported. There is a simple solution to this problem but our government won't do anything about it. I'm sorry,  I'm having a hard time understanding why Trump and his administration refuse to do shit about this. permalink award report block reply NutPsaki 2 points 2 hours ago Because he’s a cucked boomer pussy permalink parent award report block reply Treefiddydiddy 0 points 1 hour ago with his nuts firmly in net and yahoos fist sadly permalink parent award report block reply\nNutPsaki 2 points 2 hours ago Because he’s a cucked boomer pussy permalink parent award report block reply Treefiddydiddy 0 points 1 hour ago with his nuts firmly in net and yahoos fist sadly permalink parent award report block reply\nTreefiddydiddy 0 points 1 hour ago with his nuts firmly in net and yahoos fist sadly permalink parent award report block reply\nfightfightfightx 6 points 3 hours ago thank the bergs, steins, and roths for this shit starting to think the history books were all projection, because no one today even comes close to how evil they are permalink award report block reply NutPsaki 3 points 2 hours ago Starting to believe the exact opposite of what history books tell us permalink parent award report block reply\nNutPsaki 3 points 2 hours ago Starting to believe the exact opposite of what history books tell us permalink parent award report block reply\nFormerlurker92 6 points 2 hours ago Denaturalize and deport them anyway. Fuck foreign powers colonizing my home permalink award report block reply\nRedpilled2Depression 6 points 3 hours ago And they all laugh at us for being stupid enough to let them in permalink award report block reply\nBilbobaggins 5 points 2 hours ago Remember fight them over there so we don’t have to here? Turns out the truth was ‘fight them over there so we can declare them all asylum seekers and import them’ permalink award report block reply\nTheMustacheBandit 5 points 3 hours ago Disgusting and horrific.  We are cooked. permalink award report block reply mikejones 1 points 2 hours ago America was lucky. Huge, surrounded by water. Canada is frozen so not many people lived there early on. Mexico was Mexico. Then over last 40 years bribes happened and many people came over and jobs left. Then 40 years later if you try to do anything about it you are called a racist and say you are breaking the law. So there is no winning. permalink parent award report block reply\nmikejones 1 points 2 hours ago America was lucky. Huge, surrounded by water. Canada is frozen so not many people lived there early on. Mexico was Mexico. Then over last 40 years bribes happened and many people came over and jobs left. Then 40 years later if you try to do anything about it you are called a racist and say you are breaking the law. So there is no winning. permalink parent award report block reply\nTwoArizonaPedes 5 points 3 hours ago FIGHT BACK. It begins by getting together a group of like-minded patriots. Start with your church and your friends and grow from there. Set up a phone tree. Use burner phones. Don't text. Organize, coordinate, think, be creative! You already know how to respond to their street-blocking \"prayers.\" Pick a name or organization and get involved. permalink award report block reply LetFreedomRing 2 points 3 hours ago They made Christians weak by believing that Jesus would welcome everyone... What happened to people who would have fought the Crusades in this day and age?? permalink parent award report block reply TwoArizonaPedes 1 points 29 minutes ago Don't believe the lying legacy media. We're here and fighting. Join us! permalink parent award report block reply\nLetFreedomRing 2 points 3 hours ago They made Christians weak by believing that Jesus would welcome everyone... What happened to people who would have fought the Crusades in this day and age?? permalink parent award report block reply TwoArizonaPedes 1 points 29 minutes ago Don't believe the lying legacy media. We're here and fighting. Join us! permalink parent award report block reply\nTwoArizonaPedes 1 points 29 minutes ago Don't believe the lying legacy media. We're here and fighting. Join us! permalink parent award report block reply\nMEME-SUPREME 5 points 3 hours ago This will end well. permalink award report block reply\nMarkosis17 4 points 3 hours ago What in the actual fuck! permalink award report block reply\nSenaleb 4 points 3 hours ago Don't you feel culturally enriched? permalink award report block reply\nRickSanchezC137 4 points 3 hours ago Deport them all permalink award report block reply\nspezisacuckold 4 points 2 hours ago TROJAN HORSE INVASION permalink award report block reply\nSaxonlady 3 points 3 hours ago For years I've been told by many here that UK is a shithole. Whilst I never disagreed, I'm very sad that while some were watching what was happening here, they did nothing to stop this from also happening in America. permalink award report block reply RedStoneDeepState 2 points 1 hour ago This is a small part of the Detroit metro. The reason people don't care is because Arabs make better neighbors than the blacks in Detroit, and they are displacing the blacks.  It is actively making Detroit less of a shithole. permalink parent award report block reply Saxonlady 1 points 51 minutes ago Interesting. So when all the blacks are gone and it's just muslims and whites, do the whites know they will be displaced next? permalink parent award report block reply RedStoneDeepState 1 points 43 minutes ago It's Michigan. Being \"displaced\" isn't the problem, farmland is cheap to expand. permalink parent award report block reply\nRedStoneDeepState 2 points 1 hour ago This is a small part of the Detroit metro. The reason people don't care is because Arabs make better neighbors than the blacks in Detroit, and they are displacing the blacks.  It is actively making Detroit less of a shithole. permalink parent award report block reply Saxonlady 1 points 51 minutes ago Interesting. So when all the blacks are gone and it's just muslims and whites, do the whites know they will be displaced next? permalink parent award report block reply RedStoneDeepState 1 points 43 minutes ago It's Michigan. Being \"displaced\" isn't the problem, farmland is cheap to expand. permalink parent award report block reply\nSaxonlady 1 points 51 minutes ago Interesting. So when all the blacks are gone and it's just muslims and whites, do the whites know they will be displaced next? permalink parent award report block reply RedStoneDeepState 1 points 43 minutes ago It's Michigan. Being \"displaced\" isn't the problem, farmland is cheap to expand. permalink parent award report block reply\nRedStoneDeepState 1 points 43 minutes ago It's Michigan. Being \"displaced\" isn't the problem, farmland is cheap to expand. permalink parent award report block reply\nVladtheTickler 3 points 3 hours ago Thanks, Obama. permalink award report block reply dodgetimes2 1 points 2 hours ago As much as I fucking hate that faggot tranny lover this predates Obama. I’m from the SE Michigan area and played sports against Dearborn back in the 90’s. Even back then their HS football team were calling audibles in Arabic. Of course it’s gotten even worse but this was happening before that Muslim faggot. permalink parent award report block reply VladtheTickler 1 points 1 hour ago There were some, but not nearly the numbers as in post-Bushjr/Obama.  Competing for a mayoral seat was unthinkable back then. permalink parent award report block reply CheeseAndOnion 0 points 2 hours ago Well he is Moslem after all what did u expect permalink parent award report block reply\ndodgetimes2 1 points 2 hours ago As much as I fucking hate that faggot tranny lover this predates Obama. I’m from the SE Michigan area and played sports against Dearborn back in the 90’s. Even back then their HS football team were calling audibles in Arabic. Of course it’s gotten even worse but this was happening before that Muslim faggot. permalink parent award report block reply VladtheTickler 1 points 1 hour ago There were some, but not nearly the numbers as in post-Bushjr/Obama.  Competing for a mayoral seat was unthinkable back then. permalink parent award report block reply\nVladtheTickler 1 points 1 hour ago There were some, but not nearly the numbers as in post-Bushjr/Obama.  Competing for a mayoral seat was unthinkable back then. permalink parent award report block reply\nCheeseAndOnion 0 points 2 hours ago Well he is Moslem after all what did u expect permalink parent award report block reply\nOwmyballz 3 points 2 hours ago Get them the fuck out of the United States now. permalink award report block reply\nUnderpants 3 points 3 hours ago Can we build a wall around it? permalink award report block reply\nCT-PATRIOT 3 points 2 hours ago Commonly known as DearbornIstan Michigan permalink award report block reply\nTreefiddydiddy 2 points 1 hour ago gee thanks obummer etc permalink award report block reply\nCaptainWinston 2 points 3 hours ago Looks. AI AF permalink award report block reply\nGreyKnight 2 points 3 hours ago I used to wonder why they were so many wars, atrocities and genocides throughout history…now I get it. permalink award report block reply\nCheeseAndOnion 2 points 3 hours ago Deport permalink award report block reply\nirescreams 2 points 2 hours ago This is White country, Muslim invaders need to go back to their shitholes and take their flags with them. permalink award report block reply\nLetFreedomRing 2 points 3 hours ago Why didn't our people fight back? Americans have been conditioned to believe that if we fight back we're somehow racist. It's not racist to want to preserve the American way of life. It's not racist to fight people who want you dead. permalink award report block reply Oleander 2 points 3 hours ago I don't give a shit if it's racist anymore. The browns and blacks would gladly watch whites (who are a vanishing minority in this world) die. The fact that you or anyone cares whether it's \"racist\" is how we got here. The term \"racism\" is a weapon exclusively directed at whites and no one else. It is an albatross we must be free from immediately, or we will die. It's not hyperbole, the whole world and half of our own are rooting for our extinction. permalink parent award report block reply RedStoneDeepState 1 points 1 hour ago This is a small part of the Detroit metro. The reason people don't care is because Arabs make better neighbors than the blacks in Detroit, and they are displacing the blacks. It is actively making Detroit less of a shithole. permalink parent award report block reply\nOleander 2 points 3 hours ago I don't give a shit if it's racist anymore. The browns and blacks would gladly watch whites (who are a vanishing minority in this world) die. The fact that you or anyone cares whether it's \"racist\" is how we got here. The term \"racism\" is a weapon exclusively directed at whites and no one else. It is an albatross we must be free from immediately, or we will die. It's not hyperbole, the whole world and half of our own are rooting for our extinction. permalink parent award report block reply\nRedStoneDeepState 1 points 1 hour ago This is a small part of the Detroit metro. The reason people don't care is because Arabs make better neighbors than the blacks in Detroit, and they are displacing the blacks. It is actively making Detroit less of a shithole. permalink parent award report block reply\nbleeje OP 2 points 3 hours ago Thanks for sticky, mods permalink award report block reply\nSoL-Chi 2 points 1 hour ago Fn crazy. permalink award report block reply\nRerun1Central 2 points 2 hours ago retards in Michigan say... 'but the middle eastern bakery is so good'... like fuck off we have perfectly good polish & greek bakeries all over metro detroit permalink award report block reply\nTexasBrowncoat 2 points 2 hours ago Naturalized citizenship can be revoked through a process called denaturalization, which typically occurs if an individual obtained citizenship by concealing material facts or through willful misrepresentation. Additionally, citizenship may be revoked if the individual is found to have committed certain crimes or affiliated with specific organizations that preclude naturalization. permalink award report block reply\ncherbui 2 points 2 hours ago legal invasion promoted by democrat party permalink award report block reply RedStoneDeepState 1 points 1 hour ago This is promoted by Republicans as well. permalink parent award report block reply\nRedStoneDeepState 1 points 1 hour ago This is promoted by Republicans as well. permalink parent award report block reply\nDev404 2 points 1 hour ago Our government has been subsidizing an invasion of our country while calling us racist if we don't let them do it. Feminism was their tool to get mainstream acceptance of this invasion. permalink award report block reply\ndudebro 2 points 1 hour ago \"Immigration is okay as long as it's legal!\" - boomer republicans permalink award report block reply\nmateus 2 points 2 hours ago Seeing this should as care the bejeebers out of everyone. permalink award report block reply\nPolarix 2 points 2 hours ago Future NYC permalink award report block reply\nFORMERCHILDSTAR 2 points 2 hours ago I don't see orthodox Islam as a religion, it's more of a subversive militant organization hiding as a religion. Secular Muslims are tolerable in numbers that can assimilate, but vast numbers of devout Muslims with ideals contrary to the USA Constitution and individual liberty are destructive to societal cohesion. permalink award report block reply\nnewuser8 2 points 37 minutes ago I fucking hate boomers that allow this shit. permalink award report block reply\nTrumpWin 2 points 1 hour ago American people won't go for another Iraq so the deep state is bringing the invaders here permalink award report block reply\nSnek_Plissken 2 points 2 hours ago 40% of those residents are in SNAP. They imported the third world and the government takes care of them. permalink award report block reply Logan051361 2 points 2 hours ago This one I can Confirm. They will put all their wives on snap. some of these fucks have 5 wives permalink parent award report block reply Snek_Plissken 1 points 2 hours ago At some point, the various AIs will stop answering questions regarding the severity of government programs. It’s funny because the states are reimbursed for this and everyone pays for the democrat grift. permalink parent award report block reply\nLogan051361 2 points 2 hours ago This one I can Confirm. They will put all their wives on snap. some of these fucks have 5 wives permalink parent award report block reply Snek_Plissken 1 points 2 hours ago At some point, the various AIs will stop answering questions regarding the severity of government programs. It’s funny because the states are reimbursed for this and everyone pays for the democrat grift. permalink parent award report block reply\nSnek_Plissken 1 points 2 hours ago At some point, the various AIs will stop answering questions regarding the severity of government programs. It’s funny because the states are reimbursed for this and everyone pays for the democrat grift. permalink parent award report block reply\nAmerica101 2 points 49 minutes ago This is really scary and the downfall of America. Muslins are taking over Minnesota, Texas and now New York. They have a plan and it is working. permalink award report block reply\nShitsbrokeyo 2 points 2 hours ago No reason for this. permalink award report block reply\nSkabliggum2 2 points 35 minutes ago I never understood why Michigan.  Many are from hot, arid regions and they all pick Michigan? permalink award report block reply\nSvaap 2 points 2 hours ago God save us.  Really. permalink award report block reply\n20MagnusKonrad20 2 points 2 hours ago What is with all the women upholding this? If i'm to understand that Islam opresses women, why are so many of them participating and promoting it? permalink award report block reply RedStoneDeepState 1 points 1 hour ago Islam barely oppresses women. permalink parent award report block reply\nRedStoneDeepState 1 points 1 hour ago Islam barely oppresses women. permalink parent award report block reply\nFirstOfHisName 2 points 3 hours ago All wearing black like the good guys... right? permalink award report block reply\nkeeman 2 points 2 hours ago How many are living off government charity?  Maybe end that. permalink award report block reply\nDontTreadOnSnek 2 points 3 hours ago It's a race between Michigan and Minnesota as to which one becomes the first caliphate state. permalink award report block reply\nMichalusmichalus 2 points 32 minutes ago I call that drop shipped gerrymandering. It's how Ilhar Omar got her district. permalink award report block reply\nAlmostFullyDilated 2 points 1 hour ago nuke them from orbit permalink award report block reply\nRedFoxOnFire 2 points 32 minutes ago America: \"If you criticize Israel then you'll face criminal charges.\" Also America: \"We need to import more people who hate jews.\" Make it make sense. permalink award report block reply\ntlorsung 2 points 2 hours ago Dearborn better not get ANY Federal money and limited State funds! That includes any welfare/EBT/SNAP!    Muslims prove you can be self-sustainable without a Christian!!!! permalink award report block reply\nLive_free_or_die_55 2 points 2 hours ago Deport them all Now ‼️‼️‼️ permalink award report block reply\nFreefertilizer 2 points 2 hours ago sickening permalink award report block reply\nDoubleu1992 2 points 2 hours ago We lost, we are weak losers that let pedophiles take us over. Look on the mirror and call yourself a cuck fag cuz that’s what we are. A real man would kick these pedos out permalink award report block reply\nZeleskys_WH_Clothing 1 points 6 minutes ago \"These are just the people here to train us and leave... so we can become high skilled workers, make more money and send that money overseas so we can fight the real enemy, which is Iran and Russia.\" - U.S. Government permalink award report block reply\n2FBIAgents1Cup 1 points 1 hour ago You had a chance here for another airplane disaster here and you blew it..... just sayin.... permalink award report block reply\nredditadminssuckit 1 points 2 hours ago Where are flamethrowers when you need them? permalink award report block reply\nImYourHuckleberry24 1 points 2 hours ago FUCK TRUMP FOR ALLOWING THIS permalink award report block reply PotatusHead 0 points 2 hours ago DEPORTED. Byee.... permalink parent award report block reply ImYourHuckleberry24 1 points 1 hour ago Zero Fucks Given permalink parent award report block reply\nPotatusHead 0 points 2 hours ago DEPORTED. Byee.... permalink parent award report block reply ImYourHuckleberry24 1 points 1 hour ago Zero Fucks Given permalink parent award report block reply\nImYourHuckleberry24 1 points 1 hour ago Zero Fucks Given permalink parent award report block reply\nlearntocode 1 points 2 hours ago You mad at them or the people who paid them to be here? permalink award report block reply\nOodles 1 points 2 hours ago Import the third world, become the third world permalink award report block reply\nDiamondDroid 1 points 1 hour ago Won't it be sad if Dearborn had a toxic train disaster like East Palestine handled with the same incompetence as the Otto Penn administration, toxic chemical spills, and poisonous gas and smoke and polluted ground water. Or maybe a Lahina fire. Or maybe something new like a plague of stampeding pigs. That would be sooooo... sad . permalink award report block reply\nTrumpYouMagaFrenner 0 points 2 hours ago Remember all the no kings rally? This is a small insignificant percentage of people. Dont doom permalink award report block reply\nPotatusHead -1 points 2 hours ago So? permalink award report block reply",
  "fetched_at": "2025-11-12T21:15:51.199499Z"
}