{
  "id": "1ARK5131t4",
  "url": "https://patriots.win/p/1ARK5131t4/if-republicans-want-to-cut-socia/c",
  "content": "424 If Republicans Want to Cut Socialists Off at the Knees, Homes Need to Be Affordable Again (hotair.com) posted 7 days ago by rdvs34283 44 comments award share report block If Republicans Want to Cut Socialists Off at the Knees, Homes Need to Be Affordable Again Exploring the need for affordable homes amidst rising prices and economic challenges. hotair.com\n44 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style justinkayz 22 points 7 days ago Increased deportations = lower housing costs permalink award report block reply NotYourMan 9 points 6 days ago This is part of it.  The government has been helping illegal aliens buy houses for several decades now.  Housing and rent prices reflect inflation but they also reflect the lack of building over the past 30 years.  Its a supply problem.  City laws prevent single family homes like in California were the state government passed Housing Accountability Act.  Lets not forget that in California 20% of the homes are sold to H1B-visa millionaires.  These are foreign high-tech employees that got rich on the stock market.  Clinton and Obama extended the H1B-visa laws which works against Americans. permalink parent award report block reply midgetpornrocks 3 points 6 days ago Lower interest rates permalink parent award report block reply OTher55 8 points 7 days ago Don't worry there'll soon be plenty of cheap homes in New York after everyone gtfo permalink award report block reply NamendaBiden 6 points 6 days ago Lol.  NYC can look to Detroit and see their future. permalink parent award report block reply DeportThemAllForever 3 points 6 days ago But then they move into red states and turn them blue with their dumb NY behavior. permalink parent award report block reply OTher55 1 points 6 days ago Many red states got blue refugees from 2020-2024, yet all the red states got redder in 2024. permalink parent award report block reply N0rds 1 points 6 days ago Yes, but had they not moved those states probably would have been redder than a tranny's face when told he's actually a man...\nThe blues still drop the overall redness permalink parent award report block reply OTher55 1 points 6 days ago Any data or evidence or (even tho I don't place much trust in them) studies to share showing that? permalink parent award report block reply view 3 more comments... SanityGumby 4 points 6 days ago Trump is already doing what he can. He opened up federal lands for new homes, cutting epa regulations, and he is removing illegals. What the hell do people think he can do? permalink award report block reply N0rds 2 points 6 days ago Remove 100 times more illegals than we have so far. Gotta rid America of 40,000,000 illegals. permalink parent award report block reply el-y0y0s 4 points 6 days ago Jobs need to be secure again permalink award report block reply Smegmaless2 3 points 6 days ago My home’s value going down is not something I am excited about. I put 25% down and split my payments into biweekly instead of monthly. I dump everything I can against my mortgage. I have a lot of equity in my home. The prospect of my home value going down doesn’t sit well with me. I was underwater on a house in the past, during the 2009 bubble….it wasn’t pleasant. I’m conflicted when i read things like this. I want the parasitic illegals out, but I also count on having high real estate value, in case I am able to retire someday…0 permalink award report block reply HuggableBear 5 points 6 days ago Stop worrying about your home's value. It's your home, not an investment vehicle. The value in your home is the decades of shelter it provides your family. Everyone worrying about the sale value is where the problem starts. It becomes loss of potential revenue in your mind if the market shifts. I haven't worried about my house's value, ever. I bought it not to realize a profit but to provide a home, and I get 100% of that value everyday. Turning single family real estate into a revenue stream is what brought us to this point today where no one can afford a house because you don't want to lose a dime. permalink parent award report block reply N0rds 3 points 6 days ago The housing bubble is GOING to pop. 100,000 homes being sold for 750,000 is NOT normal. People who overpaid for their small houses will get screwed when the bubble finally pops. Gunna suck for many people, but we are long overdue for the bubble to pop permalink parent award report block reply BillyBobJimmyJoe 0 points 6 days ago your inflated home isn't actually worth what you think its worth permalink parent award report block reply Jefferson 3 points 6 days ago Well, that's not going to happen in Florida.  Thanks, NYC. permalink award report block reply Angryhotdog 1 points 6 days ago Georgia two but here in southern GA mostly apartment and townhouse are being built, permalink parent award report block reply schiff_for_brains 2 points 6 days ago They're dropping fast, as financing has caught home prices. I say this with the caveat that real estate is local...it's probably not true everywhere.  I believe it's generally true, though. I just moved at the end of summer.  In the old and new market, the homes that sell are well below market average (starters and rental stock needing work), or the high end (1MM+, estates, water access, land, etc).  The middle is getting squeezed very hard. I just dropped ~10% of my old home's comp value in maintenance and updates.  3 months ago, I was estimating breaking even on them.  And to be fair, work needed to be done.  Like the roof was still OK, but 25 years old.  Way easier to pay for that in the next mortgage vs. right after the banks pick you clean, and no problems getting insurance now.  Got the new informal appraisals from a couple of lenders - no change in home price on any of them despite the work.  Got 5 offers in the first week.  Ignoring the 2 lowballs, but 3 were still below asking with gatchas.  Putting out some counters to see if anything sticks. At least I saw this coming.  New market I found a below market rental that is decent enough.  I wanted to be around for a while before committing to a place to live longer term and let the price adjustments happen.  I'm seeing the same situation here, with inventory stagnating in the middle and prices declining. permalink award report block reply DITTOPatriot 1 points 6 days ago This is like the fox explaining to the farmer why there is no need to buy new hardware cloth to protect the chickens. This guy has never built or earned an honest dollar in his life.\nAsk yourself, has the financial system they set up from their perches made your life better or worse? There's a reason why nations throughout history have vacated those perches and expelled those in those perches from their country. permalink award report block reply 2016TrumpMAGA 1 points 6 days ago This is why the fucks at the fed are not lowering interest rates.  Affordability is not a function of sales price, it is a function of monthly payment. The median sales price for a home right now is $410,800. Under current mortgage rates, with 5% down, that's $2,565.03 a month, just for the mortgage.  Add another $500 a month for insurance and property tax. In 2021, for a $410,800 house, the monthly payment with 5% down would have been $1,572.61. That's a $1000 a month difference. In 2021 (assuming no other monthly debts) you would need a gross income of $52,420.33 to buy that house.  Today you need $85,501. That's your affordability problem. You can deport all the illegals in the country, and it's not going to make monthly house payments drop by 39%. permalink award report block reply HeatherSwanson 1 points 6 days ago No blackrock, no private equity, no ownership of SFH as investment vehicle. Make it law that you can only have one residence. Ban vacation homes and vrbo. Divest within 12 months and flood the market with inventory to crash the housing prices. permalink award report block reply Repentnow 0 points 6 days ago Yes, comrade, those are great suggestions. The Party will be pleased. permalink parent award report block reply me-no-likely3 1 points 6 days ago Deport 20 million illegal invaders and that will happen permalink award report block reply Drdonaldjtrump1776 1 points 6 days ago Tell me about it. Can't compete with full cash offers and 60k over asking in every fucking house in central pa. Just not fair man. I have young kids, we bought in the city before we had kids, now we're screwed for life cause we can't outbid all these bidding wars. permalink award report block reply Repentnow 2 points 6 days ago I'm not in the PA market, but that sounds like bs.  Those \"inflated\" cash offers happened in 2020 - 2021. permalink parent award report block reply Drdonaldjtrump1776 1 points 6 days ago Central pa, Ive been tryin to buy since April, Gettysburg, dover, Lancaster, Hanover, littlestown, Harrisburg, I can't get anything. It's disgusting, I had the opportunity to buy a house, neighboring my dad's, but was best out specifically with 60k cash over asking, and I took my young kids trick or treating with my dad in his neighborhood, and found the new owners have already dumped up that house with 4 old dirty cars in the driveway and a trailer parked in the side yard. It's a nice neighborhood for families with kids, has a good school right behind it, nice safe neighborhood, but got beat out buy a trash guy with more cash than I'll ever have to put down for a home permalink parent award report block reply 24601 1 points 6 days ago If WE want to cut Communists off at the knees.... WE need to take over the \"Republican\" Party and ensure America is governed by Red Blooded American Constitutionalists. permalink award report block reply auntjemima 1 points 6 days ago I can think of about 40million ways to reduce demand. permalink award report block reply Brandon1776 1 points 6 days ago This jew account is lying. Republicans dont give a shit about you permalink award report block reply Hangmhigh 1 points 6 days ago Stop allowing foreigners to buy real-estate here. permalink award report block reply Shitsbrokeyo 1 points 6 days ago It isn't any cheaper to build.  So fuck off. I'm going to build my house at $x and then you're going to devalue it? Fuck off. permalink award report block reply handshakejackson 1 points 6 days ago Republicans would need to actually get rid of the Federal Reserve.  Not going to happen. permalink award report block reply dankai420 1 points 6 days ago Regulation is choking off the contractor business, you're not paying as much for wood as for licenses and authorizations and they need to check the wood, now workers will be more expensive, migration leads to lower prices for workers but you get more houses available so it should level itself out. What the government needs to do is cut regulation, give some incentives to people who want to build, for themselves or for others, a family is having a baby, why not give them a tax break? permalink award report block reply Mhmm2MoreWeeks 1 points 6 days ago Make a Law. Anyone who supports Socialism must pay EXTRA 50% Taxes to fund it. permalink award report block reply DoMagnum 0 points 6 days ago The money changers. permalink award report block reply aaafirefly123 0 points 6 days ago Yep. Things in this country will only get worse as long as housing remains prohibitively expensive. It’s time to bite the bullet and pass a law that mandates the building of millions of new homes and that they can only be sold to US citizens. If we don’t do something to address it immediately, then expect socialists to gain more power. permalink award report block reply NoFats 0 points 6 days ago Except for a brief period between 2009 and 2014, homes have always been expensive. permalink award report block reply Odyssey 0 points 6 days ago This is what Trump was supposed to do in his 1st year. But he went all in to further the interest of Israel and settling peace in other countries when our youth is struggling due to Democrats' policies and mail-in ballot fraud. I don't care about peace in other countries when we don't have peace at home. I hope JD Vance learns from this. permalink award report block reply SanityGumby 1 points 6 days ago You are an idiot clearly not living in reality permalink parent award report block reply BillyBobJimmyJoe 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\njustinkayz 22 points 7 days ago Increased deportations = lower housing costs permalink award report block reply NotYourMan 9 points 6 days ago This is part of it.  The government has been helping illegal aliens buy houses for several decades now.  Housing and rent prices reflect inflation but they also reflect the lack of building over the past 30 years.  Its a supply problem.  City laws prevent single family homes like in California were the state government passed Housing Accountability Act.  Lets not forget that in California 20% of the homes are sold to H1B-visa millionaires.  These are foreign high-tech employees that got rich on the stock market.  Clinton and Obama extended the H1B-visa laws which works against Americans. permalink parent award report block reply midgetpornrocks 3 points 6 days ago Lower interest rates permalink parent award report block reply\nNotYourMan 9 points 6 days ago This is part of it.  The government has been helping illegal aliens buy houses for several decades now.  Housing and rent prices reflect inflation but they also reflect the lack of building over the past 30 years.  Its a supply problem.  City laws prevent single family homes like in California were the state government passed Housing Accountability Act.  Lets not forget that in California 20% of the homes are sold to H1B-visa millionaires.  These are foreign high-tech employees that got rich on the stock market.  Clinton and Obama extended the H1B-visa laws which works against Americans. permalink parent award report block reply\nmidgetpornrocks 3 points 6 days ago Lower interest rates permalink parent award report block reply\nOTher55 8 points 7 days ago Don't worry there'll soon be plenty of cheap homes in New York after everyone gtfo permalink award report block reply NamendaBiden 6 points 6 days ago Lol.  NYC can look to Detroit and see their future. permalink parent award report block reply DeportThemAllForever 3 points 6 days ago But then they move into red states and turn them blue with their dumb NY behavior. permalink parent award report block reply OTher55 1 points 6 days ago Many red states got blue refugees from 2020-2024, yet all the red states got redder in 2024. permalink parent award report block reply N0rds 1 points 6 days ago Yes, but had they not moved those states probably would have been redder than a tranny's face when told he's actually a man...\nThe blues still drop the overall redness permalink parent award report block reply OTher55 1 points 6 days ago Any data or evidence or (even tho I don't place much trust in them) studies to share showing that? permalink parent award report block reply view 3 more comments...\nNamendaBiden 6 points 6 days ago Lol.  NYC can look to Detroit and see their future. permalink parent award report block reply\nDeportThemAllForever 3 points 6 days ago But then they move into red states and turn them blue with their dumb NY behavior. permalink parent award report block reply OTher55 1 points 6 days ago Many red states got blue refugees from 2020-2024, yet all the red states got redder in 2024. permalink parent award report block reply N0rds 1 points 6 days ago Yes, but had they not moved those states probably would have been redder than a tranny's face when told he's actually a man...\nThe blues still drop the overall redness permalink parent award report block reply OTher55 1 points 6 days ago Any data or evidence or (even tho I don't place much trust in them) studies to share showing that? permalink parent award report block reply view 3 more comments...\nOTher55 1 points 6 days ago Many red states got blue refugees from 2020-2024, yet all the red states got redder in 2024. permalink parent award report block reply N0rds 1 points 6 days ago Yes, but had they not moved those states probably would have been redder than a tranny's face when told he's actually a man...\nThe blues still drop the overall redness permalink parent award report block reply OTher55 1 points 6 days ago Any data or evidence or (even tho I don't place much trust in them) studies to share showing that? permalink parent award report block reply view 3 more comments...\nN0rds 1 points 6 days ago Yes, but had they not moved those states probably would have been redder than a tranny's face when told he's actually a man...\nThe blues still drop the overall redness permalink parent award report block reply OTher55 1 points 6 days ago Any data or evidence or (even tho I don't place much trust in them) studies to share showing that? permalink parent award report block reply view 3 more comments...\nOTher55 1 points 6 days ago Any data or evidence or (even tho I don't place much trust in them) studies to share showing that? permalink parent award report block reply view 3 more comments...\nSanityGumby 4 points 6 days ago Trump is already doing what he can. He opened up federal lands for new homes, cutting epa regulations, and he is removing illegals. What the hell do people think he can do? permalink award report block reply N0rds 2 points 6 days ago Remove 100 times more illegals than we have so far. Gotta rid America of 40,000,000 illegals. permalink parent award report block reply\nN0rds 2 points 6 days ago Remove 100 times more illegals than we have so far. Gotta rid America of 40,000,000 illegals. permalink parent award report block reply\nel-y0y0s 4 points 6 days ago Jobs need to be secure again permalink award report block reply\nSmegmaless2 3 points 6 days ago My home’s value going down is not something I am excited about. I put 25% down and split my payments into biweekly instead of monthly. I dump everything I can against my mortgage. I have a lot of equity in my home. The prospect of my home value going down doesn’t sit well with me. I was underwater on a house in the past, during the 2009 bubble….it wasn’t pleasant. I’m conflicted when i read things like this. I want the parasitic illegals out, but I also count on having high real estate value, in case I am able to retire someday…0 permalink award report block reply HuggableBear 5 points 6 days ago Stop worrying about your home's value. It's your home, not an investment vehicle. The value in your home is the decades of shelter it provides your family. Everyone worrying about the sale value is where the problem starts. It becomes loss of potential revenue in your mind if the market shifts. I haven't worried about my house's value, ever. I bought it not to realize a profit but to provide a home, and I get 100% of that value everyday. Turning single family real estate into a revenue stream is what brought us to this point today where no one can afford a house because you don't want to lose a dime. permalink parent award report block reply N0rds 3 points 6 days ago The housing bubble is GOING to pop. 100,000 homes being sold for 750,000 is NOT normal. People who overpaid for their small houses will get screwed when the bubble finally pops. Gunna suck for many people, but we are long overdue for the bubble to pop permalink parent award report block reply BillyBobJimmyJoe 0 points 6 days ago your inflated home isn't actually worth what you think its worth permalink parent award report block reply\nHuggableBear 5 points 6 days ago Stop worrying about your home's value. It's your home, not an investment vehicle. The value in your home is the decades of shelter it provides your family. Everyone worrying about the sale value is where the problem starts. It becomes loss of potential revenue in your mind if the market shifts. I haven't worried about my house's value, ever. I bought it not to realize a profit but to provide a home, and I get 100% of that value everyday. Turning single family real estate into a revenue stream is what brought us to this point today where no one can afford a house because you don't want to lose a dime. permalink parent award report block reply\nN0rds 3 points 6 days ago The housing bubble is GOING to pop. 100,000 homes being sold for 750,000 is NOT normal. People who overpaid for their small houses will get screwed when the bubble finally pops. Gunna suck for many people, but we are long overdue for the bubble to pop permalink parent award report block reply\nBillyBobJimmyJoe 0 points 6 days ago your inflated home isn't actually worth what you think its worth permalink parent award report block reply\nJefferson 3 points 6 days ago Well, that's not going to happen in Florida.  Thanks, NYC. permalink award report block reply Angryhotdog 1 points 6 days ago Georgia two but here in southern GA mostly apartment and townhouse are being built, permalink parent award report block reply\nAngryhotdog 1 points 6 days ago Georgia two but here in southern GA mostly apartment and townhouse are being built, permalink parent award report block reply\nschiff_for_brains 2 points 6 days ago They're dropping fast, as financing has caught home prices. I say this with the caveat that real estate is local...it's probably not true everywhere.  I believe it's generally true, though. I just moved at the end of summer.  In the old and new market, the homes that sell are well below market average (starters and rental stock needing work), or the high end (1MM+, estates, water access, land, etc).  The middle is getting squeezed very hard. I just dropped ~10% of my old home's comp value in maintenance and updates.  3 months ago, I was estimating breaking even on them.  And to be fair, work needed to be done.  Like the roof was still OK, but 25 years old.  Way easier to pay for that in the next mortgage vs. right after the banks pick you clean, and no problems getting insurance now.  Got the new informal appraisals from a couple of lenders - no change in home price on any of them despite the work.  Got 5 offers in the first week.  Ignoring the 2 lowballs, but 3 were still below asking with gatchas.  Putting out some counters to see if anything sticks. At least I saw this coming.  New market I found a below market rental that is decent enough.  I wanted to be around for a while before committing to a place to live longer term and let the price adjustments happen.  I'm seeing the same situation here, with inventory stagnating in the middle and prices declining. permalink award report block reply\nDITTOPatriot 1 points 6 days ago This is like the fox explaining to the farmer why there is no need to buy new hardware cloth to protect the chickens. This guy has never built or earned an honest dollar in his life.\nAsk yourself, has the financial system they set up from their perches made your life better or worse? There's a reason why nations throughout history have vacated those perches and expelled those in those perches from their country. permalink award report block reply\n2016TrumpMAGA 1 points 6 days ago This is why the fucks at the fed are not lowering interest rates.  Affordability is not a function of sales price, it is a function of monthly payment. The median sales price for a home right now is $410,800. Under current mortgage rates, with 5% down, that's $2,565.03 a month, just for the mortgage.  Add another $500 a month for insurance and property tax. In 2021, for a $410,800 house, the monthly payment with 5% down would have been $1,572.61. That's a $1000 a month difference. In 2021 (assuming no other monthly debts) you would need a gross income of $52,420.33 to buy that house.  Today you need $85,501. That's your affordability problem. You can deport all the illegals in the country, and it's not going to make monthly house payments drop by 39%. permalink award report block reply\nHeatherSwanson 1 points 6 days ago No blackrock, no private equity, no ownership of SFH as investment vehicle. Make it law that you can only have one residence. Ban vacation homes and vrbo. Divest within 12 months and flood the market with inventory to crash the housing prices. permalink award report block reply Repentnow 0 points 6 days ago Yes, comrade, those are great suggestions. The Party will be pleased. permalink parent award report block reply\nRepentnow 0 points 6 days ago Yes, comrade, those are great suggestions. The Party will be pleased. permalink parent award report block reply\nme-no-likely3 1 points 6 days ago Deport 20 million illegal invaders and that will happen permalink award report block reply\nDrdonaldjtrump1776 1 points 6 days ago Tell me about it. Can't compete with full cash offers and 60k over asking in every fucking house in central pa. Just not fair man. I have young kids, we bought in the city before we had kids, now we're screwed for life cause we can't outbid all these bidding wars. permalink award report block reply Repentnow 2 points 6 days ago I'm not in the PA market, but that sounds like bs.  Those \"inflated\" cash offers happened in 2020 - 2021. permalink parent award report block reply Drdonaldjtrump1776 1 points 6 days ago Central pa, Ive been tryin to buy since April, Gettysburg, dover, Lancaster, Hanover, littlestown, Harrisburg, I can't get anything. It's disgusting, I had the opportunity to buy a house, neighboring my dad's, but was best out specifically with 60k cash over asking, and I took my young kids trick or treating with my dad in his neighborhood, and found the new owners have already dumped up that house with 4 old dirty cars in the driveway and a trailer parked in the side yard. It's a nice neighborhood for families with kids, has a good school right behind it, nice safe neighborhood, but got beat out buy a trash guy with more cash than I'll ever have to put down for a home permalink parent award report block reply\nRepentnow 2 points 6 days ago I'm not in the PA market, but that sounds like bs.  Those \"inflated\" cash offers happened in 2020 - 2021. permalink parent award report block reply Drdonaldjtrump1776 1 points 6 days ago Central pa, Ive been tryin to buy since April, Gettysburg, dover, Lancaster, Hanover, littlestown, Harrisburg, I can't get anything. It's disgusting, I had the opportunity to buy a house, neighboring my dad's, but was best out specifically with 60k cash over asking, and I took my young kids trick or treating with my dad in his neighborhood, and found the new owners have already dumped up that house with 4 old dirty cars in the driveway and a trailer parked in the side yard. It's a nice neighborhood for families with kids, has a good school right behind it, nice safe neighborhood, but got beat out buy a trash guy with more cash than I'll ever have to put down for a home permalink parent award report block reply\nDrdonaldjtrump1776 1 points 6 days ago Central pa, Ive been tryin to buy since April, Gettysburg, dover, Lancaster, Hanover, littlestown, Harrisburg, I can't get anything. It's disgusting, I had the opportunity to buy a house, neighboring my dad's, but was best out specifically with 60k cash over asking, and I took my young kids trick or treating with my dad in his neighborhood, and found the new owners have already dumped up that house with 4 old dirty cars in the driveway and a trailer parked in the side yard. It's a nice neighborhood for families with kids, has a good school right behind it, nice safe neighborhood, but got beat out buy a trash guy with more cash than I'll ever have to put down for a home permalink parent award report block reply\n24601 1 points 6 days ago If WE want to cut Communists off at the knees.... WE need to take over the \"Republican\" Party and ensure America is governed by Red Blooded American Constitutionalists. permalink award report block reply\nauntjemima 1 points 6 days ago I can think of about 40million ways to reduce demand. permalink award report block reply\nBrandon1776 1 points 6 days ago This jew account is lying. Republicans dont give a shit about you permalink award report block reply\nHangmhigh 1 points 6 days ago Stop allowing foreigners to buy real-estate here. permalink award report block reply\nShitsbrokeyo 1 points 6 days ago It isn't any cheaper to build.  So fuck off. I'm going to build my house at $x and then you're going to devalue it? Fuck off. permalink award report block reply\nhandshakejackson 1 points 6 days ago Republicans would need to actually get rid of the Federal Reserve.  Not going to happen. permalink award report block reply\ndankai420 1 points 6 days ago Regulation is choking off the contractor business, you're not paying as much for wood as for licenses and authorizations and they need to check the wood, now workers will be more expensive, migration leads to lower prices for workers but you get more houses available so it should level itself out. What the government needs to do is cut regulation, give some incentives to people who want to build, for themselves or for others, a family is having a baby, why not give them a tax break? permalink award report block reply\nMhmm2MoreWeeks 1 points 6 days ago Make a Law. Anyone who supports Socialism must pay EXTRA 50% Taxes to fund it. permalink award report block reply\nDoMagnum 0 points 6 days ago The money changers. permalink award report block reply\naaafirefly123 0 points 6 days ago Yep. Things in this country will only get worse as long as housing remains prohibitively expensive. It’s time to bite the bullet and pass a law that mandates the building of millions of new homes and that they can only be sold to US citizens. If we don’t do something to address it immediately, then expect socialists to gain more power. permalink award report block reply\nNoFats 0 points 6 days ago Except for a brief period between 2009 and 2014, homes have always been expensive. permalink award report block reply\nOdyssey 0 points 6 days ago This is what Trump was supposed to do in his 1st year. But he went all in to further the interest of Israel and settling peace in other countries when our youth is struggling due to Democrats' policies and mail-in ballot fraud. I don't care about peace in other countries when we don't have peace at home. I hope JD Vance learns from this. permalink award report block reply SanityGumby 1 points 6 days ago You are an idiot clearly not living in reality permalink parent award report block reply\nSanityGumby 1 points 6 days ago You are an idiot clearly not living in reality permalink parent award report block reply\nBillyBobJimmyJoe 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T23:00:31.246804Z"
}