{
  "id": "1ARK55acMy",
  "url": "https://patriots.win/p/1ARK55acMy/cnbc-tds-nasdaq-came-back-from-d/c",
  "content": "1328 CNBC TDS! Nasdaq came back from down 400 today! We laugh at these faggots! Dow came back from 300 down! Trump Wins the day again! ★ ☭   Far-Left Media   ☭ ★ posted 5 days ago by Mddet 137 comments award share download report block\n137 comments Sort by Top Top New Worst Old Save MickHigan2 82 points 5 days ago These markets are so cooked that I don't trust any of it. permalink award report block reply OutlawPurpleHairDye 52 points 5 days ago Be sure to get all your stock tips from Nancy Pelosi, or just do the opposite of Jim Cramer and you'll retire with FU money. permalink parent award report block reply realPhantomFuck 32 points 5 days ago I bought AVGO long before it was rated a Buy because Nasty Nancy loaded up... Up 118% on my position permalink parent award report block reply RusherOfDin 14 points 5 days ago The next time Cramer mentions Bitcoin I'm going to fly out there and punch him in the dick. permalink parent award report block reply Im_RickSteves_bitch 12 points 5 days ago I love it when PDW gets to be more like r/wallstreetbets! permalink parent award report block reply 7PC_Principle -10 points 5 days ago 🤣 what bullshit. Nasdaq is down dummy.\nAlong with all other stocks including 401k permalink parent award report block reply view 5 more comments... grenades_and_ham 4 points 5 days ago Cramer wipes back to front. permalink parent award report block reply throttlejohnson 3 points 5 days ago followed by a firm throat punch....maybe then he'll stfu permalink parent award report block reply PatriotSkorzeny 2 points 5 days ago A guy copied every trade she made and went to prison. permalink parent award report block reply BoughtByBloomberg2 1 points 5 days ago I'm actually mad she's retiring. There go my reliable 20% gains. permalink parent award report block reply Hoshi 20 points 5 days ago AI bubble. How can so many people competing in the AI space even make money off of this in the end with AI not really self learning but hallucinating made up shit? permalink parent award report block reply Im_RickSteves_bitch 11 points 5 days ago I mean, lots of scams make great money. It's not about providing something valuable for the money people give you. permalink parent award report block reply DeportThemAllForever 5 points 5 days ago DJT stock is in the shitter literally. permalink parent award report block reply flashersenpai 1 points 5 days ago Their valuable products make a few billion a year, and yet they're spending many times that. permalink parent award report block reply wlatic 8 points 5 days ago Its not really about what AI can do now its about what it has been able to learn in A small period of time and how it can massive shorter development of materials and eventually controlling stuff. It should be the same kind of leap between digging a hole by hand and using a machine, but its still way off. permalink parent award report block reply HyperCarbs 5 points 5 days ago We're in a new computing revolution. Much like the 80s and 90s. Going to move much, much faster. permalink parent award report block reply zooty 1 points 5 days ago Huzzah! Aeron chairs for all! permalink parent award report block reply Hoshi 3 points 5 days ago I am waiting for my optimus bot to come close to learn to clean my house and then I will start to believe. permalink parent award report block reply wlatic 4 points 5 days ago Personally I wouldn't want an industrial robot in my home. House based robots would need to be breakable with normal human force, but not break themselves by working, due to \"AI\". permalink parent award report block reply view 3 more comments... grenades_and_ham 2 points 5 days ago A “Do Bot.” permalink parent award report block reply view 1 more comments... iamherefortheluls 1 points 5 days ago you are hoping for a good house bot from the current corporate environment? It will sneak cockroaches into your food, sell your diarrhea fart compilations for upvotes online and than punch you in the nuts at 3 AM for failing to watch 3 hours of ads per day. today at 4 AM we rolled out a new mandatory update. All optimus bots will now draw a Microsoft logo on your bathroom mirror using your toothpaste, so you can start your day with a greeting from us. If you wish you may delay this update by.... 20 minutes. To activate the delay feature, lick your Optimus bot's feet ten times each. given the state of modern OSes, PCs, laptops and phones I wouldn't trust any robot in my house. permalink parent award report block reply LongerThanTheNile 3 points 5 days ago Possibly overvalued, but not a bubble imo. People think back to the Dotcom bubble, but it's not really comparable. There, you had a lot of no-name companies get huge valuations based on thin air and promises. Today, you have a handful of big, well-established companies with monster earnings who also have monster valuations. That's not a bubble. It might be due for a correction, but not anything like the Dotcom bust. Just think: If AI went away tomorrow, would Google and Nvidia, etc. be worthless? Fuck no. Also, AI will imo increase productivity. It already is. It can streamline a lot of monotonous tasks and free up the employee to do more innovative work. The concern is that moronic, greedy companies will think they can fully replace workers with AI, instead of letting their existing employees use it as a force multiplier. With that in mind, given the wave of recent layoffs, it does make sense to be short-term bearish. That doesn't mean they won't keep rising, though. \"The market can remain irrational longer than you can remain solvent.\" permalink parent award report block reply flashersenpai 2 points 5 days ago If AI went away tomorrow, would Google and Nvidia, etc. be worthless? Fuck no. Monopolies tend to have staying power, but that's assuming their debts and circular \"investments\" aren't big enough liabilities. permalink parent award report block reply Jaqen 1 points 5 days ago If AI went away tomorrow, nvidia would have enormous problems. permalink parent award report block reply NonyaDB 1 points 5 days ago The problem with AI is that everyone is in a rush to implement something - ANYTHING! - AI just to tell the markets that \"we haz AI nows!\" and not once do they ever think \"gee, is AI even a fit for this?\" (pro-tip:  nope, most AI implementations are not only half-baked but just make things harder.) I work in IT, installing and fixing servers and storage systems in datacenters for banks, insurance, financial companies, etc. and they're not installing a lot of AI hardware. An AI testbed demo here and there, but that's it. I know because I install and configure the damn things across about 50 datacenters in one metro alone. What are they installing if it's not AI?  STORAGE!  MASSIVE AMOUNTS OF STORAGE! And all of it is being managed by off-shored IT \"management\" companies based in India and those guys are fucking morons. And it's been that way for the at least the past 5 years and counting. What they're doing is contracting out anything-AI to the west coast and keeping the data stored in the midwest, south, and NE. If the west coast ever suffers a big power outage that lasts for a while, all that AI shit's going to start falling apart pretty quick. Why?  Because real AI datacenters have to be liquid-cooled and the vast majority of DCs in the USA are still not setup for liquid-cooling - it's all air-cooled.  Some try using dedicated hot-aisle/cold-aisle tricks but they almost always fail, especially when a DC fucks up and puts too many high-pressure, high-BTU server racks on the same aisle and it over-pressures the hot-aisle and starts blowing hot air back through the server racks into the cold-aisle. Many such cases. permalink parent award report block reply SHILL_DETECTOR 2 points 5 days ago there you go again! permalink parent award report block reply HyperCarbs 1 points 5 days ago It already popped. All the bigtech companies did AI layoffs this year. However, cutting-edge computing is still moving forward. Those comapies are still outperforming the market. In fact, they are the market right now. Personally, I'd wait for the next correction to get in if you've been sitting on the sidelines waiting for something to pop. permalink parent award report block reply Hoshi 2 points 5 days ago I bought a lot during the last two tariff scares this year mostly and  still waiting for a major correction for most of my money. permalink parent award report block reply flashersenpai 1 points 5 days ago In fact, they are the market right now. You should be concerned that a handful of companies \"are the market\" OpenAI has been asking for government bailouts since at least last week. And althought the admin says No, I'm not confident that will stand up to the pressure of all their corpo friends (Hello Bessent!) permalink parent award report block reply load 2 more comments... caseyne 5 points 5 days ago The whole purpose of these markets was to take money from poor people and make it seem you was part of a company. Why would rich people waste their money when they can waste others.You should never take them serious. permalink parent award report block reply Yawnz13 2 points 5 days ago Nah, it's just that retards act like drops that last less than a day are some kind of catastrophe. permalink parent award report block reply gustodog 2 points 5 days ago While there's legitimate reason to believe the markets are overheated (historic P/E ratios and such), there's likely also FUD drum beating to try to use market conditions as a tool to hurt Trump and get him to back off on tariffs (the Supreme Court is to rule soon about the legality of the tariffs). And during this time there's fearmongering speculation about the economic ramifications of the government shutdown and the globalist IMF is raising the alarm about global public debt and emphasizing the US's debt. Buy the dip perhaps, but also be conscious of how stock ownership works and potential risks if some sort of high level shenanigans were to kick in. \"Cede technically owns most of the publicly issued stock in the United States.\" https://en.wikipedia.org/wiki/Cede_and_Company permalink parent award report block reply load 4 more comments... AVeryNakedMan 50 points 5 days ago Daily stock fluctuations are dumb things to care about and only affect traders and retards. permalink award report block reply Emodius 10 points 5 days ago Long term they are going up permalink parent award report block reply DeportThemAllForever 12 points 5 days ago Inflation guarantees things lower value of money gold value will go up higher stock market real estate in big cities (not country) higher food and gas prices income gap is a chasm permalink parent award report block reply flashersenpai 2 points 5 days ago omg line go up permalink parent award report block reply mikejones 5 points 5 days ago Right, we should all be nearly 60 and rich. permalink parent award report block reply 73Cuda 1 points 4 days ago I hit millionaire status at 37.  DCA and ignore the noise, dont be a victimtard, any red day is a buy opportunity. permalink parent award report block reply jatergator 4 points 5 days ago And yet, this stupid post is sticked. permalink parent award report block reply canada_is_communist 2 points 5 days ago Well nasdaq was down 6-7% (no meme intended?). That's absolutely a massive move. permalink parent award report block reply Mddet OP 2 points 5 days ago Roger. But I like it permalink parent award report block reply load 3 more comments... nonrate 22 points 5 days ago A drop and recovery of a couple percentage points is not impressive, sorry. Not worth a sticky imo permalink award report block reply YouEssAye 5 points 5 days ago Plus the money printers are still running, who could've guessed the stock market goes up when the money supply is increased. It's all a scam. Trump wins the day What a dumb metric to measure presidential success by. permalink parent award report block reply flashersenpai 3 points 5 days ago What a dumb metric to measure presidential success by. mods are shilling but aren't very good at it permalink parent award report block reply canada_is_communist 1 points 5 days ago Its absolutely impressive. NVDA lost 600B of value. Six. Hundred. Billions. In a few days. Canada's entire quaterly GDP (even penny that changes hand for 40+M in an entire giant country) is not even 600B... and nvda moved this much in a few days. permalink parent award report block reply nonrate 5 points 5 days ago Dropping and recovering a few percentage points in a day happens all the time. This is not notable to me, unless I am missing something else. permalink parent award report block reply canada_is_communist 2 points 5 days ago It happens all the time due to manipulation lol permalink parent award report block reply nonrate 3 points 5 days ago true true! permalink parent award report block reply view 1 more comments... Mddet OP 1 points 5 days ago Last thing im here for are stickyness. Have a good one retard. Lol jk permalink parent award report block reply dirtysanchez69 10 points 5 days ago Buy the dip, autists permalink award report block reply canada_is_communist 4 points 5 days ago It was clear the dip was overdone. NVDA crashing 15% on... nothing? We know china is gonna get its chips no matter what, they are investing extreme amounts into AI (they dont mind building entire ghosts cities to prop up their GDP, so at this point AI isn't a problem lol) and only NVDA makes good AI chips, so... Also holidays coming, january, etc. I thought the dip would last into mid-november but this might be it, really. I think we bottomed out this morning? permalink parent award report block reply grenades_and_ham 5 points 5 days ago NVDA CEO is a Chicom simp. permalink parent award report block reply canada_is_communist 1 points 5 days ago A chicom simp that made me rich... soon I'll be able to stop teaching thanks to him permalink parent award report block reply HyperCarbs 4 points 5 days ago A 15% drop is nothing considering NVDA doubled this year alone. permalink parent award report block reply 73Cuda 1 points 4 days ago Agree, it wasnt much of a dip, I think market is off maybe 3% from all time high. permalink parent award report block reply DT170x 10 points 5 days ago Lol at the Inverse Jim Cramer When you see news markets just do the opposite. Lol. permalink award report block reply Mddet OP 4 points 5 days ago Lol permalink parent award report block reply conservativefrank 7 points 5 days ago Meanwhile, prices are up in stores, taxes up, insurance rates up, airports jammed and flights delayed. America is in a misery that will spell a blue wave at the midterms. permalink award report block reply Emodius 2 points 5 days ago Uh prices are down here what 3rd world shit hole do you live in? permalink parent award report block reply conservativefrank 1 points 5 days ago Houston TX permalink parent award report block reply DT170x 1 points 5 days ago Probably California or any Leftist state. permalink parent award report block reply MAGA_NRG 6 points 5 days ago Up today, down tomorrow. It's a long term thing not day to day. permalink award report block reply Emodius 2 points 5 days ago And it's going up over time so that's good. permalink parent award report block reply Tardigrade 3 points 5 days ago Well yeah because the unit of measurement decreases. permalink parent award report block reply booblitchutz 2 points 5 days ago Better than holding cash long term then? permalink parent award report block reply Tardigrade 1 points 5 days ago For sure permalink parent award report block reply MAGA_NRG 2 points 5 days ago Yep. Always has, always wil, barring total collapse. permalink parent award report block reply Mddet OP 1 points 5 days ago Understand permalink parent award report block reply bidensmissingbrain 1 points 5 days ago If it's down tomorrow, we've got big problems. permalink parent award report block reply booblitchutz 1 points 5 days ago Tomorrow is Saturday, Chachi permalink parent award report block reply bidensmissingbrain 1 points 5 days ago Nothing gets by you does it? permalink parent award report block reply Lawless 5 points 5 days ago You know they couldn't  WAIT to write up that article about the Nas falling 🤣 permalink award report block reply Mddet OP 1 points 5 days ago Yup. Scumbags! permalink parent award report block reply DeplorachuIChooseYou 5 points 5 days ago My stocks were down but, what I was not happy about was not knowing 100% what to buy at a discount O^O permalink award report block reply HuntersCrackDealer69 4 points 5 days ago Who cares? Not like it makes anything more affordable to anyone who actually has to work for a living. permalink award report block reply Brownwaterboys 4 points 5 days ago Meanwhile silver and gold up over 50% this year. permalink award report block reply Say_what_again 1 points 5 days ago I got into gold at 1300 (yes, a bit late to the party). I've bought regularly since. And I bought another 13 ounces today permalink parent award report block reply Brownwaterboys 2 points 5 days ago Good on ya! Keep stacking fellow pede :D Become your own central banker, stack gold and silver :D permalink parent award report block reply ahamrbond 3 points 5 days ago If the stock market goes up, I give Trump no credit. When the stock market crashes, I will give Trump no blame. Sorry, but the stock market is a ponzi scheme for foolish mainstream investors, and smart traders. Have fun making a ton of money over years and then losing it all in a week, having absolutely nothing to show for it. permalink award report block reply _Sully_ 3 points 5 days ago Right, no one ever made any money ever that’s why they keep doing it. Get a grip, man. I’ve made thousands in the stock market and got to use the money. Me a stem schmuck barely making 6 figs. Why is this place so full of doomers and mopers? I’m literally unemployed now and the outlook hasn’t looked better. We were staring down the barrel of a gun a year ago. permalink parent award report block reply flashersenpai 0 points 5 days ago no one ever made any money ever that’s why they keep doing it semantically yes, no one is making money off it because it's only a minority of people who have the resources to play with stocks Go around town and ask people who owns stocks or know what the hell is going on. Stock market doesn't reflect what normal people are going through every day. permalink parent award report block reply _Sully_ 3 points 5 days ago I don’t need to ask around town cuz it’s me. I’m not some rich person, bro. You are trying to convince me that the stock market never helped normal people. Oh I’m sure there are people who aren’t using it but that’s their mistake. Your argument is ludicrous. Yes, the stock market isn’t the economy and yes people could be doing bad while it’s doing well. However they could be doing well because the stock market is too. Look I’m not saying it’s this wonderful thing but it is absolutely brain dead and quite frankly ignorant to say normal people can’t invest their money. Hell, I bought stocks when I was 20 years old. Threw in a thousand dollars and turned it into $2,500. This is a normal person activity. I’m sorry you aren’t doing well at the moment but your attitude is simply defeatist for no good reason. Invest your money when you can. It’s the smart thing to do. permalink parent award report block reply Mddet OP 2 points 4 days ago ❤️🇺🇸 permalink parent award report block reply Mddet OP 2 points 5 days ago Ok yer nuts. My 401k is doing so good. permalink parent award report block reply Heavens2MAGAtroid 1 points 5 days ago SP 500 averages over 10% for the last 100 years permalink parent award report block reply SanityGumby 3 points 5 days ago Some turbo faggots were doing the same thing with bitcoin here as well. “IZZZA UNDA $100kzzzz”. By end of day it was around $102k permalink award report block reply MemphisMontoya71 2 points 5 days ago The market doesn't move the average American to Republicans, your everyday food and gas prices do. permalink award report block reply DeportThemAllForever 2 points 5 days ago Rich people get richer, what else is new? permalink award report block reply Mddet OP 2 points 5 days ago Im not rich, my 401 went up permalink parent award report block reply DeportThemAllForever 1 points 5 days ago But 10 cents.  Theirs by millions. permalink parent award report block reply _Sully_ 1 points 5 days ago No. People do have money and make great gains. Totally normal people. Or do they suddenly become horrible rich people in your eyes. You sound like a leftist. Stop dooming and get out there. There’s a lot of money you can make. permalink parent award report block reply booblitchutz 2 points 5 days ago Don’t you know that on TD nobody has money and everyone can’t afford a house? permalink parent award report block reply view 1 more comments... Choppermagic 2 points 5 days ago could have made easy money today if you bought the dip. permalink award report block reply captflerbus 2 points 5 days ago when the market is this high 400 points isn't really that big a deal permalink award report block reply canada_is_communist 2 points 5 days ago ITS MAGA TIME BABY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! HOLY SHIT TRUMP SAVED MY ASS TODAY! THANK YOU MR PRESIDENT TRUMP!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! permalink award report block reply Mddet OP 2 points 5 days ago You got one upvote and its me. Love you. Fuck em all! permalink parent award report block reply Rerun1Central 2 points 5 days ago every week I hear, how MCD or AAPL or TSLA or NVDA are 'tanking' and 'losing sales'... yet none of it's true... all near record highs... all with amazingly positive outlooks.. but MSM is telling people the sky is falling like henny penny permalink award report block reply HyperCarbs 1 points 5 days ago It's sell marketing to drive the price down by the big inveators so they can buy more. permalink parent award report block reply Vorticity1 2 points 5 days ago Pelosi sold her stocks. permalink award report block reply throttlejohnson 2 points 5 days ago crypto has been shit for awhile now...i have a lot of money tied up in them...hoping for a good rebound. permalink award report block reply orange_kek_great 1 points 5 days ago Trump may have won today, but what did we get? When do WE win? permalink award report block reply Tombstone2W 1 points 5 days ago The only problem with claiming the boom is you'll own the bust. permalink award report block reply PatriotDescendant 1 points 5 days ago You cannot worry about the stock market. Seven tech stocks are all vastly overvalued. permalink award report block reply H0rse 1 points 5 days ago A bunch of people sold tech stock and then bought something else permalink award report block reply its_three_oclock 1 points 5 days ago lol man, reading through this thread it’s pretty clear it’s only boomers left here, maybe a smattering of gen X. Trump has completely lost my generation, felt like such a miracle last year only for it to end like this. Depressing permalink award report block reply AccipiterQ 1 points 5 days ago How is this a sticky?  Where is the \"TDS\"?  It's literally a comment about objective reality.  Some of you guys are complete faggots, sometimes. permalink award report block reply Mddet OP 1 points 5 days ago Its a sticky because we are tired of the likes of you. Now go fock off to newyork. permalink parent award report block reply AlaskaBrO93 1 points 5 days ago Too bad none of the shit even matters with this current rate of inflation. Everything is going to cost twice as fucking much in 3 years. And that's without not even accounting for the coming interest rate cuts. permalink award report block reply alina_habbas_fanclub 1 points 5 days ago Broadcom (AVGO) is my largest holding and I recommend it long term. Best business model out there. Half chips half cloud. permalink award report block reply DicksOutForHarambe 1 points 5 days ago It’s going down more permalink award report block reply Jaunty_Haul 1 points 5 days ago Don't tie Trump to this bubble, or he'll unfairly get slammed when it pops.  There's way too much circular dealing going on; even the normies are becoming aware. permalink award report block reply auntjemima 1 points 5 days ago the jobs and $trillions are coming, they hate it. permalink award report block reply Steve1 1 points 5 days ago Well it was released jpmorgan bought a ton of etherum and that sort of turned the market permalink award report block reply AccipiterQ 0 points 5 days ago Why is this horse-shit still stickied? permalink award report block reply learntocode -1 points 5 days ago I laugh at Stonk Faggots. Your financial asset bubble can kiss my ass. permalink award report block reply flashersenpai -1 points 5 days ago Who gives a fuck? Who owns stocks? Who benefits? It's not the people who care about $4 eggs. permalink award report block reply the_new_one 2 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nMickHigan2 82 points 5 days ago These markets are so cooked that I don't trust any of it. permalink award report block reply OutlawPurpleHairDye 52 points 5 days ago Be sure to get all your stock tips from Nancy Pelosi, or just do the opposite of Jim Cramer and you'll retire with FU money. permalink parent award report block reply realPhantomFuck 32 points 5 days ago I bought AVGO long before it was rated a Buy because Nasty Nancy loaded up... Up 118% on my position permalink parent award report block reply RusherOfDin 14 points 5 days ago The next time Cramer mentions Bitcoin I'm going to fly out there and punch him in the dick. permalink parent award report block reply Im_RickSteves_bitch 12 points 5 days ago I love it when PDW gets to be more like r/wallstreetbets! permalink parent award report block reply 7PC_Principle -10 points 5 days ago 🤣 what bullshit. Nasdaq is down dummy.\nAlong with all other stocks including 401k permalink parent award report block reply view 5 more comments... grenades_and_ham 4 points 5 days ago Cramer wipes back to front. permalink parent award report block reply throttlejohnson 3 points 5 days ago followed by a firm throat punch....maybe then he'll stfu permalink parent award report block reply PatriotSkorzeny 2 points 5 days ago A guy copied every trade she made and went to prison. permalink parent award report block reply BoughtByBloomberg2 1 points 5 days ago I'm actually mad she's retiring. There go my reliable 20% gains. permalink parent award report block reply Hoshi 20 points 5 days ago AI bubble. How can so many people competing in the AI space even make money off of this in the end with AI not really self learning but hallucinating made up shit? permalink parent award report block reply Im_RickSteves_bitch 11 points 5 days ago I mean, lots of scams make great money. It's not about providing something valuable for the money people give you. permalink parent award report block reply DeportThemAllForever 5 points 5 days ago DJT stock is in the shitter literally. permalink parent award report block reply flashersenpai 1 points 5 days ago Their valuable products make a few billion a year, and yet they're spending many times that. permalink parent award report block reply wlatic 8 points 5 days ago Its not really about what AI can do now its about what it has been able to learn in A small period of time and how it can massive shorter development of materials and eventually controlling stuff. It should be the same kind of leap between digging a hole by hand and using a machine, but its still way off. permalink parent award report block reply HyperCarbs 5 points 5 days ago We're in a new computing revolution. Much like the 80s and 90s. Going to move much, much faster. permalink parent award report block reply zooty 1 points 5 days ago Huzzah! Aeron chairs for all! permalink parent award report block reply Hoshi 3 points 5 days ago I am waiting for my optimus bot to come close to learn to clean my house and then I will start to believe. permalink parent award report block reply wlatic 4 points 5 days ago Personally I wouldn't want an industrial robot in my home. House based robots would need to be breakable with normal human force, but not break themselves by working, due to \"AI\". permalink parent award report block reply view 3 more comments... grenades_and_ham 2 points 5 days ago A “Do Bot.” permalink parent award report block reply view 1 more comments... iamherefortheluls 1 points 5 days ago you are hoping for a good house bot from the current corporate environment? It will sneak cockroaches into your food, sell your diarrhea fart compilations for upvotes online and than punch you in the nuts at 3 AM for failing to watch 3 hours of ads per day. today at 4 AM we rolled out a new mandatory update. All optimus bots will now draw a Microsoft logo on your bathroom mirror using your toothpaste, so you can start your day with a greeting from us. If you wish you may delay this update by.... 20 minutes. To activate the delay feature, lick your Optimus bot's feet ten times each. given the state of modern OSes, PCs, laptops and phones I wouldn't trust any robot in my house. permalink parent award report block reply LongerThanTheNile 3 points 5 days ago Possibly overvalued, but not a bubble imo. People think back to the Dotcom bubble, but it's not really comparable. There, you had a lot of no-name companies get huge valuations based on thin air and promises. Today, you have a handful of big, well-established companies with monster earnings who also have monster valuations. That's not a bubble. It might be due for a correction, but not anything like the Dotcom bust. Just think: If AI went away tomorrow, would Google and Nvidia, etc. be worthless? Fuck no. Also, AI will imo increase productivity. It already is. It can streamline a lot of monotonous tasks and free up the employee to do more innovative work. The concern is that moronic, greedy companies will think they can fully replace workers with AI, instead of letting their existing employees use it as a force multiplier. With that in mind, given the wave of recent layoffs, it does make sense to be short-term bearish. That doesn't mean they won't keep rising, though. \"The market can remain irrational longer than you can remain solvent.\" permalink parent award report block reply flashersenpai 2 points 5 days ago If AI went away tomorrow, would Google and Nvidia, etc. be worthless? Fuck no. Monopolies tend to have staying power, but that's assuming their debts and circular \"investments\" aren't big enough liabilities. permalink parent award report block reply Jaqen 1 points 5 days ago If AI went away tomorrow, nvidia would have enormous problems. permalink parent award report block reply NonyaDB 1 points 5 days ago The problem with AI is that everyone is in a rush to implement something - ANYTHING! - AI just to tell the markets that \"we haz AI nows!\" and not once do they ever think \"gee, is AI even a fit for this?\" (pro-tip:  nope, most AI implementations are not only half-baked but just make things harder.) I work in IT, installing and fixing servers and storage systems in datacenters for banks, insurance, financial companies, etc. and they're not installing a lot of AI hardware. An AI testbed demo here and there, but that's it. I know because I install and configure the damn things across about 50 datacenters in one metro alone. What are they installing if it's not AI?  STORAGE!  MASSIVE AMOUNTS OF STORAGE! And all of it is being managed by off-shored IT \"management\" companies based in India and those guys are fucking morons. And it's been that way for the at least the past 5 years and counting. What they're doing is contracting out anything-AI to the west coast and keeping the data stored in the midwest, south, and NE. If the west coast ever suffers a big power outage that lasts for a while, all that AI shit's going to start falling apart pretty quick. Why?  Because real AI datacenters have to be liquid-cooled and the vast majority of DCs in the USA are still not setup for liquid-cooling - it's all air-cooled.  Some try using dedicated hot-aisle/cold-aisle tricks but they almost always fail, especially when a DC fucks up and puts too many high-pressure, high-BTU server racks on the same aisle and it over-pressures the hot-aisle and starts blowing hot air back through the server racks into the cold-aisle. Many such cases. permalink parent award report block reply SHILL_DETECTOR 2 points 5 days ago there you go again! permalink parent award report block reply HyperCarbs 1 points 5 days ago It already popped. All the bigtech companies did AI layoffs this year. However, cutting-edge computing is still moving forward. Those comapies are still outperforming the market. In fact, they are the market right now. Personally, I'd wait for the next correction to get in if you've been sitting on the sidelines waiting for something to pop. permalink parent award report block reply Hoshi 2 points 5 days ago I bought a lot during the last two tariff scares this year mostly and  still waiting for a major correction for most of my money. permalink parent award report block reply flashersenpai 1 points 5 days ago In fact, they are the market right now. You should be concerned that a handful of companies \"are the market\" OpenAI has been asking for government bailouts since at least last week. And althought the admin says No, I'm not confident that will stand up to the pressure of all their corpo friends (Hello Bessent!) permalink parent award report block reply load 2 more comments... caseyne 5 points 5 days ago The whole purpose of these markets was to take money from poor people and make it seem you was part of a company. Why would rich people waste their money when they can waste others.You should never take them serious. permalink parent award report block reply Yawnz13 2 points 5 days ago Nah, it's just that retards act like drops that last less than a day are some kind of catastrophe. permalink parent award report block reply gustodog 2 points 5 days ago While there's legitimate reason to believe the markets are overheated (historic P/E ratios and such), there's likely also FUD drum beating to try to use market conditions as a tool to hurt Trump and get him to back off on tariffs (the Supreme Court is to rule soon about the legality of the tariffs). And during this time there's fearmongering speculation about the economic ramifications of the government shutdown and the globalist IMF is raising the alarm about global public debt and emphasizing the US's debt. Buy the dip perhaps, but also be conscious of how stock ownership works and potential risks if some sort of high level shenanigans were to kick in. \"Cede technically owns most of the publicly issued stock in the United States.\" https://en.wikipedia.org/wiki/Cede_and_Company permalink parent award report block reply load 4 more comments...\nOutlawPurpleHairDye 52 points 5 days ago Be sure to get all your stock tips from Nancy Pelosi, or just do the opposite of Jim Cramer and you'll retire with FU money. permalink parent award report block reply realPhantomFuck 32 points 5 days ago I bought AVGO long before it was rated a Buy because Nasty Nancy loaded up... Up 118% on my position permalink parent award report block reply RusherOfDin 14 points 5 days ago The next time Cramer mentions Bitcoin I'm going to fly out there and punch him in the dick. permalink parent award report block reply Im_RickSteves_bitch 12 points 5 days ago I love it when PDW gets to be more like r/wallstreetbets! permalink parent award report block reply 7PC_Principle -10 points 5 days ago 🤣 what bullshit. Nasdaq is down dummy.\nAlong with all other stocks including 401k permalink parent award report block reply view 5 more comments... grenades_and_ham 4 points 5 days ago Cramer wipes back to front. permalink parent award report block reply throttlejohnson 3 points 5 days ago followed by a firm throat punch....maybe then he'll stfu permalink parent award report block reply PatriotSkorzeny 2 points 5 days ago A guy copied every trade she made and went to prison. permalink parent award report block reply BoughtByBloomberg2 1 points 5 days ago I'm actually mad she's retiring. There go my reliable 20% gains. permalink parent award report block reply\nrealPhantomFuck 32 points 5 days ago I bought AVGO long before it was rated a Buy because Nasty Nancy loaded up... Up 118% on my position permalink parent award report block reply\nRusherOfDin 14 points 5 days ago The next time Cramer mentions Bitcoin I'm going to fly out there and punch him in the dick. permalink parent award report block reply Im_RickSteves_bitch 12 points 5 days ago I love it when PDW gets to be more like r/wallstreetbets! permalink parent award report block reply 7PC_Principle -10 points 5 days ago 🤣 what bullshit. Nasdaq is down dummy.\nAlong with all other stocks including 401k permalink parent award report block reply view 5 more comments... grenades_and_ham 4 points 5 days ago Cramer wipes back to front. permalink parent award report block reply throttlejohnson 3 points 5 days ago followed by a firm throat punch....maybe then he'll stfu permalink parent award report block reply\nIm_RickSteves_bitch 12 points 5 days ago I love it when PDW gets to be more like r/wallstreetbets! permalink parent award report block reply 7PC_Principle -10 points 5 days ago 🤣 what bullshit. Nasdaq is down dummy.\nAlong with all other stocks including 401k permalink parent award report block reply view 5 more comments...\n7PC_Principle -10 points 5 days ago 🤣 what bullshit. Nasdaq is down dummy.\nAlong with all other stocks including 401k permalink parent award report block reply view 5 more comments...\ngrenades_and_ham 4 points 5 days ago Cramer wipes back to front. permalink parent award report block reply\nthrottlejohnson 3 points 5 days ago followed by a firm throat punch....maybe then he'll stfu permalink parent award report block reply\nPatriotSkorzeny 2 points 5 days ago A guy copied every trade she made and went to prison. permalink parent award report block reply\nBoughtByBloomberg2 1 points 5 days ago I'm actually mad she's retiring. There go my reliable 20% gains. permalink parent award report block reply\nHoshi 20 points 5 days ago AI bubble. How can so many people competing in the AI space even make money off of this in the end with AI not really self learning but hallucinating made up shit? permalink parent award report block reply Im_RickSteves_bitch 11 points 5 days ago I mean, lots of scams make great money. It's not about providing something valuable for the money people give you. permalink parent award report block reply DeportThemAllForever 5 points 5 days ago DJT stock is in the shitter literally. permalink parent award report block reply flashersenpai 1 points 5 days ago Their valuable products make a few billion a year, and yet they're spending many times that. permalink parent award report block reply wlatic 8 points 5 days ago Its not really about what AI can do now its about what it has been able to learn in A small period of time and how it can massive shorter development of materials and eventually controlling stuff. It should be the same kind of leap between digging a hole by hand and using a machine, but its still way off. permalink parent award report block reply HyperCarbs 5 points 5 days ago We're in a new computing revolution. Much like the 80s and 90s. Going to move much, much faster. permalink parent award report block reply zooty 1 points 5 days ago Huzzah! Aeron chairs for all! permalink parent award report block reply Hoshi 3 points 5 days ago I am waiting for my optimus bot to come close to learn to clean my house and then I will start to believe. permalink parent award report block reply wlatic 4 points 5 days ago Personally I wouldn't want an industrial robot in my home. House based robots would need to be breakable with normal human force, but not break themselves by working, due to \"AI\". permalink parent award report block reply view 3 more comments... grenades_and_ham 2 points 5 days ago A “Do Bot.” permalink parent award report block reply view 1 more comments... iamherefortheluls 1 points 5 days ago you are hoping for a good house bot from the current corporate environment? It will sneak cockroaches into your food, sell your diarrhea fart compilations for upvotes online and than punch you in the nuts at 3 AM for failing to watch 3 hours of ads per day. today at 4 AM we rolled out a new mandatory update. All optimus bots will now draw a Microsoft logo on your bathroom mirror using your toothpaste, so you can start your day with a greeting from us. If you wish you may delay this update by.... 20 minutes. To activate the delay feature, lick your Optimus bot's feet ten times each. given the state of modern OSes, PCs, laptops and phones I wouldn't trust any robot in my house. permalink parent award report block reply LongerThanTheNile 3 points 5 days ago Possibly overvalued, but not a bubble imo. People think back to the Dotcom bubble, but it's not really comparable. There, you had a lot of no-name companies get huge valuations based on thin air and promises. Today, you have a handful of big, well-established companies with monster earnings who also have monster valuations. That's not a bubble. It might be due for a correction, but not anything like the Dotcom bust. Just think: If AI went away tomorrow, would Google and Nvidia, etc. be worthless? Fuck no. Also, AI will imo increase productivity. It already is. It can streamline a lot of monotonous tasks and free up the employee to do more innovative work. The concern is that moronic, greedy companies will think they can fully replace workers with AI, instead of letting their existing employees use it as a force multiplier. With that in mind, given the wave of recent layoffs, it does make sense to be short-term bearish. That doesn't mean they won't keep rising, though. \"The market can remain irrational longer than you can remain solvent.\" permalink parent award report block reply flashersenpai 2 points 5 days ago If AI went away tomorrow, would Google and Nvidia, etc. be worthless? Fuck no. Monopolies tend to have staying power, but that's assuming their debts and circular \"investments\" aren't big enough liabilities. permalink parent award report block reply Jaqen 1 points 5 days ago If AI went away tomorrow, nvidia would have enormous problems. permalink parent award report block reply NonyaDB 1 points 5 days ago The problem with AI is that everyone is in a rush to implement something - ANYTHING! - AI just to tell the markets that \"we haz AI nows!\" and not once do they ever think \"gee, is AI even a fit for this?\" (pro-tip:  nope, most AI implementations are not only half-baked but just make things harder.) I work in IT, installing and fixing servers and storage systems in datacenters for banks, insurance, financial companies, etc. and they're not installing a lot of AI hardware. An AI testbed demo here and there, but that's it. I know because I install and configure the damn things across about 50 datacenters in one metro alone. What are they installing if it's not AI?  STORAGE!  MASSIVE AMOUNTS OF STORAGE! And all of it is being managed by off-shored IT \"management\" companies based in India and those guys are fucking morons. And it's been that way for the at least the past 5 years and counting. What they're doing is contracting out anything-AI to the west coast and keeping the data stored in the midwest, south, and NE. If the west coast ever suffers a big power outage that lasts for a while, all that AI shit's going to start falling apart pretty quick. Why?  Because real AI datacenters have to be liquid-cooled and the vast majority of DCs in the USA are still not setup for liquid-cooling - it's all air-cooled.  Some try using dedicated hot-aisle/cold-aisle tricks but they almost always fail, especially when a DC fucks up and puts too many high-pressure, high-BTU server racks on the same aisle and it over-pressures the hot-aisle and starts blowing hot air back through the server racks into the cold-aisle. Many such cases. permalink parent award report block reply SHILL_DETECTOR 2 points 5 days ago there you go again! permalink parent award report block reply HyperCarbs 1 points 5 days ago It already popped. All the bigtech companies did AI layoffs this year. However, cutting-edge computing is still moving forward. Those comapies are still outperforming the market. In fact, they are the market right now. Personally, I'd wait for the next correction to get in if you've been sitting on the sidelines waiting for something to pop. permalink parent award report block reply Hoshi 2 points 5 days ago I bought a lot during the last two tariff scares this year mostly and  still waiting for a major correction for most of my money. permalink parent award report block reply flashersenpai 1 points 5 days ago In fact, they are the market right now. You should be concerned that a handful of companies \"are the market\" OpenAI has been asking for government bailouts since at least last week. And althought the admin says No, I'm not confident that will stand up to the pressure of all their corpo friends (Hello Bessent!) permalink parent award report block reply load 2 more comments...\nIm_RickSteves_bitch 11 points 5 days ago I mean, lots of scams make great money. It's not about providing something valuable for the money people give you. permalink parent award report block reply DeportThemAllForever 5 points 5 days ago DJT stock is in the shitter literally. permalink parent award report block reply flashersenpai 1 points 5 days ago Their valuable products make a few billion a year, and yet they're spending many times that. permalink parent award report block reply\nDeportThemAllForever 5 points 5 days ago DJT stock is in the shitter literally. permalink parent award report block reply\nflashersenpai 1 points 5 days ago Their valuable products make a few billion a year, and yet they're spending many times that. permalink parent award report block reply\nwlatic 8 points 5 days ago Its not really about what AI can do now its about what it has been able to learn in A small period of time and how it can massive shorter development of materials and eventually controlling stuff. It should be the same kind of leap between digging a hole by hand and using a machine, but its still way off. permalink parent award report block reply HyperCarbs 5 points 5 days ago We're in a new computing revolution. Much like the 80s and 90s. Going to move much, much faster. permalink parent award report block reply zooty 1 points 5 days ago Huzzah! Aeron chairs for all! permalink parent award report block reply Hoshi 3 points 5 days ago I am waiting for my optimus bot to come close to learn to clean my house and then I will start to believe. permalink parent award report block reply wlatic 4 points 5 days ago Personally I wouldn't want an industrial robot in my home. House based robots would need to be breakable with normal human force, but not break themselves by working, due to \"AI\". permalink parent award report block reply view 3 more comments... grenades_and_ham 2 points 5 days ago A “Do Bot.” permalink parent award report block reply view 1 more comments... iamherefortheluls 1 points 5 days ago you are hoping for a good house bot from the current corporate environment? It will sneak cockroaches into your food, sell your diarrhea fart compilations for upvotes online and than punch you in the nuts at 3 AM for failing to watch 3 hours of ads per day. today at 4 AM we rolled out a new mandatory update. All optimus bots will now draw a Microsoft logo on your bathroom mirror using your toothpaste, so you can start your day with a greeting from us. If you wish you may delay this update by.... 20 minutes. To activate the delay feature, lick your Optimus bot's feet ten times each. given the state of modern OSes, PCs, laptops and phones I wouldn't trust any robot in my house. permalink parent award report block reply\nHyperCarbs 5 points 5 days ago We're in a new computing revolution. Much like the 80s and 90s. Going to move much, much faster. permalink parent award report block reply zooty 1 points 5 days ago Huzzah! Aeron chairs for all! permalink parent award report block reply\nzooty 1 points 5 days ago Huzzah! Aeron chairs for all! permalink parent award report block reply\nHoshi 3 points 5 days ago I am waiting for my optimus bot to come close to learn to clean my house and then I will start to believe. permalink parent award report block reply wlatic 4 points 5 days ago Personally I wouldn't want an industrial robot in my home. House based robots would need to be breakable with normal human force, but not break themselves by working, due to \"AI\". permalink parent award report block reply view 3 more comments... grenades_and_ham 2 points 5 days ago A “Do Bot.” permalink parent award report block reply view 1 more comments... iamherefortheluls 1 points 5 days ago you are hoping for a good house bot from the current corporate environment? It will sneak cockroaches into your food, sell your diarrhea fart compilations for upvotes online and than punch you in the nuts at 3 AM for failing to watch 3 hours of ads per day. today at 4 AM we rolled out a new mandatory update. All optimus bots will now draw a Microsoft logo on your bathroom mirror using your toothpaste, so you can start your day with a greeting from us. If you wish you may delay this update by.... 20 minutes. To activate the delay feature, lick your Optimus bot's feet ten times each. given the state of modern OSes, PCs, laptops and phones I wouldn't trust any robot in my house. permalink parent award report block reply\nwlatic 4 points 5 days ago Personally I wouldn't want an industrial robot in my home. House based robots would need to be breakable with normal human force, but not break themselves by working, due to \"AI\". permalink parent award report block reply view 3 more comments...\ngrenades_and_ham 2 points 5 days ago A “Do Bot.” permalink parent award report block reply view 1 more comments...\niamherefortheluls 1 points 5 days ago you are hoping for a good house bot from the current corporate environment? It will sneak cockroaches into your food, sell your diarrhea fart compilations for upvotes online and than punch you in the nuts at 3 AM for failing to watch 3 hours of ads per day. today at 4 AM we rolled out a new mandatory update. All optimus bots will now draw a Microsoft logo on your bathroom mirror using your toothpaste, so you can start your day with a greeting from us. If you wish you may delay this update by.... 20 minutes. To activate the delay feature, lick your Optimus bot's feet ten times each. given the state of modern OSes, PCs, laptops and phones I wouldn't trust any robot in my house. permalink parent award report block reply\nLongerThanTheNile 3 points 5 days ago Possibly overvalued, but not a bubble imo. People think back to the Dotcom bubble, but it's not really comparable. There, you had a lot of no-name companies get huge valuations based on thin air and promises. Today, you have a handful of big, well-established companies with monster earnings who also have monster valuations. That's not a bubble. It might be due for a correction, but not anything like the Dotcom bust. Just think: If AI went away tomorrow, would Google and Nvidia, etc. be worthless? Fuck no. Also, AI will imo increase productivity. It already is. It can streamline a lot of monotonous tasks and free up the employee to do more innovative work. The concern is that moronic, greedy companies will think they can fully replace workers with AI, instead of letting their existing employees use it as a force multiplier. With that in mind, given the wave of recent layoffs, it does make sense to be short-term bearish. That doesn't mean they won't keep rising, though. \"The market can remain irrational longer than you can remain solvent.\" permalink parent award report block reply flashersenpai 2 points 5 days ago If AI went away tomorrow, would Google and Nvidia, etc. be worthless? Fuck no. Monopolies tend to have staying power, but that's assuming their debts and circular \"investments\" aren't big enough liabilities. permalink parent award report block reply Jaqen 1 points 5 days ago If AI went away tomorrow, nvidia would have enormous problems. permalink parent award report block reply NonyaDB 1 points 5 days ago The problem with AI is that everyone is in a rush to implement something - ANYTHING! - AI just to tell the markets that \"we haz AI nows!\" and not once do they ever think \"gee, is AI even a fit for this?\" (pro-tip:  nope, most AI implementations are not only half-baked but just make things harder.) I work in IT, installing and fixing servers and storage systems in datacenters for banks, insurance, financial companies, etc. and they're not installing a lot of AI hardware. An AI testbed demo here and there, but that's it. I know because I install and configure the damn things across about 50 datacenters in one metro alone. What are they installing if it's not AI?  STORAGE!  MASSIVE AMOUNTS OF STORAGE! And all of it is being managed by off-shored IT \"management\" companies based in India and those guys are fucking morons. And it's been that way for the at least the past 5 years and counting. What they're doing is contracting out anything-AI to the west coast and keeping the data stored in the midwest, south, and NE. If the west coast ever suffers a big power outage that lasts for a while, all that AI shit's going to start falling apart pretty quick. Why?  Because real AI datacenters have to be liquid-cooled and the vast majority of DCs in the USA are still not setup for liquid-cooling - it's all air-cooled.  Some try using dedicated hot-aisle/cold-aisle tricks but they almost always fail, especially when a DC fucks up and puts too many high-pressure, high-BTU server racks on the same aisle and it over-pressures the hot-aisle and starts blowing hot air back through the server racks into the cold-aisle. Many such cases. permalink parent award report block reply\nflashersenpai 2 points 5 days ago If AI went away tomorrow, would Google and Nvidia, etc. be worthless? Fuck no. Monopolies tend to have staying power, but that's assuming their debts and circular \"investments\" aren't big enough liabilities. permalink parent award report block reply\nJaqen 1 points 5 days ago If AI went away tomorrow, nvidia would have enormous problems. permalink parent award report block reply\nNonyaDB 1 points 5 days ago The problem with AI is that everyone is in a rush to implement something - ANYTHING! - AI just to tell the markets that \"we haz AI nows!\" and not once do they ever think \"gee, is AI even a fit for this?\" (pro-tip:  nope, most AI implementations are not only half-baked but just make things harder.) I work in IT, installing and fixing servers and storage systems in datacenters for banks, insurance, financial companies, etc. and they're not installing a lot of AI hardware. An AI testbed demo here and there, but that's it. I know because I install and configure the damn things across about 50 datacenters in one metro alone. What are they installing if it's not AI?  STORAGE!  MASSIVE AMOUNTS OF STORAGE! And all of it is being managed by off-shored IT \"management\" companies based in India and those guys are fucking morons. And it's been that way for the at least the past 5 years and counting. What they're doing is contracting out anything-AI to the west coast and keeping the data stored in the midwest, south, and NE. If the west coast ever suffers a big power outage that lasts for a while, all that AI shit's going to start falling apart pretty quick. Why?  Because real AI datacenters have to be liquid-cooled and the vast majority of DCs in the USA are still not setup for liquid-cooling - it's all air-cooled.  Some try using dedicated hot-aisle/cold-aisle tricks but they almost always fail, especially when a DC fucks up and puts too many high-pressure, high-BTU server racks on the same aisle and it over-pressures the hot-aisle and starts blowing hot air back through the server racks into the cold-aisle. Many such cases. permalink parent award report block reply\nSHILL_DETECTOR 2 points 5 days ago there you go again! permalink parent award report block reply\nHyperCarbs 1 points 5 days ago It already popped. All the bigtech companies did AI layoffs this year. However, cutting-edge computing is still moving forward. Those comapies are still outperforming the market. In fact, they are the market right now. Personally, I'd wait for the next correction to get in if you've been sitting on the sidelines waiting for something to pop. permalink parent award report block reply Hoshi 2 points 5 days ago I bought a lot during the last two tariff scares this year mostly and  still waiting for a major correction for most of my money. permalink parent award report block reply flashersenpai 1 points 5 days ago In fact, they are the market right now. You should be concerned that a handful of companies \"are the market\" OpenAI has been asking for government bailouts since at least last week. And althought the admin says No, I'm not confident that will stand up to the pressure of all their corpo friends (Hello Bessent!) permalink parent award report block reply\nHoshi 2 points 5 days ago I bought a lot during the last two tariff scares this year mostly and  still waiting for a major correction for most of my money. permalink parent award report block reply\nflashersenpai 1 points 5 days ago In fact, they are the market right now. You should be concerned that a handful of companies \"are the market\" OpenAI has been asking for government bailouts since at least last week. And althought the admin says No, I'm not confident that will stand up to the pressure of all their corpo friends (Hello Bessent!) permalink parent award report block reply\ncaseyne 5 points 5 days ago The whole purpose of these markets was to take money from poor people and make it seem you was part of a company. Why would rich people waste their money when they can waste others.You should never take them serious. permalink parent award report block reply\nYawnz13 2 points 5 days ago Nah, it's just that retards act like drops that last less than a day are some kind of catastrophe. permalink parent award report block reply\ngustodog 2 points 5 days ago While there's legitimate reason to believe the markets are overheated (historic P/E ratios and such), there's likely also FUD drum beating to try to use market conditions as a tool to hurt Trump and get him to back off on tariffs (the Supreme Court is to rule soon about the legality of the tariffs). And during this time there's fearmongering speculation about the economic ramifications of the government shutdown and the globalist IMF is raising the alarm about global public debt and emphasizing the US's debt. Buy the dip perhaps, but also be conscious of how stock ownership works and potential risks if some sort of high level shenanigans were to kick in. \"Cede technically owns most of the publicly issued stock in the United States.\" https://en.wikipedia.org/wiki/Cede_and_Company permalink parent award report block reply\nAVeryNakedMan 50 points 5 days ago Daily stock fluctuations are dumb things to care about and only affect traders and retards. permalink award report block reply Emodius 10 points 5 days ago Long term they are going up permalink parent award report block reply DeportThemAllForever 12 points 5 days ago Inflation guarantees things lower value of money gold value will go up higher stock market real estate in big cities (not country) higher food and gas prices income gap is a chasm permalink parent award report block reply flashersenpai 2 points 5 days ago omg line go up permalink parent award report block reply mikejones 5 points 5 days ago Right, we should all be nearly 60 and rich. permalink parent award report block reply 73Cuda 1 points 4 days ago I hit millionaire status at 37.  DCA and ignore the noise, dont be a victimtard, any red day is a buy opportunity. permalink parent award report block reply jatergator 4 points 5 days ago And yet, this stupid post is sticked. permalink parent award report block reply canada_is_communist 2 points 5 days ago Well nasdaq was down 6-7% (no meme intended?). That's absolutely a massive move. permalink parent award report block reply Mddet OP 2 points 5 days ago Roger. But I like it permalink parent award report block reply load 3 more comments...\nEmodius 10 points 5 days ago Long term they are going up permalink parent award report block reply DeportThemAllForever 12 points 5 days ago Inflation guarantees things lower value of money gold value will go up higher stock market real estate in big cities (not country) higher food and gas prices income gap is a chasm permalink parent award report block reply flashersenpai 2 points 5 days ago omg line go up permalink parent award report block reply\nDeportThemAllForever 12 points 5 days ago Inflation guarantees things lower value of money gold value will go up higher stock market real estate in big cities (not country) higher food and gas prices income gap is a chasm permalink parent award report block reply\nflashersenpai 2 points 5 days ago omg line go up permalink parent award report block reply\nmikejones 5 points 5 days ago Right, we should all be nearly 60 and rich. permalink parent award report block reply 73Cuda 1 points 4 days ago I hit millionaire status at 37.  DCA and ignore the noise, dont be a victimtard, any red day is a buy opportunity. permalink parent award report block reply\n73Cuda 1 points 4 days ago I hit millionaire status at 37.  DCA and ignore the noise, dont be a victimtard, any red day is a buy opportunity. permalink parent award report block reply\njatergator 4 points 5 days ago And yet, this stupid post is sticked. permalink parent award report block reply\ncanada_is_communist 2 points 5 days ago Well nasdaq was down 6-7% (no meme intended?). That's absolutely a massive move. permalink parent award report block reply\nMddet OP 2 points 5 days ago Roger. But I like it permalink parent award report block reply\nnonrate 22 points 5 days ago A drop and recovery of a couple percentage points is not impressive, sorry. Not worth a sticky imo permalink award report block reply YouEssAye 5 points 5 days ago Plus the money printers are still running, who could've guessed the stock market goes up when the money supply is increased. It's all a scam. Trump wins the day What a dumb metric to measure presidential success by. permalink parent award report block reply flashersenpai 3 points 5 days ago What a dumb metric to measure presidential success by. mods are shilling but aren't very good at it permalink parent award report block reply canada_is_communist 1 points 5 days ago Its absolutely impressive. NVDA lost 600B of value. Six. Hundred. Billions. In a few days. Canada's entire quaterly GDP (even penny that changes hand for 40+M in an entire giant country) is not even 600B... and nvda moved this much in a few days. permalink parent award report block reply nonrate 5 points 5 days ago Dropping and recovering a few percentage points in a day happens all the time. This is not notable to me, unless I am missing something else. permalink parent award report block reply canada_is_communist 2 points 5 days ago It happens all the time due to manipulation lol permalink parent award report block reply nonrate 3 points 5 days ago true true! permalink parent award report block reply view 1 more comments... Mddet OP 1 points 5 days ago Last thing im here for are stickyness. Have a good one retard. Lol jk permalink parent award report block reply\nYouEssAye 5 points 5 days ago Plus the money printers are still running, who could've guessed the stock market goes up when the money supply is increased. It's all a scam. Trump wins the day What a dumb metric to measure presidential success by. permalink parent award report block reply flashersenpai 3 points 5 days ago What a dumb metric to measure presidential success by. mods are shilling but aren't very good at it permalink parent award report block reply\nflashersenpai 3 points 5 days ago What a dumb metric to measure presidential success by. mods are shilling but aren't very good at it permalink parent award report block reply\ncanada_is_communist 1 points 5 days ago Its absolutely impressive. NVDA lost 600B of value. Six. Hundred. Billions. In a few days. Canada's entire quaterly GDP (even penny that changes hand for 40+M in an entire giant country) is not even 600B... and nvda moved this much in a few days. permalink parent award report block reply nonrate 5 points 5 days ago Dropping and recovering a few percentage points in a day happens all the time. This is not notable to me, unless I am missing something else. permalink parent award report block reply canada_is_communist 2 points 5 days ago It happens all the time due to manipulation lol permalink parent award report block reply nonrate 3 points 5 days ago true true! permalink parent award report block reply view 1 more comments...\nnonrate 5 points 5 days ago Dropping and recovering a few percentage points in a day happens all the time. This is not notable to me, unless I am missing something else. permalink parent award report block reply canada_is_communist 2 points 5 days ago It happens all the time due to manipulation lol permalink parent award report block reply nonrate 3 points 5 days ago true true! permalink parent award report block reply view 1 more comments...\ncanada_is_communist 2 points 5 days ago It happens all the time due to manipulation lol permalink parent award report block reply nonrate 3 points 5 days ago true true! permalink parent award report block reply view 1 more comments...\nnonrate 3 points 5 days ago true true! permalink parent award report block reply view 1 more comments...\nMddet OP 1 points 5 days ago Last thing im here for are stickyness. Have a good one retard. Lol jk permalink parent award report block reply\ndirtysanchez69 10 points 5 days ago Buy the dip, autists permalink award report block reply canada_is_communist 4 points 5 days ago It was clear the dip was overdone. NVDA crashing 15% on... nothing? We know china is gonna get its chips no matter what, they are investing extreme amounts into AI (they dont mind building entire ghosts cities to prop up their GDP, so at this point AI isn't a problem lol) and only NVDA makes good AI chips, so... Also holidays coming, january, etc. I thought the dip would last into mid-november but this might be it, really. I think we bottomed out this morning? permalink parent award report block reply grenades_and_ham 5 points 5 days ago NVDA CEO is a Chicom simp. permalink parent award report block reply canada_is_communist 1 points 5 days ago A chicom simp that made me rich... soon I'll be able to stop teaching thanks to him permalink parent award report block reply HyperCarbs 4 points 5 days ago A 15% drop is nothing considering NVDA doubled this year alone. permalink parent award report block reply 73Cuda 1 points 4 days ago Agree, it wasnt much of a dip, I think market is off maybe 3% from all time high. permalink parent award report block reply\ncanada_is_communist 4 points 5 days ago It was clear the dip was overdone. NVDA crashing 15% on... nothing? We know china is gonna get its chips no matter what, they are investing extreme amounts into AI (they dont mind building entire ghosts cities to prop up their GDP, so at this point AI isn't a problem lol) and only NVDA makes good AI chips, so... Also holidays coming, january, etc. I thought the dip would last into mid-november but this might be it, really. I think we bottomed out this morning? permalink parent award report block reply grenades_and_ham 5 points 5 days ago NVDA CEO is a Chicom simp. permalink parent award report block reply canada_is_communist 1 points 5 days ago A chicom simp that made me rich... soon I'll be able to stop teaching thanks to him permalink parent award report block reply HyperCarbs 4 points 5 days ago A 15% drop is nothing considering NVDA doubled this year alone. permalink parent award report block reply 73Cuda 1 points 4 days ago Agree, it wasnt much of a dip, I think market is off maybe 3% from all time high. permalink parent award report block reply\ngrenades_and_ham 5 points 5 days ago NVDA CEO is a Chicom simp. permalink parent award report block reply canada_is_communist 1 points 5 days ago A chicom simp that made me rich... soon I'll be able to stop teaching thanks to him permalink parent award report block reply\ncanada_is_communist 1 points 5 days ago A chicom simp that made me rich... soon I'll be able to stop teaching thanks to him permalink parent award report block reply\nHyperCarbs 4 points 5 days ago A 15% drop is nothing considering NVDA doubled this year alone. permalink parent award report block reply\n73Cuda 1 points 4 days ago Agree, it wasnt much of a dip, I think market is off maybe 3% from all time high. permalink parent award report block reply\nDT170x 10 points 5 days ago Lol at the Inverse Jim Cramer When you see news markets just do the opposite. Lol. permalink award report block reply Mddet OP 4 points 5 days ago Lol permalink parent award report block reply\nMddet OP 4 points 5 days ago Lol permalink parent award report block reply\nconservativefrank 7 points 5 days ago Meanwhile, prices are up in stores, taxes up, insurance rates up, airports jammed and flights delayed. America is in a misery that will spell a blue wave at the midterms. permalink award report block reply Emodius 2 points 5 days ago Uh prices are down here what 3rd world shit hole do you live in? permalink parent award report block reply conservativefrank 1 points 5 days ago Houston TX permalink parent award report block reply DT170x 1 points 5 days ago Probably California or any Leftist state. permalink parent award report block reply\nEmodius 2 points 5 days ago Uh prices are down here what 3rd world shit hole do you live in? permalink parent award report block reply conservativefrank 1 points 5 days ago Houston TX permalink parent award report block reply DT170x 1 points 5 days ago Probably California or any Leftist state. permalink parent award report block reply\nconservativefrank 1 points 5 days ago Houston TX permalink parent award report block reply\nDT170x 1 points 5 days ago Probably California or any Leftist state. permalink parent award report block reply\nMAGA_NRG 6 points 5 days ago Up today, down tomorrow. It's a long term thing not day to day. permalink award report block reply Emodius 2 points 5 days ago And it's going up over time so that's good. permalink parent award report block reply Tardigrade 3 points 5 days ago Well yeah because the unit of measurement decreases. permalink parent award report block reply booblitchutz 2 points 5 days ago Better than holding cash long term then? permalink parent award report block reply Tardigrade 1 points 5 days ago For sure permalink parent award report block reply MAGA_NRG 2 points 5 days ago Yep. Always has, always wil, barring total collapse. permalink parent award report block reply Mddet OP 1 points 5 days ago Understand permalink parent award report block reply bidensmissingbrain 1 points 5 days ago If it's down tomorrow, we've got big problems. permalink parent award report block reply booblitchutz 1 points 5 days ago Tomorrow is Saturday, Chachi permalink parent award report block reply bidensmissingbrain 1 points 5 days ago Nothing gets by you does it? permalink parent award report block reply\nEmodius 2 points 5 days ago And it's going up over time so that's good. permalink parent award report block reply Tardigrade 3 points 5 days ago Well yeah because the unit of measurement decreases. permalink parent award report block reply booblitchutz 2 points 5 days ago Better than holding cash long term then? permalink parent award report block reply Tardigrade 1 points 5 days ago For sure permalink parent award report block reply MAGA_NRG 2 points 5 days ago Yep. Always has, always wil, barring total collapse. permalink parent award report block reply\nTardigrade 3 points 5 days ago Well yeah because the unit of measurement decreases. permalink parent award report block reply booblitchutz 2 points 5 days ago Better than holding cash long term then? permalink parent award report block reply Tardigrade 1 points 5 days ago For sure permalink parent award report block reply\nbooblitchutz 2 points 5 days ago Better than holding cash long term then? permalink parent award report block reply Tardigrade 1 points 5 days ago For sure permalink parent award report block reply\nTardigrade 1 points 5 days ago For sure permalink parent award report block reply\nMAGA_NRG 2 points 5 days ago Yep. Always has, always wil, barring total collapse. permalink parent award report block reply\nMddet OP 1 points 5 days ago Understand permalink parent award report block reply\nbidensmissingbrain 1 points 5 days ago If it's down tomorrow, we've got big problems. permalink parent award report block reply booblitchutz 1 points 5 days ago Tomorrow is Saturday, Chachi permalink parent award report block reply bidensmissingbrain 1 points 5 days ago Nothing gets by you does it? permalink parent award report block reply\nbooblitchutz 1 points 5 days ago Tomorrow is Saturday, Chachi permalink parent award report block reply bidensmissingbrain 1 points 5 days ago Nothing gets by you does it? permalink parent award report block reply\nbidensmissingbrain 1 points 5 days ago Nothing gets by you does it? permalink parent award report block reply\nLawless 5 points 5 days ago You know they couldn't  WAIT to write up that article about the Nas falling 🤣 permalink award report block reply Mddet OP 1 points 5 days ago Yup. Scumbags! permalink parent award report block reply\nMddet OP 1 points 5 days ago Yup. Scumbags! permalink parent award report block reply\nDeplorachuIChooseYou 5 points 5 days ago My stocks were down but, what I was not happy about was not knowing 100% what to buy at a discount O^O permalink award report block reply\nHuntersCrackDealer69 4 points 5 days ago Who cares? Not like it makes anything more affordable to anyone who actually has to work for a living. permalink award report block reply\nBrownwaterboys 4 points 5 days ago Meanwhile silver and gold up over 50% this year. permalink award report block reply Say_what_again 1 points 5 days ago I got into gold at 1300 (yes, a bit late to the party). I've bought regularly since. And I bought another 13 ounces today permalink parent award report block reply Brownwaterboys 2 points 5 days ago Good on ya! Keep stacking fellow pede :D Become your own central banker, stack gold and silver :D permalink parent award report block reply\nSay_what_again 1 points 5 days ago I got into gold at 1300 (yes, a bit late to the party). I've bought regularly since. And I bought another 13 ounces today permalink parent award report block reply Brownwaterboys 2 points 5 days ago Good on ya! Keep stacking fellow pede :D Become your own central banker, stack gold and silver :D permalink parent award report block reply\nBrownwaterboys 2 points 5 days ago Good on ya! Keep stacking fellow pede :D Become your own central banker, stack gold and silver :D permalink parent award report block reply\nahamrbond 3 points 5 days ago If the stock market goes up, I give Trump no credit. When the stock market crashes, I will give Trump no blame. Sorry, but the stock market is a ponzi scheme for foolish mainstream investors, and smart traders. Have fun making a ton of money over years and then losing it all in a week, having absolutely nothing to show for it. permalink award report block reply _Sully_ 3 points 5 days ago Right, no one ever made any money ever that’s why they keep doing it. Get a grip, man. I’ve made thousands in the stock market and got to use the money. Me a stem schmuck barely making 6 figs. Why is this place so full of doomers and mopers? I’m literally unemployed now and the outlook hasn’t looked better. We were staring down the barrel of a gun a year ago. permalink parent award report block reply flashersenpai 0 points 5 days ago no one ever made any money ever that’s why they keep doing it semantically yes, no one is making money off it because it's only a minority of people who have the resources to play with stocks Go around town and ask people who owns stocks or know what the hell is going on. Stock market doesn't reflect what normal people are going through every day. permalink parent award report block reply _Sully_ 3 points 5 days ago I don’t need to ask around town cuz it’s me. I’m not some rich person, bro. You are trying to convince me that the stock market never helped normal people. Oh I’m sure there are people who aren’t using it but that’s their mistake. Your argument is ludicrous. Yes, the stock market isn’t the economy and yes people could be doing bad while it’s doing well. However they could be doing well because the stock market is too. Look I’m not saying it’s this wonderful thing but it is absolutely brain dead and quite frankly ignorant to say normal people can’t invest their money. Hell, I bought stocks when I was 20 years old. Threw in a thousand dollars and turned it into $2,500. This is a normal person activity. I’m sorry you aren’t doing well at the moment but your attitude is simply defeatist for no good reason. Invest your money when you can. It’s the smart thing to do. permalink parent award report block reply Mddet OP 2 points 4 days ago ❤️🇺🇸 permalink parent award report block reply Mddet OP 2 points 5 days ago Ok yer nuts. My 401k is doing so good. permalink parent award report block reply Heavens2MAGAtroid 1 points 5 days ago SP 500 averages over 10% for the last 100 years permalink parent award report block reply\n_Sully_ 3 points 5 days ago Right, no one ever made any money ever that’s why they keep doing it. Get a grip, man. I’ve made thousands in the stock market and got to use the money. Me a stem schmuck barely making 6 figs. Why is this place so full of doomers and mopers? I’m literally unemployed now and the outlook hasn’t looked better. We were staring down the barrel of a gun a year ago. permalink parent award report block reply flashersenpai 0 points 5 days ago no one ever made any money ever that’s why they keep doing it semantically yes, no one is making money off it because it's only a minority of people who have the resources to play with stocks Go around town and ask people who owns stocks or know what the hell is going on. Stock market doesn't reflect what normal people are going through every day. permalink parent award report block reply _Sully_ 3 points 5 days ago I don’t need to ask around town cuz it’s me. I’m not some rich person, bro. You are trying to convince me that the stock market never helped normal people. Oh I’m sure there are people who aren’t using it but that’s their mistake. Your argument is ludicrous. Yes, the stock market isn’t the economy and yes people could be doing bad while it’s doing well. However they could be doing well because the stock market is too. Look I’m not saying it’s this wonderful thing but it is absolutely brain dead and quite frankly ignorant to say normal people can’t invest their money. Hell, I bought stocks when I was 20 years old. Threw in a thousand dollars and turned it into $2,500. This is a normal person activity. I’m sorry you aren’t doing well at the moment but your attitude is simply defeatist for no good reason. Invest your money when you can. It’s the smart thing to do. permalink parent award report block reply Mddet OP 2 points 4 days ago ❤️🇺🇸 permalink parent award report block reply\nflashersenpai 0 points 5 days ago no one ever made any money ever that’s why they keep doing it semantically yes, no one is making money off it because it's only a minority of people who have the resources to play with stocks Go around town and ask people who owns stocks or know what the hell is going on. Stock market doesn't reflect what normal people are going through every day. permalink parent award report block reply _Sully_ 3 points 5 days ago I don’t need to ask around town cuz it’s me. I’m not some rich person, bro. You are trying to convince me that the stock market never helped normal people. Oh I’m sure there are people who aren’t using it but that’s their mistake. Your argument is ludicrous. Yes, the stock market isn’t the economy and yes people could be doing bad while it’s doing well. However they could be doing well because the stock market is too. Look I’m not saying it’s this wonderful thing but it is absolutely brain dead and quite frankly ignorant to say normal people can’t invest their money. Hell, I bought stocks when I was 20 years old. Threw in a thousand dollars and turned it into $2,500. This is a normal person activity. I’m sorry you aren’t doing well at the moment but your attitude is simply defeatist for no good reason. Invest your money when you can. It’s the smart thing to do. permalink parent award report block reply Mddet OP 2 points 4 days ago ❤️🇺🇸 permalink parent award report block reply\n_Sully_ 3 points 5 days ago I don’t need to ask around town cuz it’s me. I’m not some rich person, bro. You are trying to convince me that the stock market never helped normal people. Oh I’m sure there are people who aren’t using it but that’s their mistake. Your argument is ludicrous. Yes, the stock market isn’t the economy and yes people could be doing bad while it’s doing well. However they could be doing well because the stock market is too. Look I’m not saying it’s this wonderful thing but it is absolutely brain dead and quite frankly ignorant to say normal people can’t invest their money. Hell, I bought stocks when I was 20 years old. Threw in a thousand dollars and turned it into $2,500. This is a normal person activity. I’m sorry you aren’t doing well at the moment but your attitude is simply defeatist for no good reason. Invest your money when you can. It’s the smart thing to do. permalink parent award report block reply Mddet OP 2 points 4 days ago ❤️🇺🇸 permalink parent award report block reply\nMddet OP 2 points 4 days ago ❤️🇺🇸 permalink parent award report block reply\nMddet OP 2 points 5 days ago Ok yer nuts. My 401k is doing so good. permalink parent award report block reply\nHeavens2MAGAtroid 1 points 5 days ago SP 500 averages over 10% for the last 100 years permalink parent award report block reply\nSanityGumby 3 points 5 days ago Some turbo faggots were doing the same thing with bitcoin here as well. “IZZZA UNDA $100kzzzz”. By end of day it was around $102k permalink award report block reply\nMemphisMontoya71 2 points 5 days ago The market doesn't move the average American to Republicans, your everyday food and gas prices do. permalink award report block reply\nDeportThemAllForever 2 points 5 days ago Rich people get richer, what else is new? permalink award report block reply Mddet OP 2 points 5 days ago Im not rich, my 401 went up permalink parent award report block reply DeportThemAllForever 1 points 5 days ago But 10 cents.  Theirs by millions. permalink parent award report block reply _Sully_ 1 points 5 days ago No. People do have money and make great gains. Totally normal people. Or do they suddenly become horrible rich people in your eyes. You sound like a leftist. Stop dooming and get out there. There’s a lot of money you can make. permalink parent award report block reply booblitchutz 2 points 5 days ago Don’t you know that on TD nobody has money and everyone can’t afford a house? permalink parent award report block reply view 1 more comments...\nMddet OP 2 points 5 days ago Im not rich, my 401 went up permalink parent award report block reply DeportThemAllForever 1 points 5 days ago But 10 cents.  Theirs by millions. permalink parent award report block reply _Sully_ 1 points 5 days ago No. People do have money and make great gains. Totally normal people. Or do they suddenly become horrible rich people in your eyes. You sound like a leftist. Stop dooming and get out there. There’s a lot of money you can make. permalink parent award report block reply booblitchutz 2 points 5 days ago Don’t you know that on TD nobody has money and everyone can’t afford a house? permalink parent award report block reply view 1 more comments...\nDeportThemAllForever 1 points 5 days ago But 10 cents.  Theirs by millions. permalink parent award report block reply _Sully_ 1 points 5 days ago No. People do have money and make great gains. Totally normal people. Or do they suddenly become horrible rich people in your eyes. You sound like a leftist. Stop dooming and get out there. There’s a lot of money you can make. permalink parent award report block reply booblitchutz 2 points 5 days ago Don’t you know that on TD nobody has money and everyone can’t afford a house? permalink parent award report block reply view 1 more comments...\n_Sully_ 1 points 5 days ago No. People do have money and make great gains. Totally normal people. Or do they suddenly become horrible rich people in your eyes. You sound like a leftist. Stop dooming and get out there. There’s a lot of money you can make. permalink parent award report block reply booblitchutz 2 points 5 days ago Don’t you know that on TD nobody has money and everyone can’t afford a house? permalink parent award report block reply view 1 more comments...\nbooblitchutz 2 points 5 days ago Don’t you know that on TD nobody has money and everyone can’t afford a house? permalink parent award report block reply view 1 more comments...\nChoppermagic 2 points 5 days ago could have made easy money today if you bought the dip. permalink award report block reply\ncaptflerbus 2 points 5 days ago when the market is this high 400 points isn't really that big a deal permalink award report block reply\ncanada_is_communist 2 points 5 days ago ITS MAGA TIME BABY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! HOLY SHIT TRUMP SAVED MY ASS TODAY! THANK YOU MR PRESIDENT TRUMP!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! permalink award report block reply Mddet OP 2 points 5 days ago You got one upvote and its me. Love you. Fuck em all! permalink parent award report block reply\nMddet OP 2 points 5 days ago You got one upvote and its me. Love you. Fuck em all! permalink parent award report block reply\nRerun1Central 2 points 5 days ago every week I hear, how MCD or AAPL or TSLA or NVDA are 'tanking' and 'losing sales'... yet none of it's true... all near record highs... all with amazingly positive outlooks.. but MSM is telling people the sky is falling like henny penny permalink award report block reply HyperCarbs 1 points 5 days ago It's sell marketing to drive the price down by the big inveators so they can buy more. permalink parent award report block reply\nHyperCarbs 1 points 5 days ago It's sell marketing to drive the price down by the big inveators so they can buy more. permalink parent award report block reply\nVorticity1 2 points 5 days ago Pelosi sold her stocks. permalink award report block reply\nthrottlejohnson 2 points 5 days ago crypto has been shit for awhile now...i have a lot of money tied up in them...hoping for a good rebound. permalink award report block reply\norange_kek_great 1 points 5 days ago Trump may have won today, but what did we get? When do WE win? permalink award report block reply\nTombstone2W 1 points 5 days ago The only problem with claiming the boom is you'll own the bust. permalink award report block reply\nPatriotDescendant 1 points 5 days ago You cannot worry about the stock market. Seven tech stocks are all vastly overvalued. permalink award report block reply\nH0rse 1 points 5 days ago A bunch of people sold tech stock and then bought something else permalink award report block reply\nits_three_oclock 1 points 5 days ago lol man, reading through this thread it’s pretty clear it’s only boomers left here, maybe a smattering of gen X. Trump has completely lost my generation, felt like such a miracle last year only for it to end like this. Depressing permalink award report block reply\nAccipiterQ 1 points 5 days ago How is this a sticky?  Where is the \"TDS\"?  It's literally a comment about objective reality.  Some of you guys are complete faggots, sometimes. permalink award report block reply Mddet OP 1 points 5 days ago Its a sticky because we are tired of the likes of you. Now go fock off to newyork. permalink parent award report block reply\nMddet OP 1 points 5 days ago Its a sticky because we are tired of the likes of you. Now go fock off to newyork. permalink parent award report block reply\nAlaskaBrO93 1 points 5 days ago Too bad none of the shit even matters with this current rate of inflation. Everything is going to cost twice as fucking much in 3 years. And that's without not even accounting for the coming interest rate cuts. permalink award report block reply\nalina_habbas_fanclub 1 points 5 days ago Broadcom (AVGO) is my largest holding and I recommend it long term. Best business model out there. Half chips half cloud. permalink award report block reply\nDicksOutForHarambe 1 points 5 days ago It’s going down more permalink award report block reply\nJaunty_Haul 1 points 5 days ago Don't tie Trump to this bubble, or he'll unfairly get slammed when it pops.  There's way too much circular dealing going on; even the normies are becoming aware. permalink award report block reply\nauntjemima 1 points 5 days ago the jobs and $trillions are coming, they hate it. permalink award report block reply\nSteve1 1 points 5 days ago Well it was released jpmorgan bought a ton of etherum and that sort of turned the market permalink award report block reply\nAccipiterQ 0 points 5 days ago Why is this horse-shit still stickied? permalink award report block reply\nlearntocode -1 points 5 days ago I laugh at Stonk Faggots. Your financial asset bubble can kiss my ass. permalink award report block reply\nflashersenpai -1 points 5 days ago Who gives a fuck? Who owns stocks? Who benefits? It's not the people who care about $4 eggs. permalink award report block reply\nthe_new_one 2 points 5 days ago Comment removed upon the user being banned. permalink award report block reply",
  "fetched_at": "2025-11-12T23:01:45.762016Z"
}