{
  "id": "1ARK9l7C3q",
  "url": "https://patriots.win/p/1ARK9l7C3q/high-calorie-humans/c",
  "content": "405 High Calorie Humans TOP  KEK posted 1 day ago by dirtysanchez69 14 comments award share download report block\n14 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style Lance_Romance 27 points 1 day ago lol  Poor Rosie  ROFLMAO permalink award report block reply edxzxz 14 points 1 day ago He is the funniest POTUS ever!  Unless Don Jr. wins it, DJT will hold the title forever. permalink award report block reply TEXinLA 12 points 1 day ago WOMP WOMP permalink award report block reply NADSAQ 11 points 1 day ago “No Fat Chicks” permalink award report block reply you_know_GOAT 11 points 1 day ago Holy Shit this is hilarious with the Rosie jab at the end. permalink award report block reply getup 8 points 1 day ago Clown world post. permalink award report block reply Formerlurker92 5 points 1 day ago Makes sense permalink award report block reply Psalm-118_24 4 points 24 hours ago I pray this is real! permalink award report block reply MakingArrowsOrange 3 points 1 day ago EXPAND permalink award report block reply NoticesBugleOWO 3 points 1 day ago High calorie humans will attract too many bears and sharks, and we just can't take the risk. permalink award report block reply SoulSnipper 2 points 1 day ago Perhaps we could ban witches, women suspected of being witches could be dunked in tanks if water - if they float then they're witches and we must burn them. If they don't , then their soggy remains will be shipped home respectfully. permalink award report block reply Necrovoter 4 points 23 hours ago Or weigh the same as a duck. permalink parent award report block reply bobbacringo 1 points 22 hours ago Rosie lost a lot of weight. The stress of learning that Irish people hate her has really taken it's toll on her. permalink award report block reply\nLance_Romance 27 points 1 day ago lol  Poor Rosie  ROFLMAO permalink award report block reply\nedxzxz 14 points 1 day ago He is the funniest POTUS ever!  Unless Don Jr. wins it, DJT will hold the title forever. permalink award report block reply\nTEXinLA 12 points 1 day ago WOMP WOMP permalink award report block reply\nNADSAQ 11 points 1 day ago “No Fat Chicks” permalink award report block reply\nyou_know_GOAT 11 points 1 day ago Holy Shit this is hilarious with the Rosie jab at the end. permalink award report block reply\ngetup 8 points 1 day ago Clown world post. permalink award report block reply\nFormerlurker92 5 points 1 day ago Makes sense permalink award report block reply\nPsalm-118_24 4 points 24 hours ago I pray this is real! permalink award report block reply\nMakingArrowsOrange 3 points 1 day ago EXPAND permalink award report block reply\nNoticesBugleOWO 3 points 1 day ago High calorie humans will attract too many bears and sharks, and we just can't take the risk. permalink award report block reply\nSoulSnipper 2 points 1 day ago Perhaps we could ban witches, women suspected of being witches could be dunked in tanks if water - if they float then they're witches and we must burn them. If they don't , then their soggy remains will be shipped home respectfully. permalink award report block reply Necrovoter 4 points 23 hours ago Or weigh the same as a duck. permalink parent award report block reply\nNecrovoter 4 points 23 hours ago Or weigh the same as a duck. permalink parent award report block reply\nbobbacringo 1 points 22 hours ago Rosie lost a lot of weight. The stress of learning that Irish people hate her has really taken it's toll on her. permalink award report block reply",
  "fetched_at": "2025-11-12T21:06:42.796918Z"
}