{
  "id": "1ARK0UanLN",
  "url": "https://patriots.win/p/1ARK0UanLN/thomas-massie-to-avoid-a-repeat-/c",
  "content": "365 Thomas Massie: \"To avoid a repeat of last night’s shellacking in the 2026 midterms, Republicans should: quit covering for pedophiles; put America before Israel; put farmers before corporations; quit funding wars abroad; reduce spending to control inflation; quit attacking independent voices\" posted 7 days ago by raptoris2 135 comments award share report block Thomas Massie @RepThomasMassie • 7d To avoid a repeat of last night’s shellacking in the 2026 midterms, Republicans should: quit covering for pedophiles put America before Israel put farmers before corporations quit funding wars abroad reduce spending to control inflation quit attacking independent voices\n135 comments Sort by Top Top New Worst Old Save ChyNahAzzWhole1 37 points 7 days ago Stop being MIGA and start supporting MAGA. permalink award report block reply UCantStumpTheTrump 12 points 7 days ago It’s not even a shellacking, lmao. Dems won in blue states with no voter ID. Shocking! permalink parent award report block reply LostElf 25 points 7 days ago Shellacking. Jesus H. Did he expect Sliwa to be the next NYC mayor? Did the GOP lift a finger to help any Republicans in any of these races? All I saw was Scott Presler and X pundits. How about all Republicans unite to push President Trump's platform on overdrive so midterms feature secure elections and a shattered Democrat party with half their leaders behind bars. Then Massie's wishlist can be addressed with a vengeance. permalink award report block reply SanityGumby 12 points 7 days ago All of the Republican candidates had tds permalink parent award report block reply 1_Badcop 3 points 7 days ago Seriously? \" all Republicans\"? Like Mike Johnson? Almost all republicans in office hate Trump and hate us. The only uniting will be done on behalf of Netanyahu. permalink parent award report block reply henri_derelicte 17 points 7 days ago At least half of what he wants is dead on arrival. We can certainly cut spending, primarily in the form of eliminating Obamacare subsidies and preventing illegals from collecting welfare benefits permalink award report block reply surgeriot 17 points 7 days ago Ok Massie, let's start with you. America First, faggot. permalink award report block reply PunishedOrange 15 points 7 days ago yeah fuck this faggot, he votes for it every time permalink award report block reply ShitFromShinola 7 points 7 days ago Which of his points do you disagree with? permalink parent award report block reply asiandood 1 points 6 days ago See past the facade and start questioning Massie and his 7000 shekels he received from ISLAM: https://patriots.win/p/1ARJhd7zk0/major-ilhan-omar-donor-donates-7/c permalink parent award report block reply Badfinz_FL 13 points 7 days ago Massie is an anti MAGA faggot. There was no \"shellacking\" last night.  It was blue candidates winning in blue states.  Nothing more. permalink award report block reply fr33d0mTruck 13 points 7 days ago define MAGA and why is he anti MAGA? I'm just curious...because if you're against any of the things listed here, wtf kinda drugs are on seriously? permalink parent award report block reply Badfinz_FL 10 points 7 days ago go read his tweets on X. permalink parent award report block reply SanityGumby 2 points 7 days ago Because he literally is and votes against anything good for the country because his financial backers like Muslim terrorists groups, ilhan omar, and the democrat socialists of America tell him to permalink parent award report block reply ReleasetheList 4 points 7 days ago https://thefreedomindex.org/report/scorecard-119-1/chamber/rep/ Is this a Muslim site? He's got a 100% score. permalink parent award report block reply asiandood 1 points 6 days ago Massie received his 7000 shekels from ISLAM: https://patriots.win/p/1ARJhd7zk0/major-ilhan-omar-donor-donates-7/c permalink parent award report block reply TrancePhreak 1 points 7 days ago These kind of sites have a huge flaw in how they calculate. They weight voting for things like \"We Declare: Yay puppies!\" the same as all other legislation. They don't weight up issues like him voting for unlimited funds for Biden with higher weight. permalink parent award report block reply SanityGumby 1 points 6 days ago It must be because he always votes with democrats so by effect it’s impossible for him to score 100% on any freedom scoring that’s real. permalink parent award report block reply Stlpoolguy 1 points 6 days ago The mf'er has voted on D dogshit in the past, and while the Trump budget isn't perfect, it's a step in the right direction. Something we haven't had in decades.... but here's your boy banging his drum like he has no record. I don't dislike the guy but if you aren't flexible in the least...you're gonna break.  That mf'er is broken permalink parent award report block reply ShitFromShinola 2 points 7 days ago Gov. Blumpkin of Virginia would probably disagree with that. permalink parent award report block reply imnotdeadyet 2 points 7 days ago True, but a commie winning in NYC is a wakeup call that the Dems are fucking crazy. permalink parent award report block reply TakingCoatsWIN 7 points 7 days ago DeBlasio was a literal Communist party member.... Mamdani got in because the media destroyed Mayor Adams and the only other option they had was the mass murderer Cuomo who left office in disgrace after he got \"Me Too'd\". permalink parent award report block reply 1_Badcop 2 points 7 days ago If somebody didn't wake up after Biden/Harris, they are permanently comatose. permalink parent award report block reply anotherthing 2 points 7 days ago If they didn't wake up when Democrats let their cities burn to the tune of $4.2 billion in property damage by the end of 2020 or murder elderly people in nursing homes by putting COVID patients in them, Biden/Harris was just a four year long nudging. permalink parent award report block reply imnotdeadyet 2 points 7 days ago I can't argue with you on that! permalink parent award report block reply 24601 8 points 7 days ago Massie is giant faggot.  Busy yapping while doing nothing. permalink award report block reply SanityGumby 6 points 7 days ago This faggot is funded by the same people that funded mamdami. permalink award report block reply 1_Badcop 5 points 7 days ago He's right. And none of those things will happen. permalink award report block reply mlp67 3 points 6 days ago Why didn't Massie ask for the Epstein files the whole 4 years Biden was president? Why now? permalink award report block reply barwhack 3 points 7 days ago Sounds anti-semitic... 😀 permalink award report block reply Grindelwald 3 points 7 days ago Just stop spending money that you have not already collected. permalink award report block reply budgsxr 3 points 6 days ago Massie is a useless shitbag. He says good things but never votes with the President when he needs his vote. The muh principles bullshit. I’m so sick and damn tired of our useless government. It’s done nothing but accelerate this countries destruction. permalink award report block reply donttreadonme1492 2 points 7 days ago Massie is a cuck. He didn't put up a fuss about Epstein until AFTER Joe Biden was out of office. permalink award report block reply Deporter 2 points 7 days ago Why did he leave out ending the filibuster??? permalink award report block reply COnDEMnED 2 points 7 days ago Massie has payments from pro-Israel lobbyists, does he not? What the fuck is he talking about? permalink award report block reply sordfysh PRO 5 points 7 days ago Which orgs fund him that are pro-Israel? Is AIPAC funding him all of a sudden? permalink parent award report block reply SanityGumby 5 points 7 days ago No but ilhan Omar, communists, and Muslim terror groups do permalink parent award report block reply sordfysh PRO 1 points 6 days ago Did the head of Al Qaida in Syria just visit him? permalink parent award report block reply asiandood 2 points 6 days ago Massie received his 7000 shekels from ISLAM: https://patriots.win/p/1ARJhd7zk0/major-ilhan-omar-donor-donates-7/c permalink parent award report block reply TrancePhreak 1 points 7 days ago Jeff Yass funds him. permalink parent award report block reply anotherthing 1 points 7 days ago Jeff Yass also donates to MAGA Inc. $16 million alone in 2025. MAGA Inc was started with $20 million from Trump's very own Save America PAC. permalink parent award report block reply TrancePhreak 2 points 6 days ago Sure, but that doesn't take away from Jeff Yass, a pro-Israel donor, funding him. permalink parent award report block reply sordfysh PRO 0 points 6 days ago Wow. So Jeff Yass is an anti-semite? He clearly funds anti-Zionism. permalink parent award report block reply TrancePhreak 1 points 6 days ago He funds messaging that drives up donations to Zionist PAC's. It's an old trick used by AIPAC and others. Has Massie actually voted for anything of the sort, or is it all just messaging? permalink parent award report block reply deleted 1 points 7 days ago DickTick PRO 2 points 7 days ago Our gas has been around 2.40 to 2.50 here for many months now and that's up in the middle of the city permalink parent award report block reply SanityGumby 2 points 7 days ago Found the idiot too retarded to understand his own problem that the rest of us don’t have permalink parent award report block reply Thereyago 1 points 7 days ago Massie is convincing me on term limits permalink award report block reply eclectic22 1 points 7 days ago The Asshole speaks. permalink award report block reply journalist 1 points 7 days ago Eat a dick Massie permalink award report block reply Obambi 1 points 7 days ago Fuck Israel. Fuck China. Fuck Iran. permalink award report block reply booblitchutz 1 points 6 days ago The GOP lost those races this week because the democrats poured billions into ads, door knockers, ballot harvesting, no kings rallies… they have all the cash they would ever need to outspend us, every single time - without exception. permalink award report block reply CrankyCrab 1 points 7 days ago Yawn... The uniparty peddling fake news in a failed attempt to undermine President Trump.  This clown does nothing but talk. People have short attention spans...let's see what happens in 2026. permalink award report block reply snoozeflu 1 points 7 days ago Should do this. Should do that.\nAnyways. permalink award report block reply deleted 0 points 7 days ago anotherthing -1 points 7 days ago He voted with his party 13 times in September 2025 alone. You can look it up. Congressional record is public, and ignorance is a choice. https://massie.house.gov/voterecord/ Honoring the life and legacy of Charles \"Charlie\" James Kirk. GRID Power Act National Coal Council Reestablishment Act Promoting Cross-border Energy Infrastructure Act District of Columbia Policing Protection Act District of Columbia Judicial Nominations Reform Act Honoring Our Heroes Act of 2025 Territorial Response and Access to Veterans’ Essential Lifecare Act Stop Illegal Entry Act of 2025 Personnel Oversight and Shift Tracking Act of 2025 Shared Property Agency Collaboration and Engagement Act of 2025 Stop Chinese Fentanyl Act of 2025 FMS-Only List Review Act And this doesn't count consideration voting and other procedural votes, just the votes to pass things. permalink parent award report block reply asiandood 0 points 6 days ago Stop Illegal Entry Act of 2025 = defacto amnesty for illegals. Come on, everything you listed does nothing and some are already ILLEGAL, yet why do you need to pass something else?  Its already ILLEGAL. He voted against securing the border and building the wall TWICE. permalink parent award report block reply anotherthing 1 points 6 days ago He cosponsored a bill in 2023 to build a border wall, paying for it by cutting UN funds. He's on board with it when you cut spending from one thing in order to fund it. You guys don't seem to get how bad of a situation our debt is. Our debt is $38T. Our GDP is only $28T. Our spending is around $7T. Our revenue is around $5T. Our deficit is around $2T even with tariffs. The only reason our currency hasn't fallen off a cliff is because it's the defacto currency for trade. If the BRICS nations could actually trust one another, and it replaced the dollars, we'd be in a hyper-inflation death spiral. We currently spend as much on interest on that debt as we do on medicare. We spend 27% more on interest on the debt as we do Defense. Two years ago, interest on the debt was the same as Defense in terms of spending. That's only going up. And the GOP led Congress and Trump are pushing Biden Era spending levels. The GOP used to talk about balancing the budget and cutting spending. It's been years since they've done that. permalink parent award report block reply asiandood 0 points 6 days ago Everything he DOES is on purpose that he knows it will never pass so he can virtue signal as \"principled\". He doesn't care about spending.  Here's an amazing comment I found on a youtube post glazing Massie: THOMAS MASSIE delivered the DECIDING VOTE (7-6) to move the \"Fiscal Responsibility Act of 2023\" out of the House Rules Committee to allow it to come to a full vote in the House. The following day, the \"Principled\" Thomas Massie voted YES to pass this bill, which SUSPENDED the debt ceiling and allowed UNLIMITED BORROWING\nuntil January 1, 2025. He alone had the power to kill that deal in Committee, if he truly cared, yet he passed on that opportunity. That's right. Massie essentially handed Biden a blank check and said \"SPEND AWAY.\" Massie doesn't care about debt, he doesn't care about spending, and he is NOT \"principled.\" https://www.cnbc.com/2023/05/30/debt-ceiling-deal-updates.html Massie's social media in the past and receipts were posted here in the past that Massie did not want to be responsible for a govt shutdown under Biden. permalink parent award report block reply TrancePhreak 0 points 7 days ago Tell Massie to quit blocking Trump's agenda. permalink award report block reply Darkpoisonousshaddow 0 points 7 days ago Why do people hate this guy? I can't imagine anyone not agreeing with these points. permalink award report block reply Mhmm2MoreWeeks -1 points 7 days ago None of this is accurate. permalink award report block reply captflerbus -2 points 7 days ago none of these things are happening guy is a dope permalink award report block reply RyanKeyOh -2 points 7 days ago Eat a dick massie permalink award report block reply tingo999 -10 points 7 days ago What part of not allowing Muslims to dominate Israel is putting Israel before the USA? What is the USA doing in supporting Israel that is harming the USA? Israel is part of Christian history. This dumb fuck is telling us to remove the USA military dominance? Which would allow all of the other global militaries to dominate the world? This guy is a dumb fuck you're all dumb fucks. This is the end of the USA and the world. The USA needs to stay dominate, the USA needs to stop Muslims from dominating every country in the world. This is fucking retarded. permalink award report block reply CommanderOfCheese 9 points 7 days ago The physical land of Israel is where most of the Bible takes place, true. The present occupants, not so much. Their religion not the Father of Christianity; Christianity isn't a derivative branch of Judaism. In fact, it's the other way around -- Judaism is a tyrannical, heretical branch of the original faith given to the children of Adam, which branch has actively suppressed the root. permalink parent award report block reply Tiger5468 -2 points 7 days ago Absolutely correct. But it looks like Mohammad, Mohammad, Mohammad, and Muhammod (variant spelling of Mohammed), all downvoted your post permalink parent award report block reply Agent_86 -11 points 7 days ago How are they putting Israel before America? Is it the on gojng contracts with Israels military? Is it the exchange for advanced tech we get from Israel? You guys keep saying this stupid old trope and all I see is the cheese and whine. Come on ladies do better. Come up with SOMETHING, shit. permalink award report block reply Jaybone86 11 points 7 days ago Ffs you can’t be serious with this shit.  We’ve been paying for a war there for 3 years. permalink parent award report block reply Agent_86 -5 points 7 days ago What does helping an Ally have to with putting Israel first? permalink parent award report block reply Jaybone86 9 points 7 days ago What’s been done on the home front?  How’s those food, energy, and fuel costs going? permalink parent award report block reply Agent_86 -7 points 7 days ago Who is Israel to God? His promised ones right? The apple of His eye even. We bless israel we are blessed of God. He said as much. Also by His grace I'm doing very well. I don't even work. God is good bud. permalink parent award report block reply view 56 more comments... ReleasetheList 4 points 7 days ago They have no formal treaty with the US. They aren't obligated to come to our defense if we are attacked. We've given them an average of $3 Billion in tax payer money every year for the last 30 years, while they have free healthcare and subsidized higher education. What do we get in return other than dragged into their conflicts to spend over $4 trilion on a decades long occupation just to give the country back to the people we got into war with in the first place? permalink parent award report block reply TonyTheSlop 4 points 7 days ago Uh you mean our greatest alley that has blackmailed all of congress damn near? Is that the advanced tech? permalink parent award report block reply Agent_86 -1 points 7 days ago Well prove it. Where's your evidence. I've seen accusations like this on white supremacist websites, so pardon me if i don't bite. permalink parent award report block reply Jaybone86 1 points 6 days ago They don’t get warnings every damn day for an invasion force 10000 strong.  You are talking to someone with an intelligence level slightly above a slug you can’t call missing an invasion force 10k strong a mistake and be credible. permalink parent award report block reply Agent_86 1 points 6 days ago Yes Egypt did warn Israel that “an explosion” or major escalation was imminent from Gaza a few days before October 7. I agree with you. However, the warning was general rather than specific. Israel denies receiving a detailed operational warning. If you are using this for argument or discussion, you should note both the existence of the warning and the ambiguity surrounding its specificity and Israel’s response. Don't u think? permalink parent award report block reply Jaybone86 1 points 6 days ago Thinking the armed forces should have been on alert isn’t asking much.   Israel had other intelligence agencies telling them something was coming they also had the SIM card activation that they saw in volume right before the attacks.  Failing to change the alert level of the armed forces on just this alone is unforgivable much less what their own intelligence agency likely saw. permalink parent award report block reply Agent_86 1 points 6 days ago That's not what yhe warning said. permalink parent award report block reply\nChyNahAzzWhole1 37 points 7 days ago Stop being MIGA and start supporting MAGA. permalink award report block reply UCantStumpTheTrump 12 points 7 days ago It’s not even a shellacking, lmao. Dems won in blue states with no voter ID. Shocking! permalink parent award report block reply\nUCantStumpTheTrump 12 points 7 days ago It’s not even a shellacking, lmao. Dems won in blue states with no voter ID. Shocking! permalink parent award report block reply\nLostElf 25 points 7 days ago Shellacking. Jesus H. Did he expect Sliwa to be the next NYC mayor? Did the GOP lift a finger to help any Republicans in any of these races? All I saw was Scott Presler and X pundits. How about all Republicans unite to push President Trump's platform on overdrive so midterms feature secure elections and a shattered Democrat party with half their leaders behind bars. Then Massie's wishlist can be addressed with a vengeance. permalink award report block reply SanityGumby 12 points 7 days ago All of the Republican candidates had tds permalink parent award report block reply 1_Badcop 3 points 7 days ago Seriously? \" all Republicans\"? Like Mike Johnson? Almost all republicans in office hate Trump and hate us. The only uniting will be done on behalf of Netanyahu. permalink parent award report block reply\nSanityGumby 12 points 7 days ago All of the Republican candidates had tds permalink parent award report block reply\n1_Badcop 3 points 7 days ago Seriously? \" all Republicans\"? Like Mike Johnson? Almost all republicans in office hate Trump and hate us. The only uniting will be done on behalf of Netanyahu. permalink parent award report block reply\nhenri_derelicte 17 points 7 days ago At least half of what he wants is dead on arrival. We can certainly cut spending, primarily in the form of eliminating Obamacare subsidies and preventing illegals from collecting welfare benefits permalink award report block reply\nsurgeriot 17 points 7 days ago Ok Massie, let's start with you. America First, faggot. permalink award report block reply\nPunishedOrange 15 points 7 days ago yeah fuck this faggot, he votes for it every time permalink award report block reply ShitFromShinola 7 points 7 days ago Which of his points do you disagree with? permalink parent award report block reply asiandood 1 points 6 days ago See past the facade and start questioning Massie and his 7000 shekels he received from ISLAM: https://patriots.win/p/1ARJhd7zk0/major-ilhan-omar-donor-donates-7/c permalink parent award report block reply\nShitFromShinola 7 points 7 days ago Which of his points do you disagree with? permalink parent award report block reply asiandood 1 points 6 days ago See past the facade and start questioning Massie and his 7000 shekels he received from ISLAM: https://patriots.win/p/1ARJhd7zk0/major-ilhan-omar-donor-donates-7/c permalink parent award report block reply\nasiandood 1 points 6 days ago See past the facade and start questioning Massie and his 7000 shekels he received from ISLAM: https://patriots.win/p/1ARJhd7zk0/major-ilhan-omar-donor-donates-7/c permalink parent award report block reply\nBadfinz_FL 13 points 7 days ago Massie is an anti MAGA faggot. There was no \"shellacking\" last night.  It was blue candidates winning in blue states.  Nothing more. permalink award report block reply fr33d0mTruck 13 points 7 days ago define MAGA and why is he anti MAGA? I'm just curious...because if you're against any of the things listed here, wtf kinda drugs are on seriously? permalink parent award report block reply Badfinz_FL 10 points 7 days ago go read his tweets on X. permalink parent award report block reply SanityGumby 2 points 7 days ago Because he literally is and votes against anything good for the country because his financial backers like Muslim terrorists groups, ilhan omar, and the democrat socialists of America tell him to permalink parent award report block reply ReleasetheList 4 points 7 days ago https://thefreedomindex.org/report/scorecard-119-1/chamber/rep/ Is this a Muslim site? He's got a 100% score. permalink parent award report block reply asiandood 1 points 6 days ago Massie received his 7000 shekels from ISLAM: https://patriots.win/p/1ARJhd7zk0/major-ilhan-omar-donor-donates-7/c permalink parent award report block reply TrancePhreak 1 points 7 days ago These kind of sites have a huge flaw in how they calculate. They weight voting for things like \"We Declare: Yay puppies!\" the same as all other legislation. They don't weight up issues like him voting for unlimited funds for Biden with higher weight. permalink parent award report block reply SanityGumby 1 points 6 days ago It must be because he always votes with democrats so by effect it’s impossible for him to score 100% on any freedom scoring that’s real. permalink parent award report block reply Stlpoolguy 1 points 6 days ago The mf'er has voted on D dogshit in the past, and while the Trump budget isn't perfect, it's a step in the right direction. Something we haven't had in decades.... but here's your boy banging his drum like he has no record. I don't dislike the guy but if you aren't flexible in the least...you're gonna break.  That mf'er is broken permalink parent award report block reply ShitFromShinola 2 points 7 days ago Gov. Blumpkin of Virginia would probably disagree with that. permalink parent award report block reply imnotdeadyet 2 points 7 days ago True, but a commie winning in NYC is a wakeup call that the Dems are fucking crazy. permalink parent award report block reply TakingCoatsWIN 7 points 7 days ago DeBlasio was a literal Communist party member.... Mamdani got in because the media destroyed Mayor Adams and the only other option they had was the mass murderer Cuomo who left office in disgrace after he got \"Me Too'd\". permalink parent award report block reply 1_Badcop 2 points 7 days ago If somebody didn't wake up after Biden/Harris, they are permanently comatose. permalink parent award report block reply anotherthing 2 points 7 days ago If they didn't wake up when Democrats let their cities burn to the tune of $4.2 billion in property damage by the end of 2020 or murder elderly people in nursing homes by putting COVID patients in them, Biden/Harris was just a four year long nudging. permalink parent award report block reply imnotdeadyet 2 points 7 days ago I can't argue with you on that! permalink parent award report block reply\nfr33d0mTruck 13 points 7 days ago define MAGA and why is he anti MAGA? I'm just curious...because if you're against any of the things listed here, wtf kinda drugs are on seriously? permalink parent award report block reply Badfinz_FL 10 points 7 days ago go read his tweets on X. permalink parent award report block reply SanityGumby 2 points 7 days ago Because he literally is and votes against anything good for the country because his financial backers like Muslim terrorists groups, ilhan omar, and the democrat socialists of America tell him to permalink parent award report block reply ReleasetheList 4 points 7 days ago https://thefreedomindex.org/report/scorecard-119-1/chamber/rep/ Is this a Muslim site? He's got a 100% score. permalink parent award report block reply asiandood 1 points 6 days ago Massie received his 7000 shekels from ISLAM: https://patriots.win/p/1ARJhd7zk0/major-ilhan-omar-donor-donates-7/c permalink parent award report block reply TrancePhreak 1 points 7 days ago These kind of sites have a huge flaw in how they calculate. They weight voting for things like \"We Declare: Yay puppies!\" the same as all other legislation. They don't weight up issues like him voting for unlimited funds for Biden with higher weight. permalink parent award report block reply SanityGumby 1 points 6 days ago It must be because he always votes with democrats so by effect it’s impossible for him to score 100% on any freedom scoring that’s real. permalink parent award report block reply Stlpoolguy 1 points 6 days ago The mf'er has voted on D dogshit in the past, and while the Trump budget isn't perfect, it's a step in the right direction. Something we haven't had in decades.... but here's your boy banging his drum like he has no record. I don't dislike the guy but if you aren't flexible in the least...you're gonna break.  That mf'er is broken permalink parent award report block reply\nBadfinz_FL 10 points 7 days ago go read his tweets on X. permalink parent award report block reply\nSanityGumby 2 points 7 days ago Because he literally is and votes against anything good for the country because his financial backers like Muslim terrorists groups, ilhan omar, and the democrat socialists of America tell him to permalink parent award report block reply ReleasetheList 4 points 7 days ago https://thefreedomindex.org/report/scorecard-119-1/chamber/rep/ Is this a Muslim site? He's got a 100% score. permalink parent award report block reply asiandood 1 points 6 days ago Massie received his 7000 shekels from ISLAM: https://patriots.win/p/1ARJhd7zk0/major-ilhan-omar-donor-donates-7/c permalink parent award report block reply TrancePhreak 1 points 7 days ago These kind of sites have a huge flaw in how they calculate. They weight voting for things like \"We Declare: Yay puppies!\" the same as all other legislation. They don't weight up issues like him voting for unlimited funds for Biden with higher weight. permalink parent award report block reply SanityGumby 1 points 6 days ago It must be because he always votes with democrats so by effect it’s impossible for him to score 100% on any freedom scoring that’s real. permalink parent award report block reply\nReleasetheList 4 points 7 days ago https://thefreedomindex.org/report/scorecard-119-1/chamber/rep/ Is this a Muslim site? He's got a 100% score. permalink parent award report block reply asiandood 1 points 6 days ago Massie received his 7000 shekels from ISLAM: https://patriots.win/p/1ARJhd7zk0/major-ilhan-omar-donor-donates-7/c permalink parent award report block reply TrancePhreak 1 points 7 days ago These kind of sites have a huge flaw in how they calculate. They weight voting for things like \"We Declare: Yay puppies!\" the same as all other legislation. They don't weight up issues like him voting for unlimited funds for Biden with higher weight. permalink parent award report block reply SanityGumby 1 points 6 days ago It must be because he always votes with democrats so by effect it’s impossible for him to score 100% on any freedom scoring that’s real. permalink parent award report block reply\nasiandood 1 points 6 days ago Massie received his 7000 shekels from ISLAM: https://patriots.win/p/1ARJhd7zk0/major-ilhan-omar-donor-donates-7/c permalink parent award report block reply\nTrancePhreak 1 points 7 days ago These kind of sites have a huge flaw in how they calculate. They weight voting for things like \"We Declare: Yay puppies!\" the same as all other legislation. They don't weight up issues like him voting for unlimited funds for Biden with higher weight. permalink parent award report block reply\nSanityGumby 1 points 6 days ago It must be because he always votes with democrats so by effect it’s impossible for him to score 100% on any freedom scoring that’s real. permalink parent award report block reply\nStlpoolguy 1 points 6 days ago The mf'er has voted on D dogshit in the past, and while the Trump budget isn't perfect, it's a step in the right direction. Something we haven't had in decades.... but here's your boy banging his drum like he has no record. I don't dislike the guy but if you aren't flexible in the least...you're gonna break.  That mf'er is broken permalink parent award report block reply\nShitFromShinola 2 points 7 days ago Gov. Blumpkin of Virginia would probably disagree with that. permalink parent award report block reply\nimnotdeadyet 2 points 7 days ago True, but a commie winning in NYC is a wakeup call that the Dems are fucking crazy. permalink parent award report block reply TakingCoatsWIN 7 points 7 days ago DeBlasio was a literal Communist party member.... Mamdani got in because the media destroyed Mayor Adams and the only other option they had was the mass murderer Cuomo who left office in disgrace after he got \"Me Too'd\". permalink parent award report block reply 1_Badcop 2 points 7 days ago If somebody didn't wake up after Biden/Harris, they are permanently comatose. permalink parent award report block reply anotherthing 2 points 7 days ago If they didn't wake up when Democrats let their cities burn to the tune of $4.2 billion in property damage by the end of 2020 or murder elderly people in nursing homes by putting COVID patients in them, Biden/Harris was just a four year long nudging. permalink parent award report block reply imnotdeadyet 2 points 7 days ago I can't argue with you on that! permalink parent award report block reply\nTakingCoatsWIN 7 points 7 days ago DeBlasio was a literal Communist party member.... Mamdani got in because the media destroyed Mayor Adams and the only other option they had was the mass murderer Cuomo who left office in disgrace after he got \"Me Too'd\". permalink parent award report block reply\n1_Badcop 2 points 7 days ago If somebody didn't wake up after Biden/Harris, they are permanently comatose. permalink parent award report block reply anotherthing 2 points 7 days ago If they didn't wake up when Democrats let their cities burn to the tune of $4.2 billion in property damage by the end of 2020 or murder elderly people in nursing homes by putting COVID patients in them, Biden/Harris was just a four year long nudging. permalink parent award report block reply imnotdeadyet 2 points 7 days ago I can't argue with you on that! permalink parent award report block reply\nanotherthing 2 points 7 days ago If they didn't wake up when Democrats let their cities burn to the tune of $4.2 billion in property damage by the end of 2020 or murder elderly people in nursing homes by putting COVID patients in them, Biden/Harris was just a four year long nudging. permalink parent award report block reply\nimnotdeadyet 2 points 7 days ago I can't argue with you on that! permalink parent award report block reply\n24601 8 points 7 days ago Massie is giant faggot.  Busy yapping while doing nothing. permalink award report block reply\nSanityGumby 6 points 7 days ago This faggot is funded by the same people that funded mamdami. permalink award report block reply\n1_Badcop 5 points 7 days ago He's right. And none of those things will happen. permalink award report block reply\nmlp67 3 points 6 days ago Why didn't Massie ask for the Epstein files the whole 4 years Biden was president? Why now? permalink award report block reply\nbarwhack 3 points 7 days ago Sounds anti-semitic... 😀 permalink award report block reply\nGrindelwald 3 points 7 days ago Just stop spending money that you have not already collected. permalink award report block reply\nbudgsxr 3 points 6 days ago Massie is a useless shitbag. He says good things but never votes with the President when he needs his vote. The muh principles bullshit. I’m so sick and damn tired of our useless government. It’s done nothing but accelerate this countries destruction. permalink award report block reply\ndonttreadonme1492 2 points 7 days ago Massie is a cuck. He didn't put up a fuss about Epstein until AFTER Joe Biden was out of office. permalink award report block reply\nDeporter 2 points 7 days ago Why did he leave out ending the filibuster??? permalink award report block reply\nCOnDEMnED 2 points 7 days ago Massie has payments from pro-Israel lobbyists, does he not? What the fuck is he talking about? permalink award report block reply sordfysh PRO 5 points 7 days ago Which orgs fund him that are pro-Israel? Is AIPAC funding him all of a sudden? permalink parent award report block reply SanityGumby 5 points 7 days ago No but ilhan Omar, communists, and Muslim terror groups do permalink parent award report block reply sordfysh PRO 1 points 6 days ago Did the head of Al Qaida in Syria just visit him? permalink parent award report block reply asiandood 2 points 6 days ago Massie received his 7000 shekels from ISLAM: https://patriots.win/p/1ARJhd7zk0/major-ilhan-omar-donor-donates-7/c permalink parent award report block reply TrancePhreak 1 points 7 days ago Jeff Yass funds him. permalink parent award report block reply anotherthing 1 points 7 days ago Jeff Yass also donates to MAGA Inc. $16 million alone in 2025. MAGA Inc was started with $20 million from Trump's very own Save America PAC. permalink parent award report block reply TrancePhreak 2 points 6 days ago Sure, but that doesn't take away from Jeff Yass, a pro-Israel donor, funding him. permalink parent award report block reply sordfysh PRO 0 points 6 days ago Wow. So Jeff Yass is an anti-semite? He clearly funds anti-Zionism. permalink parent award report block reply TrancePhreak 1 points 6 days ago He funds messaging that drives up donations to Zionist PAC's. It's an old trick used by AIPAC and others. Has Massie actually voted for anything of the sort, or is it all just messaging? permalink parent award report block reply\nsordfysh PRO 5 points 7 days ago Which orgs fund him that are pro-Israel? Is AIPAC funding him all of a sudden? permalink parent award report block reply SanityGumby 5 points 7 days ago No but ilhan Omar, communists, and Muslim terror groups do permalink parent award report block reply sordfysh PRO 1 points 6 days ago Did the head of Al Qaida in Syria just visit him? permalink parent award report block reply asiandood 2 points 6 days ago Massie received his 7000 shekels from ISLAM: https://patriots.win/p/1ARJhd7zk0/major-ilhan-omar-donor-donates-7/c permalink parent award report block reply TrancePhreak 1 points 7 days ago Jeff Yass funds him. permalink parent award report block reply anotherthing 1 points 7 days ago Jeff Yass also donates to MAGA Inc. $16 million alone in 2025. MAGA Inc was started with $20 million from Trump's very own Save America PAC. permalink parent award report block reply TrancePhreak 2 points 6 days ago Sure, but that doesn't take away from Jeff Yass, a pro-Israel donor, funding him. permalink parent award report block reply sordfysh PRO 0 points 6 days ago Wow. So Jeff Yass is an anti-semite? He clearly funds anti-Zionism. permalink parent award report block reply TrancePhreak 1 points 6 days ago He funds messaging that drives up donations to Zionist PAC's. It's an old trick used by AIPAC and others. Has Massie actually voted for anything of the sort, or is it all just messaging? permalink parent award report block reply\nSanityGumby 5 points 7 days ago No but ilhan Omar, communists, and Muslim terror groups do permalink parent award report block reply sordfysh PRO 1 points 6 days ago Did the head of Al Qaida in Syria just visit him? permalink parent award report block reply\nsordfysh PRO 1 points 6 days ago Did the head of Al Qaida in Syria just visit him? permalink parent award report block reply\nasiandood 2 points 6 days ago Massie received his 7000 shekels from ISLAM: https://patriots.win/p/1ARJhd7zk0/major-ilhan-omar-donor-donates-7/c permalink parent award report block reply\nTrancePhreak 1 points 7 days ago Jeff Yass funds him. permalink parent award report block reply anotherthing 1 points 7 days ago Jeff Yass also donates to MAGA Inc. $16 million alone in 2025. MAGA Inc was started with $20 million from Trump's very own Save America PAC. permalink parent award report block reply TrancePhreak 2 points 6 days ago Sure, but that doesn't take away from Jeff Yass, a pro-Israel donor, funding him. permalink parent award report block reply sordfysh PRO 0 points 6 days ago Wow. So Jeff Yass is an anti-semite? He clearly funds anti-Zionism. permalink parent award report block reply TrancePhreak 1 points 6 days ago He funds messaging that drives up donations to Zionist PAC's. It's an old trick used by AIPAC and others. Has Massie actually voted for anything of the sort, or is it all just messaging? permalink parent award report block reply\nanotherthing 1 points 7 days ago Jeff Yass also donates to MAGA Inc. $16 million alone in 2025. MAGA Inc was started with $20 million from Trump's very own Save America PAC. permalink parent award report block reply TrancePhreak 2 points 6 days ago Sure, but that doesn't take away from Jeff Yass, a pro-Israel donor, funding him. permalink parent award report block reply\nTrancePhreak 2 points 6 days ago Sure, but that doesn't take away from Jeff Yass, a pro-Israel donor, funding him. permalink parent award report block reply\nsordfysh PRO 0 points 6 days ago Wow. So Jeff Yass is an anti-semite? He clearly funds anti-Zionism. permalink parent award report block reply TrancePhreak 1 points 6 days ago He funds messaging that drives up donations to Zionist PAC's. It's an old trick used by AIPAC and others. Has Massie actually voted for anything of the sort, or is it all just messaging? permalink parent award report block reply\nTrancePhreak 1 points 6 days ago He funds messaging that drives up donations to Zionist PAC's. It's an old trick used by AIPAC and others. Has Massie actually voted for anything of the sort, or is it all just messaging? permalink parent award report block reply\ndeleted 1 points 7 days ago DickTick PRO 2 points 7 days ago Our gas has been around 2.40 to 2.50 here for many months now and that's up in the middle of the city permalink parent award report block reply SanityGumby 2 points 7 days ago Found the idiot too retarded to understand his own problem that the rest of us don’t have permalink parent award report block reply\nDickTick PRO 2 points 7 days ago Our gas has been around 2.40 to 2.50 here for many months now and that's up in the middle of the city permalink parent award report block reply\nSanityGumby 2 points 7 days ago Found the idiot too retarded to understand his own problem that the rest of us don’t have permalink parent award report block reply\nThereyago 1 points 7 days ago Massie is convincing me on term limits permalink award report block reply\neclectic22 1 points 7 days ago The Asshole speaks. permalink award report block reply\njournalist 1 points 7 days ago Eat a dick Massie permalink award report block reply\nObambi 1 points 7 days ago Fuck Israel. Fuck China. Fuck Iran. permalink award report block reply\nbooblitchutz 1 points 6 days ago The GOP lost those races this week because the democrats poured billions into ads, door knockers, ballot harvesting, no kings rallies… they have all the cash they would ever need to outspend us, every single time - without exception. permalink award report block reply\nCrankyCrab 1 points 7 days ago Yawn... The uniparty peddling fake news in a failed attempt to undermine President Trump.  This clown does nothing but talk. People have short attention spans...let's see what happens in 2026. permalink award report block reply\nsnoozeflu 1 points 7 days ago Should do this. Should do that.\nAnyways. permalink award report block reply\ndeleted 0 points 7 days ago anotherthing -1 points 7 days ago He voted with his party 13 times in September 2025 alone. You can look it up. Congressional record is public, and ignorance is a choice. https://massie.house.gov/voterecord/ Honoring the life and legacy of Charles \"Charlie\" James Kirk. GRID Power Act National Coal Council Reestablishment Act Promoting Cross-border Energy Infrastructure Act District of Columbia Policing Protection Act District of Columbia Judicial Nominations Reform Act Honoring Our Heroes Act of 2025 Territorial Response and Access to Veterans’ Essential Lifecare Act Stop Illegal Entry Act of 2025 Personnel Oversight and Shift Tracking Act of 2025 Shared Property Agency Collaboration and Engagement Act of 2025 Stop Chinese Fentanyl Act of 2025 FMS-Only List Review Act And this doesn't count consideration voting and other procedural votes, just the votes to pass things. permalink parent award report block reply asiandood 0 points 6 days ago Stop Illegal Entry Act of 2025 = defacto amnesty for illegals. Come on, everything you listed does nothing and some are already ILLEGAL, yet why do you need to pass something else?  Its already ILLEGAL. He voted against securing the border and building the wall TWICE. permalink parent award report block reply anotherthing 1 points 6 days ago He cosponsored a bill in 2023 to build a border wall, paying for it by cutting UN funds. He's on board with it when you cut spending from one thing in order to fund it. You guys don't seem to get how bad of a situation our debt is. Our debt is $38T. Our GDP is only $28T. Our spending is around $7T. Our revenue is around $5T. Our deficit is around $2T even with tariffs. The only reason our currency hasn't fallen off a cliff is because it's the defacto currency for trade. If the BRICS nations could actually trust one another, and it replaced the dollars, we'd be in a hyper-inflation death spiral. We currently spend as much on interest on that debt as we do on medicare. We spend 27% more on interest on the debt as we do Defense. Two years ago, interest on the debt was the same as Defense in terms of spending. That's only going up. And the GOP led Congress and Trump are pushing Biden Era spending levels. The GOP used to talk about balancing the budget and cutting spending. It's been years since they've done that. permalink parent award report block reply asiandood 0 points 6 days ago Everything he DOES is on purpose that he knows it will never pass so he can virtue signal as \"principled\". He doesn't care about spending.  Here's an amazing comment I found on a youtube post glazing Massie: THOMAS MASSIE delivered the DECIDING VOTE (7-6) to move the \"Fiscal Responsibility Act of 2023\" out of the House Rules Committee to allow it to come to a full vote in the House. The following day, the \"Principled\" Thomas Massie voted YES to pass this bill, which SUSPENDED the debt ceiling and allowed UNLIMITED BORROWING\nuntil January 1, 2025. He alone had the power to kill that deal in Committee, if he truly cared, yet he passed on that opportunity. That's right. Massie essentially handed Biden a blank check and said \"SPEND AWAY.\" Massie doesn't care about debt, he doesn't care about spending, and he is NOT \"principled.\" https://www.cnbc.com/2023/05/30/debt-ceiling-deal-updates.html Massie's social media in the past and receipts were posted here in the past that Massie did not want to be responsible for a govt shutdown under Biden. permalink parent award report block reply\nanotherthing -1 points 7 days ago He voted with his party 13 times in September 2025 alone. You can look it up. Congressional record is public, and ignorance is a choice. https://massie.house.gov/voterecord/ Honoring the life and legacy of Charles \"Charlie\" James Kirk. GRID Power Act National Coal Council Reestablishment Act Promoting Cross-border Energy Infrastructure Act District of Columbia Policing Protection Act District of Columbia Judicial Nominations Reform Act Honoring Our Heroes Act of 2025 Territorial Response and Access to Veterans’ Essential Lifecare Act Stop Illegal Entry Act of 2025 Personnel Oversight and Shift Tracking Act of 2025 Shared Property Agency Collaboration and Engagement Act of 2025 Stop Chinese Fentanyl Act of 2025 FMS-Only List Review Act And this doesn't count consideration voting and other procedural votes, just the votes to pass things. permalink parent award report block reply asiandood 0 points 6 days ago Stop Illegal Entry Act of 2025 = defacto amnesty for illegals. Come on, everything you listed does nothing and some are already ILLEGAL, yet why do you need to pass something else?  Its already ILLEGAL. He voted against securing the border and building the wall TWICE. permalink parent award report block reply anotherthing 1 points 6 days ago He cosponsored a bill in 2023 to build a border wall, paying for it by cutting UN funds. He's on board with it when you cut spending from one thing in order to fund it. You guys don't seem to get how bad of a situation our debt is. Our debt is $38T. Our GDP is only $28T. Our spending is around $7T. Our revenue is around $5T. Our deficit is around $2T even with tariffs. The only reason our currency hasn't fallen off a cliff is because it's the defacto currency for trade. If the BRICS nations could actually trust one another, and it replaced the dollars, we'd be in a hyper-inflation death spiral. We currently spend as much on interest on that debt as we do on medicare. We spend 27% more on interest on the debt as we do Defense. Two years ago, interest on the debt was the same as Defense in terms of spending. That's only going up. And the GOP led Congress and Trump are pushing Biden Era spending levels. The GOP used to talk about balancing the budget and cutting spending. It's been years since they've done that. permalink parent award report block reply asiandood 0 points 6 days ago Everything he DOES is on purpose that he knows it will never pass so he can virtue signal as \"principled\". He doesn't care about spending.  Here's an amazing comment I found on a youtube post glazing Massie: THOMAS MASSIE delivered the DECIDING VOTE (7-6) to move the \"Fiscal Responsibility Act of 2023\" out of the House Rules Committee to allow it to come to a full vote in the House. The following day, the \"Principled\" Thomas Massie voted YES to pass this bill, which SUSPENDED the debt ceiling and allowed UNLIMITED BORROWING\nuntil January 1, 2025. He alone had the power to kill that deal in Committee, if he truly cared, yet he passed on that opportunity. That's right. Massie essentially handed Biden a blank check and said \"SPEND AWAY.\" Massie doesn't care about debt, he doesn't care about spending, and he is NOT \"principled.\" https://www.cnbc.com/2023/05/30/debt-ceiling-deal-updates.html Massie's social media in the past and receipts were posted here in the past that Massie did not want to be responsible for a govt shutdown under Biden. permalink parent award report block reply\nasiandood 0 points 6 days ago Stop Illegal Entry Act of 2025 = defacto amnesty for illegals. Come on, everything you listed does nothing and some are already ILLEGAL, yet why do you need to pass something else?  Its already ILLEGAL. He voted against securing the border and building the wall TWICE. permalink parent award report block reply anotherthing 1 points 6 days ago He cosponsored a bill in 2023 to build a border wall, paying for it by cutting UN funds. He's on board with it when you cut spending from one thing in order to fund it. You guys don't seem to get how bad of a situation our debt is. Our debt is $38T. Our GDP is only $28T. Our spending is around $7T. Our revenue is around $5T. Our deficit is around $2T even with tariffs. The only reason our currency hasn't fallen off a cliff is because it's the defacto currency for trade. If the BRICS nations could actually trust one another, and it replaced the dollars, we'd be in a hyper-inflation death spiral. We currently spend as much on interest on that debt as we do on medicare. We spend 27% more on interest on the debt as we do Defense. Two years ago, interest on the debt was the same as Defense in terms of spending. That's only going up. And the GOP led Congress and Trump are pushing Biden Era spending levels. The GOP used to talk about balancing the budget and cutting spending. It's been years since they've done that. permalink parent award report block reply asiandood 0 points 6 days ago Everything he DOES is on purpose that he knows it will never pass so he can virtue signal as \"principled\". He doesn't care about spending.  Here's an amazing comment I found on a youtube post glazing Massie: THOMAS MASSIE delivered the DECIDING VOTE (7-6) to move the \"Fiscal Responsibility Act of 2023\" out of the House Rules Committee to allow it to come to a full vote in the House. The following day, the \"Principled\" Thomas Massie voted YES to pass this bill, which SUSPENDED the debt ceiling and allowed UNLIMITED BORROWING\nuntil January 1, 2025. He alone had the power to kill that deal in Committee, if he truly cared, yet he passed on that opportunity. That's right. Massie essentially handed Biden a blank check and said \"SPEND AWAY.\" Massie doesn't care about debt, he doesn't care about spending, and he is NOT \"principled.\" https://www.cnbc.com/2023/05/30/debt-ceiling-deal-updates.html Massie's social media in the past and receipts were posted here in the past that Massie did not want to be responsible for a govt shutdown under Biden. permalink parent award report block reply\nanotherthing 1 points 6 days ago He cosponsored a bill in 2023 to build a border wall, paying for it by cutting UN funds. He's on board with it when you cut spending from one thing in order to fund it. You guys don't seem to get how bad of a situation our debt is. Our debt is $38T. Our GDP is only $28T. Our spending is around $7T. Our revenue is around $5T. Our deficit is around $2T even with tariffs. The only reason our currency hasn't fallen off a cliff is because it's the defacto currency for trade. If the BRICS nations could actually trust one another, and it replaced the dollars, we'd be in a hyper-inflation death spiral. We currently spend as much on interest on that debt as we do on medicare. We spend 27% more on interest on the debt as we do Defense. Two years ago, interest on the debt was the same as Defense in terms of spending. That's only going up. And the GOP led Congress and Trump are pushing Biden Era spending levels. The GOP used to talk about balancing the budget and cutting spending. It's been years since they've done that. permalink parent award report block reply asiandood 0 points 6 days ago Everything he DOES is on purpose that he knows it will never pass so he can virtue signal as \"principled\". He doesn't care about spending.  Here's an amazing comment I found on a youtube post glazing Massie: THOMAS MASSIE delivered the DECIDING VOTE (7-6) to move the \"Fiscal Responsibility Act of 2023\" out of the House Rules Committee to allow it to come to a full vote in the House. The following day, the \"Principled\" Thomas Massie voted YES to pass this bill, which SUSPENDED the debt ceiling and allowed UNLIMITED BORROWING\nuntil January 1, 2025. He alone had the power to kill that deal in Committee, if he truly cared, yet he passed on that opportunity. That's right. Massie essentially handed Biden a blank check and said \"SPEND AWAY.\" Massie doesn't care about debt, he doesn't care about spending, and he is NOT \"principled.\" https://www.cnbc.com/2023/05/30/debt-ceiling-deal-updates.html Massie's social media in the past and receipts were posted here in the past that Massie did not want to be responsible for a govt shutdown under Biden. permalink parent award report block reply\nasiandood 0 points 6 days ago Everything he DOES is on purpose that he knows it will never pass so he can virtue signal as \"principled\". He doesn't care about spending.  Here's an amazing comment I found on a youtube post glazing Massie: THOMAS MASSIE delivered the DECIDING VOTE (7-6) to move the \"Fiscal Responsibility Act of 2023\" out of the House Rules Committee to allow it to come to a full vote in the House. The following day, the \"Principled\" Thomas Massie voted YES to pass this bill, which SUSPENDED the debt ceiling and allowed UNLIMITED BORROWING\nuntil January 1, 2025. He alone had the power to kill that deal in Committee, if he truly cared, yet he passed on that opportunity. That's right. Massie essentially handed Biden a blank check and said \"SPEND AWAY.\" Massie doesn't care about debt, he doesn't care about spending, and he is NOT \"principled.\" https://www.cnbc.com/2023/05/30/debt-ceiling-deal-updates.html Massie's social media in the past and receipts were posted here in the past that Massie did not want to be responsible for a govt shutdown under Biden. permalink parent award report block reply\nTrancePhreak 0 points 7 days ago Tell Massie to quit blocking Trump's agenda. permalink award report block reply\nDarkpoisonousshaddow 0 points 7 days ago Why do people hate this guy? I can't imagine anyone not agreeing with these points. permalink award report block reply\nMhmm2MoreWeeks -1 points 7 days ago None of this is accurate. permalink award report block reply\ncaptflerbus -2 points 7 days ago none of these things are happening guy is a dope permalink award report block reply\nRyanKeyOh -2 points 7 days ago Eat a dick massie permalink award report block reply\ntingo999 -10 points 7 days ago What part of not allowing Muslims to dominate Israel is putting Israel before the USA? What is the USA doing in supporting Israel that is harming the USA? Israel is part of Christian history. This dumb fuck is telling us to remove the USA military dominance? Which would allow all of the other global militaries to dominate the world? This guy is a dumb fuck you're all dumb fucks. This is the end of the USA and the world. The USA needs to stay dominate, the USA needs to stop Muslims from dominating every country in the world. This is fucking retarded. permalink award report block reply CommanderOfCheese 9 points 7 days ago The physical land of Israel is where most of the Bible takes place, true. The present occupants, not so much. Their religion not the Father of Christianity; Christianity isn't a derivative branch of Judaism. In fact, it's the other way around -- Judaism is a tyrannical, heretical branch of the original faith given to the children of Adam, which branch has actively suppressed the root. permalink parent award report block reply Tiger5468 -2 points 7 days ago Absolutely correct. But it looks like Mohammad, Mohammad, Mohammad, and Muhammod (variant spelling of Mohammed), all downvoted your post permalink parent award report block reply\nCommanderOfCheese 9 points 7 days ago The physical land of Israel is where most of the Bible takes place, true. The present occupants, not so much. Their religion not the Father of Christianity; Christianity isn't a derivative branch of Judaism. In fact, it's the other way around -- Judaism is a tyrannical, heretical branch of the original faith given to the children of Adam, which branch has actively suppressed the root. permalink parent award report block reply\nTiger5468 -2 points 7 days ago Absolutely correct. But it looks like Mohammad, Mohammad, Mohammad, and Muhammod (variant spelling of Mohammed), all downvoted your post permalink parent award report block reply\nAgent_86 -11 points 7 days ago How are they putting Israel before America? Is it the on gojng contracts with Israels military? Is it the exchange for advanced tech we get from Israel? You guys keep saying this stupid old trope and all I see is the cheese and whine. Come on ladies do better. Come up with SOMETHING, shit. permalink award report block reply Jaybone86 11 points 7 days ago Ffs you can’t be serious with this shit.  We’ve been paying for a war there for 3 years. permalink parent award report block reply Agent_86 -5 points 7 days ago What does helping an Ally have to with putting Israel first? permalink parent award report block reply Jaybone86 9 points 7 days ago What’s been done on the home front?  How’s those food, energy, and fuel costs going? permalink parent award report block reply Agent_86 -7 points 7 days ago Who is Israel to God? His promised ones right? The apple of His eye even. We bless israel we are blessed of God. He said as much. Also by His grace I'm doing very well. I don't even work. God is good bud. permalink parent award report block reply view 56 more comments... ReleasetheList 4 points 7 days ago They have no formal treaty with the US. They aren't obligated to come to our defense if we are attacked. We've given them an average of $3 Billion in tax payer money every year for the last 30 years, while they have free healthcare and subsidized higher education. What do we get in return other than dragged into their conflicts to spend over $4 trilion on a decades long occupation just to give the country back to the people we got into war with in the first place? permalink parent award report block reply TonyTheSlop 4 points 7 days ago Uh you mean our greatest alley that has blackmailed all of congress damn near? Is that the advanced tech? permalink parent award report block reply Agent_86 -1 points 7 days ago Well prove it. Where's your evidence. I've seen accusations like this on white supremacist websites, so pardon me if i don't bite. permalink parent award report block reply Jaybone86 1 points 6 days ago They don’t get warnings every damn day for an invasion force 10000 strong.  You are talking to someone with an intelligence level slightly above a slug you can’t call missing an invasion force 10k strong a mistake and be credible. permalink parent award report block reply Agent_86 1 points 6 days ago Yes Egypt did warn Israel that “an explosion” or major escalation was imminent from Gaza a few days before October 7. I agree with you. However, the warning was general rather than specific. Israel denies receiving a detailed operational warning. If you are using this for argument or discussion, you should note both the existence of the warning and the ambiguity surrounding its specificity and Israel’s response. Don't u think? permalink parent award report block reply Jaybone86 1 points 6 days ago Thinking the armed forces should have been on alert isn’t asking much.   Israel had other intelligence agencies telling them something was coming they also had the SIM card activation that they saw in volume right before the attacks.  Failing to change the alert level of the armed forces on just this alone is unforgivable much less what their own intelligence agency likely saw. permalink parent award report block reply Agent_86 1 points 6 days ago That's not what yhe warning said. permalink parent award report block reply\nJaybone86 11 points 7 days ago Ffs you can’t be serious with this shit.  We’ve been paying for a war there for 3 years. permalink parent award report block reply Agent_86 -5 points 7 days ago What does helping an Ally have to with putting Israel first? permalink parent award report block reply Jaybone86 9 points 7 days ago What’s been done on the home front?  How’s those food, energy, and fuel costs going? permalink parent award report block reply Agent_86 -7 points 7 days ago Who is Israel to God? His promised ones right? The apple of His eye even. We bless israel we are blessed of God. He said as much. Also by His grace I'm doing very well. I don't even work. God is good bud. permalink parent award report block reply view 56 more comments... ReleasetheList 4 points 7 days ago They have no formal treaty with the US. They aren't obligated to come to our defense if we are attacked. We've given them an average of $3 Billion in tax payer money every year for the last 30 years, while they have free healthcare and subsidized higher education. What do we get in return other than dragged into their conflicts to spend over $4 trilion on a decades long occupation just to give the country back to the people we got into war with in the first place? permalink parent award report block reply\nAgent_86 -5 points 7 days ago What does helping an Ally have to with putting Israel first? permalink parent award report block reply Jaybone86 9 points 7 days ago What’s been done on the home front?  How’s those food, energy, and fuel costs going? permalink parent award report block reply Agent_86 -7 points 7 days ago Who is Israel to God? His promised ones right? The apple of His eye even. We bless israel we are blessed of God. He said as much. Also by His grace I'm doing very well. I don't even work. God is good bud. permalink parent award report block reply view 56 more comments... ReleasetheList 4 points 7 days ago They have no formal treaty with the US. They aren't obligated to come to our defense if we are attacked. We've given them an average of $3 Billion in tax payer money every year for the last 30 years, while they have free healthcare and subsidized higher education. What do we get in return other than dragged into their conflicts to spend over $4 trilion on a decades long occupation just to give the country back to the people we got into war with in the first place? permalink parent award report block reply\nJaybone86 9 points 7 days ago What’s been done on the home front?  How’s those food, energy, and fuel costs going? permalink parent award report block reply Agent_86 -7 points 7 days ago Who is Israel to God? His promised ones right? The apple of His eye even. We bless israel we are blessed of God. He said as much. Also by His grace I'm doing very well. I don't even work. God is good bud. permalink parent award report block reply view 56 more comments...\nAgent_86 -7 points 7 days ago Who is Israel to God? His promised ones right? The apple of His eye even. We bless israel we are blessed of God. He said as much. Also by His grace I'm doing very well. I don't even work. God is good bud. permalink parent award report block reply view 56 more comments...\nReleasetheList 4 points 7 days ago They have no formal treaty with the US. They aren't obligated to come to our defense if we are attacked. We've given them an average of $3 Billion in tax payer money every year for the last 30 years, while they have free healthcare and subsidized higher education. What do we get in return other than dragged into their conflicts to spend over $4 trilion on a decades long occupation just to give the country back to the people we got into war with in the first place? permalink parent award report block reply\nTonyTheSlop 4 points 7 days ago Uh you mean our greatest alley that has blackmailed all of congress damn near? Is that the advanced tech? permalink parent award report block reply Agent_86 -1 points 7 days ago Well prove it. Where's your evidence. I've seen accusations like this on white supremacist websites, so pardon me if i don't bite. permalink parent award report block reply\nAgent_86 -1 points 7 days ago Well prove it. Where's your evidence. I've seen accusations like this on white supremacist websites, so pardon me if i don't bite. permalink parent award report block reply\nJaybone86 1 points 6 days ago They don’t get warnings every damn day for an invasion force 10000 strong.  You are talking to someone with an intelligence level slightly above a slug you can’t call missing an invasion force 10k strong a mistake and be credible. permalink parent award report block reply Agent_86 1 points 6 days ago Yes Egypt did warn Israel that “an explosion” or major escalation was imminent from Gaza a few days before October 7. I agree with you. However, the warning was general rather than specific. Israel denies receiving a detailed operational warning. If you are using this for argument or discussion, you should note both the existence of the warning and the ambiguity surrounding its specificity and Israel’s response. Don't u think? permalink parent award report block reply Jaybone86 1 points 6 days ago Thinking the armed forces should have been on alert isn’t asking much.   Israel had other intelligence agencies telling them something was coming they also had the SIM card activation that they saw in volume right before the attacks.  Failing to change the alert level of the armed forces on just this alone is unforgivable much less what their own intelligence agency likely saw. permalink parent award report block reply Agent_86 1 points 6 days ago That's not what yhe warning said. permalink parent award report block reply\nAgent_86 1 points 6 days ago Yes Egypt did warn Israel that “an explosion” or major escalation was imminent from Gaza a few days before October 7. I agree with you. However, the warning was general rather than specific. Israel denies receiving a detailed operational warning. If you are using this for argument or discussion, you should note both the existence of the warning and the ambiguity surrounding its specificity and Israel’s response. Don't u think? permalink parent award report block reply Jaybone86 1 points 6 days ago Thinking the armed forces should have been on alert isn’t asking much.   Israel had other intelligence agencies telling them something was coming they also had the SIM card activation that they saw in volume right before the attacks.  Failing to change the alert level of the armed forces on just this alone is unforgivable much less what their own intelligence agency likely saw. permalink parent award report block reply\nJaybone86 1 points 6 days ago Thinking the armed forces should have been on alert isn’t asking much.   Israel had other intelligence agencies telling them something was coming they also had the SIM card activation that they saw in volume right before the attacks.  Failing to change the alert level of the armed forces on just this alone is unforgivable much less what their own intelligence agency likely saw. permalink parent award report block reply\nAgent_86 1 points 6 days ago That's not what yhe warning said. permalink parent award report block reply",
  "fetched_at": "2025-11-12T21:16:15.381293Z"
}