{
  "id": "8182749",
  "title": "1555Retardedposted1 day agobyTrick75 commentsawardsharedownloadreportblock",
  "url": "https://patriots.win/p/1ARK9k0RdR/retarded/c",
  "content": "1555 Retarded posted 1 day ago by Trick 75 comments award share download report block\n75 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno A_Little_White_Duck 61 points 1 day ago Did the interviewer seriously look that ugly? Are these from the same event? Never mind, I looked it up. Yes. It's real. permalink award report block reply hughjasske69 55 points 1 day ago Yes. her facial contortions were repulsive... permalink parent award report block reply RedCalifornia 24 points 1 day ago Possession is never attractive permalink parent award report block reply Constitution_1788 4 points 1 day ago Kek. permalink parent award report block reply snoopy3210 3 points 23 hours ago And she brought her own leftist lies about the ad, claiming it was a reference to race superiority when it was clearly a reference to the genetics of beauty. If you can’t understand the difference, you don’t get to call yourself a reporter. permalink parent award report block reply drattastic1 49 points 1 day ago Nope, that was her. She tried to walk Sweeney into a minefield with her \"superior\" lefty intellect and Sweeney treated her like the man faced bug she was. The look of contempt from Sweeney pretty much sums up how the trap interview went. permalink parent award report block reply ohwell316 21 points 1 day ago I really like this girl. Her movies didn't impress me, but she seems great permalink parent award report block reply imnotdeadyet 20 points 1 day ago She is quite based.  She is pretty good with a firearm as well. permalink parent award report block reply sun_wolf 20 points 1 day ago To me it’s not even a look of contempt, it’s more like a look of neutral clinical observation. As the liberal twists and contorts itself in performative logic pretzels, the observer simply watches, emotionally and psychologically disconnected from the liberal’s mental illness. We used to react more defensively, trying to counter their accusations, or to soothe their mental illness, or show them the error in their logic. But now it’s like watching monkeys throw their feces at each other. You don’t get involved and you don’t jump down in the enclosure and try to explain to the monkey why this is unsanitary and unproductive. Because they’re monkeys, and it’s not about you. permalink parent award report block reply covok48 10 points 1 day ago Damn good description. permalink parent award report block reply Constitution_1788 6 points 1 day ago She genuinely looks like she’s staring at a lab experiment. permalink parent award report block reply Standingoak 2 points 1 day ago Natural resting contempt face made it seem easy.   The responses exposed her derision. permalink parent award report block reply YT45 17 points 1 day ago The best comment I heard was “What she lacks in intelligence she makes up for in chromosomes!” permalink parent award report block reply MawdT20 7 points 1 day ago A Razorfist classic. permalink parent award report block reply Ch3f4554551n 1 points 23 hours ago Godfuckinspeed. permalink parent award report block reply MAGArita45 5 points 1 day ago Her hooded eyelids do give her that ‘Downs’ look. permalink parent award report block reply MooseStangSally 5 points 1 day ago Yes and yes. 🥴 permalink parent award report block reply Spindle-spin 4 points 1 day ago Fuck Sarah Palin for trying to take that word out of our mouths permalink parent award report block reply load 4 more comments... Shinydenim 34 points 1 day ago The irony is that we aren’t calling the Down syndrome kids retards. Only the word police is insisting that those with Downs Syndrome are retarded. permalink award report block reply 559throw 22 points 1 day ago It's so fucking stupid because if we don't say retarded we'll just say something else that literally means exactly the same fucking thing. The term exists because there are retarded fuckers out there and there needs to be a word to use to refer to how goddamned dumb they are, that is more precise than just goddamned dumb. permalink parent award report block reply SicSemperTyrannis2 2 points 24 hours ago We could use SS pictures to specify exactly how retarded these bozos are, in each instance. permalink parent award report block reply barwhack 8 points 1 day ago I went thru medical residency with a Down's sufferer ... they needn't be retarded. This aside from the contextual total shift in meaning of the word \"retard\". permalink parent award report block reply imnotdeadyet 8 points 1 day ago There are various levels of retardation.  There is a group of parents that have special needs daugthers that go out to dinner every Monday night.  It is usually 10 to 15 parents and 8 or 9 kids.  These \"kids\" are all older (20 to 40).  I go to the bar with my golf buddies and will go hang out with the parents for a while and will talk to the girls.  Some of the girls have a problem holding a brief conversation, others are like talking to any other person their age, even cracking jokes.  The one thing I can tell is these kids are a nice as can be.  They are kind, loving, children.  The Tards I come across in the wild, not so much! permalink parent award report block reply barwhack 5 points 1 day ago They're not even on the same scale. Slightly lower mental capacity is what you are addressing, by degrees. Morally vacant by choice is what \"retard\" means, now. permalink parent award report block reply imnotdeadyet 3 points 1 day ago I agree, but I refer to them a Fagtards to avoid any confusion. permalink parent award report block reply AmarilloArmadillo 1 points 23 hours ago Comment removed by community filter. permalink parent award report block reply Neo2025 4 points 1 day ago Retarded is when you are born \"normal\" but choose to act retarded compared to your potential. Downs people aren't retarded. They do not act like they are being retarded, compared to the potential they were born with. permalink parent award report block reply grantking2256 3 points 1 day ago Right. Who the fuck would actually belittle and be mean af to mentally challenged kids. Most normal folk only belittle those who have full reason and mental capacity yet choose to not use it. Thats why the people being called retarded are universally NOT those with downs. permalink parent award report block reply Wtf_socialismreally 1 points 1 day ago Yeah, rare is the person who actually calls someone with a mental handicap retarded. It's like how people don't generally hit cripples. permalink parent award report block reply USMC1234O10 29 points 1 day ago UNFUCKABLE (the one on top at least) permalink award report block reply newestofnew 19 points 1 day ago the one on top is how I picture all the MIGAs on this site trying to chastise the base for speaking the obvious truth about misplaced foreign priorities permalink parent award report block reply rebuildingMyself 10 points 1 day ago Umm... Akshually... If you don't do everything Israel wants isn't that like antisemitic??? 😏 Sweeney: 😐 permalink parent award report block reply covok48 2 points 1 day ago Here and Facebook. permalink parent award report block reply PowerOfBlues 0 points 22 hours ago I picture your mother to be even uglier than this young hag.... though she's probably even uglier....Shalom and  go fuck off...rat face permalink parent award report block reply Malice 21 points 1 day ago Lord Farquaad looking bitch. permalink award report block reply drattastic1 15 points 1 day ago Someone described her as looking like a female Quentin Tarantino. I like yours too. permalink parent award report block reply MisterMAGA 11 points 1 day ago Trump condemned “white supremacy” multiple times on tape. And media and Dems still led with the lie that he called WS very fine people. Never apologize for something fake and gay, they will still hate you and want you dead and lie about why while pretending you said something different. I wish Sweeney would have mentioned this. permalink award report block reply covok48 5 points 1 day ago You’re expecting her to be one of us. She is not. permalink parent award report block reply Wtf_socialismreally 3 points 1 day ago I'm okay with that. She handled neutrality well. Would that other celebrities understood not to be overtly political. permalink parent award report block reply the-new-style 3 points 1 day ago But then that becomes an argument. As we saw, she didn't need to mention anything. permalink parent award report block reply MisterMAGA 2 points 23 hours ago I don’t know. Tons of people still don’t know about the very fine people hoax. They need to know how badly the media lies and carries water for globohomo. permalink parent award report block reply the-new-style 1 points 22 hours ago But if she had engaged in that, we wouldn't be here. permalink parent award report block reply MisterMAGA 1 points 22 hours ago Disagree. We and the Internet would still be talking about it and the country would be a slightly better place. permalink parent award report block reply 5DchessWatch 9 points 1 day ago You're very special What's that supposed to mean? It means if you were just a little more special you wouldn't even have to ask that. permalink award report block reply MawdT20 6 points 1 day ago \"That's retarded.\" permalink award report block reply HaSumBro 4 points 1 day ago It's crazy how deformed and hideous that woman is... permalink award report block reply TallestSkill 3 points 1 day ago You are supposed to leave the bottom panel blank on this meme permalink award report block reply 2Clutch 7 points 1 day ago Or say, \"Well, isn't that retarded.\" permalink parent award report block reply Tulkas71 3 points 1 day ago Please someone with skills wojak her expression permalink award report block reply quiznossucks 2 points 1 day ago 😆😆😆😆😆 permalink award report block reply Patriot454 2 points 1 day ago wont work, you cant special the timing... you either advance or retard it. permalink award report block reply DiamondDroid 2 points 1 day ago Well isn't that special,  you retarded cow. permalink award report block reply patrioticwinning3 2 points 1 day ago She would have said, \"Retarded\" :p permalink award report block reply PotatusHead 2 points 1 day ago NEEDS \"BE RETARDED\" FLAIR! permalink award report block reply MAGASquatch 1 points 20 hours ago Whoa!  She used a hard R there.  Could have simply said \"tarded.\"  Surprised the interviewer did say \"Reeeee-tarded.\" Other alternative forms of retard include:\n• low IQ\n• smooth-brained\n• goober\n• dingleberry\n• NPC behavior issues\n• moron\n• bro is cooked The alternatives are endless but she had to pull the hard R?.... What a retard! permalink award report block reply wst4 1 points 1 day ago LOL! permalink award report block reply MisprisionIsEvil 1 points 19 hours ago I thought it was spelled retarted? I can't keep up any moar. permalink award report block reply knnbccb 1 points 1 day ago Nope. They are fucktarded fucktards. Keep a lookout for 'neurodiverse' another trending fancy term to refer to individuals with (mild?) mental illness. My hunch is that it's another way to score DEI points. permalink award report block reply sun_wolf 3 points 1 day ago They once felt a bit of anxiety before a math test they didn’t study for, so now they are “neurodiverse”. permalink parent award report block reply Eurpoean 1 points 1 day ago What an annoying face. permalink award report block reply Ostia 1 points 1 day ago Careful, if Sarah Palin ever comes back you’ll all be back to defending how it’s offensive and never should be used again. permalink award report block reply covok48 3 points 1 day ago That’s a name I haven’t heard in a long long time. permalink parent award report block reply LiquidSun 1 points 1 day ago When a 1/10 battles a 6/10. permalink award report block reply Klown_Kutz 1 points 1 day ago It's not retarded, it's gay and retarded. permalink award report block reply Quixotic 1 points 22 hours ago Well isn’t that retarded permalink award report block reply SavingPrivateGrace 1 points 1 day ago Now you're a famous meme, Ass burger. permalink award report block reply dodgetimes2 1 points 1 day ago Totally read that in Dana Carvey’s Church Lady voice. permalink award report block reply LiteraIIyHitIer 0 points 1 day ago The interviewer chick not only looks like she in an episode of Star Trek , but also she really resembles Kate Mulgrew as Captain Kathryn Janeway in particular. permalink award report block reply Viciouspuddin -4 points 1 day ago Boomer meme. Eh permalink award report block reply covok48 2 points 1 day ago Shut up, kid. permalink parent award report block reply\nA_Little_White_Duck 61 points 1 day ago Did the interviewer seriously look that ugly? Are these from the same event? Never mind, I looked it up. Yes. It's real. permalink award report block reply hughjasske69 55 points 1 day ago Yes. her facial contortions were repulsive... permalink parent award report block reply RedCalifornia 24 points 1 day ago Possession is never attractive permalink parent award report block reply Constitution_1788 4 points 1 day ago Kek. permalink parent award report block reply snoopy3210 3 points 23 hours ago And she brought her own leftist lies about the ad, claiming it was a reference to race superiority when it was clearly a reference to the genetics of beauty. If you can’t understand the difference, you don’t get to call yourself a reporter. permalink parent award report block reply drattastic1 49 points 1 day ago Nope, that was her. She tried to walk Sweeney into a minefield with her \"superior\" lefty intellect and Sweeney treated her like the man faced bug she was. The look of contempt from Sweeney pretty much sums up how the trap interview went. permalink parent award report block reply ohwell316 21 points 1 day ago I really like this girl. Her movies didn't impress me, but she seems great permalink parent award report block reply imnotdeadyet 20 points 1 day ago She is quite based.  She is pretty good with a firearm as well. permalink parent award report block reply sun_wolf 20 points 1 day ago To me it’s not even a look of contempt, it’s more like a look of neutral clinical observation. As the liberal twists and contorts itself in performative logic pretzels, the observer simply watches, emotionally and psychologically disconnected from the liberal’s mental illness. We used to react more defensively, trying to counter their accusations, or to soothe their mental illness, or show them the error in their logic. But now it’s like watching monkeys throw their feces at each other. You don’t get involved and you don’t jump down in the enclosure and try to explain to the monkey why this is unsanitary and unproductive. Because they’re monkeys, and it’s not about you. permalink parent award report block reply covok48 10 points 1 day ago Damn good description. permalink parent award report block reply Constitution_1788 6 points 1 day ago She genuinely looks like she’s staring at a lab experiment. permalink parent award report block reply Standingoak 2 points 1 day ago Natural resting contempt face made it seem easy.   The responses exposed her derision. permalink parent award report block reply YT45 17 points 1 day ago The best comment I heard was “What she lacks in intelligence she makes up for in chromosomes!” permalink parent award report block reply MawdT20 7 points 1 day ago A Razorfist classic. permalink parent award report block reply Ch3f4554551n 1 points 23 hours ago Godfuckinspeed. permalink parent award report block reply MAGArita45 5 points 1 day ago Her hooded eyelids do give her that ‘Downs’ look. permalink parent award report block reply MooseStangSally 5 points 1 day ago Yes and yes. 🥴 permalink parent award report block reply Spindle-spin 4 points 1 day ago Fuck Sarah Palin for trying to take that word out of our mouths permalink parent award report block reply load 4 more comments...\nhughjasske69 55 points 1 day ago Yes. her facial contortions were repulsive... permalink parent award report block reply RedCalifornia 24 points 1 day ago Possession is never attractive permalink parent award report block reply Constitution_1788 4 points 1 day ago Kek. permalink parent award report block reply snoopy3210 3 points 23 hours ago And she brought her own leftist lies about the ad, claiming it was a reference to race superiority when it was clearly a reference to the genetics of beauty. If you can’t understand the difference, you don’t get to call yourself a reporter. permalink parent award report block reply\nRedCalifornia 24 points 1 day ago Possession is never attractive permalink parent award report block reply Constitution_1788 4 points 1 day ago Kek. permalink parent award report block reply\nConstitution_1788 4 points 1 day ago Kek. permalink parent award report block reply\nsnoopy3210 3 points 23 hours ago And she brought her own leftist lies about the ad, claiming it was a reference to race superiority when it was clearly a reference to the genetics of beauty. If you can’t understand the difference, you don’t get to call yourself a reporter. permalink parent award report block reply\ndrattastic1 49 points 1 day ago Nope, that was her. She tried to walk Sweeney into a minefield with her \"superior\" lefty intellect and Sweeney treated her like the man faced bug she was. The look of contempt from Sweeney pretty much sums up how the trap interview went. permalink parent award report block reply ohwell316 21 points 1 day ago I really like this girl. Her movies didn't impress me, but she seems great permalink parent award report block reply imnotdeadyet 20 points 1 day ago She is quite based.  She is pretty good with a firearm as well. permalink parent award report block reply sun_wolf 20 points 1 day ago To me it’s not even a look of contempt, it’s more like a look of neutral clinical observation. As the liberal twists and contorts itself in performative logic pretzels, the observer simply watches, emotionally and psychologically disconnected from the liberal’s mental illness. We used to react more defensively, trying to counter their accusations, or to soothe their mental illness, or show them the error in their logic. But now it’s like watching monkeys throw their feces at each other. You don’t get involved and you don’t jump down in the enclosure and try to explain to the monkey why this is unsanitary and unproductive. Because they’re monkeys, and it’s not about you. permalink parent award report block reply covok48 10 points 1 day ago Damn good description. permalink parent award report block reply Constitution_1788 6 points 1 day ago She genuinely looks like she’s staring at a lab experiment. permalink parent award report block reply Standingoak 2 points 1 day ago Natural resting contempt face made it seem easy.   The responses exposed her derision. permalink parent award report block reply\nohwell316 21 points 1 day ago I really like this girl. Her movies didn't impress me, but she seems great permalink parent award report block reply imnotdeadyet 20 points 1 day ago She is quite based.  She is pretty good with a firearm as well. permalink parent award report block reply\nimnotdeadyet 20 points 1 day ago She is quite based.  She is pretty good with a firearm as well. permalink parent award report block reply\nsun_wolf 20 points 1 day ago To me it’s not even a look of contempt, it’s more like a look of neutral clinical observation. As the liberal twists and contorts itself in performative logic pretzels, the observer simply watches, emotionally and psychologically disconnected from the liberal’s mental illness. We used to react more defensively, trying to counter their accusations, or to soothe their mental illness, or show them the error in their logic. But now it’s like watching monkeys throw their feces at each other. You don’t get involved and you don’t jump down in the enclosure and try to explain to the monkey why this is unsanitary and unproductive. Because they’re monkeys, and it’s not about you. permalink parent award report block reply covok48 10 points 1 day ago Damn good description. permalink parent award report block reply Constitution_1788 6 points 1 day ago She genuinely looks like she’s staring at a lab experiment. permalink parent award report block reply\ncovok48 10 points 1 day ago Damn good description. permalink parent award report block reply\nConstitution_1788 6 points 1 day ago She genuinely looks like she’s staring at a lab experiment. permalink parent award report block reply\nStandingoak 2 points 1 day ago Natural resting contempt face made it seem easy.   The responses exposed her derision. permalink parent award report block reply\nYT45 17 points 1 day ago The best comment I heard was “What she lacks in intelligence she makes up for in chromosomes!” permalink parent award report block reply MawdT20 7 points 1 day ago A Razorfist classic. permalink parent award report block reply Ch3f4554551n 1 points 23 hours ago Godfuckinspeed. permalink parent award report block reply MAGArita45 5 points 1 day ago Her hooded eyelids do give her that ‘Downs’ look. permalink parent award report block reply\nMawdT20 7 points 1 day ago A Razorfist classic. permalink parent award report block reply Ch3f4554551n 1 points 23 hours ago Godfuckinspeed. permalink parent award report block reply\nCh3f4554551n 1 points 23 hours ago Godfuckinspeed. permalink parent award report block reply\nMAGArita45 5 points 1 day ago Her hooded eyelids do give her that ‘Downs’ look. permalink parent award report block reply\nMooseStangSally 5 points 1 day ago Yes and yes. 🥴 permalink parent award report block reply\nSpindle-spin 4 points 1 day ago Fuck Sarah Palin for trying to take that word out of our mouths permalink parent award report block reply\nShinydenim 34 points 1 day ago The irony is that we aren’t calling the Down syndrome kids retards. Only the word police is insisting that those with Downs Syndrome are retarded. permalink award report block reply 559throw 22 points 1 day ago It's so fucking stupid because if we don't say retarded we'll just say something else that literally means exactly the same fucking thing. The term exists because there are retarded fuckers out there and there needs to be a word to use to refer to how goddamned dumb they are, that is more precise than just goddamned dumb. permalink parent award report block reply SicSemperTyrannis2 2 points 24 hours ago We could use SS pictures to specify exactly how retarded these bozos are, in each instance. permalink parent award report block reply barwhack 8 points 1 day ago I went thru medical residency with a Down's sufferer ... they needn't be retarded. This aside from the contextual total shift in meaning of the word \"retard\". permalink parent award report block reply imnotdeadyet 8 points 1 day ago There are various levels of retardation.  There is a group of parents that have special needs daugthers that go out to dinner every Monday night.  It is usually 10 to 15 parents and 8 or 9 kids.  These \"kids\" are all older (20 to 40).  I go to the bar with my golf buddies and will go hang out with the parents for a while and will talk to the girls.  Some of the girls have a problem holding a brief conversation, others are like talking to any other person their age, even cracking jokes.  The one thing I can tell is these kids are a nice as can be.  They are kind, loving, children.  The Tards I come across in the wild, not so much! permalink parent award report block reply barwhack 5 points 1 day ago They're not even on the same scale. Slightly lower mental capacity is what you are addressing, by degrees. Morally vacant by choice is what \"retard\" means, now. permalink parent award report block reply imnotdeadyet 3 points 1 day ago I agree, but I refer to them a Fagtards to avoid any confusion. permalink parent award report block reply AmarilloArmadillo 1 points 23 hours ago Comment removed by community filter. permalink parent award report block reply Neo2025 4 points 1 day ago Retarded is when you are born \"normal\" but choose to act retarded compared to your potential. Downs people aren't retarded. They do not act like they are being retarded, compared to the potential they were born with. permalink parent award report block reply grantking2256 3 points 1 day ago Right. Who the fuck would actually belittle and be mean af to mentally challenged kids. Most normal folk only belittle those who have full reason and mental capacity yet choose to not use it. Thats why the people being called retarded are universally NOT those with downs. permalink parent award report block reply Wtf_socialismreally 1 points 1 day ago Yeah, rare is the person who actually calls someone with a mental handicap retarded. It's like how people don't generally hit cripples. permalink parent award report block reply\n559throw 22 points 1 day ago It's so fucking stupid because if we don't say retarded we'll just say something else that literally means exactly the same fucking thing. The term exists because there are retarded fuckers out there and there needs to be a word to use to refer to how goddamned dumb they are, that is more precise than just goddamned dumb. permalink parent award report block reply SicSemperTyrannis2 2 points 24 hours ago We could use SS pictures to specify exactly how retarded these bozos are, in each instance. permalink parent award report block reply\nSicSemperTyrannis2 2 points 24 hours ago We could use SS pictures to specify exactly how retarded these bozos are, in each instance. permalink parent award report block reply\nbarwhack 8 points 1 day ago I went thru medical residency with a Down's sufferer ... they needn't be retarded. This aside from the contextual total shift in meaning of the word \"retard\". permalink parent award report block reply imnotdeadyet 8 points 1 day ago There are various levels of retardation.  There is a group of parents that have special needs daugthers that go out to dinner every Monday night.  It is usually 10 to 15 parents and 8 or 9 kids.  These \"kids\" are all older (20 to 40).  I go to the bar with my golf buddies and will go hang out with the parents for a while and will talk to the girls.  Some of the girls have a problem holding a brief conversation, others are like talking to any other person their age, even cracking jokes.  The one thing I can tell is these kids are a nice as can be.  They are kind, loving, children.  The Tards I come across in the wild, not so much! permalink parent award report block reply barwhack 5 points 1 day ago They're not even on the same scale. Slightly lower mental capacity is what you are addressing, by degrees. Morally vacant by choice is what \"retard\" means, now. permalink parent award report block reply imnotdeadyet 3 points 1 day ago I agree, but I refer to them a Fagtards to avoid any confusion. permalink parent award report block reply AmarilloArmadillo 1 points 23 hours ago Comment removed by community filter. permalink parent award report block reply\nimnotdeadyet 8 points 1 day ago There are various levels of retardation.  There is a group of parents that have special needs daugthers that go out to dinner every Monday night.  It is usually 10 to 15 parents and 8 or 9 kids.  These \"kids\" are all older (20 to 40).  I go to the bar with my golf buddies and will go hang out with the parents for a while and will talk to the girls.  Some of the girls have a problem holding a brief conversation, others are like talking to any other person their age, even cracking jokes.  The one thing I can tell is these kids are a nice as can be.  They are kind, loving, children.  The Tards I come across in the wild, not so much! permalink parent award report block reply barwhack 5 points 1 day ago They're not even on the same scale. Slightly lower mental capacity is what you are addressing, by degrees. Morally vacant by choice is what \"retard\" means, now. permalink parent award report block reply imnotdeadyet 3 points 1 day ago I agree, but I refer to them a Fagtards to avoid any confusion. permalink parent award report block reply AmarilloArmadillo 1 points 23 hours ago Comment removed by community filter. permalink parent award report block reply\nbarwhack 5 points 1 day ago They're not even on the same scale. Slightly lower mental capacity is what you are addressing, by degrees. Morally vacant by choice is what \"retard\" means, now. permalink parent award report block reply imnotdeadyet 3 points 1 day ago I agree, but I refer to them a Fagtards to avoid any confusion. permalink parent award report block reply\nimnotdeadyet 3 points 1 day ago I agree, but I refer to them a Fagtards to avoid any confusion. permalink parent award report block reply\nAmarilloArmadillo 1 points 23 hours ago Comment removed by community filter. permalink parent award report block reply\nNeo2025 4 points 1 day ago Retarded is when you are born \"normal\" but choose to act retarded compared to your potential. Downs people aren't retarded. They do not act like they are being retarded, compared to the potential they were born with. permalink parent award report block reply\ngrantking2256 3 points 1 day ago Right. Who the fuck would actually belittle and be mean af to mentally challenged kids. Most normal folk only belittle those who have full reason and mental capacity yet choose to not use it. Thats why the people being called retarded are universally NOT those with downs. permalink parent award report block reply\nWtf_socialismreally 1 points 1 day ago Yeah, rare is the person who actually calls someone with a mental handicap retarded. It's like how people don't generally hit cripples. permalink parent award report block reply\nUSMC1234O10 29 points 1 day ago UNFUCKABLE (the one on top at least) permalink award report block reply newestofnew 19 points 1 day ago the one on top is how I picture all the MIGAs on this site trying to chastise the base for speaking the obvious truth about misplaced foreign priorities permalink parent award report block reply rebuildingMyself 10 points 1 day ago Umm... Akshually... If you don't do everything Israel wants isn't that like antisemitic??? 😏 Sweeney: 😐 permalink parent award report block reply covok48 2 points 1 day ago Here and Facebook. permalink parent award report block reply PowerOfBlues 0 points 22 hours ago I picture your mother to be even uglier than this young hag.... though she's probably even uglier....Shalom and  go fuck off...rat face permalink parent award report block reply\nnewestofnew 19 points 1 day ago the one on top is how I picture all the MIGAs on this site trying to chastise the base for speaking the obvious truth about misplaced foreign priorities permalink parent award report block reply rebuildingMyself 10 points 1 day ago Umm... Akshually... If you don't do everything Israel wants isn't that like antisemitic??? 😏 Sweeney: 😐 permalink parent award report block reply covok48 2 points 1 day ago Here and Facebook. permalink parent award report block reply PowerOfBlues 0 points 22 hours ago I picture your mother to be even uglier than this young hag.... though she's probably even uglier....Shalom and  go fuck off...rat face permalink parent award report block reply\nrebuildingMyself 10 points 1 day ago Umm... Akshually... If you don't do everything Israel wants isn't that like antisemitic??? 😏 Sweeney: 😐 permalink parent award report block reply\ncovok48 2 points 1 day ago Here and Facebook. permalink parent award report block reply\nPowerOfBlues 0 points 22 hours ago I picture your mother to be even uglier than this young hag.... though she's probably even uglier....Shalom and  go fuck off...rat face permalink parent award report block reply\nMalice 21 points 1 day ago Lord Farquaad looking bitch. permalink award report block reply drattastic1 15 points 1 day ago Someone described her as looking like a female Quentin Tarantino. I like yours too. permalink parent award report block reply\ndrattastic1 15 points 1 day ago Someone described her as looking like a female Quentin Tarantino. I like yours too. permalink parent award report block reply\nMisterMAGA 11 points 1 day ago Trump condemned “white supremacy” multiple times on tape. And media and Dems still led with the lie that he called WS very fine people. Never apologize for something fake and gay, they will still hate you and want you dead and lie about why while pretending you said something different. I wish Sweeney would have mentioned this. permalink award report block reply covok48 5 points 1 day ago You’re expecting her to be one of us. She is not. permalink parent award report block reply Wtf_socialismreally 3 points 1 day ago I'm okay with that. She handled neutrality well. Would that other celebrities understood not to be overtly political. permalink parent award report block reply the-new-style 3 points 1 day ago But then that becomes an argument. As we saw, she didn't need to mention anything. permalink parent award report block reply MisterMAGA 2 points 23 hours ago I don’t know. Tons of people still don’t know about the very fine people hoax. They need to know how badly the media lies and carries water for globohomo. permalink parent award report block reply the-new-style 1 points 22 hours ago But if she had engaged in that, we wouldn't be here. permalink parent award report block reply MisterMAGA 1 points 22 hours ago Disagree. We and the Internet would still be talking about it and the country would be a slightly better place. permalink parent award report block reply\ncovok48 5 points 1 day ago You’re expecting her to be one of us. She is not. permalink parent award report block reply Wtf_socialismreally 3 points 1 day ago I'm okay with that. She handled neutrality well. Would that other celebrities understood not to be overtly political. permalink parent award report block reply\nWtf_socialismreally 3 points 1 day ago I'm okay with that. She handled neutrality well. Would that other celebrities understood not to be overtly political. permalink parent award report block reply\nthe-new-style 3 points 1 day ago But then that becomes an argument. As we saw, she didn't need to mention anything. permalink parent award report block reply MisterMAGA 2 points 23 hours ago I don’t know. Tons of people still don’t know about the very fine people hoax. They need to know how badly the media lies and carries water for globohomo. permalink parent award report block reply the-new-style 1 points 22 hours ago But if she had engaged in that, we wouldn't be here. permalink parent award report block reply MisterMAGA 1 points 22 hours ago Disagree. We and the Internet would still be talking about it and the country would be a slightly better place. permalink parent award report block reply\nMisterMAGA 2 points 23 hours ago I don’t know. Tons of people still don’t know about the very fine people hoax. They need to know how badly the media lies and carries water for globohomo. permalink parent award report block reply the-new-style 1 points 22 hours ago But if she had engaged in that, we wouldn't be here. permalink parent award report block reply MisterMAGA 1 points 22 hours ago Disagree. We and the Internet would still be talking about it and the country would be a slightly better place. permalink parent award report block reply\nthe-new-style 1 points 22 hours ago But if she had engaged in that, we wouldn't be here. permalink parent award report block reply MisterMAGA 1 points 22 hours ago Disagree. We and the Internet would still be talking about it and the country would be a slightly better place. permalink parent award report block reply\nMisterMAGA 1 points 22 hours ago Disagree. We and the Internet would still be talking about it and the country would be a slightly better place. permalink parent award report block reply\n5DchessWatch 9 points 1 day ago You're very special What's that supposed to mean? It means if you were just a little more special you wouldn't even have to ask that. permalink award report block reply\nMawdT20 6 points 1 day ago \"That's retarded.\" permalink award report block reply\nHaSumBro 4 points 1 day ago It's crazy how deformed and hideous that woman is... permalink award report block reply\nTallestSkill 3 points 1 day ago You are supposed to leave the bottom panel blank on this meme permalink award report block reply 2Clutch 7 points 1 day ago Or say, \"Well, isn't that retarded.\" permalink parent award report block reply\n2Clutch 7 points 1 day ago Or say, \"Well, isn't that retarded.\" permalink parent award report block reply\nTulkas71 3 points 1 day ago Please someone with skills wojak her expression permalink award report block reply\nquiznossucks 2 points 1 day ago 😆😆😆😆😆 permalink award report block reply\nPatriot454 2 points 1 day ago wont work, you cant special the timing... you either advance or retard it. permalink award report block reply\nDiamondDroid 2 points 1 day ago Well isn't that special,  you retarded cow. permalink award report block reply\npatrioticwinning3 2 points 1 day ago She would have said, \"Retarded\" :p permalink award report block reply\nPotatusHead 2 points 1 day ago NEEDS \"BE RETARDED\" FLAIR! permalink award report block reply\nMAGASquatch 1 points 20 hours ago Whoa!  She used a hard R there.  Could have simply said \"tarded.\"  Surprised the interviewer did say \"Reeeee-tarded.\" Other alternative forms of retard include:\n• low IQ\n• smooth-brained\n• goober\n• dingleberry\n• NPC behavior issues\n• moron\n• bro is cooked The alternatives are endless but she had to pull the hard R?.... What a retard! permalink award report block reply\nwst4 1 points 1 day ago LOL! permalink award report block reply\nMisprisionIsEvil 1 points 19 hours ago I thought it was spelled retarted? I can't keep up any moar. permalink award report block reply\nknnbccb 1 points 1 day ago Nope. They are fucktarded fucktards. Keep a lookout for 'neurodiverse' another trending fancy term to refer to individuals with (mild?) mental illness. My hunch is that it's another way to score DEI points. permalink award report block reply sun_wolf 3 points 1 day ago They once felt a bit of anxiety before a math test they didn’t study for, so now they are “neurodiverse”. permalink parent award report block reply\nsun_wolf 3 points 1 day ago They once felt a bit of anxiety before a math test they didn’t study for, so now they are “neurodiverse”. permalink parent award report block reply\nEurpoean 1 points 1 day ago What an annoying face. permalink award report block reply\nOstia 1 points 1 day ago Careful, if Sarah Palin ever comes back you’ll all be back to defending how it’s offensive and never should be used again. permalink award report block reply covok48 3 points 1 day ago That’s a name I haven’t heard in a long long time. permalink parent award report block reply\ncovok48 3 points 1 day ago That’s a name I haven’t heard in a long long time. permalink parent award report block reply\nLiquidSun 1 points 1 day ago When a 1/10 battles a 6/10. permalink award report block reply\nKlown_Kutz 1 points 1 day ago It's not retarded, it's gay and retarded. permalink award report block reply\nQuixotic 1 points 22 hours ago Well isn’t that retarded permalink award report block reply\nSavingPrivateGrace 1 points 1 day ago Now you're a famous meme, Ass burger. permalink award report block reply\ndodgetimes2 1 points 1 day ago Totally read that in Dana Carvey’s Church Lady voice. permalink award report block reply\nLiteraIIyHitIer 0 points 1 day ago The interviewer chick not only looks like she in an episode of Star Trek , but also she really resembles Kate Mulgrew as Captain Kathryn Janeway in particular. permalink award report block reply\nViciouspuddin -4 points 1 day ago Boomer meme. Eh permalink award report block reply covok48 2 points 1 day ago Shut up, kid. permalink parent award report block reply\ncovok48 2 points 1 day ago Shut up, kid. permalink parent award report block reply",
  "fetched_at": "2025-11-12T20:00:48.658347Z"
}