{
  "id": "1ARK57tKLu",
  "url": "https://patriots.win/p/1ARK57tKLu/if-you-are-wondering-why-health-/c",
  "content": "434 If you are wondering why health insurance has gotten so expensive, this is why.\n\nThe Democrats set up a massive wealth transfer system that takes money from American taxpayers and gives it to insurance companies.\n\nAnd everybody’s premiums have skyrocketed in the interim. posted 4 days ago by ALT26 18 comments award share report block James Blair @JamesBlairUSA • 4d If you are wondering why health insurance has gotten so expensive, this is why. The Democrats set up a massive wealth transfer system that takes money from American taxpayers and gives it to insurance companies. And everybody’s premiums have skyrocketed in the interim. Commentary Donald J. Trump Posts From Truth Social @TrumpDailyPosts • 4d Donald J. Trump Truth Social Post 09:42 PM EST 11/07/25\n18 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno deleted 7 points 4 days ago PosterIsDead 5 points 4 days ago And buy hospitals and pharmacies. permalink parent award report block reply Trooph-Hurts 4 points 4 days ago You would think that with all of the new people paying for insurance that typically don’t have insurance that premiums would go down, but it’s the total opposite… that’s one way you know it’s a complete and total fraud permalink award report block reply zooty 4 points 4 days ago Mandating purchasing a product? How could anyone possibly think that would decrease prices? A fundamental foundation of making a good deal is being able and willing to walk away. permalink parent award report block reply mark2398 3 points 4 days ago Obamacare.  Government pays huge premiums on your behalf.  Huge deductibles mean the insurance company rarely pays a dime.  Your few doctors that accepts the insurance will speak in broken English. permalink award report block reply thunderpussy 1 points 4 days ago Insurance companies on the exchanges are mandated to spend 80% of all premiums on claims. permalink parent award report block reply Standingoak 1 points 4 days ago Stop \"Man dating\" permalink parent award report block reply thunderpussy 1 points 4 days ago People are naive beyond belief about healthcare and the drivers of it's expense, and how many hands are in it.  You have literally every industry, practically, feeding off healthcare spending, both public and government. It would take us DECADES to unwind the excesses and grift in our entire system, without collapsing the whole thing suddenly, including the economy, where it makes up around 16% to 17% of GDP, expected to rise to 20% very shortly. permalink parent award report block reply Standingoak 1 points 4 days ago This has always been about what comes after.  Hold on tight buttercup. permalink parent award report block reply view 1 more comments... GontMawr 2 points 4 days ago The number 1 profitable business in every state. permalink award report block reply kaduh 1 points 4 days ago We have to pass it to see what's in it, you dolts. permalink award report block reply ListenJack 1 points 4 days ago Obamacare was nothing more than a tax payer transfer to insurance companies with the caveat that they had to cover everyone and pre-existing conditions. A quasi single-payer system with ZERO government or industry oversight. What could possibly go wrong? permalink award report block reply okboomer59 1 points 4 days ago Kaiser Family Foundation funded the lobbying and propaganda for Obamacare. Kaiser Permanente makes UHS look like pikers. permalink award report block reply Znut55 1 points 4 days ago It was designed to make you BEG for their single-payer socialist healthcare system where they control what you get and what you don't. permalink award report block reply keeman 1 points 4 days ago That is just the most recent thing.  Ask yourself WHY your employer provides your insurance?  Do they buy your groceries or pay your rent?  Why only this?  If you guessed government fuckery then you guessed correct (but get no points as this is the usual answer). permalink award report block reply Lower 1 points 4 days ago How much of that insurance company increase got kicked back to those making and passing our laws? permalink award report block reply JustACitizenWarrior 1 points 4 days ago dont say they stole money and then show stock price. show their REVENUES to finish that argument. permalink award report block reply\ndeleted 7 points 4 days ago PosterIsDead 5 points 4 days ago And buy hospitals and pharmacies. permalink parent award report block reply\nPosterIsDead 5 points 4 days ago And buy hospitals and pharmacies. permalink parent award report block reply\nTrooph-Hurts 4 points 4 days ago You would think that with all of the new people paying for insurance that typically don’t have insurance that premiums would go down, but it’s the total opposite… that’s one way you know it’s a complete and total fraud permalink award report block reply zooty 4 points 4 days ago Mandating purchasing a product? How could anyone possibly think that would decrease prices? A fundamental foundation of making a good deal is being able and willing to walk away. permalink parent award report block reply\nzooty 4 points 4 days ago Mandating purchasing a product? How could anyone possibly think that would decrease prices? A fundamental foundation of making a good deal is being able and willing to walk away. permalink parent award report block reply\nmark2398 3 points 4 days ago Obamacare.  Government pays huge premiums on your behalf.  Huge deductibles mean the insurance company rarely pays a dime.  Your few doctors that accepts the insurance will speak in broken English. permalink award report block reply thunderpussy 1 points 4 days ago Insurance companies on the exchanges are mandated to spend 80% of all premiums on claims. permalink parent award report block reply Standingoak 1 points 4 days ago Stop \"Man dating\" permalink parent award report block reply thunderpussy 1 points 4 days ago People are naive beyond belief about healthcare and the drivers of it's expense, and how many hands are in it.  You have literally every industry, practically, feeding off healthcare spending, both public and government. It would take us DECADES to unwind the excesses and grift in our entire system, without collapsing the whole thing suddenly, including the economy, where it makes up around 16% to 17% of GDP, expected to rise to 20% very shortly. permalink parent award report block reply Standingoak 1 points 4 days ago This has always been about what comes after.  Hold on tight buttercup. permalink parent award report block reply view 1 more comments...\nthunderpussy 1 points 4 days ago Insurance companies on the exchanges are mandated to spend 80% of all premiums on claims. permalink parent award report block reply Standingoak 1 points 4 days ago Stop \"Man dating\" permalink parent award report block reply thunderpussy 1 points 4 days ago People are naive beyond belief about healthcare and the drivers of it's expense, and how many hands are in it.  You have literally every industry, practically, feeding off healthcare spending, both public and government. It would take us DECADES to unwind the excesses and grift in our entire system, without collapsing the whole thing suddenly, including the economy, where it makes up around 16% to 17% of GDP, expected to rise to 20% very shortly. permalink parent award report block reply Standingoak 1 points 4 days ago This has always been about what comes after.  Hold on tight buttercup. permalink parent award report block reply view 1 more comments...\nStandingoak 1 points 4 days ago Stop \"Man dating\" permalink parent award report block reply thunderpussy 1 points 4 days ago People are naive beyond belief about healthcare and the drivers of it's expense, and how many hands are in it.  You have literally every industry, practically, feeding off healthcare spending, both public and government. It would take us DECADES to unwind the excesses and grift in our entire system, without collapsing the whole thing suddenly, including the economy, where it makes up around 16% to 17% of GDP, expected to rise to 20% very shortly. permalink parent award report block reply Standingoak 1 points 4 days ago This has always been about what comes after.  Hold on tight buttercup. permalink parent award report block reply view 1 more comments...\nthunderpussy 1 points 4 days ago People are naive beyond belief about healthcare and the drivers of it's expense, and how many hands are in it.  You have literally every industry, practically, feeding off healthcare spending, both public and government. It would take us DECADES to unwind the excesses and grift in our entire system, without collapsing the whole thing suddenly, including the economy, where it makes up around 16% to 17% of GDP, expected to rise to 20% very shortly. permalink parent award report block reply Standingoak 1 points 4 days ago This has always been about what comes after.  Hold on tight buttercup. permalink parent award report block reply view 1 more comments...\nStandingoak 1 points 4 days ago This has always been about what comes after.  Hold on tight buttercup. permalink parent award report block reply view 1 more comments...\nGontMawr 2 points 4 days ago The number 1 profitable business in every state. permalink award report block reply\nkaduh 1 points 4 days ago We have to pass it to see what's in it, you dolts. permalink award report block reply\nListenJack 1 points 4 days ago Obamacare was nothing more than a tax payer transfer to insurance companies with the caveat that they had to cover everyone and pre-existing conditions. A quasi single-payer system with ZERO government or industry oversight. What could possibly go wrong? permalink award report block reply\nokboomer59 1 points 4 days ago Kaiser Family Foundation funded the lobbying and propaganda for Obamacare. Kaiser Permanente makes UHS look like pikers. permalink award report block reply\nZnut55 1 points 4 days ago It was designed to make you BEG for their single-payer socialist healthcare system where they control what you get and what you don't. permalink award report block reply\nkeeman 1 points 4 days ago That is just the most recent thing.  Ask yourself WHY your employer provides your insurance?  Do they buy your groceries or pay your rent?  Why only this?  If you guessed government fuckery then you guessed correct (but get no points as this is the usual answer). permalink award report block reply\nLower 1 points 4 days ago How much of that insurance company increase got kicked back to those making and passing our laws? permalink award report block reply\nJustACitizenWarrior 1 points 4 days ago dont say they stole money and then show stock price. show their REVENUES to finish that argument. permalink award report block reply",
  "fetched_at": "2025-11-12T23:08:28.299750Z"
}