{
  "id": "1ARK9isKUp",
  "url": "https://patriots.win/p/1ARK9isKUp/uc-berkeley-currently-looks-like/c",
  "content": "949 UC Berkeley currently looks like a war zone. \n\nAn ANTIFA member just lit off a flare resulting in TPUSA event attendees being rushed inside. posted 2 days ago by I-am-Orlando PRO 81 comments award share report block FRONTLINES TPUSA @FrontlinesTPUSA • 2d UC Berkeley currently looks like a war zone. An ANTIFA member just lit off a flare resulting in TPUSA event attendees being rushed inside. A car then comes and starts backfiring visibly scaring multiple attendees who feared they were hearing gunshots. @TPUSA | @Savsays\n81 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style IncredibleMrE1 85 points 2 days ago UC Berkeley is Antifa Ground Zero. Pepe Farms remembers the Battle for Berkeley and Professor Bike Lock, Based Stickman, and Moldylocks. Spez: Obligatory - The Ballad of Moldylocks permalink award report block reply July_1776 24 points 2 days ago ahh, fren. I member, too. permalink parent award report block reply deleted 16 points 2 days ago Wtf_socialismreally 4 points 2 days ago I sometimes reference Venus even still. permalink parent award report block reply THELEADERSOFMEN 1 points 2 days ago Unfortunately, am I right lmao permalink parent award report block reply IncredibleMrE1 11 points 2 days ago Oh, and someone please remind me what Alex Soros' alma mater is? permalink parent award report block reply TheRedPike 1 points 1 day ago The gay bathhouse in Berkeley? permalink parent award report block reply Ikon 12 points 2 days ago Apparently there was a porno or some shit of moldylox as well and she had more hair in her bush than the moldy lox on her head. permalink parent award report block reply diverscale 9 points 2 days ago 4chan was busy back then permalink parent award report block reply Lulzokbro 3 points 2 days ago Well, get them off their ass, they need to use that weaponized autism again permalink parent award report block reply Viewer01 8 points 2 days ago Yea they dubbed her Snach-quatch cause she had a ragged pelt on that beat to shit cooter. permalink parent award report block reply Comanche_Moon 4 points 2 days ago She sold videos and peeks to guys who were obsessed with hairy bushes. permalink parent award report block reply Taqiyya_Mockingbird 9 points 2 days ago Yvette Felarca permalink parent award report block reply Moose_Antlers 2 points 2 days ago Name and shame. Normally, I follow the \"don't dox people\" rule, but with creeps like these who are literally trying to destroy my country and want me to die, it's time to name and shame. Antifa 1.0 was a communist rat's nest. So's the modern remake. permalink parent award report block reply Aquamine-Amarine 7 points 2 days ago Isn't this the same campus these faggots almost burned down because Milo was going to give a speech there years ago? Before or during Trump's first term. I remember Milo calling into Tucker's show to talk about it. permalink parent award report block reply IncredibleMrE1 4 points 2 days ago Yep, same one. permalink parent award report block reply AwareandNonCompliant 3 points 2 days ago Best part of that night was when the rioters came across Jake Shields who protected someone running from them.  They called him a NAZI and rushed him and he pulled off some MMA moves.  Then someone in the group said, I don’t think this guys a NAZI man and they disappeared real quick. permalink parent award report block reply DCPower 4 points 2 days ago Haha, thanks for sharing, hadn’t seen that one. permalink parent award report block reply load 7 more comments... Jack_Dupp 46 points 2 days ago Lotta good declaring them a domestic terrorist org did… permalink award report block reply laxslash 23 points 2 days ago It was a strongly worded designation. permalink parent award report block reply JoeMcCarthyWasRight 22 points 2 days ago Makes Trump look weak af on domestic terrorism. Absolutely nothing has happened to these fucking traitors. Has there been one terrorism charge since? I know there’s been plenty of terrorism. permalink parent award report block reply Modernturnkey 14 points 2 days ago So far, Trump has been weak af on all fronts. I'm waiting on literally anything, anything, to happen. permalink parent award report block reply Rakkasan91b 5 points 2 days ago I hate to say it, but it looks like the only people that he has Bondi going after are the people who directly attacked him with the BS lawfare attacks and Russian Dossier.  Yes those people do need to be prosecuted for what they did, but there are a HELL of a lot more people and groups that they need to be going after.  Not next week, or next month, or after the midterms, this should have started 9 months ago. permalink parent award report block reply anotherthing 2 points 1 day ago And anti-Israel protestors. They went after them pretty good for a while. permalink parent award report block reply 10MeV 2 points 1 day ago Scam Blondi is probably afflicted with the same suicidal empathy problem most females have.  They should not be in leadership positions, period (no pun intended). permalink parent award report block reply view 1 more comments... THELEADERSOFMEN 1 points 1 day ago The Russia Russia Russia hoax was anything but BS lawfare. They wanted to put him away for LIFE, if not have him executed, and it was their number one weapon in stealing 2020. permalink parent award report block reply Moose_Antlers 3 points 2 days ago You guys really need to learn how law enforcement works on organizations like this. You map them out. You document their entire social network, their funding. You watch everything they do and collect evidence that's admissible in court. When you finally move, you take them all down, particularly the leaders. It takes time. This is how they do anti-racketeering work, anti-mafia, anti-gang, anti-cartel ... etc. Every time you see the FBI bragging about busting 30 men running a human trafficking and prostitution ring, this is how they do it. It's months to years' worth of work to get these creeps. Let Trump work. Good Lord, impatient people. permalink parent award report block reply IPMang 25 points 2 days ago What's fucked up about this \"protesting\" is it 100% RELIES on the criminal justice system to protect them. They instigate, but there can be no response. It's an absolute abuse of the country. Like they're outside fighting the police... But it's the police who are keeping them protected. Without the police, these fuckers would be erased in a single day. permalink award report block reply Modernturnkey 9 points 2 days ago Which is why, in no way shape or form, are police good. They're not on our side. They protect criminals from real justice, collect guns, and kill our side for even talking of making meaningful change. permalink parent award report block reply MEME-SUPREME 17 points 2 days ago Nuke it from orbit it's the only way to be sure. permalink award report block reply JoeMcCarthyWasRight 14 points 2 days ago Berkeley Riots 2? LFG. Who wants to be this go arounds Moldy Locks? permalink award report block reply SavingPrivateGrace 13 points 2 days ago The Antifa riots didn't work.  The Tour, TPUSA Live https://www.youtube.com/watch?v=D5bNZ9pt3Ds permalink award report block reply DCPower 5 points 2 days ago Nice permalink parent award report block reply NoClueForAName2 5 points 2 days ago It’s still going? Good for them 👍 permalink parent award report block reply rangooooo 12 points 2 days ago Sounds like terrorism to me permalink award report block reply sixfingerdildo 5 points 2 days ago Only half a step from burning crosses permalink parent award report block reply 1776take2 11 points 2 days ago Send in the National Guard… permalink award report block reply starjello 2 points 2 days ago Trump is waiting for a judge's permission, the democrat judge at that permalink parent award report block reply Hanging_Chad 10 points 2 days ago what did I just watch permalink award report block reply Skogin 10 points 2 days ago bunch of unhappy faggots permalink parent award report block reply cd3dog 7 points 2 days ago Ahhh.  I give you the ever-tolerant and inclusive left.  Well done.  Well done indeed. permalink award report block reply GenerallyRight 6 points 2 days ago Higher education...  Thoughtful exchange of ideas...  Tolerance and all... permalink award report block reply WarOfTheFanboys2 5 points 2 days ago Reminder that EVERY liberal is a terrorist fascist. They would slit your throat the moment they can. permalink award report block reply MAGAguitar 5 points 2 days ago They are a unique zone of faggots Berkeley. permalink award report block reply itspancakees 5 points 2 days ago Pam is going to investigate these terrorists right away, she just needs to get her nails done first permalink award report block reply Filo76 2 points 2 days ago She's gotta go on Fox News and talk about it as well. By it I mean her nails.  Not investigating, or heaven forbid, prosecuting ANTIFA. permalink parent award report block reply itspancakees 2 points 2 days ago Give her a break, she has 10 of them!! Ten!!! Do you know how busy she is trying to get all 10 of her nails done? That's not even counting the toes. I'm about ready to vote for bernie as much as you MAGA people complain permalink parent award report block reply FusionBlack 4 points 2 days ago Ban forgien students completely. Sorry that may cause harm for a peace or trade deal... This is out of control. permalink award report block reply Michalusmichalus 2 points 1 day ago Foreign students are cash paying at the highest rates. That's why schools keep taking in more, and more. permalink parent award report block reply benjovikenobi 4 points 2 days ago This isn't crime, it's warfare. Hopefully one day, we'll figure that out. permalink award report block reply A_Colostomy_Bag 4 points 2 days ago Berkeley should be bulldozed and replaced with a Christian school. permalink award report block reply Dev404 4 points 2 days ago If the governmen won't do it's job in enforcing peace from terrorists, then the people will and the government will need to be reset becaues it's proven itself to be utterly useless or an accomplice. Those are the only two answers. permalink award report block reply Citizen_Bob 4 points 2 days ago there should already be feds there and that creep should already be locked up facing 20 years what the fuck is our team doing permalink award report block reply thisisatestof2 4 points 2 days ago We gonna need another wall. permalink award report block reply Tico1968 3 points 2 days ago Sweet looking E21. permalink award report block reply suckmycorona 3 points 2 days ago Let me get this straight. Were the violent ones? permalink award report block reply FearGodTheAlmighty 2 points 2 days ago TPUSA is so hot right now permalink award report block reply Snooptwo 2 points 2 days ago All of this can be quickly stopped with live rounds. Just start shooting communists. No people will die. Fill up hell. Stop letting communists live freely in public. Fucking crazy permalink award report block reply NewGoldenAge 2 points 2 days ago If you don't shoot back after Charlie - you're just the next target. permalink award report block reply redditadminssuckit 2 points 2 days ago DEADLY DEFENSIVE FORCE AUTHORIZED permalink award report block reply SevenThunders 2 points 2 days ago They should be arrested and put into hard labor until they learn respect for America. permalink award report block reply rzeszowpatriot 2 points 2 days ago Designate Pantifa a FUCKING terrorist organization already permalink award report block reply Michalusmichalus 1 points 1 day ago Charge the individuals with harassment. permalink award report block reply jermzdeejd 1 points 1 day ago It's amazing what the covid masks were all about. permalink award report block reply barwhack 1 points 2 days ago Berkeley can burn down to cinders, and the world would not notice any detriment. Which is to say: Who cares. permalink award report block reply Pissonit 1 points 1 day ago Oh look Terrorist..... permalink award report block reply SALTY-OGRE 1 points 1 day ago FA! permalink award report block reply new_guy2 1 points 2 days ago Comment removed by community moderators. permalink award report block reply\nIncredibleMrE1 85 points 2 days ago UC Berkeley is Antifa Ground Zero. Pepe Farms remembers the Battle for Berkeley and Professor Bike Lock, Based Stickman, and Moldylocks. Spez: Obligatory - The Ballad of Moldylocks permalink award report block reply July_1776 24 points 2 days ago ahh, fren. I member, too. permalink parent award report block reply deleted 16 points 2 days ago Wtf_socialismreally 4 points 2 days ago I sometimes reference Venus even still. permalink parent award report block reply THELEADERSOFMEN 1 points 2 days ago Unfortunately, am I right lmao permalink parent award report block reply IncredibleMrE1 11 points 2 days ago Oh, and someone please remind me what Alex Soros' alma mater is? permalink parent award report block reply TheRedPike 1 points 1 day ago The gay bathhouse in Berkeley? permalink parent award report block reply Ikon 12 points 2 days ago Apparently there was a porno or some shit of moldylox as well and she had more hair in her bush than the moldy lox on her head. permalink parent award report block reply diverscale 9 points 2 days ago 4chan was busy back then permalink parent award report block reply Lulzokbro 3 points 2 days ago Well, get them off their ass, they need to use that weaponized autism again permalink parent award report block reply Viewer01 8 points 2 days ago Yea they dubbed her Snach-quatch cause she had a ragged pelt on that beat to shit cooter. permalink parent award report block reply Comanche_Moon 4 points 2 days ago She sold videos and peeks to guys who were obsessed with hairy bushes. permalink parent award report block reply Taqiyya_Mockingbird 9 points 2 days ago Yvette Felarca permalink parent award report block reply Moose_Antlers 2 points 2 days ago Name and shame. Normally, I follow the \"don't dox people\" rule, but with creeps like these who are literally trying to destroy my country and want me to die, it's time to name and shame. Antifa 1.0 was a communist rat's nest. So's the modern remake. permalink parent award report block reply Aquamine-Amarine 7 points 2 days ago Isn't this the same campus these faggots almost burned down because Milo was going to give a speech there years ago? Before or during Trump's first term. I remember Milo calling into Tucker's show to talk about it. permalink parent award report block reply IncredibleMrE1 4 points 2 days ago Yep, same one. permalink parent award report block reply AwareandNonCompliant 3 points 2 days ago Best part of that night was when the rioters came across Jake Shields who protected someone running from them.  They called him a NAZI and rushed him and he pulled off some MMA moves.  Then someone in the group said, I don’t think this guys a NAZI man and they disappeared real quick. permalink parent award report block reply DCPower 4 points 2 days ago Haha, thanks for sharing, hadn’t seen that one. permalink parent award report block reply load 7 more comments...\nJuly_1776 24 points 2 days ago ahh, fren. I member, too. permalink parent award report block reply deleted 16 points 2 days ago Wtf_socialismreally 4 points 2 days ago I sometimes reference Venus even still. permalink parent award report block reply THELEADERSOFMEN 1 points 2 days ago Unfortunately, am I right lmao permalink parent award report block reply IncredibleMrE1 11 points 2 days ago Oh, and someone please remind me what Alex Soros' alma mater is? permalink parent award report block reply TheRedPike 1 points 1 day ago The gay bathhouse in Berkeley? permalink parent award report block reply\ndeleted 16 points 2 days ago Wtf_socialismreally 4 points 2 days ago I sometimes reference Venus even still. permalink parent award report block reply THELEADERSOFMEN 1 points 2 days ago Unfortunately, am I right lmao permalink parent award report block reply\nWtf_socialismreally 4 points 2 days ago I sometimes reference Venus even still. permalink parent award report block reply\nTHELEADERSOFMEN 1 points 2 days ago Unfortunately, am I right lmao permalink parent award report block reply\nIncredibleMrE1 11 points 2 days ago Oh, and someone please remind me what Alex Soros' alma mater is? permalink parent award report block reply TheRedPike 1 points 1 day ago The gay bathhouse in Berkeley? permalink parent award report block reply\nTheRedPike 1 points 1 day ago The gay bathhouse in Berkeley? permalink parent award report block reply\nIkon 12 points 2 days ago Apparently there was a porno or some shit of moldylox as well and she had more hair in her bush than the moldy lox on her head. permalink parent award report block reply diverscale 9 points 2 days ago 4chan was busy back then permalink parent award report block reply Lulzokbro 3 points 2 days ago Well, get them off their ass, they need to use that weaponized autism again permalink parent award report block reply Viewer01 8 points 2 days ago Yea they dubbed her Snach-quatch cause she had a ragged pelt on that beat to shit cooter. permalink parent award report block reply Comanche_Moon 4 points 2 days ago She sold videos and peeks to guys who were obsessed with hairy bushes. permalink parent award report block reply\ndiverscale 9 points 2 days ago 4chan was busy back then permalink parent award report block reply Lulzokbro 3 points 2 days ago Well, get them off their ass, they need to use that weaponized autism again permalink parent award report block reply\nLulzokbro 3 points 2 days ago Well, get them off their ass, they need to use that weaponized autism again permalink parent award report block reply\nViewer01 8 points 2 days ago Yea they dubbed her Snach-quatch cause she had a ragged pelt on that beat to shit cooter. permalink parent award report block reply\nComanche_Moon 4 points 2 days ago She sold videos and peeks to guys who were obsessed with hairy bushes. permalink parent award report block reply\nTaqiyya_Mockingbird 9 points 2 days ago Yvette Felarca permalink parent award report block reply Moose_Antlers 2 points 2 days ago Name and shame. Normally, I follow the \"don't dox people\" rule, but with creeps like these who are literally trying to destroy my country and want me to die, it's time to name and shame. Antifa 1.0 was a communist rat's nest. So's the modern remake. permalink parent award report block reply\nMoose_Antlers 2 points 2 days ago Name and shame. Normally, I follow the \"don't dox people\" rule, but with creeps like these who are literally trying to destroy my country and want me to die, it's time to name and shame. Antifa 1.0 was a communist rat's nest. So's the modern remake. permalink parent award report block reply\nAquamine-Amarine 7 points 2 days ago Isn't this the same campus these faggots almost burned down because Milo was going to give a speech there years ago? Before or during Trump's first term. I remember Milo calling into Tucker's show to talk about it. permalink parent award report block reply IncredibleMrE1 4 points 2 days ago Yep, same one. permalink parent award report block reply AwareandNonCompliant 3 points 2 days ago Best part of that night was when the rioters came across Jake Shields who protected someone running from them.  They called him a NAZI and rushed him and he pulled off some MMA moves.  Then someone in the group said, I don’t think this guys a NAZI man and they disappeared real quick. permalink parent award report block reply\nIncredibleMrE1 4 points 2 days ago Yep, same one. permalink parent award report block reply\nAwareandNonCompliant 3 points 2 days ago Best part of that night was when the rioters came across Jake Shields who protected someone running from them.  They called him a NAZI and rushed him and he pulled off some MMA moves.  Then someone in the group said, I don’t think this guys a NAZI man and they disappeared real quick. permalink parent award report block reply\nDCPower 4 points 2 days ago Haha, thanks for sharing, hadn’t seen that one. permalink parent award report block reply\nJack_Dupp 46 points 2 days ago Lotta good declaring them a domestic terrorist org did… permalink award report block reply laxslash 23 points 2 days ago It was a strongly worded designation. permalink parent award report block reply JoeMcCarthyWasRight 22 points 2 days ago Makes Trump look weak af on domestic terrorism. Absolutely nothing has happened to these fucking traitors. Has there been one terrorism charge since? I know there’s been plenty of terrorism. permalink parent award report block reply Modernturnkey 14 points 2 days ago So far, Trump has been weak af on all fronts. I'm waiting on literally anything, anything, to happen. permalink parent award report block reply Rakkasan91b 5 points 2 days ago I hate to say it, but it looks like the only people that he has Bondi going after are the people who directly attacked him with the BS lawfare attacks and Russian Dossier.  Yes those people do need to be prosecuted for what they did, but there are a HELL of a lot more people and groups that they need to be going after.  Not next week, or next month, or after the midterms, this should have started 9 months ago. permalink parent award report block reply anotherthing 2 points 1 day ago And anti-Israel protestors. They went after them pretty good for a while. permalink parent award report block reply 10MeV 2 points 1 day ago Scam Blondi is probably afflicted with the same suicidal empathy problem most females have.  They should not be in leadership positions, period (no pun intended). permalink parent award report block reply view 1 more comments... THELEADERSOFMEN 1 points 1 day ago The Russia Russia Russia hoax was anything but BS lawfare. They wanted to put him away for LIFE, if not have him executed, and it was their number one weapon in stealing 2020. permalink parent award report block reply Moose_Antlers 3 points 2 days ago You guys really need to learn how law enforcement works on organizations like this. You map them out. You document their entire social network, their funding. You watch everything they do and collect evidence that's admissible in court. When you finally move, you take them all down, particularly the leaders. It takes time. This is how they do anti-racketeering work, anti-mafia, anti-gang, anti-cartel ... etc. Every time you see the FBI bragging about busting 30 men running a human trafficking and prostitution ring, this is how they do it. It's months to years' worth of work to get these creeps. Let Trump work. Good Lord, impatient people. permalink parent award report block reply\nlaxslash 23 points 2 days ago It was a strongly worded designation. permalink parent award report block reply\nJoeMcCarthyWasRight 22 points 2 days ago Makes Trump look weak af on domestic terrorism. Absolutely nothing has happened to these fucking traitors. Has there been one terrorism charge since? I know there’s been plenty of terrorism. permalink parent award report block reply Modernturnkey 14 points 2 days ago So far, Trump has been weak af on all fronts. I'm waiting on literally anything, anything, to happen. permalink parent award report block reply Rakkasan91b 5 points 2 days ago I hate to say it, but it looks like the only people that he has Bondi going after are the people who directly attacked him with the BS lawfare attacks and Russian Dossier.  Yes those people do need to be prosecuted for what they did, but there are a HELL of a lot more people and groups that they need to be going after.  Not next week, or next month, or after the midterms, this should have started 9 months ago. permalink parent award report block reply anotherthing 2 points 1 day ago And anti-Israel protestors. They went after them pretty good for a while. permalink parent award report block reply 10MeV 2 points 1 day ago Scam Blondi is probably afflicted with the same suicidal empathy problem most females have.  They should not be in leadership positions, period (no pun intended). permalink parent award report block reply view 1 more comments... THELEADERSOFMEN 1 points 1 day ago The Russia Russia Russia hoax was anything but BS lawfare. They wanted to put him away for LIFE, if not have him executed, and it was their number one weapon in stealing 2020. permalink parent award report block reply\nModernturnkey 14 points 2 days ago So far, Trump has been weak af on all fronts. I'm waiting on literally anything, anything, to happen. permalink parent award report block reply Rakkasan91b 5 points 2 days ago I hate to say it, but it looks like the only people that he has Bondi going after are the people who directly attacked him with the BS lawfare attacks and Russian Dossier.  Yes those people do need to be prosecuted for what they did, but there are a HELL of a lot more people and groups that they need to be going after.  Not next week, or next month, or after the midterms, this should have started 9 months ago. permalink parent award report block reply anotherthing 2 points 1 day ago And anti-Israel protestors. They went after them pretty good for a while. permalink parent award report block reply 10MeV 2 points 1 day ago Scam Blondi is probably afflicted with the same suicidal empathy problem most females have.  They should not be in leadership positions, period (no pun intended). permalink parent award report block reply view 1 more comments... THELEADERSOFMEN 1 points 1 day ago The Russia Russia Russia hoax was anything but BS lawfare. They wanted to put him away for LIFE, if not have him executed, and it was their number one weapon in stealing 2020. permalink parent award report block reply\nRakkasan91b 5 points 2 days ago I hate to say it, but it looks like the only people that he has Bondi going after are the people who directly attacked him with the BS lawfare attacks and Russian Dossier.  Yes those people do need to be prosecuted for what they did, but there are a HELL of a lot more people and groups that they need to be going after.  Not next week, or next month, or after the midterms, this should have started 9 months ago. permalink parent award report block reply anotherthing 2 points 1 day ago And anti-Israel protestors. They went after them pretty good for a while. permalink parent award report block reply 10MeV 2 points 1 day ago Scam Blondi is probably afflicted with the same suicidal empathy problem most females have.  They should not be in leadership positions, period (no pun intended). permalink parent award report block reply view 1 more comments... THELEADERSOFMEN 1 points 1 day ago The Russia Russia Russia hoax was anything but BS lawfare. They wanted to put him away for LIFE, if not have him executed, and it was their number one weapon in stealing 2020. permalink parent award report block reply\nanotherthing 2 points 1 day ago And anti-Israel protestors. They went after them pretty good for a while. permalink parent award report block reply\n10MeV 2 points 1 day ago Scam Blondi is probably afflicted with the same suicidal empathy problem most females have.  They should not be in leadership positions, period (no pun intended). permalink parent award report block reply view 1 more comments...\nTHELEADERSOFMEN 1 points 1 day ago The Russia Russia Russia hoax was anything but BS lawfare. They wanted to put him away for LIFE, if not have him executed, and it was their number one weapon in stealing 2020. permalink parent award report block reply\nMoose_Antlers 3 points 2 days ago You guys really need to learn how law enforcement works on organizations like this. You map them out. You document their entire social network, their funding. You watch everything they do and collect evidence that's admissible in court. When you finally move, you take them all down, particularly the leaders. It takes time. This is how they do anti-racketeering work, anti-mafia, anti-gang, anti-cartel ... etc. Every time you see the FBI bragging about busting 30 men running a human trafficking and prostitution ring, this is how they do it. It's months to years' worth of work to get these creeps. Let Trump work. Good Lord, impatient people. permalink parent award report block reply\nIPMang 25 points 2 days ago What's fucked up about this \"protesting\" is it 100% RELIES on the criminal justice system to protect them. They instigate, but there can be no response. It's an absolute abuse of the country. Like they're outside fighting the police... But it's the police who are keeping them protected. Without the police, these fuckers would be erased in a single day. permalink award report block reply Modernturnkey 9 points 2 days ago Which is why, in no way shape or form, are police good. They're not on our side. They protect criminals from real justice, collect guns, and kill our side for even talking of making meaningful change. permalink parent award report block reply\nModernturnkey 9 points 2 days ago Which is why, in no way shape or form, are police good. They're not on our side. They protect criminals from real justice, collect guns, and kill our side for even talking of making meaningful change. permalink parent award report block reply\nMEME-SUPREME 17 points 2 days ago Nuke it from orbit it's the only way to be sure. permalink award report block reply\nJoeMcCarthyWasRight 14 points 2 days ago Berkeley Riots 2? LFG. Who wants to be this go arounds Moldy Locks? permalink award report block reply\nSavingPrivateGrace 13 points 2 days ago The Antifa riots didn't work.  The Tour, TPUSA Live https://www.youtube.com/watch?v=D5bNZ9pt3Ds permalink award report block reply DCPower 5 points 2 days ago Nice permalink parent award report block reply NoClueForAName2 5 points 2 days ago It’s still going? Good for them 👍 permalink parent award report block reply\nDCPower 5 points 2 days ago Nice permalink parent award report block reply\nNoClueForAName2 5 points 2 days ago It’s still going? Good for them 👍 permalink parent award report block reply\nrangooooo 12 points 2 days ago Sounds like terrorism to me permalink award report block reply sixfingerdildo 5 points 2 days ago Only half a step from burning crosses permalink parent award report block reply\nsixfingerdildo 5 points 2 days ago Only half a step from burning crosses permalink parent award report block reply\n1776take2 11 points 2 days ago Send in the National Guard… permalink award report block reply starjello 2 points 2 days ago Trump is waiting for a judge's permission, the democrat judge at that permalink parent award report block reply\nstarjello 2 points 2 days ago Trump is waiting for a judge's permission, the democrat judge at that permalink parent award report block reply\nHanging_Chad 10 points 2 days ago what did I just watch permalink award report block reply Skogin 10 points 2 days ago bunch of unhappy faggots permalink parent award report block reply\nSkogin 10 points 2 days ago bunch of unhappy faggots permalink parent award report block reply\ncd3dog 7 points 2 days ago Ahhh.  I give you the ever-tolerant and inclusive left.  Well done.  Well done indeed. permalink award report block reply\nGenerallyRight 6 points 2 days ago Higher education...  Thoughtful exchange of ideas...  Tolerance and all... permalink award report block reply\nWarOfTheFanboys2 5 points 2 days ago Reminder that EVERY liberal is a terrorist fascist. They would slit your throat the moment they can. permalink award report block reply\nMAGAguitar 5 points 2 days ago They are a unique zone of faggots Berkeley. permalink award report block reply\nitspancakees 5 points 2 days ago Pam is going to investigate these terrorists right away, she just needs to get her nails done first permalink award report block reply Filo76 2 points 2 days ago She's gotta go on Fox News and talk about it as well. By it I mean her nails.  Not investigating, or heaven forbid, prosecuting ANTIFA. permalink parent award report block reply itspancakees 2 points 2 days ago Give her a break, she has 10 of them!! Ten!!! Do you know how busy she is trying to get all 10 of her nails done? That's not even counting the toes. I'm about ready to vote for bernie as much as you MAGA people complain permalink parent award report block reply\nFilo76 2 points 2 days ago She's gotta go on Fox News and talk about it as well. By it I mean her nails.  Not investigating, or heaven forbid, prosecuting ANTIFA. permalink parent award report block reply itspancakees 2 points 2 days ago Give her a break, she has 10 of them!! Ten!!! Do you know how busy she is trying to get all 10 of her nails done? That's not even counting the toes. I'm about ready to vote for bernie as much as you MAGA people complain permalink parent award report block reply\nitspancakees 2 points 2 days ago Give her a break, she has 10 of them!! Ten!!! Do you know how busy she is trying to get all 10 of her nails done? That's not even counting the toes. I'm about ready to vote for bernie as much as you MAGA people complain permalink parent award report block reply\nFusionBlack 4 points 2 days ago Ban forgien students completely. Sorry that may cause harm for a peace or trade deal... This is out of control. permalink award report block reply Michalusmichalus 2 points 1 day ago Foreign students are cash paying at the highest rates. That's why schools keep taking in more, and more. permalink parent award report block reply\nMichalusmichalus 2 points 1 day ago Foreign students are cash paying at the highest rates. That's why schools keep taking in more, and more. permalink parent award report block reply\nbenjovikenobi 4 points 2 days ago This isn't crime, it's warfare. Hopefully one day, we'll figure that out. permalink award report block reply\nA_Colostomy_Bag 4 points 2 days ago Berkeley should be bulldozed and replaced with a Christian school. permalink award report block reply\nDev404 4 points 2 days ago If the governmen won't do it's job in enforcing peace from terrorists, then the people will and the government will need to be reset becaues it's proven itself to be utterly useless or an accomplice. Those are the only two answers. permalink award report block reply\nCitizen_Bob 4 points 2 days ago there should already be feds there and that creep should already be locked up facing 20 years what the fuck is our team doing permalink award report block reply\nthisisatestof2 4 points 2 days ago We gonna need another wall. permalink award report block reply\nTico1968 3 points 2 days ago Sweet looking E21. permalink award report block reply\nsuckmycorona 3 points 2 days ago Let me get this straight. Were the violent ones? permalink award report block reply\nFearGodTheAlmighty 2 points 2 days ago TPUSA is so hot right now permalink award report block reply\nSnooptwo 2 points 2 days ago All of this can be quickly stopped with live rounds. Just start shooting communists. No people will die. Fill up hell. Stop letting communists live freely in public. Fucking crazy permalink award report block reply\nNewGoldenAge 2 points 2 days ago If you don't shoot back after Charlie - you're just the next target. permalink award report block reply\nredditadminssuckit 2 points 2 days ago DEADLY DEFENSIVE FORCE AUTHORIZED permalink award report block reply\nSevenThunders 2 points 2 days ago They should be arrested and put into hard labor until they learn respect for America. permalink award report block reply\nrzeszowpatriot 2 points 2 days ago Designate Pantifa a FUCKING terrorist organization already permalink award report block reply\nMichalusmichalus 1 points 1 day ago Charge the individuals with harassment. permalink award report block reply\njermzdeejd 1 points 1 day ago It's amazing what the covid masks were all about. permalink award report block reply\nbarwhack 1 points 2 days ago Berkeley can burn down to cinders, and the world would not notice any detriment. Which is to say: Who cares. permalink award report block reply\nPissonit 1 points 1 day ago Oh look Terrorist..... permalink award report block reply\nSALTY-OGRE 1 points 1 day ago FA! permalink award report block reply\nnew_guy2 1 points 2 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T22:49:10.062491Z"
}