{
  "id": "1ARK9nOG14",
  "url": "https://patriots.win/p/1ARK9nOG14/centerfold-from-last-weeks-new-r/c",
  "content": "17 Centerfold from last week's new Robert Crumb comic are the worries pages CONSPIRACY THEORIES!... QUESTION AUTHORITY posted 9 hours ago by Sunnybats2 8 comments award share download report block\n8 comments Sort by Top Top New Worst Old Save Around the Web reversethefraud 3 points 8 hours ago I still cant smell, especially bathroom smells. Makes me wonder if that wasn't engineered to make the third worlders they imported more tolerable. permalink award report block reply Sunnybats2 OP 1 points 8 hours ago Huh permalink parent award report block reply reversethefraud 2 points 8 hours ago loss of smell from covid 19 the engineered virus. permalink parent award report block reply oldftg 2 points 6 hours ago I didn't know Crumb was still producing. I'll have to look him up. permalink award report block reply Sunnybats2 OP 1 points 58 minutes ago Yeah i had thought he wa dead hah\nIt is called Tales Of Paranoia i think permalink parent award report block reply Sunnybats2 OP 1 points 8 hours ago WORDIEST** KILL AUTOCORRECT IMMEDIATELY permalink award report block reply breadbaker 0 points 8 hours ago Sorry, can't read Comic Sans. Please translate. permalink award report block reply Sunnybats2 OP 1 points 8 hours ago It says BREADBAKER IS PUSSY WHO NEEDS TO STFU FOREVER Hope this helps permalink parent award report block reply\nreversethefraud 3 points 8 hours ago I still cant smell, especially bathroom smells. Makes me wonder if that wasn't engineered to make the third worlders they imported more tolerable. permalink award report block reply Sunnybats2 OP 1 points 8 hours ago Huh permalink parent award report block reply reversethefraud 2 points 8 hours ago loss of smell from covid 19 the engineered virus. permalink parent award report block reply\nSunnybats2 OP 1 points 8 hours ago Huh permalink parent award report block reply reversethefraud 2 points 8 hours ago loss of smell from covid 19 the engineered virus. permalink parent award report block reply\nreversethefraud 2 points 8 hours ago loss of smell from covid 19 the engineered virus. permalink parent award report block reply\noldftg 2 points 6 hours ago I didn't know Crumb was still producing. I'll have to look him up. permalink award report block reply Sunnybats2 OP 1 points 58 minutes ago Yeah i had thought he wa dead hah\nIt is called Tales Of Paranoia i think permalink parent award report block reply\nSunnybats2 OP 1 points 58 minutes ago Yeah i had thought he wa dead hah\nIt is called Tales Of Paranoia i think permalink parent award report block reply\nSunnybats2 OP 1 points 8 hours ago WORDIEST** KILL AUTOCORRECT IMMEDIATELY permalink award report block reply\nbreadbaker 0 points 8 hours ago Sorry, can't read Comic Sans. Please translate. permalink award report block reply Sunnybats2 OP 1 points 8 hours ago It says BREADBAKER IS PUSSY WHO NEEDS TO STFU FOREVER Hope this helps permalink parent award report block reply\nSunnybats2 OP 1 points 8 hours ago It says BREADBAKER IS PUSSY WHO NEEDS TO STFU FOREVER Hope this helps permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:28:35.317193Z"
}