{
  "id": "8177871",
  "title": "1161OBAMA Pentagon official publicly called for a  MILITARY COUP against Trump just 10 days after be",
  "url": "https://patriots.win/p/1ARK591SHx/obama-pentagon-official-publicly/c",
  "content": "1161 OBAMA Pentagon official publicly called for a  MILITARY COUP against Trump just 10 days after becoming president. 🛑  Corrupt Commies  🛑 posted 3 days ago by IronWolve 49 comments award share report block The SCIF @TheIntelSCIF • 4d OBAMA Pentagon official publicly called for a  MILITARY COUP against Trump just 10 days after becoming president. Coincidentally, the Russian Collusion Hoax and many others were initiated to take Trump down. Trump wasn't just up against Obama and the Clintons, etc., he was up\n49 comments Sort by Top Top New Worst Old Save MEME-SUPREME 59 points 3 days ago HANGINGS WHEN? permalink award report block reply kristal 19 points 3 days ago Best we can do is give another $20 billion in weapons to lsraeIi ICC war criminal squatters. I have a good feeling this time they'll stop spitting on us for being Christian. permalink parent award report block reply Briben 2 points 3 days ago Is it hot in Pakistan this time of year? permalink parent award report block reply conservativefrank -3 points 3 days ago Right to \"the Jews the Jews the Jews!\" permalink parent award report block reply lash 15 points 3 days ago Hangings LOL, they probably still work there ffs.. permalink parent award report block reply ScamBlondie 6 points 3 days ago Probably got a promotion permalink parent award report block reply Rock9Head 6 points 3 days ago Many already skated out with their great pension. permalink parent award report block reply Peekov3 9 points 3 days ago 2 weeks permalink parent award report block reply LogicCircuits 9 points 3 days ago 2 weeks permalink parent award report block reply load 8 more comments... Prof_Smith 21 points 3 days ago And nothing will happen. Congress won’t do anything. DC courts won’t do anything. Even at trial a DC jury won’t do anything. permalink award report block reply USDMaga 4 points 3 days ago Its not like he called for a Senator to be removed from office, that would result in jail time for him Only when Congress is bothered is anything done. permalink parent award report block reply PatriotSkorzeny 19 points 3 days ago What til you see what the Capitol Police did on J6! And then when the Border Patrol let millions of hostile foreigners in to slaughter Americans cause Alejandro said so. You’ll be more and more dissatisfied.🤣 permalink award report block reply pepperonishoes 8 points 3 days ago but, but, Alejandro said the border was completely secure. permalink parent award report block reply SicSemperTyrannis2 3 points 3 days ago So was the election ;) permalink parent award report block reply snoopy3210 3 points 3 days ago In 2021 both Biden and Trudeau opened the border. It was synchronized because they were both (along with Mayorkas) following the Swiss Great Reset plan, which involves mass spending on migrants to destroy the currency and replace it with a Swiss CBDC provided by the IMF. All the INSANE mass spending during Covid that didn’t even go towards hospitals, all the covid loans, all the checks, all the money printing for another Covid bill after Biden got in, and for his insane Inflation reduction act formerly called the green new deal, was done in preparation for the replacement of our currencies with the IMF digital one. Now available in the UK! permalink parent award report block reply N0rds 1 points 3 days ago Comment removed by community filter. permalink parent award report block reply questionmarks 9 points 3 days ago either all of this is bullshit or trump is inept and powerless pick one permalink award report block reply Mitch_WerBell_III 4 points 3 days ago It’s probably just overhyped bullshit to generate Twitter fag following. permalink parent award report block reply Klaus73 2 points 3 days ago I mean obviously this was a five alarm fire given it happened..(checks watch) 9 months ago? permalink parent award report block reply Kraken_V_Algorithm 1 points 3 days ago I think this goes back to his first term permalink parent award report block reply Klaus73 1 points 3 days ago Oof thats even longer...how is this being posted now? permalink parent award report block reply Sparks1017 7 points 3 days ago They ALL MUST BE HANGED!! permalink award report block reply PorchLightOn 4 points 3 days ago Here's an archived link to the trashy editorial by Rosa Brooks in Jan 2017, in Foreign Policy: \"Three Ways to Get Rid of President Trump Before 2020\" https://archive.is/h6sIi permalink award report block reply Fanakapan 3 points 3 days ago Anti war activist and wife of 'Special Forces Officer' ????  Seems like some stick needs to be put about in the officers club ? permalink award report block reply geekesmind 3 points 3 days ago Jesus Christ Obama is the only ex president I know that WONT GO THE FUCK AWAY. Every ex president has went away but this bastard permalink award report block reply ancroidubh 3 points 3 days ago Sooner or later, the unorganized militia will need to step up and put a stop this shit. permalink award report block reply SaltyTitties4 3 points 3 days ago Lloyd Austin and General Milley all walked free.  Remember that shit?  Nothing happened  to them except they are still enjoying their inflated salaries and will get their retirement for the rest of their lives.  But a hundred thousand regular old military men and women got kicked out for not taking the “covid vaccine.” And the reason is bc we are too stupid and gullible, and we let our attention go on to the next “story” and psyop upon which the want us to get jinned up about- until they give us the next one, and so on. permalink award report block reply Smurfection 2 points 3 days ago How did a pacifist end up as number 3 in the War Department?  How did a communist Gus Hall voter end up as the Director of the CIA?    Government needs to relearn the basics of how our government works and each part of it needs to focus on the mission, not partisan politics. permalink award report block reply GodKingHarambe 1 points 3 days ago Recall retired Joseph Mouer to active duty and court martial permalink award report block reply GodKingHarambe 3 points 3 days ago \"From 2016 to 2020, she was also a reserve police officer with the Metropolitan Police Department of the District of Columbia\" Interesting.... permalink parent award report block reply 2016TrumpMAGA 2 points 3 days ago A way to funnel extra $ her way without her having to do anything. permalink parent award report block reply Dieselslacker 1 points 3 days ago They better do something, bc the velvet glove is gone, the iron fist underneath is poised to strike Trump, MAGA, and no telling who else permalink award report block reply Briben 1 points 3 days ago Many are still there. permalink award report block reply Treefiddydiddy 1 points 3 days ago do I even need to early life this bish.... permalink award report block reply OxAO 1 points 3 days ago Rosa Brooks now works for \"deep state network\"\nExample of Rosa talking about elections: https://youtu.be/qSRADQ0S3d0?t=1501 permalink award report block reply hairless_ap3 1 points 3 days ago Was it some liberal white faggot? permalink award report block reply PorchLightOn 3 points 3 days ago When Brooks wrote the 2017 editorial, she was an armed reserve officer (and attorney) in the DC Metro Police. But before that she worked at the Pentagon as counsel to Under Sec of Defense for Policy Michelle Fluornoy. Now Brooks is a Georgetown law professor. From Grokipedia: https://grokipedia.com/page/Rosa_Brooks#rosa-brooks Rosa Brooks is an American law professor at Georgetown University, former senior official in the Obama administration's Department of Defense, reserve police officer, and author focused on national security, the militarization of policy, and policing.[1] She earned an A.B. in history and literature from Harvard University in 1991, an M.St. in social anthropology from Oxford University in 1993, and a J.D. from Yale Law School.[2] From 2009 to 2011, Brooks served as Counselor to Under Secretary of Defense for Policy Michèle Flournoy, advising on rule of law, humanitarian policy, and countering violent extremism. [1] In this role, she contributed to efforts addressing the expanding scope of U.S. military involvement in non-traditional security domains, a theme central to her 2016 book How Everything Became War and the Military Became Everything: Tales from the Pentagon.[3] Brooks later joined the Washington, D.C., Metropolitan Police Department as an armed reserve officer from 2016 to 2020, an experience that informed her 2021 book Tangled Up in Blue: Policing the American City, which critiques systemic issues in law enforcement while drawing from firsthand observation.[4] Her writings have included controversial proposals, such as a 2017 Foreign Policy article outlining mechanisms—including invocation of the 25th Amendment or military intervention—to remove President Donald Trump from office before 2020, prompting accusations of advocating undemocratic actions. [5] permalink parent award report block reply hairless_ap3 2 points 3 days ago Thanks permalink parent award report block reply readonly-polarbear 1 points 3 days ago The Ob'hillary complex was frightened that anyone other than their chosen could get into office. Does it surprise anyone that they would do this? permalink award report block reply KennyKetchem 1 points 3 days ago Why do they always use women to go after Trump? Fani, Peek-A-Boo James, Cassidy Hutchinson, E. Jean Carroll, Liz Cheney, Adam Schiff permalink award report block reply\nMEME-SUPREME 59 points 3 days ago HANGINGS WHEN? permalink award report block reply kristal 19 points 3 days ago Best we can do is give another $20 billion in weapons to lsraeIi ICC war criminal squatters. I have a good feeling this time they'll stop spitting on us for being Christian. permalink parent award report block reply Briben 2 points 3 days ago Is it hot in Pakistan this time of year? permalink parent award report block reply conservativefrank -3 points 3 days ago Right to \"the Jews the Jews the Jews!\" permalink parent award report block reply lash 15 points 3 days ago Hangings LOL, they probably still work there ffs.. permalink parent award report block reply ScamBlondie 6 points 3 days ago Probably got a promotion permalink parent award report block reply Rock9Head 6 points 3 days ago Many already skated out with their great pension. permalink parent award report block reply Peekov3 9 points 3 days ago 2 weeks permalink parent award report block reply LogicCircuits 9 points 3 days ago 2 weeks permalink parent award report block reply load 8 more comments...\nkristal 19 points 3 days ago Best we can do is give another $20 billion in weapons to lsraeIi ICC war criminal squatters. I have a good feeling this time they'll stop spitting on us for being Christian. permalink parent award report block reply Briben 2 points 3 days ago Is it hot in Pakistan this time of year? permalink parent award report block reply conservativefrank -3 points 3 days ago Right to \"the Jews the Jews the Jews!\" permalink parent award report block reply\nBriben 2 points 3 days ago Is it hot in Pakistan this time of year? permalink parent award report block reply\nconservativefrank -3 points 3 days ago Right to \"the Jews the Jews the Jews!\" permalink parent award report block reply\nlash 15 points 3 days ago Hangings LOL, they probably still work there ffs.. permalink parent award report block reply ScamBlondie 6 points 3 days ago Probably got a promotion permalink parent award report block reply Rock9Head 6 points 3 days ago Many already skated out with their great pension. permalink parent award report block reply\nScamBlondie 6 points 3 days ago Probably got a promotion permalink parent award report block reply\nRock9Head 6 points 3 days ago Many already skated out with their great pension. permalink parent award report block reply\nPeekov3 9 points 3 days ago 2 weeks permalink parent award report block reply\nLogicCircuits 9 points 3 days ago 2 weeks permalink parent award report block reply\nProf_Smith 21 points 3 days ago And nothing will happen. Congress won’t do anything. DC courts won’t do anything. Even at trial a DC jury won’t do anything. permalink award report block reply USDMaga 4 points 3 days ago Its not like he called for a Senator to be removed from office, that would result in jail time for him Only when Congress is bothered is anything done. permalink parent award report block reply\nUSDMaga 4 points 3 days ago Its not like he called for a Senator to be removed from office, that would result in jail time for him Only when Congress is bothered is anything done. permalink parent award report block reply\nPatriotSkorzeny 19 points 3 days ago What til you see what the Capitol Police did on J6! And then when the Border Patrol let millions of hostile foreigners in to slaughter Americans cause Alejandro said so. You’ll be more and more dissatisfied.🤣 permalink award report block reply pepperonishoes 8 points 3 days ago but, but, Alejandro said the border was completely secure. permalink parent award report block reply SicSemperTyrannis2 3 points 3 days ago So was the election ;) permalink parent award report block reply snoopy3210 3 points 3 days ago In 2021 both Biden and Trudeau opened the border. It was synchronized because they were both (along with Mayorkas) following the Swiss Great Reset plan, which involves mass spending on migrants to destroy the currency and replace it with a Swiss CBDC provided by the IMF. All the INSANE mass spending during Covid that didn’t even go towards hospitals, all the covid loans, all the checks, all the money printing for another Covid bill after Biden got in, and for his insane Inflation reduction act formerly called the green new deal, was done in preparation for the replacement of our currencies with the IMF digital one. Now available in the UK! permalink parent award report block reply N0rds 1 points 3 days ago Comment removed by community filter. permalink parent award report block reply\npepperonishoes 8 points 3 days ago but, but, Alejandro said the border was completely secure. permalink parent award report block reply SicSemperTyrannis2 3 points 3 days ago So was the election ;) permalink parent award report block reply\nSicSemperTyrannis2 3 points 3 days ago So was the election ;) permalink parent award report block reply\nsnoopy3210 3 points 3 days ago In 2021 both Biden and Trudeau opened the border. It was synchronized because they were both (along with Mayorkas) following the Swiss Great Reset plan, which involves mass spending on migrants to destroy the currency and replace it with a Swiss CBDC provided by the IMF. All the INSANE mass spending during Covid that didn’t even go towards hospitals, all the covid loans, all the checks, all the money printing for another Covid bill after Biden got in, and for his insane Inflation reduction act formerly called the green new deal, was done in preparation for the replacement of our currencies with the IMF digital one. Now available in the UK! permalink parent award report block reply N0rds 1 points 3 days ago Comment removed by community filter. permalink parent award report block reply\nN0rds 1 points 3 days ago Comment removed by community filter. permalink parent award report block reply\nquestionmarks 9 points 3 days ago either all of this is bullshit or trump is inept and powerless pick one permalink award report block reply Mitch_WerBell_III 4 points 3 days ago It’s probably just overhyped bullshit to generate Twitter fag following. permalink parent award report block reply Klaus73 2 points 3 days ago I mean obviously this was a five alarm fire given it happened..(checks watch) 9 months ago? permalink parent award report block reply Kraken_V_Algorithm 1 points 3 days ago I think this goes back to his first term permalink parent award report block reply Klaus73 1 points 3 days ago Oof thats even longer...how is this being posted now? permalink parent award report block reply\nMitch_WerBell_III 4 points 3 days ago It’s probably just overhyped bullshit to generate Twitter fag following. permalink parent award report block reply Klaus73 2 points 3 days ago I mean obviously this was a five alarm fire given it happened..(checks watch) 9 months ago? permalink parent award report block reply Kraken_V_Algorithm 1 points 3 days ago I think this goes back to his first term permalink parent award report block reply Klaus73 1 points 3 days ago Oof thats even longer...how is this being posted now? permalink parent award report block reply\nKlaus73 2 points 3 days ago I mean obviously this was a five alarm fire given it happened..(checks watch) 9 months ago? permalink parent award report block reply Kraken_V_Algorithm 1 points 3 days ago I think this goes back to his first term permalink parent award report block reply Klaus73 1 points 3 days ago Oof thats even longer...how is this being posted now? permalink parent award report block reply\nKraken_V_Algorithm 1 points 3 days ago I think this goes back to his first term permalink parent award report block reply Klaus73 1 points 3 days ago Oof thats even longer...how is this being posted now? permalink parent award report block reply\nKlaus73 1 points 3 days ago Oof thats even longer...how is this being posted now? permalink parent award report block reply\nSparks1017 7 points 3 days ago They ALL MUST BE HANGED!! permalink award report block reply\nPorchLightOn 4 points 3 days ago Here's an archived link to the trashy editorial by Rosa Brooks in Jan 2017, in Foreign Policy: \"Three Ways to Get Rid of President Trump Before 2020\" https://archive.is/h6sIi permalink award report block reply\nFanakapan 3 points 3 days ago Anti war activist and wife of 'Special Forces Officer' ????  Seems like some stick needs to be put about in the officers club ? permalink award report block reply\ngeekesmind 3 points 3 days ago Jesus Christ Obama is the only ex president I know that WONT GO THE FUCK AWAY. Every ex president has went away but this bastard permalink award report block reply\nancroidubh 3 points 3 days ago Sooner or later, the unorganized militia will need to step up and put a stop this shit. permalink award report block reply\nSaltyTitties4 3 points 3 days ago Lloyd Austin and General Milley all walked free.  Remember that shit?  Nothing happened  to them except they are still enjoying their inflated salaries and will get their retirement for the rest of their lives.  But a hundred thousand regular old military men and women got kicked out for not taking the “covid vaccine.” And the reason is bc we are too stupid and gullible, and we let our attention go on to the next “story” and psyop upon which the want us to get jinned up about- until they give us the next one, and so on. permalink award report block reply\nSmurfection 2 points 3 days ago How did a pacifist end up as number 3 in the War Department?  How did a communist Gus Hall voter end up as the Director of the CIA?    Government needs to relearn the basics of how our government works and each part of it needs to focus on the mission, not partisan politics. permalink award report block reply\nGodKingHarambe 1 points 3 days ago Recall retired Joseph Mouer to active duty and court martial permalink award report block reply GodKingHarambe 3 points 3 days ago \"From 2016 to 2020, she was also a reserve police officer with the Metropolitan Police Department of the District of Columbia\" Interesting.... permalink parent award report block reply 2016TrumpMAGA 2 points 3 days ago A way to funnel extra $ her way without her having to do anything. permalink parent award report block reply\nGodKingHarambe 3 points 3 days ago \"From 2016 to 2020, she was also a reserve police officer with the Metropolitan Police Department of the District of Columbia\" Interesting.... permalink parent award report block reply 2016TrumpMAGA 2 points 3 days ago A way to funnel extra $ her way without her having to do anything. permalink parent award report block reply\n2016TrumpMAGA 2 points 3 days ago A way to funnel extra $ her way without her having to do anything. permalink parent award report block reply\nDieselslacker 1 points 3 days ago They better do something, bc the velvet glove is gone, the iron fist underneath is poised to strike Trump, MAGA, and no telling who else permalink award report block reply\nBriben 1 points 3 days ago Many are still there. permalink award report block reply\nTreefiddydiddy 1 points 3 days ago do I even need to early life this bish.... permalink award report block reply\nOxAO 1 points 3 days ago Rosa Brooks now works for \"deep state network\"\nExample of Rosa talking about elections: https://youtu.be/qSRADQ0S3d0?t=1501 permalink award report block reply\nhairless_ap3 1 points 3 days ago Was it some liberal white faggot? permalink award report block reply PorchLightOn 3 points 3 days ago When Brooks wrote the 2017 editorial, she was an armed reserve officer (and attorney) in the DC Metro Police. But before that she worked at the Pentagon as counsel to Under Sec of Defense for Policy Michelle Fluornoy. Now Brooks is a Georgetown law professor. From Grokipedia: https://grokipedia.com/page/Rosa_Brooks#rosa-brooks Rosa Brooks is an American law professor at Georgetown University, former senior official in the Obama administration's Department of Defense, reserve police officer, and author focused on national security, the militarization of policy, and policing.[1] She earned an A.B. in history and literature from Harvard University in 1991, an M.St. in social anthropology from Oxford University in 1993, and a J.D. from Yale Law School.[2] From 2009 to 2011, Brooks served as Counselor to Under Secretary of Defense for Policy Michèle Flournoy, advising on rule of law, humanitarian policy, and countering violent extremism. [1] In this role, she contributed to efforts addressing the expanding scope of U.S. military involvement in non-traditional security domains, a theme central to her 2016 book How Everything Became War and the Military Became Everything: Tales from the Pentagon.[3] Brooks later joined the Washington, D.C., Metropolitan Police Department as an armed reserve officer from 2016 to 2020, an experience that informed her 2021 book Tangled Up in Blue: Policing the American City, which critiques systemic issues in law enforcement while drawing from firsthand observation.[4] Her writings have included controversial proposals, such as a 2017 Foreign Policy article outlining mechanisms—including invocation of the 25th Amendment or military intervention—to remove President Donald Trump from office before 2020, prompting accusations of advocating undemocratic actions. [5] permalink parent award report block reply hairless_ap3 2 points 3 days ago Thanks permalink parent award report block reply\nPorchLightOn 3 points 3 days ago When Brooks wrote the 2017 editorial, she was an armed reserve officer (and attorney) in the DC Metro Police. But before that she worked at the Pentagon as counsel to Under Sec of Defense for Policy Michelle Fluornoy. Now Brooks is a Georgetown law professor. From Grokipedia: https://grokipedia.com/page/Rosa_Brooks#rosa-brooks Rosa Brooks is an American law professor at Georgetown University, former senior official in the Obama administration's Department of Defense, reserve police officer, and author focused on national security, the militarization of policy, and policing.[1] She earned an A.B. in history and literature from Harvard University in 1991, an M.St. in social anthropology from Oxford University in 1993, and a J.D. from Yale Law School.[2] From 2009 to 2011, Brooks served as Counselor to Under Secretary of Defense for Policy Michèle Flournoy, advising on rule of law, humanitarian policy, and countering violent extremism. [1] In this role, she contributed to efforts addressing the expanding scope of U.S. military involvement in non-traditional security domains, a theme central to her 2016 book How Everything Became War and the Military Became Everything: Tales from the Pentagon.[3] Brooks later joined the Washington, D.C., Metropolitan Police Department as an armed reserve officer from 2016 to 2020, an experience that informed her 2021 book Tangled Up in Blue: Policing the American City, which critiques systemic issues in law enforcement while drawing from firsthand observation.[4] Her writings have included controversial proposals, such as a 2017 Foreign Policy article outlining mechanisms—including invocation of the 25th Amendment or military intervention—to remove President Donald Trump from office before 2020, prompting accusations of advocating undemocratic actions. [5] permalink parent award report block reply hairless_ap3 2 points 3 days ago Thanks permalink parent award report block reply\nhairless_ap3 2 points 3 days ago Thanks permalink parent award report block reply\nreadonly-polarbear 1 points 3 days ago The Ob'hillary complex was frightened that anyone other than their chosen could get into office. Does it surprise anyone that they would do this? permalink award report block reply\nKennyKetchem 1 points 3 days ago Why do they always use women to go after Trump? Fani, Peek-A-Boo James, Cassidy Hutchinson, E. Jean Carroll, Liz Cheney, Adam Schiff permalink award report block reply"
}