{
  "id": "1ARK9isbD7",
  "url": "https://patriots.win/p/1ARK9isbD7/i-am-totally-fine-with-half-of-o/c",
  "content": "326 I am totally fine with half of our colleges going out of business.\n\nMost of them are producing indoctrinated radical left wing socialists. Most of the degrees are worthless. Let them fail. Kick the 600,000 Chinese students out. posted 2 days ago by PiratePatriotParrot 13 comments award share report block Wall Street Mav @WallStreetMav • 2d I am totally fine with half of our colleges going out of business. Most of them are producing indoctrinated radical left wing socialists. Most of the degrees are worthless. Let them fail. Kick the 600,000 Chinese students out. Disclose.tv @disclosetv • 2d NOW - Trump says 600,000 Chinese students coming to the U.S. is a pro-MAGA stance because \"you would have half the colleges in the United States go out of business... I know what MAGA wants better than anybody else.\"\n13 comments Sort by Top Top New Worst Old Save Say_what_again 16 points 2 days ago WTAF. I want these ChiCom spies branded as spies, permanently kicked out, and executed for espionage if they ever come back. permalink award report block reply Floppybutthole 5 points 1 day ago Fuck American colleges too.  They aren't MAGA permalink parent award report block reply mlp67 11 points 2 days ago He's fucking gone. What the hell happened to him? Why the hell would HBCUs go out of business? They don't go there. permalink award report block reply MondayCoupleIsDead 9 points 2 days ago There are 600k American students that could take their place. Fuck this shit. permalink award report block reply Counterwhat 6 points 1 day ago Exactly. I am so tired of pandering to institutions. End it. We voted for this. They are Anti American at this point. permalink parent award report block reply tingo999 7 points 2 days ago That's a fucking retarded take. We should be fighting to take the colleges back. Especially the ones that are historic American institutions. Obviously we don't need the colleges that sprouted up to take advantage of the international students. Btw, Wall Street Mav is a financial scammer from Canada. You noobs don't know his story. permalink award report block reply wmmiv2016v2 3 points 2 days ago You take them back by removing their government back stop, forcing them to compete in the market and deliver useful degrees to students who can pay them back with useful jobs. permalink parent award report block reply Secondrun007 5 points 2 days ago Teach the Chinese incorrectly.  Let the go back with 2+2=5 permalink award report block reply justinkayz 5 points 1 day ago MAGA would LOVE to see half the colleges in the US go out of business...they're probably the biggest detriment to MAGA there is! WTF is going on here? permalink award report block reply BumpForTrump 3 points 1 day ago Way off here, Trump. permalink award report block reply lustmorden 2 points 1 day ago The people in my \"honors\" English course over 15 years ago were idiots. Too many colleges. Too many people being let in who don't belong there. Half the colleges going out of business? Please! That would just be a start. International students bring in trillions? Who cares? At what long term cost?? WTF? permalink award report block reply the-new-style 1 points 1 day ago here's a photo of the award permalink award report block reply kaibab210 1 points 22 hours ago \"Tone-Deaf Shutdown Comment and Base Alienation\" permalink award report block reply\nSay_what_again 16 points 2 days ago WTAF. I want these ChiCom spies branded as spies, permanently kicked out, and executed for espionage if they ever come back. permalink award report block reply Floppybutthole 5 points 1 day ago Fuck American colleges too.  They aren't MAGA permalink parent award report block reply\nFloppybutthole 5 points 1 day ago Fuck American colleges too.  They aren't MAGA permalink parent award report block reply\nmlp67 11 points 2 days ago He's fucking gone. What the hell happened to him? Why the hell would HBCUs go out of business? They don't go there. permalink award report block reply\nMondayCoupleIsDead 9 points 2 days ago There are 600k American students that could take their place. Fuck this shit. permalink award report block reply Counterwhat 6 points 1 day ago Exactly. I am so tired of pandering to institutions. End it. We voted for this. They are Anti American at this point. permalink parent award report block reply\nCounterwhat 6 points 1 day ago Exactly. I am so tired of pandering to institutions. End it. We voted for this. They are Anti American at this point. permalink parent award report block reply\ntingo999 7 points 2 days ago That's a fucking retarded take. We should be fighting to take the colleges back. Especially the ones that are historic American institutions. Obviously we don't need the colleges that sprouted up to take advantage of the international students. Btw, Wall Street Mav is a financial scammer from Canada. You noobs don't know his story. permalink award report block reply wmmiv2016v2 3 points 2 days ago You take them back by removing their government back stop, forcing them to compete in the market and deliver useful degrees to students who can pay them back with useful jobs. permalink parent award report block reply\nwmmiv2016v2 3 points 2 days ago You take them back by removing their government back stop, forcing them to compete in the market and deliver useful degrees to students who can pay them back with useful jobs. permalink parent award report block reply\nSecondrun007 5 points 2 days ago Teach the Chinese incorrectly.  Let the go back with 2+2=5 permalink award report block reply\njustinkayz 5 points 1 day ago MAGA would LOVE to see half the colleges in the US go out of business...they're probably the biggest detriment to MAGA there is! WTF is going on here? permalink award report block reply\nBumpForTrump 3 points 1 day ago Way off here, Trump. permalink award report block reply\nlustmorden 2 points 1 day ago The people in my \"honors\" English course over 15 years ago were idiots. Too many colleges. Too many people being let in who don't belong there. Half the colleges going out of business? Please! That would just be a start. International students bring in trillions? Who cares? At what long term cost?? WTF? permalink award report block reply\nthe-new-style 1 points 1 day ago here's a photo of the award permalink award report block reply\nkaibab210 1 points 22 hours ago \"Tone-Deaf Shutdown Comment and Base Alienation\" permalink award report block reply",
  "fetched_at": "2025-11-12T20:43:12.219013Z"
}