{
  "id": "8178634",
  "title": "1210He pays for his groceries with his own money!!posted3 days agobyMrUnderhill67 commentsawardshare",
  "url": "https://patriots.win/p/1ARK5A9IRg/he-pays-for-his-groceries-with-h/c",
  "content": "1210 He pays for his groceries with his own money!! posted 3 days ago by MrUnderhill 67 comments award share download report block\n67 comments Sort by Top Top New Worst Old Save hughjasske69 61 points 3 days ago Oh hell he's worth a child support check permalink award report block reply HeavyMetalPatriot 9 points 3 days ago Hard truth right there. permalink parent award report block reply Patriot4TN 47 points 3 days ago Not only do I pay for groceries with my own money, I am unvaxed, got a job,  and own my home! Damn I am a walking gold mine! permalink award report block reply patriotpodcast 13 points 3 days ago Same, but married already so that line of ladies I presume are waiting at my door will have to move on. permalink parent award report block reply trumpORbust -1 points 3 days ago Go poly conservative with a MAGA harrem permalink parent award report block reply Husky 6 points 3 days ago Something tells me the maga misses might take issue with this plan permalink parent award report block reply chickeninoven 0 points 3 days ago Not really her call to make, if your household is in order. permalink parent award report block reply view 1 more comments... 3-10 4 points 3 days ago That gold digger is just asking how long she has to tolerate you to get her worth. permalink parent award report block reply BloodElfSupporter 3 points 3 days ago Are u married 👀 permalink parent award report block reply killedmytv 2 points 3 days ago Ha, I'm all those things plus I'm my own boss, with no ex wives or kids that I know of... would've put a ring on the one who got away had she not alrwady been married to a barely above minimum wage desk job for an employer who couldn't have cared less if she left. ¯_(ツ)_/¯ permalink parent award report block reply BloodElfSupporter 2 points 3 days ago That’s her loss fren permalink parent award report block reply Patriot4TN 1 points 3 days ago Are you looking? permalink parent award report block reply duznmatter 1 points 3 days ago But always one short of utopia I say. All is paid and setting on a goldmine but can't get a woody to work all day. permalink parent award report block reply Klown_Kutz 25 points 3 days ago Unrealistic. It’s two Gen Z white women. They want the aspiring rapper with 2 felonies and no job. permalink award report block reply bidensmissingbrain 16 points 3 days ago This meme is so old, I'm pretty sure both of those girls are in their 50s now. permalink parent award report block reply TrumpVoter1 9 points 3 days ago They aren't that old but they were minors in that pic permalink parent award report block reply KernalMustard 13 points 3 days ago Biden enters the chat permalink parent award report block reply Floppybutthole 6 points 3 days ago *sniffshair.jpg permalink parent award report block reply TrumpVoter1 3 points 3 days ago Millennials , not gen z and they were minors in that pic permalink parent award report block reply Klown_Kutz 0 points 3 days ago Same thing permalink parent award report block reply Induceddrag 11 points 3 days ago I saw a Libs of TikTok vid where this woman was telling a dating consultant what she wanted in a husband.  I don’t know her financial situation, but she was no beauty queen, probably wakes up looking like a 3.  She wanted a guy with a seven figure salary, who also did morning group workouts “with accountability.” My guess is she is still looking. permalink award report block reply weme06 1 points 3 days ago I saw that 😂 permalink parent award report block reply Hanging_Chad 10 points 3 days ago … and gets 5% cashback 🥵 permalink award report block reply Scatter-Shot 7 points 3 days ago Canada doesn't have EBT, anyone looking for a Conservative Canadian man? permalink award report block reply Floppybutthole 2 points 3 days ago Move to alberta and vote your way in permalink parent award report block reply KernalMustard 4 points 3 days ago I can tell you this never happened once in my entire life. permalink award report block reply DickTick PRO 4 points 3 days ago It does make me feel like quite the chad being the only person in the checkout line at Walmart paying for hundreds of dollars in groceries with cash or my debit card lol permalink award report block reply Hikedelics 3 points 3 days ago I need to shit towards that mindset. It doesn’t happen as often now that I’m in Colorado, but in Louisiana I’d feel like a chump checking out with my meager selections trying to stay frugal while Sheniqua just ahead of me has a basket over flowing with steaks and shit and she isn’t worried about paying for a penny of it. permalink parent award report block reply LiveFreeInXorDie 2 points 3 days ago That just unlocked some old memories as a squirt standing in line with Dad, seeing how few items he brought (all cheap off-brand stuff), meanwhile fat ghetto ladies bringing carts full of crap and taking forever to check out, and me wondering why we could never get fancy brand food like them. permalink parent award report block reply McShoty96 4 points 3 days ago Two wives are better then one. permalink award report block reply RedStoneDeepState 10 points 3 days ago Two mother in laws, twice the crazy permalink parent award report block reply Floppybutthole 3 points 3 days ago I got divorced twice at the same time and lost half my money with each one. permalink parent award report block reply BeauHD 7 points 3 days ago Not if they have rights. That's where Mamdummy is right. permalink parent award report block reply Trump454748 5 points 3 days ago I’m at the age now where the only reason l have two girls at once is so when l fall asleep, they have each other to talk to. permalink parent award report block reply Glenlaw 6 points 3 days ago I'm at the age where having sex two nights in a row is having sex on a Tuesday in April and. Wednesday in May. permalink parent award report block reply Hanging_Chad 2 points 3 days ago do females exist if they’re alone? permalink parent award report block reply CommanderOfCheese 4 points 3 days ago As a descendant of polygamists... it really depends on the situation, but on the whole no it's not. Best case it's workable for the small fraction of men capable of being the patriarch of multiple whole families (as in separate households). It may also be workable for the small fraction of women who can handle a second matriarch in the home. And at a societal level it can only work when there's an excess of single women. permalink parent award report block reply Floppybutthole 3 points 3 days ago Agreed polygamy can only work if men died at twice the rate of women.  Even then, most tribes the woman would be married to her brother in law and the original wife had clear social power in the family unit and the new wife was thankful for her children getting fed. Of course the chances of one wife killing the child of the other increases significantly.    And having a society based around men dying all the time doesn't often advance beyond hunting and gathering. And when it does it quickly collapses or adopts a monogamous culture.  Or.... when it does become more successful, like Islam it gets pretty retarded because the average man is marrying his ugly cousin and the rich guys have 100 wives.   And men there still die like crazy. Either way you gotta ask yourself do you want to live in a western society or do you want to stick your dick in 100 women? Personally,  I'm not to fond of most western women.  But I'm not to fond of the current western culture either so... permalink parent award report block reply Friendly_B 1 points 3 days ago the rich guys have 100 wives Yeah but the Biblical guidelines for divorce are very clear that there are almost no times it is allowable... one of the only exceptions is when the woman is not getting enough food, clothing, and sex.  So that limits even wealthy men who don't have time for tending to each wife. permalink parent award report block reply Friendly_B -4 points 3 days ago Churches are full of excess single women pining away for a marriage. It isn't about the overall gender populations of the nation, it's about the overall populations of grounded responsible men v. excess women. permalink parent award report block reply CommanderOfCheese 6 points 3 days ago By \"excess single women\" i mean not picky women but rather women for who couldn't find a single man even if she lowered her standards and took whoever was willing to wife her up. permalink parent award report block reply Friendly_B -2 points 3 days ago I understand that, but it's already happening.  There are way, way more women who want to be married in a stable relationship then men who feel the same way. permalink parent award report block reply view 1 more comments... Reassess_Reevaluate 3 points 3 days ago Churches are full of women over the age of 30 who had their hoe phase and are looking for a boring nice guy to settle for since Chad Thunderstoke Poundermuffin the 3rd wouldn't commit to her. Then they suddenly \"Find Jayyysus\" so they won't be alone. If they show up at the door of the church for the first time after the age of 30, single, or even worse, single mom, then you better inspect her past with an electron microscope before you make any commitments. If she puts you off or says stuff like, \"body count doesn't matter, cause I've been born again!\"  Then good luck to you my brother in Christ. permalink parent award report block reply KernalMustard 2 points 3 days ago Are you mormon? permalink parent award report block reply load 7 more comments... hillaryforprison 3 points 3 days ago That's so hot right now permalink award report block reply KeepingAmericaGreat 3 points 3 days ago Creepy meme permalink award report block reply The_Emperor 3 points 3 days ago Creepy?  Mayhaps you read too much into it?  Girls like stable providers of resources as potential mates, to ensure a future for their kids.  Tale old as time, and I thought the meme a bit clever, given the times. permalink parent award report block reply OGTsince1992 3 points 3 days ago I think it is creepy as well, and not because of the message. It’s the fact that those girls look about 14 years old. permalink parent award report block reply KeepingAmericaGreat 2 points 3 days ago Exactly. permalink parent award report block reply Mungo 3 points 3 days ago In cash! permalink award report block reply Pied-Trumper 3 points 3 days ago These meme makes me realize how old we all are. Look how pixelated it is. The movie was 20 years ago now. permalink award report block reply GreyKnight 3 points 3 days ago I always hated that picture. It seems wrong. permalink award report block reply knnbccb 2 points 3 days ago I consider condoms as part of grocery shopping. permalink award report block reply SERP-SERP 1 points 3 days ago https://media1.tenor.com/m/vzB4NFf84lMAAAAC/mmmmm-sweet-squirts.gif permalink award report block reply walls4america 0 points 3 days ago That’s no “catch” for a gal!!! If he had a large homestead, knew how to build cabins, was a master craftsman with furniture, grew his own produce, had plenty of livestock, had a large arsenal of guns (that avoided boat accidents) for hunting game, and kept the household supplied with fish and fresh seafood (having a boat would be great, too), then, yes, please give me his satellite phone number. 😜 permalink award report block reply bicentennial_john 1 points 3 days ago Any other requirements? permalink parent award report block reply walls4america 1 points 2 days ago I’ll have to watch some more homesteading shows and see if I can think of anything else. 🤣 Until age 6 we lived on a farm in the South, so the homesteading shows with the flocks of chickens and home gardens and canning make me nostalgic. Then on RAV this weekend Ted Nugent was showing off results of his latest hunting, boasting of saving grocery money on meats. Despite my ability to cook all sorts of international meals from scratch and make bread, pasta, desserts, etc. (even biscuits & bacon gravy!!) from scratch, there’s another level to being self-sufficient in raising one’s own food. So in contrast with the meme, my thought was, why be 100% dependent on food from the store if most can be raised at home? permalink parent award report block reply Friendly_B 1 points 3 days ago Hmmm.  I checked off 7 out of 10 lol. permalink parent award report block reply GoldwaterVoter 1 points 3 days ago On the other hand ... https://m.media-amazon.com/images/I/51m62vt7kRL . AC .jpg Don't click -- copy the entire URL and enter into address bar.\nSomehow I can't copy the entire URL as a link! permalink parent award report block reply TheDarkEmperor 2 points 3 days ago Comment removed by community moderators. permalink award report block reply\nhughjasske69 61 points 3 days ago Oh hell he's worth a child support check permalink award report block reply HeavyMetalPatriot 9 points 3 days ago Hard truth right there. permalink parent award report block reply\nHeavyMetalPatriot 9 points 3 days ago Hard truth right there. permalink parent award report block reply\nPatriot4TN 47 points 3 days ago Not only do I pay for groceries with my own money, I am unvaxed, got a job,  and own my home! Damn I am a walking gold mine! permalink award report block reply patriotpodcast 13 points 3 days ago Same, but married already so that line of ladies I presume are waiting at my door will have to move on. permalink parent award report block reply trumpORbust -1 points 3 days ago Go poly conservative with a MAGA harrem permalink parent award report block reply Husky 6 points 3 days ago Something tells me the maga misses might take issue with this plan permalink parent award report block reply chickeninoven 0 points 3 days ago Not really her call to make, if your household is in order. permalink parent award report block reply view 1 more comments... 3-10 4 points 3 days ago That gold digger is just asking how long she has to tolerate you to get her worth. permalink parent award report block reply BloodElfSupporter 3 points 3 days ago Are u married 👀 permalink parent award report block reply killedmytv 2 points 3 days ago Ha, I'm all those things plus I'm my own boss, with no ex wives or kids that I know of... would've put a ring on the one who got away had she not alrwady been married to a barely above minimum wage desk job for an employer who couldn't have cared less if she left. ¯_(ツ)_/¯ permalink parent award report block reply BloodElfSupporter 2 points 3 days ago That’s her loss fren permalink parent award report block reply Patriot4TN 1 points 3 days ago Are you looking? permalink parent award report block reply duznmatter 1 points 3 days ago But always one short of utopia I say. All is paid and setting on a goldmine but can't get a woody to work all day. permalink parent award report block reply\npatriotpodcast 13 points 3 days ago Same, but married already so that line of ladies I presume are waiting at my door will have to move on. permalink parent award report block reply trumpORbust -1 points 3 days ago Go poly conservative with a MAGA harrem permalink parent award report block reply Husky 6 points 3 days ago Something tells me the maga misses might take issue with this plan permalink parent award report block reply chickeninoven 0 points 3 days ago Not really her call to make, if your household is in order. permalink parent award report block reply view 1 more comments...\ntrumpORbust -1 points 3 days ago Go poly conservative with a MAGA harrem permalink parent award report block reply Husky 6 points 3 days ago Something tells me the maga misses might take issue with this plan permalink parent award report block reply chickeninoven 0 points 3 days ago Not really her call to make, if your household is in order. permalink parent award report block reply view 1 more comments...\nHusky 6 points 3 days ago Something tells me the maga misses might take issue with this plan permalink parent award report block reply chickeninoven 0 points 3 days ago Not really her call to make, if your household is in order. permalink parent award report block reply view 1 more comments...\nchickeninoven 0 points 3 days ago Not really her call to make, if your household is in order. permalink parent award report block reply view 1 more comments...\n3-10 4 points 3 days ago That gold digger is just asking how long she has to tolerate you to get her worth. permalink parent award report block reply\nBloodElfSupporter 3 points 3 days ago Are u married 👀 permalink parent award report block reply killedmytv 2 points 3 days ago Ha, I'm all those things plus I'm my own boss, with no ex wives or kids that I know of... would've put a ring on the one who got away had she not alrwady been married to a barely above minimum wage desk job for an employer who couldn't have cared less if she left. ¯_(ツ)_/¯ permalink parent award report block reply BloodElfSupporter 2 points 3 days ago That’s her loss fren permalink parent award report block reply Patriot4TN 1 points 3 days ago Are you looking? permalink parent award report block reply\nkilledmytv 2 points 3 days ago Ha, I'm all those things plus I'm my own boss, with no ex wives or kids that I know of... would've put a ring on the one who got away had she not alrwady been married to a barely above minimum wage desk job for an employer who couldn't have cared less if she left. ¯_(ツ)_/¯ permalink parent award report block reply BloodElfSupporter 2 points 3 days ago That’s her loss fren permalink parent award report block reply\nBloodElfSupporter 2 points 3 days ago That’s her loss fren permalink parent award report block reply\nPatriot4TN 1 points 3 days ago Are you looking? permalink parent award report block reply\nduznmatter 1 points 3 days ago But always one short of utopia I say. All is paid and setting on a goldmine but can't get a woody to work all day. permalink parent award report block reply\nKlown_Kutz 25 points 3 days ago Unrealistic. It’s two Gen Z white women. They want the aspiring rapper with 2 felonies and no job. permalink award report block reply bidensmissingbrain 16 points 3 days ago This meme is so old, I'm pretty sure both of those girls are in their 50s now. permalink parent award report block reply TrumpVoter1 9 points 3 days ago They aren't that old but they were minors in that pic permalink parent award report block reply KernalMustard 13 points 3 days ago Biden enters the chat permalink parent award report block reply Floppybutthole 6 points 3 days ago *sniffshair.jpg permalink parent award report block reply TrumpVoter1 3 points 3 days ago Millennials , not gen z and they were minors in that pic permalink parent award report block reply Klown_Kutz 0 points 3 days ago Same thing permalink parent award report block reply\nbidensmissingbrain 16 points 3 days ago This meme is so old, I'm pretty sure both of those girls are in their 50s now. permalink parent award report block reply TrumpVoter1 9 points 3 days ago They aren't that old but they were minors in that pic permalink parent award report block reply KernalMustard 13 points 3 days ago Biden enters the chat permalink parent award report block reply Floppybutthole 6 points 3 days ago *sniffshair.jpg permalink parent award report block reply\nTrumpVoter1 9 points 3 days ago They aren't that old but they were minors in that pic permalink parent award report block reply KernalMustard 13 points 3 days ago Biden enters the chat permalink parent award report block reply Floppybutthole 6 points 3 days ago *sniffshair.jpg permalink parent award report block reply\nKernalMustard 13 points 3 days ago Biden enters the chat permalink parent award report block reply Floppybutthole 6 points 3 days ago *sniffshair.jpg permalink parent award report block reply\nFloppybutthole 6 points 3 days ago *sniffshair.jpg permalink parent award report block reply\nTrumpVoter1 3 points 3 days ago Millennials , not gen z and they were minors in that pic permalink parent award report block reply Klown_Kutz 0 points 3 days ago Same thing permalink parent award report block reply\nKlown_Kutz 0 points 3 days ago Same thing permalink parent award report block reply\nInduceddrag 11 points 3 days ago I saw a Libs of TikTok vid where this woman was telling a dating consultant what she wanted in a husband.  I don’t know her financial situation, but she was no beauty queen, probably wakes up looking like a 3.  She wanted a guy with a seven figure salary, who also did morning group workouts “with accountability.” My guess is she is still looking. permalink award report block reply weme06 1 points 3 days ago I saw that 😂 permalink parent award report block reply\nweme06 1 points 3 days ago I saw that 😂 permalink parent award report block reply\nHanging_Chad 10 points 3 days ago … and gets 5% cashback 🥵 permalink award report block reply\nScatter-Shot 7 points 3 days ago Canada doesn't have EBT, anyone looking for a Conservative Canadian man? permalink award report block reply Floppybutthole 2 points 3 days ago Move to alberta and vote your way in permalink parent award report block reply\nFloppybutthole 2 points 3 days ago Move to alberta and vote your way in permalink parent award report block reply\nKernalMustard 4 points 3 days ago I can tell you this never happened once in my entire life. permalink award report block reply\nDickTick PRO 4 points 3 days ago It does make me feel like quite the chad being the only person in the checkout line at Walmart paying for hundreds of dollars in groceries with cash or my debit card lol permalink award report block reply Hikedelics 3 points 3 days ago I need to shit towards that mindset. It doesn’t happen as often now that I’m in Colorado, but in Louisiana I’d feel like a chump checking out with my meager selections trying to stay frugal while Sheniqua just ahead of me has a basket over flowing with steaks and shit and she isn’t worried about paying for a penny of it. permalink parent award report block reply LiveFreeInXorDie 2 points 3 days ago That just unlocked some old memories as a squirt standing in line with Dad, seeing how few items he brought (all cheap off-brand stuff), meanwhile fat ghetto ladies bringing carts full of crap and taking forever to check out, and me wondering why we could never get fancy brand food like them. permalink parent award report block reply\nHikedelics 3 points 3 days ago I need to shit towards that mindset. It doesn’t happen as often now that I’m in Colorado, but in Louisiana I’d feel like a chump checking out with my meager selections trying to stay frugal while Sheniqua just ahead of me has a basket over flowing with steaks and shit and she isn’t worried about paying for a penny of it. permalink parent award report block reply LiveFreeInXorDie 2 points 3 days ago That just unlocked some old memories as a squirt standing in line with Dad, seeing how few items he brought (all cheap off-brand stuff), meanwhile fat ghetto ladies bringing carts full of crap and taking forever to check out, and me wondering why we could never get fancy brand food like them. permalink parent award report block reply\nLiveFreeInXorDie 2 points 3 days ago That just unlocked some old memories as a squirt standing in line with Dad, seeing how few items he brought (all cheap off-brand stuff), meanwhile fat ghetto ladies bringing carts full of crap and taking forever to check out, and me wondering why we could never get fancy brand food like them. permalink parent award report block reply\nMcShoty96 4 points 3 days ago Two wives are better then one. permalink award report block reply RedStoneDeepState 10 points 3 days ago Two mother in laws, twice the crazy permalink parent award report block reply Floppybutthole 3 points 3 days ago I got divorced twice at the same time and lost half my money with each one. permalink parent award report block reply BeauHD 7 points 3 days ago Not if they have rights. That's where Mamdummy is right. permalink parent award report block reply Trump454748 5 points 3 days ago I’m at the age now where the only reason l have two girls at once is so when l fall asleep, they have each other to talk to. permalink parent award report block reply Glenlaw 6 points 3 days ago I'm at the age where having sex two nights in a row is having sex on a Tuesday in April and. Wednesday in May. permalink parent award report block reply Hanging_Chad 2 points 3 days ago do females exist if they’re alone? permalink parent award report block reply CommanderOfCheese 4 points 3 days ago As a descendant of polygamists... it really depends on the situation, but on the whole no it's not. Best case it's workable for the small fraction of men capable of being the patriarch of multiple whole families (as in separate households). It may also be workable for the small fraction of women who can handle a second matriarch in the home. And at a societal level it can only work when there's an excess of single women. permalink parent award report block reply Floppybutthole 3 points 3 days ago Agreed polygamy can only work if men died at twice the rate of women.  Even then, most tribes the woman would be married to her brother in law and the original wife had clear social power in the family unit and the new wife was thankful for her children getting fed. Of course the chances of one wife killing the child of the other increases significantly.    And having a society based around men dying all the time doesn't often advance beyond hunting and gathering. And when it does it quickly collapses or adopts a monogamous culture.  Or.... when it does become more successful, like Islam it gets pretty retarded because the average man is marrying his ugly cousin and the rich guys have 100 wives.   And men there still die like crazy. Either way you gotta ask yourself do you want to live in a western society or do you want to stick your dick in 100 women? Personally,  I'm not to fond of most western women.  But I'm not to fond of the current western culture either so... permalink parent award report block reply Friendly_B 1 points 3 days ago the rich guys have 100 wives Yeah but the Biblical guidelines for divorce are very clear that there are almost no times it is allowable... one of the only exceptions is when the woman is not getting enough food, clothing, and sex.  So that limits even wealthy men who don't have time for tending to each wife. permalink parent award report block reply Friendly_B -4 points 3 days ago Churches are full of excess single women pining away for a marriage. It isn't about the overall gender populations of the nation, it's about the overall populations of grounded responsible men v. excess women. permalink parent award report block reply CommanderOfCheese 6 points 3 days ago By \"excess single women\" i mean not picky women but rather women for who couldn't find a single man even if she lowered her standards and took whoever was willing to wife her up. permalink parent award report block reply Friendly_B -2 points 3 days ago I understand that, but it's already happening.  There are way, way more women who want to be married in a stable relationship then men who feel the same way. permalink parent award report block reply view 1 more comments... Reassess_Reevaluate 3 points 3 days ago Churches are full of women over the age of 30 who had their hoe phase and are looking for a boring nice guy to settle for since Chad Thunderstoke Poundermuffin the 3rd wouldn't commit to her. Then they suddenly \"Find Jayyysus\" so they won't be alone. If they show up at the door of the church for the first time after the age of 30, single, or even worse, single mom, then you better inspect her past with an electron microscope before you make any commitments. If she puts you off or says stuff like, \"body count doesn't matter, cause I've been born again!\"  Then good luck to you my brother in Christ. permalink parent award report block reply KernalMustard 2 points 3 days ago Are you mormon? permalink parent award report block reply load 7 more comments...\nRedStoneDeepState 10 points 3 days ago Two mother in laws, twice the crazy permalink parent award report block reply Floppybutthole 3 points 3 days ago I got divorced twice at the same time and lost half my money with each one. permalink parent award report block reply\nFloppybutthole 3 points 3 days ago I got divorced twice at the same time and lost half my money with each one. permalink parent award report block reply\nBeauHD 7 points 3 days ago Not if they have rights. That's where Mamdummy is right. permalink parent award report block reply\nTrump454748 5 points 3 days ago I’m at the age now where the only reason l have two girls at once is so when l fall asleep, they have each other to talk to. permalink parent award report block reply Glenlaw 6 points 3 days ago I'm at the age where having sex two nights in a row is having sex on a Tuesday in April and. Wednesday in May. permalink parent award report block reply Hanging_Chad 2 points 3 days ago do females exist if they’re alone? permalink parent award report block reply\nGlenlaw 6 points 3 days ago I'm at the age where having sex two nights in a row is having sex on a Tuesday in April and. Wednesday in May. permalink parent award report block reply\nHanging_Chad 2 points 3 days ago do females exist if they’re alone? permalink parent award report block reply\nCommanderOfCheese 4 points 3 days ago As a descendant of polygamists... it really depends on the situation, but on the whole no it's not. Best case it's workable for the small fraction of men capable of being the patriarch of multiple whole families (as in separate households). It may also be workable for the small fraction of women who can handle a second matriarch in the home. And at a societal level it can only work when there's an excess of single women. permalink parent award report block reply Floppybutthole 3 points 3 days ago Agreed polygamy can only work if men died at twice the rate of women.  Even then, most tribes the woman would be married to her brother in law and the original wife had clear social power in the family unit and the new wife was thankful for her children getting fed. Of course the chances of one wife killing the child of the other increases significantly.    And having a society based around men dying all the time doesn't often advance beyond hunting and gathering. And when it does it quickly collapses or adopts a monogamous culture.  Or.... when it does become more successful, like Islam it gets pretty retarded because the average man is marrying his ugly cousin and the rich guys have 100 wives.   And men there still die like crazy. Either way you gotta ask yourself do you want to live in a western society or do you want to stick your dick in 100 women? Personally,  I'm not to fond of most western women.  But I'm not to fond of the current western culture either so... permalink parent award report block reply Friendly_B 1 points 3 days ago the rich guys have 100 wives Yeah but the Biblical guidelines for divorce are very clear that there are almost no times it is allowable... one of the only exceptions is when the woman is not getting enough food, clothing, and sex.  So that limits even wealthy men who don't have time for tending to each wife. permalink parent award report block reply Friendly_B -4 points 3 days ago Churches are full of excess single women pining away for a marriage. It isn't about the overall gender populations of the nation, it's about the overall populations of grounded responsible men v. excess women. permalink parent award report block reply CommanderOfCheese 6 points 3 days ago By \"excess single women\" i mean not picky women but rather women for who couldn't find a single man even if she lowered her standards and took whoever was willing to wife her up. permalink parent award report block reply Friendly_B -2 points 3 days ago I understand that, but it's already happening.  There are way, way more women who want to be married in a stable relationship then men who feel the same way. permalink parent award report block reply view 1 more comments... Reassess_Reevaluate 3 points 3 days ago Churches are full of women over the age of 30 who had their hoe phase and are looking for a boring nice guy to settle for since Chad Thunderstoke Poundermuffin the 3rd wouldn't commit to her. Then they suddenly \"Find Jayyysus\" so they won't be alone. If they show up at the door of the church for the first time after the age of 30, single, or even worse, single mom, then you better inspect her past with an electron microscope before you make any commitments. If she puts you off or says stuff like, \"body count doesn't matter, cause I've been born again!\"  Then good luck to you my brother in Christ. permalink parent award report block reply\nFloppybutthole 3 points 3 days ago Agreed polygamy can only work if men died at twice the rate of women.  Even then, most tribes the woman would be married to her brother in law and the original wife had clear social power in the family unit and the new wife was thankful for her children getting fed. Of course the chances of one wife killing the child of the other increases significantly.    And having a society based around men dying all the time doesn't often advance beyond hunting and gathering. And when it does it quickly collapses or adopts a monogamous culture.  Or.... when it does become more successful, like Islam it gets pretty retarded because the average man is marrying his ugly cousin and the rich guys have 100 wives.   And men there still die like crazy. Either way you gotta ask yourself do you want to live in a western society or do you want to stick your dick in 100 women? Personally,  I'm not to fond of most western women.  But I'm not to fond of the current western culture either so... permalink parent award report block reply Friendly_B 1 points 3 days ago the rich guys have 100 wives Yeah but the Biblical guidelines for divorce are very clear that there are almost no times it is allowable... one of the only exceptions is when the woman is not getting enough food, clothing, and sex.  So that limits even wealthy men who don't have time for tending to each wife. permalink parent award report block reply\nFriendly_B 1 points 3 days ago the rich guys have 100 wives Yeah but the Biblical guidelines for divorce are very clear that there are almost no times it is allowable... one of the only exceptions is when the woman is not getting enough food, clothing, and sex.  So that limits even wealthy men who don't have time for tending to each wife. permalink parent award report block reply\nFriendly_B -4 points 3 days ago Churches are full of excess single women pining away for a marriage. It isn't about the overall gender populations of the nation, it's about the overall populations of grounded responsible men v. excess women. permalink parent award report block reply CommanderOfCheese 6 points 3 days ago By \"excess single women\" i mean not picky women but rather women for who couldn't find a single man even if she lowered her standards and took whoever was willing to wife her up. permalink parent award report block reply Friendly_B -2 points 3 days ago I understand that, but it's already happening.  There are way, way more women who want to be married in a stable relationship then men who feel the same way. permalink parent award report block reply view 1 more comments... Reassess_Reevaluate 3 points 3 days ago Churches are full of women over the age of 30 who had their hoe phase and are looking for a boring nice guy to settle for since Chad Thunderstoke Poundermuffin the 3rd wouldn't commit to her. Then they suddenly \"Find Jayyysus\" so they won't be alone. If they show up at the door of the church for the first time after the age of 30, single, or even worse, single mom, then you better inspect her past with an electron microscope before you make any commitments. If she puts you off or says stuff like, \"body count doesn't matter, cause I've been born again!\"  Then good luck to you my brother in Christ. permalink parent award report block reply\nCommanderOfCheese 6 points 3 days ago By \"excess single women\" i mean not picky women but rather women for who couldn't find a single man even if she lowered her standards and took whoever was willing to wife her up. permalink parent award report block reply Friendly_B -2 points 3 days ago I understand that, but it's already happening.  There are way, way more women who want to be married in a stable relationship then men who feel the same way. permalink parent award report block reply view 1 more comments...\nFriendly_B -2 points 3 days ago I understand that, but it's already happening.  There are way, way more women who want to be married in a stable relationship then men who feel the same way. permalink parent award report block reply view 1 more comments...\nReassess_Reevaluate 3 points 3 days ago Churches are full of women over the age of 30 who had their hoe phase and are looking for a boring nice guy to settle for since Chad Thunderstoke Poundermuffin the 3rd wouldn't commit to her. Then they suddenly \"Find Jayyysus\" so they won't be alone. If they show up at the door of the church for the first time after the age of 30, single, or even worse, single mom, then you better inspect her past with an electron microscope before you make any commitments. If she puts you off or says stuff like, \"body count doesn't matter, cause I've been born again!\"  Then good luck to you my brother in Christ. permalink parent award report block reply\nKernalMustard 2 points 3 days ago Are you mormon? permalink parent award report block reply\nhillaryforprison 3 points 3 days ago That's so hot right now permalink award report block reply\nKeepingAmericaGreat 3 points 3 days ago Creepy meme permalink award report block reply The_Emperor 3 points 3 days ago Creepy?  Mayhaps you read too much into it?  Girls like stable providers of resources as potential mates, to ensure a future for their kids.  Tale old as time, and I thought the meme a bit clever, given the times. permalink parent award report block reply OGTsince1992 3 points 3 days ago I think it is creepy as well, and not because of the message. It’s the fact that those girls look about 14 years old. permalink parent award report block reply KeepingAmericaGreat 2 points 3 days ago Exactly. permalink parent award report block reply\nThe_Emperor 3 points 3 days ago Creepy?  Mayhaps you read too much into it?  Girls like stable providers of resources as potential mates, to ensure a future for their kids.  Tale old as time, and I thought the meme a bit clever, given the times. permalink parent award report block reply OGTsince1992 3 points 3 days ago I think it is creepy as well, and not because of the message. It’s the fact that those girls look about 14 years old. permalink parent award report block reply KeepingAmericaGreat 2 points 3 days ago Exactly. permalink parent award report block reply\nOGTsince1992 3 points 3 days ago I think it is creepy as well, and not because of the message. It’s the fact that those girls look about 14 years old. permalink parent award report block reply KeepingAmericaGreat 2 points 3 days ago Exactly. permalink parent award report block reply\nKeepingAmericaGreat 2 points 3 days ago Exactly. permalink parent award report block reply\nMungo 3 points 3 days ago In cash! permalink award report block reply\nPied-Trumper 3 points 3 days ago These meme makes me realize how old we all are. Look how pixelated it is. The movie was 20 years ago now. permalink award report block reply\nGreyKnight 3 points 3 days ago I always hated that picture. It seems wrong. permalink award report block reply\nknnbccb 2 points 3 days ago I consider condoms as part of grocery shopping. permalink award report block reply\nSERP-SERP 1 points 3 days ago https://media1.tenor.com/m/vzB4NFf84lMAAAAC/mmmmm-sweet-squirts.gif permalink award report block reply\nwalls4america 0 points 3 days ago That’s no “catch” for a gal!!! If he had a large homestead, knew how to build cabins, was a master craftsman with furniture, grew his own produce, had plenty of livestock, had a large arsenal of guns (that avoided boat accidents) for hunting game, and kept the household supplied with fish and fresh seafood (having a boat would be great, too), then, yes, please give me his satellite phone number. 😜 permalink award report block reply bicentennial_john 1 points 3 days ago Any other requirements? permalink parent award report block reply walls4america 1 points 2 days ago I’ll have to watch some more homesteading shows and see if I can think of anything else. 🤣 Until age 6 we lived on a farm in the South, so the homesteading shows with the flocks of chickens and home gardens and canning make me nostalgic. Then on RAV this weekend Ted Nugent was showing off results of his latest hunting, boasting of saving grocery money on meats. Despite my ability to cook all sorts of international meals from scratch and make bread, pasta, desserts, etc. (even biscuits & bacon gravy!!) from scratch, there’s another level to being self-sufficient in raising one’s own food. So in contrast with the meme, my thought was, why be 100% dependent on food from the store if most can be raised at home? permalink parent award report block reply Friendly_B 1 points 3 days ago Hmmm.  I checked off 7 out of 10 lol. permalink parent award report block reply GoldwaterVoter 1 points 3 days ago On the other hand ... https://m.media-amazon.com/images/I/51m62vt7kRL . AC .jpg Don't click -- copy the entire URL and enter into address bar.\nSomehow I can't copy the entire URL as a link! permalink parent award report block reply\nbicentennial_john 1 points 3 days ago Any other requirements? permalink parent award report block reply walls4america 1 points 2 days ago I’ll have to watch some more homesteading shows and see if I can think of anything else. 🤣 Until age 6 we lived on a farm in the South, so the homesteading shows with the flocks of chickens and home gardens and canning make me nostalgic. Then on RAV this weekend Ted Nugent was showing off results of his latest hunting, boasting of saving grocery money on meats. Despite my ability to cook all sorts of international meals from scratch and make bread, pasta, desserts, etc. (even biscuits & bacon gravy!!) from scratch, there’s another level to being self-sufficient in raising one’s own food. So in contrast with the meme, my thought was, why be 100% dependent on food from the store if most can be raised at home? permalink parent award report block reply\nwalls4america 1 points 2 days ago I’ll have to watch some more homesteading shows and see if I can think of anything else. 🤣 Until age 6 we lived on a farm in the South, so the homesteading shows with the flocks of chickens and home gardens and canning make me nostalgic. Then on RAV this weekend Ted Nugent was showing off results of his latest hunting, boasting of saving grocery money on meats. Despite my ability to cook all sorts of international meals from scratch and make bread, pasta, desserts, etc. (even biscuits & bacon gravy!!) from scratch, there’s another level to being self-sufficient in raising one’s own food. So in contrast with the meme, my thought was, why be 100% dependent on food from the store if most can be raised at home? permalink parent award report block reply\nFriendly_B 1 points 3 days ago Hmmm.  I checked off 7 out of 10 lol. permalink parent award report block reply\nGoldwaterVoter 1 points 3 days ago On the other hand ... https://m.media-amazon.com/images/I/51m62vt7kRL . AC .jpg Don't click -- copy the entire URL and enter into address bar.\nSomehow I can't copy the entire URL as a link! permalink parent award report block reply\nTheDarkEmperor 2 points 3 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T20:14:23.483100Z"
}