{
  "id": "8185403",
  "title": "99People feel betrayed when Trump doesnt say the right thing every day, every time. Hold tight frens",
  "url": "https://patriots.win/p/1ARK9nOnmV/people-feel-betrayed-when-trump-/c",
  "content": "99 People feel betrayed when Trump doesnt say the right thing every day, every time. Hold tight frens. Trump 75% based is still 1000x better than any (D) or RINO. posted 3 hours ago by try4gain PRO 28 comments award share download report block\n28 comments Sort by Top Top New Worst Old Save Awakened 19 points 3 hours ago Being slowly boiled is much more dangerous than a quick jolt. Look, it isn't just this. It started with the Epstein thing and was followed by a lot of other things. You're not gonna rally the troops when all they are doing is responding to him saying anti-MAGA things. Their reaction isn't their fault, it's Trumps. They are reacting naturally to betrayal on the most important thing their is, American jobs. Main street versus Wall street. Trump needs massive turnout to overcome fraud in the midterms, since he hasn't pulled off any major arrests at this point, expect it to be massive massive fraud. He will not get that at this point. Worse, it could be a total route.  Then they will not only have the votes to impeach him, but remove him. Then throw him and his in jail. Someone better wake him up. But most here are done pretending everything is all right. Good luck permalink award report block reply Standingoak -1 points 2 hours ago They are reacting naturally Thanks for letting everyone know YOU are not MAGA because : 'We are reacting naturally' permalink parent award report block reply Awakened 2 points 2 hours ago Lol. This shit doesn't work on those of us who risked everything for MAGA and for Trump.  You just seem retarded, but not in the good way. We deserve better shills. permalink parent award report block reply try4gain OP PRO -3 points 2 hours ago Trump was never perfect and will never be.  Every President & Politician makes promises they cant deliver on. Epstein files : This is the new JFK files.  Going to take ages to release.  Trump realized it was MI6 CIA Mossad and so had to do a hard awkward pivot which he handled poorly. If Trump was in the Epstein files Biden & Co would have leaked it to the press. Trump has always had a habbit of putting his foot in his mouth at least once a month.  Then  the base pushes back hard enough and often he changes course.  But dont expect that with Epstein because it's CIA Mossad shit. Trump is the start of the MAGA movement.  We wont get everything we want.  JD Vance will be the next step. This is a multi-term multi-decade movement.  It took decades for leftist and RINOs to get us in this mess, we're not getting out with a few executive orders. permalink parent award report block reply Awakened 2 points 2 hours ago Except, and this is very important, are you ready JOBS! That's the real reason he is there and he just shit on his reason. Shit all over it. Oh, and this is also important TELLING US TO WAIT NO LONGER WORKS Because we know what happened last term. We are through being strung along and treated secondary. We are so completely done. The midterms will be here soon. No one can buy a house and groceries are still through the roof. Forget about a nice night eating out. We are circling the drain. Also, we don't want Vance. He is a tech bro puppet and super pro H1b. You guys really don't get it. You're about to lose in a massive way. Also, Vivek will turn Ohio over to the commies because he will be losing. Well done Trump, well done. You people really don't get what's coming do you? A complete walking away of the base. The democrats were on their last leg and Trump just saved them. permalink parent award report block reply Iremembermypassword 8 points 3 hours ago Why Trump not 110% based? What does it cost him? What does it benefit MAGA? permalink award report block reply MAGALADON9 8 points 3 hours ago Trump lives in a bubble and is being lead by bad actors. permalink award report block reply BlackJack1776 1 points 2 hours ago That isolating \"Presidential Bubble\" is a real hazard. Bad Actors and the Deep State mastered exploiting it before telegraphs were even a thing. GEOTUS is getting Wormtounged, who's gonna Gandolf him? permalink parent award report block reply MAGALADON9 2 points 1 hour ago (Copy and paste this in similar threads. You will have to \"**\" the points yourself.) GET ON THESE GUYS RADAR. CONTACT DIRECTLY. DJT OBSERVES THEM. LET THEM KNOW YOUR STRONG DISAPPOINTMENT AND DISAPPROVAL - EXAGGERATE A BIT. Rasmussen Reports Email: info@rasmussenreports.com ; Web form at rasmussenreports.com/contact_us Trump tweets their data weekly; say \"For Scott Rasmussen: My take on [issue].\" Trafalgar Group Form: thetrafalgargroup.org/contact; Phone: 202-810-2123 Robert Cahaly (lead) briefs Trump allies; emphasize GOP alignment. John McLaughlin Email: info@mclaughlinonline.com ; Phone: 305-894-1020 Trump's go-to; reference \"for John McLaughlin re: Trump priorities.\" TIPP Form: tippingpointpolls.com/contact; Email: info@tippingpointpolls.com ... if you actually give a fuck make a call. Send emails. permalink parent award report block reply assblast 7 points 3 hours ago The yes-man attitude is 100x more harmful than people that hold him accountable. GG OP you retard permalink award report block reply YaharaRiver -6 points 2 hours ago Please turn your sage wisdom onto the millions of ☪️ultists who say yes to everything their pedofile prophet says. permalink parent award report block reply RandoBudster 3 points 3 hours ago Yep, people have gone from GEOTUS to turncoat over some serious missteps but if he listens there is still time to course correct and there's no one else I'd rather have in the job. permalink award report block reply NotYourMan 3 points 3 hours ago Support Trump because everything democrats have done since Carter is wrong for the middle class.  The latest flood of immigrants to steal the wealth that boomers left to the children is yet another failure of the democrats to support the middle class.  BE ANTI-DEMOCRAT INSTEAD OF DOOMERS. permalink parent award report block reply here2red 2 points 3 hours ago This. Its gets annoying after a while. permalink award report block reply 62jawbill 2 points 2 hours ago I'm trying my hardest to find anything Trump and his administration has done that benefits my family. Groceries are still expensive and gas just went over 3$ a gallon (NC) Hasn't been this high since 22.. all I've seen is him kissing every other countries ass. Meanwhile antifa mobs are attacking Patriots. We'll be left with his crap as he swings his clubs and drinks champagne with the Epstein clients. permalink award report block reply Petiteputnam1 1 points 3 hours ago This happens literally every other month where people freak out for a week and then all of a sudden something happens and they're happy again. I will wait a few days to judge what is currently unfolding permalink award report block reply iamherefortheluls -2 points 2 hours ago people freak out for a week and then all of a sudden something happens and a bunch of shills pretend everything is good now and have circle jerk threads over it Look guys, he blew up another boat and Venezuela didn't do anything! Why are you still whining about economy? permalink parent award report block reply Petiteputnam1 1 points 2 hours ago Can walk and chew gum at the same time. It's ok to tout the accomplishments and complain about the missteps. I think it's more complaining than anything especially this past week. For every 10 posts I see about Pam and Kash doing nothing or H1B visas scams I see maybe one post about the stupid drug smugglers dying permalink parent award report block reply YaharaRiver 1 points 3 hours ago Frankly, I wouldn’t be at all surprised to learn in the future that a lot of the notions coming from Trump today are intended to arouse the strong passions of the faithful and jolt the rest into reality. permalink award report block reply assblast 3 points 3 hours ago Ah yes the 420D chess that is ever-talked about but has never actually been used in the 10 years Trump has been in politics. permalink parent award report block reply iamherefortheluls 2 points 2 hours ago guy we are like a year past the point when we need to jolting the base into everything. The base got him into power. This isn't boot camp, you are on the fucking battle field you are pretending like him turning the guns on his own is some kind of training exercise. One year till mid terms, and no one is turning out for this crap. permalink parent award report block reply YaharaRiver -1 points 2 hours ago if you think for one second that GEOTUS is “turning the guns on his own” you are fucking delusional.  What might look like that to you will always be him aiming at the enemy standing RIGHT BEHIND you! permalink parent award report block reply BrokenWolf2022 0 points 3 hours ago If you say so. Me, I'd rather a (D) be in charge so we can start shooting, but that's just me. permalink award report block reply try4gain OP PRO 0 points 3 hours ago there isnt going to be a civil war but you can go to prison if you want I guess permalink parent award report block reply BrokenWolf2022 1 points 1 hour ago Funny thing is, a lot of people said that the first time. I'll wait. Shouldn't be much longer. permalink parent award report block reply NotYourMan -3 points 3 hours ago Trump is learning.  Keep the voice loud; stop the dooming.  Here is an idea, H1B-visa employees get a yearly fee equal to 20% of their salary.  The federal government uses that money as grants for US citizens at universities to get masters degrees in real, practical majors like Computer Science or EE or other engineering fields (no funds for DEI majors like Racial Equity majors). permalink award report block reply bratt 1 points 2 hours ago H1B-visa employees are assigned a equal wage trainee that shadows their every move. The trainee can attend additional schooling as required. Then send the H1B home unless more trainees are needed. Then send him home. No path to citizenship possible. permalink parent award report block reply togtfo 0 points 2 hours ago 50%.  Now go make it real, faggot. permalink parent award report block reply\nAwakened 19 points 3 hours ago Being slowly boiled is much more dangerous than a quick jolt. Look, it isn't just this. It started with the Epstein thing and was followed by a lot of other things. You're not gonna rally the troops when all they are doing is responding to him saying anti-MAGA things. Their reaction isn't their fault, it's Trumps. They are reacting naturally to betrayal on the most important thing their is, American jobs. Main street versus Wall street. Trump needs massive turnout to overcome fraud in the midterms, since he hasn't pulled off any major arrests at this point, expect it to be massive massive fraud. He will not get that at this point. Worse, it could be a total route.  Then they will not only have the votes to impeach him, but remove him. Then throw him and his in jail. Someone better wake him up. But most here are done pretending everything is all right. Good luck permalink award report block reply Standingoak -1 points 2 hours ago They are reacting naturally Thanks for letting everyone know YOU are not MAGA because : 'We are reacting naturally' permalink parent award report block reply Awakened 2 points 2 hours ago Lol. This shit doesn't work on those of us who risked everything for MAGA and for Trump.  You just seem retarded, but not in the good way. We deserve better shills. permalink parent award report block reply try4gain OP PRO -3 points 2 hours ago Trump was never perfect and will never be.  Every President & Politician makes promises they cant deliver on. Epstein files : This is the new JFK files.  Going to take ages to release.  Trump realized it was MI6 CIA Mossad and so had to do a hard awkward pivot which he handled poorly. If Trump was in the Epstein files Biden & Co would have leaked it to the press. Trump has always had a habbit of putting his foot in his mouth at least once a month.  Then  the base pushes back hard enough and often he changes course.  But dont expect that with Epstein because it's CIA Mossad shit. Trump is the start of the MAGA movement.  We wont get everything we want.  JD Vance will be the next step. This is a multi-term multi-decade movement.  It took decades for leftist and RINOs to get us in this mess, we're not getting out with a few executive orders. permalink parent award report block reply Awakened 2 points 2 hours ago Except, and this is very important, are you ready JOBS! That's the real reason he is there and he just shit on his reason. Shit all over it. Oh, and this is also important TELLING US TO WAIT NO LONGER WORKS Because we know what happened last term. We are through being strung along and treated secondary. We are so completely done. The midterms will be here soon. No one can buy a house and groceries are still through the roof. Forget about a nice night eating out. We are circling the drain. Also, we don't want Vance. He is a tech bro puppet and super pro H1b. You guys really don't get it. You're about to lose in a massive way. Also, Vivek will turn Ohio over to the commies because he will be losing. Well done Trump, well done. You people really don't get what's coming do you? A complete walking away of the base. The democrats were on their last leg and Trump just saved them. permalink parent award report block reply\nStandingoak -1 points 2 hours ago They are reacting naturally Thanks for letting everyone know YOU are not MAGA because : 'We are reacting naturally' permalink parent award report block reply Awakened 2 points 2 hours ago Lol. This shit doesn't work on those of us who risked everything for MAGA and for Trump.  You just seem retarded, but not in the good way. We deserve better shills. permalink parent award report block reply\nAwakened 2 points 2 hours ago Lol. This shit doesn't work on those of us who risked everything for MAGA and for Trump.  You just seem retarded, but not in the good way. We deserve better shills. permalink parent award report block reply\ntry4gain OP PRO -3 points 2 hours ago Trump was never perfect and will never be.  Every President & Politician makes promises they cant deliver on. Epstein files : This is the new JFK files.  Going to take ages to release.  Trump realized it was MI6 CIA Mossad and so had to do a hard awkward pivot which he handled poorly. If Trump was in the Epstein files Biden & Co would have leaked it to the press. Trump has always had a habbit of putting his foot in his mouth at least once a month.  Then  the base pushes back hard enough and often he changes course.  But dont expect that with Epstein because it's CIA Mossad shit. Trump is the start of the MAGA movement.  We wont get everything we want.  JD Vance will be the next step. This is a multi-term multi-decade movement.  It took decades for leftist and RINOs to get us in this mess, we're not getting out with a few executive orders. permalink parent award report block reply Awakened 2 points 2 hours ago Except, and this is very important, are you ready JOBS! That's the real reason he is there and he just shit on his reason. Shit all over it. Oh, and this is also important TELLING US TO WAIT NO LONGER WORKS Because we know what happened last term. We are through being strung along and treated secondary. We are so completely done. The midterms will be here soon. No one can buy a house and groceries are still through the roof. Forget about a nice night eating out. We are circling the drain. Also, we don't want Vance. He is a tech bro puppet and super pro H1b. You guys really don't get it. You're about to lose in a massive way. Also, Vivek will turn Ohio over to the commies because he will be losing. Well done Trump, well done. You people really don't get what's coming do you? A complete walking away of the base. The democrats were on their last leg and Trump just saved them. permalink parent award report block reply\nAwakened 2 points 2 hours ago Except, and this is very important, are you ready JOBS! That's the real reason he is there and he just shit on his reason. Shit all over it. Oh, and this is also important TELLING US TO WAIT NO LONGER WORKS Because we know what happened last term. We are through being strung along and treated secondary. We are so completely done. The midterms will be here soon. No one can buy a house and groceries are still through the roof. Forget about a nice night eating out. We are circling the drain. Also, we don't want Vance. He is a tech bro puppet and super pro H1b. You guys really don't get it. You're about to lose in a massive way. Also, Vivek will turn Ohio over to the commies because he will be losing. Well done Trump, well done. You people really don't get what's coming do you? A complete walking away of the base. The democrats were on their last leg and Trump just saved them. permalink parent award report block reply\nIremembermypassword 8 points 3 hours ago Why Trump not 110% based? What does it cost him? What does it benefit MAGA? permalink award report block reply\nMAGALADON9 8 points 3 hours ago Trump lives in a bubble and is being lead by bad actors. permalink award report block reply BlackJack1776 1 points 2 hours ago That isolating \"Presidential Bubble\" is a real hazard. Bad Actors and the Deep State mastered exploiting it before telegraphs were even a thing. GEOTUS is getting Wormtounged, who's gonna Gandolf him? permalink parent award report block reply MAGALADON9 2 points 1 hour ago (Copy and paste this in similar threads. You will have to \"**\" the points yourself.) GET ON THESE GUYS RADAR. CONTACT DIRECTLY. DJT OBSERVES THEM. LET THEM KNOW YOUR STRONG DISAPPOINTMENT AND DISAPPROVAL - EXAGGERATE A BIT. Rasmussen Reports Email: info@rasmussenreports.com ; Web form at rasmussenreports.com/contact_us Trump tweets their data weekly; say \"For Scott Rasmussen: My take on [issue].\" Trafalgar Group Form: thetrafalgargroup.org/contact; Phone: 202-810-2123 Robert Cahaly (lead) briefs Trump allies; emphasize GOP alignment. John McLaughlin Email: info@mclaughlinonline.com ; Phone: 305-894-1020 Trump's go-to; reference \"for John McLaughlin re: Trump priorities.\" TIPP Form: tippingpointpolls.com/contact; Email: info@tippingpointpolls.com ... if you actually give a fuck make a call. Send emails. permalink parent award report block reply\nBlackJack1776 1 points 2 hours ago That isolating \"Presidential Bubble\" is a real hazard. Bad Actors and the Deep State mastered exploiting it before telegraphs were even a thing. GEOTUS is getting Wormtounged, who's gonna Gandolf him? permalink parent award report block reply MAGALADON9 2 points 1 hour ago (Copy and paste this in similar threads. You will have to \"**\" the points yourself.) GET ON THESE GUYS RADAR. CONTACT DIRECTLY. DJT OBSERVES THEM. LET THEM KNOW YOUR STRONG DISAPPOINTMENT AND DISAPPROVAL - EXAGGERATE A BIT. Rasmussen Reports Email: info@rasmussenreports.com ; Web form at rasmussenreports.com/contact_us Trump tweets their data weekly; say \"For Scott Rasmussen: My take on [issue].\" Trafalgar Group Form: thetrafalgargroup.org/contact; Phone: 202-810-2123 Robert Cahaly (lead) briefs Trump allies; emphasize GOP alignment. John McLaughlin Email: info@mclaughlinonline.com ; Phone: 305-894-1020 Trump's go-to; reference \"for John McLaughlin re: Trump priorities.\" TIPP Form: tippingpointpolls.com/contact; Email: info@tippingpointpolls.com ... if you actually give a fuck make a call. Send emails. permalink parent award report block reply\nMAGALADON9 2 points 1 hour ago (Copy and paste this in similar threads. You will have to \"**\" the points yourself.) GET ON THESE GUYS RADAR. CONTACT DIRECTLY. DJT OBSERVES THEM. LET THEM KNOW YOUR STRONG DISAPPOINTMENT AND DISAPPROVAL - EXAGGERATE A BIT. Rasmussen Reports Email: info@rasmussenreports.com ; Web form at rasmussenreports.com/contact_us Trump tweets their data weekly; say \"For Scott Rasmussen: My take on [issue].\" Trafalgar Group Form: thetrafalgargroup.org/contact; Phone: 202-810-2123 Robert Cahaly (lead) briefs Trump allies; emphasize GOP alignment. John McLaughlin Email: info@mclaughlinonline.com ; Phone: 305-894-1020 Trump's go-to; reference \"for John McLaughlin re: Trump priorities.\" TIPP Form: tippingpointpolls.com/contact; Email: info@tippingpointpolls.com ... if you actually give a fuck make a call. Send emails. permalink parent award report block reply\nassblast 7 points 3 hours ago The yes-man attitude is 100x more harmful than people that hold him accountable. GG OP you retard permalink award report block reply YaharaRiver -6 points 2 hours ago Please turn your sage wisdom onto the millions of ☪️ultists who say yes to everything their pedofile prophet says. permalink parent award report block reply\nYaharaRiver -6 points 2 hours ago Please turn your sage wisdom onto the millions of ☪️ultists who say yes to everything their pedofile prophet says. permalink parent award report block reply\nRandoBudster 3 points 3 hours ago Yep, people have gone from GEOTUS to turncoat over some serious missteps but if he listens there is still time to course correct and there's no one else I'd rather have in the job. permalink award report block reply NotYourMan 3 points 3 hours ago Support Trump because everything democrats have done since Carter is wrong for the middle class.  The latest flood of immigrants to steal the wealth that boomers left to the children is yet another failure of the democrats to support the middle class.  BE ANTI-DEMOCRAT INSTEAD OF DOOMERS. permalink parent award report block reply\nNotYourMan 3 points 3 hours ago Support Trump because everything democrats have done since Carter is wrong for the middle class.  The latest flood of immigrants to steal the wealth that boomers left to the children is yet another failure of the democrats to support the middle class.  BE ANTI-DEMOCRAT INSTEAD OF DOOMERS. permalink parent award report block reply\nhere2red 2 points 3 hours ago This. Its gets annoying after a while. permalink award report block reply\n62jawbill 2 points 2 hours ago I'm trying my hardest to find anything Trump and his administration has done that benefits my family. Groceries are still expensive and gas just went over 3$ a gallon (NC) Hasn't been this high since 22.. all I've seen is him kissing every other countries ass. Meanwhile antifa mobs are attacking Patriots. We'll be left with his crap as he swings his clubs and drinks champagne with the Epstein clients. permalink award report block reply\nPetiteputnam1 1 points 3 hours ago This happens literally every other month where people freak out for a week and then all of a sudden something happens and they're happy again. I will wait a few days to judge what is currently unfolding permalink award report block reply iamherefortheluls -2 points 2 hours ago people freak out for a week and then all of a sudden something happens and a bunch of shills pretend everything is good now and have circle jerk threads over it Look guys, he blew up another boat and Venezuela didn't do anything! Why are you still whining about economy? permalink parent award report block reply Petiteputnam1 1 points 2 hours ago Can walk and chew gum at the same time. It's ok to tout the accomplishments and complain about the missteps. I think it's more complaining than anything especially this past week. For every 10 posts I see about Pam and Kash doing nothing or H1B visas scams I see maybe one post about the stupid drug smugglers dying permalink parent award report block reply\niamherefortheluls -2 points 2 hours ago people freak out for a week and then all of a sudden something happens and a bunch of shills pretend everything is good now and have circle jerk threads over it Look guys, he blew up another boat and Venezuela didn't do anything! Why are you still whining about economy? permalink parent award report block reply Petiteputnam1 1 points 2 hours ago Can walk and chew gum at the same time. It's ok to tout the accomplishments and complain about the missteps. I think it's more complaining than anything especially this past week. For every 10 posts I see about Pam and Kash doing nothing or H1B visas scams I see maybe one post about the stupid drug smugglers dying permalink parent award report block reply\nPetiteputnam1 1 points 2 hours ago Can walk and chew gum at the same time. It's ok to tout the accomplishments and complain about the missteps. I think it's more complaining than anything especially this past week. For every 10 posts I see about Pam and Kash doing nothing or H1B visas scams I see maybe one post about the stupid drug smugglers dying permalink parent award report block reply\nYaharaRiver 1 points 3 hours ago Frankly, I wouldn’t be at all surprised to learn in the future that a lot of the notions coming from Trump today are intended to arouse the strong passions of the faithful and jolt the rest into reality. permalink award report block reply assblast 3 points 3 hours ago Ah yes the 420D chess that is ever-talked about but has never actually been used in the 10 years Trump has been in politics. permalink parent award report block reply iamherefortheluls 2 points 2 hours ago guy we are like a year past the point when we need to jolting the base into everything. The base got him into power. This isn't boot camp, you are on the fucking battle field you are pretending like him turning the guns on his own is some kind of training exercise. One year till mid terms, and no one is turning out for this crap. permalink parent award report block reply YaharaRiver -1 points 2 hours ago if you think for one second that GEOTUS is “turning the guns on his own” you are fucking delusional.  What might look like that to you will always be him aiming at the enemy standing RIGHT BEHIND you! permalink parent award report block reply\nassblast 3 points 3 hours ago Ah yes the 420D chess that is ever-talked about but has never actually been used in the 10 years Trump has been in politics. permalink parent award report block reply\niamherefortheluls 2 points 2 hours ago guy we are like a year past the point when we need to jolting the base into everything. The base got him into power. This isn't boot camp, you are on the fucking battle field you are pretending like him turning the guns on his own is some kind of training exercise. One year till mid terms, and no one is turning out for this crap. permalink parent award report block reply YaharaRiver -1 points 2 hours ago if you think for one second that GEOTUS is “turning the guns on his own” you are fucking delusional.  What might look like that to you will always be him aiming at the enemy standing RIGHT BEHIND you! permalink parent award report block reply\nYaharaRiver -1 points 2 hours ago if you think for one second that GEOTUS is “turning the guns on his own” you are fucking delusional.  What might look like that to you will always be him aiming at the enemy standing RIGHT BEHIND you! permalink parent award report block reply\nBrokenWolf2022 0 points 3 hours ago If you say so. Me, I'd rather a (D) be in charge so we can start shooting, but that's just me. permalink award report block reply try4gain OP PRO 0 points 3 hours ago there isnt going to be a civil war but you can go to prison if you want I guess permalink parent award report block reply BrokenWolf2022 1 points 1 hour ago Funny thing is, a lot of people said that the first time. I'll wait. Shouldn't be much longer. permalink parent award report block reply\ntry4gain OP PRO 0 points 3 hours ago there isnt going to be a civil war but you can go to prison if you want I guess permalink parent award report block reply BrokenWolf2022 1 points 1 hour ago Funny thing is, a lot of people said that the first time. I'll wait. Shouldn't be much longer. permalink parent award report block reply\nBrokenWolf2022 1 points 1 hour ago Funny thing is, a lot of people said that the first time. I'll wait. Shouldn't be much longer. permalink parent award report block reply\nNotYourMan -3 points 3 hours ago Trump is learning.  Keep the voice loud; stop the dooming.  Here is an idea, H1B-visa employees get a yearly fee equal to 20% of their salary.  The federal government uses that money as grants for US citizens at universities to get masters degrees in real, practical majors like Computer Science or EE or other engineering fields (no funds for DEI majors like Racial Equity majors). permalink award report block reply bratt 1 points 2 hours ago H1B-visa employees are assigned a equal wage trainee that shadows their every move. The trainee can attend additional schooling as required. Then send the H1B home unless more trainees are needed. Then send him home. No path to citizenship possible. permalink parent award report block reply togtfo 0 points 2 hours ago 50%.  Now go make it real, faggot. permalink parent award report block reply\nbratt 1 points 2 hours ago H1B-visa employees are assigned a equal wage trainee that shadows their every move. The trainee can attend additional schooling as required. Then send the H1B home unless more trainees are needed. Then send him home. No path to citizenship possible. permalink parent award report block reply\ntogtfo 0 points 2 hours ago 50%.  Now go make it real, faggot. permalink parent award report block reply"
}