{
  "id": "1ARK0TUbLi",
  "url": "https://patriots.win/p/1ARK0TUbLi/uae-saudi-arabia-egypt-bahrain-a/c",
  "content": "244 UAE, Saudi Arabia, Egypt, Bahrain and Russia have designated the Muslim Brotherhood a Terrorist Organization. Why Hasn't The US? posted 7 days ago by perma-maga 6 comments award share report block The Muslim Brotherhood, through the Rabita Trust, were major funders of the September 11 attacks on the United States.\n6 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno ChyNahAzzWhole1 5 points 7 days ago aipac hasnt told them to permalink award report block reply Tiger5468 1 points 7 days ago Comment removed by community filter, pending further review. permalink parent award report block reply magnokor 2 points 7 days ago Why? They are deep in the government, the political parties, in North America. They write legislation for the Liberal Party in Canada.  They were visiting Barry so often at the White House, and around DC, that they could have been made an official cabinet position. Ban them all, or surrender to them. permalink award report block reply ReleasetheList 2 points 7 days ago Because both parties hate you and want you dead, just for different reasons. permalink award report block reply Votingnerd 1 points 7 days ago $oros money permalink award report block reply\nChyNahAzzWhole1 5 points 7 days ago aipac hasnt told them to permalink award report block reply Tiger5468 1 points 7 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nTiger5468 1 points 7 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nmagnokor 2 points 7 days ago Why? They are deep in the government, the political parties, in North America. They write legislation for the Liberal Party in Canada.  They were visiting Barry so often at the White House, and around DC, that they could have been made an official cabinet position. Ban them all, or surrender to them. permalink award report block reply\nReleasetheList 2 points 7 days ago Because both parties hate you and want you dead, just for different reasons. permalink award report block reply\nVotingnerd 1 points 7 days ago $oros money permalink award report block reply",
  "fetched_at": "2025-11-12T21:17:04.188706Z"
}