{
  "id": "1ARK9hiY8C",
  "url": "https://patriots.win/p/1ARK9hiY8C/youre-a-republican-arent-you/c",
  "content": "613 you're a Republican, aren't you? posted 2 days ago by Taraa 20 comments award share report block Sassafrass84 @Sassafrass_84 • 3d 🤣🤣🤣\n20 comments Sort by Top Top New Worst Old Save BBvarn 31 points 2 days ago No, I am anti-communist, there's a difference. permalink award report block reply MAGABOND 7 points 2 days ago I begrudgingly vote Republican, but I ain’t no Republican. permalink parent award report block reply GallowsTime 25 points 2 days ago Him:  Bwahahaha speed dials Tom Homan. permalink award report block reply SAHMiAM60 17 points 2 days ago Small g \"god\". Of course she's a godless ho. permalink award report block reply Beelzy 15 points 2 days ago Have a nice trip Puta. permalink award report block reply nakedjay 10 points 2 days ago Fake, but still funny. permalink award report block reply Tardigrade 7 points 2 days ago And VERY old. permalink parent award report block reply MythArcana 9 points 2 days ago They have to go back. Stop stealing my bandwidth. permalink award report block reply rebuildingMyself 3 points 2 days ago Hand over the Obama phone as well since we're all paying for it permalink parent award report block reply South_Florida_Guy 7 points 2 days ago You're right....it's important to keep promises (dials ICE) permalink award report block reply YaharaRiver 5 points 2 days ago Pls tell me  his next text was to ICE 😂 permalink award report block reply AmericanJawa 5 points 2 days ago Unless he's planning to use that meal as a trap so ICE can detain and deport her, he's part of the problem. permalink award report block reply Vermino 3 points 2 days ago If only there were $1,000 bounties. permalink award report block reply HockeyMom4Trump 2 points 2 days ago Quick. Call ICE. permalink award report block reply schnazzmizzle 2 points 2 days ago https://youtu.be/Nntd2fgMUYw?si permalink award report block reply Blue_Falcons_Suck 1 points 2 days ago Just one more meal paid for by a Citizen before getting the boot... At least this time she can look the benefactor in the eye. permalink award report block reply bill_in_texas 1 points 2 days ago I hope an ICE report was generated and sent. permalink award report block reply Bicentennial76 1 points 2 days ago Undocumented... so sick of the gay euphemisms permalink award report block reply barwhack 1 points 2 days ago At least before you leave . 😆 Lovely. permalink award report block reply PhantomShield72 1 points 2 days ago Tryna get one last dirty sanchez in before the deportation bus arrives. Have to admire the game... permalink award report block reply RudeFrog -3 points 2 days ago The two party system? What are you 12? Do you still believe in the Easter bunny too? permalink award report block reply\nBBvarn 31 points 2 days ago No, I am anti-communist, there's a difference. permalink award report block reply MAGABOND 7 points 2 days ago I begrudgingly vote Republican, but I ain’t no Republican. permalink parent award report block reply\nMAGABOND 7 points 2 days ago I begrudgingly vote Republican, but I ain’t no Republican. permalink parent award report block reply\nGallowsTime 25 points 2 days ago Him:  Bwahahaha speed dials Tom Homan. permalink award report block reply\nSAHMiAM60 17 points 2 days ago Small g \"god\". Of course she's a godless ho. permalink award report block reply\nBeelzy 15 points 2 days ago Have a nice trip Puta. permalink award report block reply\nnakedjay 10 points 2 days ago Fake, but still funny. permalink award report block reply Tardigrade 7 points 2 days ago And VERY old. permalink parent award report block reply\nTardigrade 7 points 2 days ago And VERY old. permalink parent award report block reply\nMythArcana 9 points 2 days ago They have to go back. Stop stealing my bandwidth. permalink award report block reply rebuildingMyself 3 points 2 days ago Hand over the Obama phone as well since we're all paying for it permalink parent award report block reply\nrebuildingMyself 3 points 2 days ago Hand over the Obama phone as well since we're all paying for it permalink parent award report block reply\nSouth_Florida_Guy 7 points 2 days ago You're right....it's important to keep promises (dials ICE) permalink award report block reply\nYaharaRiver 5 points 2 days ago Pls tell me  his next text was to ICE 😂 permalink award report block reply\nAmericanJawa 5 points 2 days ago Unless he's planning to use that meal as a trap so ICE can detain and deport her, he's part of the problem. permalink award report block reply\nVermino 3 points 2 days ago If only there were $1,000 bounties. permalink award report block reply\nHockeyMom4Trump 2 points 2 days ago Quick. Call ICE. permalink award report block reply\nschnazzmizzle 2 points 2 days ago https://youtu.be/Nntd2fgMUYw?si permalink award report block reply\nBlue_Falcons_Suck 1 points 2 days ago Just one more meal paid for by a Citizen before getting the boot... At least this time she can look the benefactor in the eye. permalink award report block reply\nbill_in_texas 1 points 2 days ago I hope an ICE report was generated and sent. permalink award report block reply\nBicentennial76 1 points 2 days ago Undocumented... so sick of the gay euphemisms permalink award report block reply\nbarwhack 1 points 2 days ago At least before you leave . 😆 Lovely. permalink award report block reply\nPhantomShield72 1 points 2 days ago Tryna get one last dirty sanchez in before the deportation bus arrives. Have to admire the game... permalink award report block reply\nRudeFrog -3 points 2 days ago The two party system? What are you 12? Do you still believe in the Easter bunny too? permalink award report block reply",
  "fetched_at": "2025-11-12T23:16:43.847613Z"
}