{
  "id": "1ARK0UcRZZ",
  "url": "https://patriots.win/p/1ARK0UcRZZ/stop-falling-for-fake-news-demor/c",
  "content": "1208 Stop Falling for Fake News Demoralization posted 7 days ago by grandfather_nurgle 150 comments award share download report block\n150 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Cyber1776 121 points 7 days ago Being blackpilled is gay, but its important to realize that we fucked up with these elections and need to prepare for the midterms permalink award report block reply Minn2000 80 points 7 days ago This is the 100% correct and healthy view on the situation. permalink parent award report block reply UCantStumpTheTrump 28 points 7 days ago Just be aware the site is flooded with shills trying to “fracture the base,” complaining that Trump is doing this or that wrong, or he hasn’t delivered on X or Y promise. Ridicule and shame them whenever you see them post permalink parent award report block reply Harsh_Truth2 10 points 7 days ago Intelligence is NOT ridiculing people who refuse to blindly follow along. A cult mentality that refuses to question anything, or hold anyone accountable is no different than the other side. Sorry, but Trump is doing a million things to put the fire out in the back uard while the porch burns. permalink parent award report block reply TillaMAGA 12 points 7 days ago Subtle. – I'm guessing that \"Harsh_Truth1\" was already taken. permalink parent award report block reply UCantStumpTheTrump 9 points 7 days ago Ridicule works. People who are only here to complain and bitch are not adding to the discourse and deserve to be driven off the site permalink parent award report block reply ridge3z 2 points 7 days ago So you'd rather not challenge those actually trying to diminish MAGA? There are a lot of people here who listen to the nonsense of Mark Levin, Dana Loesch, et al and believe their nonsense. permalink parent award report block reply view 10 more comments... BBvarn 1 points 6 days ago News flash, all of you young communists can go get free shit plus free bus rides in NYC.  Quit bitching on this site about what your parents didn't provide for you. permalink parent award report block reply Pnw4gotpwd 1 points 7 days ago 100% the Dems must pay and economic misery many Americans now suffer from needs to be fixed. College grads need jobs. American workers need job mobility. Groceries, electricity, housing, insurance and gas prices need to come down. As does the crime rate. And we must take credit for that and make the Dems eat it. We must prosecute the corrupt Dems who spies on us, tormented is, and used the corrupt wheels of the government machine to try to crush us.  Trump needs to play up what he was accomplished via kash Patel, tom homan, Linda McMahon, mete hegseth, et al. Also, Trump needs to not do shit like tear down the East wing and deny he's doing it. Instead be 100% forthright about doing it, and then do it. Trumps messaging has been far from perfect, and some of it has come off like when jd vance called grace chong a \"mouth breathing idiot\". Grace chong is loyal, dedicated, intelligent, and has done a lot for america and for Trump. Plus she's hot... Vance could and should have made his point without insulting her. And trump has suffered some similar failures. permalink parent award report block reply NomadicKrow2 1 points 6 days ago Also, if you buy crypto, consider bitcoin dropping 10% as a limited time discount. permalink parent award report block reply pollsarefake 21 points 7 days ago We didn’t fuck up The elections were rigged just like 2020 They were STOLEN using MASSIVE DUMPS and FRAUD inside the CORRUPT MACHINES permalink parent award report block reply philasoma 17 points 7 days ago Dems are building a coalition of immigrants/minorities and white women and that will actually put them over the top w/o massive cheating. Trump's inroads with latinos and young voters won him the election. I totally agree we need voter ID, no mail-in ballots, and citizen-only voting, but the dems have an angle to win their coalition even a fair election if we are being realistic. permalink parent award report block reply InfinitesimalOrange 1 points 6 days ago \"Without cheating\" Yeah if we consider Importing millions of illegal immigrants to vote. to not be cheating. Fair my fucking ass, they spent 50 years literally illegally changing the demographics of the country to coalesce their power. A fucking fair election, shut the fuck up, I don't think one of those has ever happened. permalink parent award report block reply johnqpublic864 12 points 7 days ago Regardless of how, seats were lost. Your typical Joe Football MAGA lites won't get off their asses and vote in local elections, mid-terms, etc. We're also horrible at getting messaging out on all these smaller elections. Scott Presler and a few posts on here aren't nearly enough against the libtard machine. The GOP machine is ass. permalink parent award report block reply pollsarefake -1 points 7 days ago They weren’t “lost” you doomer faggot They were STOLEN permalink parent award report block reply johnqpublic864 2 points 6 days ago You lack personal accountability. Remember \"Too Big to Rig?\" Of course you don't. Did you even vote in your local elections? Take anyone outside of your household with you? Ballot harvest? Did you door knock? Register any voters? Host or go to any meetings? I'm betting the answer to most/all of those questions is \"no.\" Outside of voting, I didn't do anything, either. Instead of offering excuses and blame, which aren't productive, we should ask \"What can I do between now and mid-terms to help?\" Calling people doomer faggot on Patriots ain't it. permalink parent award report block reply view 2 more comments... PitfallHarry 9 points 7 days ago Citarelli is a cuck faggot for conceding. permalink parent award report block reply Harvestsmiles 5 points 7 days ago You'd think someone would change some election laws to prevent that kind of thing by now. But, they f'ked that up... permalink parent award report block reply Krat 3 points 7 days ago They dont want itnchanged, they want ypu gone and replaced too permalink parent award report block reply Throwawayjan6 5 points 7 days ago Reeeeeeeeeeeegged. Dude, the expected winners won. Shitty candidates and long shots don’t make for rigged elections. permalink parent award report block reply load 9 more comments... Skogin 9 points 7 days ago I fucked up nothing. permalink parent award report block reply starjello 11 points 7 days ago Neither did I. I voted correctly, but I also know we will not vote our way out of this. I also do not drink the kool-aid served here by many. permalink parent award report block reply PensivePatriot 6 points 7 days ago I’d like to offer the white pill and say that this was the most reactionary election ever, on the democrats behalf. I bet they can’t muster the same strength next year. permalink parent award report block reply PitfallHarry 3 points 7 days ago Now that Trump has prices down we’ll sweep the midterms. It won’t even be close. These were all blue states anyway. permalink parent award report block reply Harsh_Truth2 -6 points 7 days ago Are the low prices in the forum with us? Oooooo eggs went down...that was a supply and demand issue, not an exectutive branch issue. Groceries still sky high. Housing still a crisis. Cars still over priced. Gas has stayed level/ticked up not dropped. Please explain what propaganda you're reading to think prices dropped!? permalink parent award report block reply PitfallHarry 4 points 7 days ago Trump told the American people that prices are down. Unless you’re telling me he lied to us all and is gaslighting the American people then President Trump’s words are the only propaganda that’s needed. permalink parent award report block reply load 10 more comments... War_Hamster 62 points 7 days ago This meme needs to include how MAGA is being attacked from “within”. The whole  “woke right” thing is a neocon attack on the MAGA movement. permalink award report block reply ParadigmShift2070 16 points 7 days ago Call them what they are, Judeo-cons permalink parent award report block reply Iforgot2 -8 points 7 days ago Woke right is people like twinkie and his gay followers like you. permalink parent award report block reply IncredibleMrE1 8 points 7 days ago Neocons are neo-Trotskyists. permalink parent award report block reply Gletkin 1 points 7 days ago Historically accurate. permalink parent award report block reply DeportThemAllForever 0 points 6 days ago They learned to copy the meme war permalink parent award report block reply DelendaEstMarxismo 34 points 7 days ago These are all leftist strongholds. Let's not exaggerate the significance of Democrats winning. permalink award report block reply Gletkin 4 points 7 days ago True. I don’t think these were MAGA fuckups, just libtards libbing out in places where they’re dominant. permalink parent award report block reply TooHotToFrost 1 points 6 days ago They got the right whining that Cuomo didn’t win the election. Lol. Psyop successful. permalink parent award report block reply Prandogolio 26 points 7 days ago New York City did not vote Democrat.  They voted Muslim Communist. permalink award report block reply Lelleck 17 points 7 days ago They voted the 2025 version of Democrat. permalink parent award report block reply Gletkin 6 points 7 days ago They voted managed decline of America into apocalyptic faggotry. permalink parent award report block reply Lelleck 3 points 7 days ago Is it not working out perfectly fine in London? permalink parent award report block reply Harvestsmiles 9 points 7 days ago Meaning the election was just for show permalink parent award report block reply anotherthing 2 points 6 days ago The Muslim Communist only beat the grandma mass murderer by 9 points. permalink parent award report block reply lifeisahologram 23 points 7 days ago Bitcoin dropping is exciting, it just means I get a discount. permalink award report block reply Hanging_Chad 6 points 7 days ago the sub-100k dip is over :/ permalink parent award report block reply lifeisahologram 6 points 7 days ago This is just the warm up before we go back to consistent 70k next year. Get ready to stack in 2026! permalink parent award report block reply Lelleck 4 points 7 days ago It would follow the usual 4 year cycle to be honest. Halving, 6-8 months later a peak, going down slowly, another somewhat peak, finding a new base. Getting excited for coming halving. Fear of missing out. Next halving… permalink parent award report block reply Hanging_Chad 1 points 7 days ago 🎢 permalink parent award report block reply Miskyavine 21 points 7 days ago Virginia sucked though permalink award report block reply IncredibleMrE1 25 points 7 days ago I can't imagine why conservative voters didn't turn out for the anti-Trump black immigrant woman. Or why the government workers in NOVA turned out en masse for Jay \"I want to butcher children in front of their Republican parents\" Jones. permalink parent award report block reply swarleybing 9 points 7 days ago Yup it was similar to trying to get PA republicans excited about Turkish Muslim Dr Oz. (Ironically Fetterman turned into kind of a Dino) permalink parent award report block reply Gletkin 3 points 7 days ago He still votes D, just like Murkowski and Collins. permalink parent award report block reply vote_for_MAGA_2020 2 points 7 days ago I'm glad I'm not the only one who sees Earl Sears as the fraud that she is. permalink parent award report block reply Miskyavine 1 points 6 days ago Yea i dont know the fine details im in Illinois but yea GOP makes some stupid ass decisions permalink parent award report block reply KnoxHarrington 9 points 7 days ago Sears is a retard who ran a shit campaign.  Idk what powerful glue the VA GOP were sniffing when they decided she was our best. permalink parent award report block reply Prandogolio 10 points 7 days ago They were huffing \"let's prove we're not racist!” permalink parent award report block reply ragnarokrobo 2 points 6 days ago Always a winning strategy for boomercons. permalink parent award report block reply TheJakeFroggy 5 points 7 days ago I hardly understand Virginia. In 2021, Terry McAuliffe lost because he told parents that they shouldn't have any involvement in children's education. Then four years later, Jay Jones is revealed to have fantasized about killing someone's children, which is way more disgusting and psychotic than what McAuliffe said, and still somehow manages to win. Did Virginia society just go through rapid moral decay during the last four years? permalink parent award report block reply jcd_007 4 points 7 days ago Virginia has a ridiculous number of government employees, many of whom are currently out of work due to the shutdown. Is it a surprise they voted D? Virginia has also been increasingly overrun by immigrants. permalink parent award report block reply Braineack 0 points 7 days ago Yeah but think about all the good pho and Korean bbq you can eat, while constantly getting into fender benders permalink parent award report block reply Covidrrhea 16 points 7 days ago You kiddin' me?  Only pussies doom about blue cities getting fucked.  I got popcorn for days, I'm going to watch New York sink into the ocean before California, and I ain't even mad. permalink award report block reply FatigueIsReal 6 points 7 days ago Bing bong. permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply -f-b-i- 16 points 7 days ago Doom permalink award report block reply deleted 17 points 7 days ago Hanging_Chad 7 points 7 days ago ✊🏻 permalink parent award report block reply MajJamesMcFarlane 2 points 7 days ago Sadly, the solution is kinetic but we're still too soft to reach that point yet permalink parent award report block reply grandfather_nurgle OP 10 points 7 days ago 10 years into this thing and these faggots still piss themselves over every tendie spill permalink parent award report block reply FatigueIsReal 6 points 7 days ago Right there with you. It's tiring watching these retards try to talk everyone else into pissing themselves too so they feel less cowardly. permalink parent award report block reply HOSEQ 0 points 6 days ago I would ask just how STUPID you can be, but then you made this, and now I don't have to ask.... permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply seangalt 5 points 7 days ago ☝️☠️ MAGA 🤙 permalink parent award report block reply ItsFunToSay-M-A-G-A 4 points 7 days ago Live webcam view from inside NYC subway station: https://files.catbox.moe/vau50a.jpg permalink parent award report block reply Hanging_Chad 2 points 7 days ago ban OP and sticky it permalink parent award report block reply load 1 more comments... TrumpInAus 13 points 7 days ago I keep seeing leftists saying MAGA must be crying, like the far left states voting far left was unexpected permalink award report block reply LabTech 10 points 7 days ago I agree, my local elections made me fairly optimistic.  I come from a blue state, and my Mayor's one of the few Republican ones in that state, and she just won re-election over her Democrat rival, who she's beaten before. A lot of the more toxic council members were purged, and more conservative leaning ones got in... and in the grand scheme of things, local politicians matter far more than State or Federal ones, because they're in charge of the day to day affairs on the ground. permalink award report block reply VoldemarBGuerta 6 points 7 days ago Friend, this is the copium that we've been huffing for a decade... if things keep up - repubs are going to get stomped in the mid-terms, just like in 2018. We can't vote our way out of this. permalink award report block reply LORDFALCONE 4 points 7 days ago Should have been spending time fixing voting rather than deepthroating the Palantir cock permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply America_No_1 6 points 7 days ago Thank you, OP.  The Dems didnt win bullshit.  In fact id say this means less than thr 2024 statement.  Far left leaning blue cities remain blue.  Shocker. permalink award report block reply TOPDAWG23 5 points 7 days ago Wait Bitcoin drops like 10% every other day. permalink award report block reply M-m-m-my-corona 5 points 7 days ago Why vote Republican when republicans won't do anything but support Israel?  You fix that problem and the votes will pour in. permalink award report block reply LORDFALCONE 4 points 7 days ago This. The entire past year has been entirely Israel themed 24/7. 🤢 They even somehow tuned Charlie Kirks death into just praising Israel before the body was even cold. Smh permalink parent award report block reply XxxRDTPRNxxX 4 points 7 days ago We're not gonna win the coming civil war at the ballot box. I hope you all understand that. permalink award report block reply HunterBidensPC 4 points 7 days ago Nah they passed over the democrat and voted straight communist permalink award report block reply henri_derelicte 4 points 7 days ago If the Dems cheat during the midterms, that’s when we cross the Rubicon. Under no circumstances are we giving up control of Congress to Chuck Schumer and Hakeem Jeffries. There will be blood in the streets before that happens. permalink award report block reply unotrumpcard 0 points 6 days ago So they got away with stealing a presidential election but if they cheat in the midterms that's when you are really going to do something? Stop, its pathetic, you will do nothing. permalink parent award report block reply ESAsher 4 points 7 days ago Carl Benjamin has a great take on New York, especially since basically the same thing happened to London. https://youtu.be/d3X_8KPOO0o?si=lQ698YK8NEBfqDBm https://youtu.be/sY5TecSArYI?si=uc1RgHxAkIT1tCpW permalink award report block reply jcd_007 4 points 7 days ago BTC is way overdue for a massive crash. permalink award report block reply 123breadman 4 points 7 days ago Thank fuk you noticed this. This is what I have been telling everyone I know. \"NYC is lost\" lol ok crackhead, when did we ever have NYC? permalink award report block reply Moose_Antlers 3 points 7 days ago I get the emotional reaction, but the response is wrong. What we need to do is get organized and start putting forward viable solutions. This all starts locally. We should be active in running our towns and our states. Without that grassroots base, we can't do much of anything at the national level. The Left organize. We don't. We need to learn to canvas neighborhoods, talk about real solutions, fundraise, etc. We're not going to save our republic by replacing it with a dictator and slaughtering all the \"enemies.\" Where's our healthcare plan? Where's our infrastructure modernization plan? Where's our agriculture plan to make sure we're feeding our population and keeping prices down? etc, etc. The Leftists have plans for all of that. They're terrible plans, but they have a vision to work towards whereas we don't. permalink award report block reply Tophat9000 3 points 7 days ago Personally I'm getting the gut feeling the Democrats by the shot their wad This was their best shot permalink award report block reply lionwind 3 points 7 days ago The NY thing should scare you, it is more proof that demographics is destiny. And the demographics are changing permalink award report block reply ridge3z 3 points 7 days ago Actual MAGA isn't feeling demoralized nor black pilled. Myself, I even voted on online polls that Spanberger and Mamdani would win. But there are a lot of dishonest \"hello fellow MAGA\" actors out there trying to push narratives. Many of which who are progressives coping through such dishonesty because they still know they have lost despite the \"wins\". Even Mark Levin and Dana Loesch (the original anti-MAGA) are doing that again just like they did in 2015, early 2016. But with them.. they are neocons. permalink award report block reply IncredibleMrE1 3 points 7 days ago These pansies pissing themselves are annoying. permalink award report block reply donkeyKang 2 points 7 days ago Was the result unexpected? It wasn't to me. Minneapolis didn't elect a Somali pirate, even though they got the same turd they already had. (I'm in MN, but not MPLS), and all of our school levy increases failed spectacularly. The NYC race was closer than anyone is admitting because of the split ticket. Yea, it's not good for NYC, but as soon as the Free $hit Army realizes they aren't getting any ammunition, things will turn. permalink award report block reply seeling0 4 points 7 days ago Here in TX, we just passed a bucketload of constitutional amendments that take an axe to the death tax, cashless bail, illegals voting, etc.. Commies in Dallas, Houston, and Austin are vowing to leave for NYC because TX is clearly \"fascist\". permalink parent award report block reply seangalt 1 points 7 days ago Same.  i haven't heard about the school levies all failing.  You mean all over the state?  That would be good news considering how evil the establishment is here. permalink parent award report block reply ja391045 2 points 7 days ago Both the commies and MAGA only turn out when Trump is on the ballot.  Only problem is, in the twisted mind of the commies, Trump is on every ballot, in every race, all the time. When Trump is actually on the ballot, MAGA crushes it. This election revealed  two specific problems: 1.)  The majority of unmarried white women aged 18-39 need deprogramming.  They are full on cultists. I'm not sure if the current crop of AWFLs can ever be swayed.  Wokeism is their religion now.  Maybe GOP can target messaging at younger women so the next generation isn't so one-sided. 2.)  We Republicans need to increase the reliability of the Trump coalition before the midterms.   I think that can only be done by having candjdates that MAGA cares about, plus adopting a more \"vote red no matter who\" attitude.     A lot of people might have a problem with that.   Those people are idiots.   If we don't do that, we lose, plain and simple. permalink award report block reply PatrioticVideo 2 points 7 days ago Only dumb people allow fake news that kind of power over their beliefs. permalink award report block reply shadypollster 2 points 7 days ago Love it! permalink award report block reply CrankyCrab 2 points 7 days ago Exactly! And fuck off to the jack ass(es) down voting those who see through this fake news bullshit. permalink award report block reply IAmNotAnAutist 2 points 7 days ago Yeah all our ex-Bernie Bro homos are such pussies.  Wow, NYC voted for the Democrat!  It's all over!!!! permalink award report block reply FL4ida-Man 2 points 7 days ago Finally.  Someone else who understands.  MAGA was never going to win in NY and NJ. permalink award report block reply bluntedaffect 1 points 6 days ago Seriously. Was everyone hoping that the 50-year career democrat took his turn? Because that was the other possibility. permalink award report block reply Roguepepe 1 points 6 days ago I see it the exact opposite. MAGA entered their house (NJ, VA, and NY) and made them flinch. Anyone who is surprised Dem areas voted Dem is an idiot. permalink award report block reply realsolidsnakeoil 1 points 7 days ago I've literally never given a fuck about Bitcoin. It'll always be worthless in crunch time, which is when you'd actually need it. New York has always been dumb and gay. Same with Jersey but they also can't drive for shit. SSDD. permalink award report block reply keeman 1 points 7 days ago I am happy with the NYC election.  Now the world can see what you get when you vote for a upper class twit woke commie.  Will be a nice object lesson for everyone else.  Cuomo would have been far worse.  The slow predictable road to authoritarian communism.  Frog boiled slowly.  Mamdani will boil quickly and frog will notice. permalink award report block reply CPT88 1 points 6 days ago The biggest psyop here is the uncle thread trying to make out there are no good women and to give up. That's not true. There good women if you make yourself to be a good man. Don't fall for the modern trap of focusing on easy lifestyle joys. Having a family is the most wholesome purposeful thing you can do, but you need to literally man up and work your ass off to be the best you and a good provider. permalink award report block reply nomoreprinkles 1 points 6 days ago By lying about the economy and focusing on retarded world affairs, Trump is nosediving his credibility. permalink award report block reply YodaBannon 1 points 7 days ago lol permalink award report block reply RusherOfDin 1 points 7 days ago I've been holding on to my Bitcoin since 2017. 10% don't mean shit to me. permalink award report block reply South_Florida_Guy 1 points 7 days ago Been saying exactly this all day long permalink award report block reply Trunks 1 points 7 days ago GA and VA too. permalink award report block reply PhantomShield72 1 points 6 days ago Imagine shitting your pants over a leftist retard winning in a leftist retard controlled area that has seen inbound mass migration of illegals combined with outbound mass migration of conservatives... permalink award report block reply 5DchessWatch 1 points 6 days ago bitcoin dropped 10%  (LOL)   so true! news headline \"Bitcoin crashed to 100k today\"   (GFY) permalink award report block reply MajJamesMcFarlane 1 points 7 days ago All the deluded ones on here wouldn't be so angry at doomers if we weren't always right permalink award report block reply sun_wolf 3 points 7 days ago The doomers told us only DeSantis could win in 2024 because he didn’t have “baggage”. The doomers told us 2016 was lost too because of the Access Hollywood tape and Trump just needed to step down and let Pence run so “at least maybe we still hold a couple seats in the House”. Doomers told us Trump made an “unforced error” when he trounced Biden in that debate, and now all was lost because they were going to swap him out for Kamala, who he couldn’t beat. Remember that one? The doomers were SO pissed that Trump trounced Biden in that debate. It sent them into total despair. BEFORE that debate they were dooming in the OTHER direction though. They said Trump never should have agreed to debate Biden on CNN because they were going to make cuts in the live feed to make Trump look bad and Trump was “such an idiot” for walking into an obvious trap, that only the doomers could see. Remember WW3 in Iran a few months ago? According to doomers, America already had “boots on the ground” and Trump was “Bush 2.0”. That’s all been memory-holed and the doomers just kept doomin’ on. permalink parent award report block reply seangalt 1 points 7 days ago Doomers = Always Wrong.  Doomers prove that it's possible to be Always Wrong while attempting to appear always right. permalink parent award report block reply VanDeKoik -6 points 7 days ago And those are the same sissies that then post like they are bad ass tough dudes when they talk shit about jews and minorities. permalink award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply KungPaoMcChicken 1 points 7 days ago Comment removed by community filter. permalink award report block reply GreenLeader1 1 points 7 days ago Comment removed upon the user being banned. permalink award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nCyber1776 121 points 7 days ago Being blackpilled is gay, but its important to realize that we fucked up with these elections and need to prepare for the midterms permalink award report block reply Minn2000 80 points 7 days ago This is the 100% correct and healthy view on the situation. permalink parent award report block reply UCantStumpTheTrump 28 points 7 days ago Just be aware the site is flooded with shills trying to “fracture the base,” complaining that Trump is doing this or that wrong, or he hasn’t delivered on X or Y promise. Ridicule and shame them whenever you see them post permalink parent award report block reply Harsh_Truth2 10 points 7 days ago Intelligence is NOT ridiculing people who refuse to blindly follow along. A cult mentality that refuses to question anything, or hold anyone accountable is no different than the other side. Sorry, but Trump is doing a million things to put the fire out in the back uard while the porch burns. permalink parent award report block reply TillaMAGA 12 points 7 days ago Subtle. – I'm guessing that \"Harsh_Truth1\" was already taken. permalink parent award report block reply UCantStumpTheTrump 9 points 7 days ago Ridicule works. People who are only here to complain and bitch are not adding to the discourse and deserve to be driven off the site permalink parent award report block reply ridge3z 2 points 7 days ago So you'd rather not challenge those actually trying to diminish MAGA? There are a lot of people here who listen to the nonsense of Mark Levin, Dana Loesch, et al and believe their nonsense. permalink parent award report block reply view 10 more comments... BBvarn 1 points 6 days ago News flash, all of you young communists can go get free shit plus free bus rides in NYC.  Quit bitching on this site about what your parents didn't provide for you. permalink parent award report block reply Pnw4gotpwd 1 points 7 days ago 100% the Dems must pay and economic misery many Americans now suffer from needs to be fixed. College grads need jobs. American workers need job mobility. Groceries, electricity, housing, insurance and gas prices need to come down. As does the crime rate. And we must take credit for that and make the Dems eat it. We must prosecute the corrupt Dems who spies on us, tormented is, and used the corrupt wheels of the government machine to try to crush us.  Trump needs to play up what he was accomplished via kash Patel, tom homan, Linda McMahon, mete hegseth, et al. Also, Trump needs to not do shit like tear down the East wing and deny he's doing it. Instead be 100% forthright about doing it, and then do it. Trumps messaging has been far from perfect, and some of it has come off like when jd vance called grace chong a \"mouth breathing idiot\". Grace chong is loyal, dedicated, intelligent, and has done a lot for america and for Trump. Plus she's hot... Vance could and should have made his point without insulting her. And trump has suffered some similar failures. permalink parent award report block reply NomadicKrow2 1 points 6 days ago Also, if you buy crypto, consider bitcoin dropping 10% as a limited time discount. permalink parent award report block reply pollsarefake 21 points 7 days ago We didn’t fuck up The elections were rigged just like 2020 They were STOLEN using MASSIVE DUMPS and FRAUD inside the CORRUPT MACHINES permalink parent award report block reply philasoma 17 points 7 days ago Dems are building a coalition of immigrants/minorities and white women and that will actually put them over the top w/o massive cheating. Trump's inroads with latinos and young voters won him the election. I totally agree we need voter ID, no mail-in ballots, and citizen-only voting, but the dems have an angle to win their coalition even a fair election if we are being realistic. permalink parent award report block reply InfinitesimalOrange 1 points 6 days ago \"Without cheating\" Yeah if we consider Importing millions of illegal immigrants to vote. to not be cheating. Fair my fucking ass, they spent 50 years literally illegally changing the demographics of the country to coalesce their power. A fucking fair election, shut the fuck up, I don't think one of those has ever happened. permalink parent award report block reply johnqpublic864 12 points 7 days ago Regardless of how, seats were lost. Your typical Joe Football MAGA lites won't get off their asses and vote in local elections, mid-terms, etc. We're also horrible at getting messaging out on all these smaller elections. Scott Presler and a few posts on here aren't nearly enough against the libtard machine. The GOP machine is ass. permalink parent award report block reply pollsarefake -1 points 7 days ago They weren’t “lost” you doomer faggot They were STOLEN permalink parent award report block reply johnqpublic864 2 points 6 days ago You lack personal accountability. Remember \"Too Big to Rig?\" Of course you don't. Did you even vote in your local elections? Take anyone outside of your household with you? Ballot harvest? Did you door knock? Register any voters? Host or go to any meetings? I'm betting the answer to most/all of those questions is \"no.\" Outside of voting, I didn't do anything, either. Instead of offering excuses and blame, which aren't productive, we should ask \"What can I do between now and mid-terms to help?\" Calling people doomer faggot on Patriots ain't it. permalink parent award report block reply view 2 more comments... PitfallHarry 9 points 7 days ago Citarelli is a cuck faggot for conceding. permalink parent award report block reply Harvestsmiles 5 points 7 days ago You'd think someone would change some election laws to prevent that kind of thing by now. But, they f'ked that up... permalink parent award report block reply Krat 3 points 7 days ago They dont want itnchanged, they want ypu gone and replaced too permalink parent award report block reply Throwawayjan6 5 points 7 days ago Reeeeeeeeeeeegged. Dude, the expected winners won. Shitty candidates and long shots don’t make for rigged elections. permalink parent award report block reply load 9 more comments... Skogin 9 points 7 days ago I fucked up nothing. permalink parent award report block reply starjello 11 points 7 days ago Neither did I. I voted correctly, but I also know we will not vote our way out of this. I also do not drink the kool-aid served here by many. permalink parent award report block reply PensivePatriot 6 points 7 days ago I’d like to offer the white pill and say that this was the most reactionary election ever, on the democrats behalf. I bet they can’t muster the same strength next year. permalink parent award report block reply PitfallHarry 3 points 7 days ago Now that Trump has prices down we’ll sweep the midterms. It won’t even be close. These were all blue states anyway. permalink parent award report block reply Harsh_Truth2 -6 points 7 days ago Are the low prices in the forum with us? Oooooo eggs went down...that was a supply and demand issue, not an exectutive branch issue. Groceries still sky high. Housing still a crisis. Cars still over priced. Gas has stayed level/ticked up not dropped. Please explain what propaganda you're reading to think prices dropped!? permalink parent award report block reply PitfallHarry 4 points 7 days ago Trump told the American people that prices are down. Unless you’re telling me he lied to us all and is gaslighting the American people then President Trump’s words are the only propaganda that’s needed. permalink parent award report block reply load 10 more comments...\nMinn2000 80 points 7 days ago This is the 100% correct and healthy view on the situation. permalink parent award report block reply UCantStumpTheTrump 28 points 7 days ago Just be aware the site is flooded with shills trying to “fracture the base,” complaining that Trump is doing this or that wrong, or he hasn’t delivered on X or Y promise. Ridicule and shame them whenever you see them post permalink parent award report block reply Harsh_Truth2 10 points 7 days ago Intelligence is NOT ridiculing people who refuse to blindly follow along. A cult mentality that refuses to question anything, or hold anyone accountable is no different than the other side. Sorry, but Trump is doing a million things to put the fire out in the back uard while the porch burns. permalink parent award report block reply TillaMAGA 12 points 7 days ago Subtle. – I'm guessing that \"Harsh_Truth1\" was already taken. permalink parent award report block reply UCantStumpTheTrump 9 points 7 days ago Ridicule works. People who are only here to complain and bitch are not adding to the discourse and deserve to be driven off the site permalink parent award report block reply ridge3z 2 points 7 days ago So you'd rather not challenge those actually trying to diminish MAGA? There are a lot of people here who listen to the nonsense of Mark Levin, Dana Loesch, et al and believe their nonsense. permalink parent award report block reply view 10 more comments... BBvarn 1 points 6 days ago News flash, all of you young communists can go get free shit plus free bus rides in NYC.  Quit bitching on this site about what your parents didn't provide for you. permalink parent award report block reply Pnw4gotpwd 1 points 7 days ago 100% the Dems must pay and economic misery many Americans now suffer from needs to be fixed. College grads need jobs. American workers need job mobility. Groceries, electricity, housing, insurance and gas prices need to come down. As does the crime rate. And we must take credit for that and make the Dems eat it. We must prosecute the corrupt Dems who spies on us, tormented is, and used the corrupt wheels of the government machine to try to crush us.  Trump needs to play up what he was accomplished via kash Patel, tom homan, Linda McMahon, mete hegseth, et al. Also, Trump needs to not do shit like tear down the East wing and deny he's doing it. Instead be 100% forthright about doing it, and then do it. Trumps messaging has been far from perfect, and some of it has come off like when jd vance called grace chong a \"mouth breathing idiot\". Grace chong is loyal, dedicated, intelligent, and has done a lot for america and for Trump. Plus she's hot... Vance could and should have made his point without insulting her. And trump has suffered some similar failures. permalink parent award report block reply NomadicKrow2 1 points 6 days ago Also, if you buy crypto, consider bitcoin dropping 10% as a limited time discount. permalink parent award report block reply\nUCantStumpTheTrump 28 points 7 days ago Just be aware the site is flooded with shills trying to “fracture the base,” complaining that Trump is doing this or that wrong, or he hasn’t delivered on X or Y promise. Ridicule and shame them whenever you see them post permalink parent award report block reply Harsh_Truth2 10 points 7 days ago Intelligence is NOT ridiculing people who refuse to blindly follow along. A cult mentality that refuses to question anything, or hold anyone accountable is no different than the other side. Sorry, but Trump is doing a million things to put the fire out in the back uard while the porch burns. permalink parent award report block reply TillaMAGA 12 points 7 days ago Subtle. – I'm guessing that \"Harsh_Truth1\" was already taken. permalink parent award report block reply UCantStumpTheTrump 9 points 7 days ago Ridicule works. People who are only here to complain and bitch are not adding to the discourse and deserve to be driven off the site permalink parent award report block reply ridge3z 2 points 7 days ago So you'd rather not challenge those actually trying to diminish MAGA? There are a lot of people here who listen to the nonsense of Mark Levin, Dana Loesch, et al and believe their nonsense. permalink parent award report block reply view 10 more comments... BBvarn 1 points 6 days ago News flash, all of you young communists can go get free shit plus free bus rides in NYC.  Quit bitching on this site about what your parents didn't provide for you. permalink parent award report block reply\nHarsh_Truth2 10 points 7 days ago Intelligence is NOT ridiculing people who refuse to blindly follow along. A cult mentality that refuses to question anything, or hold anyone accountable is no different than the other side. Sorry, but Trump is doing a million things to put the fire out in the back uard while the porch burns. permalink parent award report block reply TillaMAGA 12 points 7 days ago Subtle. – I'm guessing that \"Harsh_Truth1\" was already taken. permalink parent award report block reply UCantStumpTheTrump 9 points 7 days ago Ridicule works. People who are only here to complain and bitch are not adding to the discourse and deserve to be driven off the site permalink parent award report block reply ridge3z 2 points 7 days ago So you'd rather not challenge those actually trying to diminish MAGA? There are a lot of people here who listen to the nonsense of Mark Levin, Dana Loesch, et al and believe their nonsense. permalink parent award report block reply view 10 more comments... BBvarn 1 points 6 days ago News flash, all of you young communists can go get free shit plus free bus rides in NYC.  Quit bitching on this site about what your parents didn't provide for you. permalink parent award report block reply\nTillaMAGA 12 points 7 days ago Subtle. – I'm guessing that \"Harsh_Truth1\" was already taken. permalink parent award report block reply\nUCantStumpTheTrump 9 points 7 days ago Ridicule works. People who are only here to complain and bitch are not adding to the discourse and deserve to be driven off the site permalink parent award report block reply\nridge3z 2 points 7 days ago So you'd rather not challenge those actually trying to diminish MAGA? There are a lot of people here who listen to the nonsense of Mark Levin, Dana Loesch, et al and believe their nonsense. permalink parent award report block reply view 10 more comments...\nBBvarn 1 points 6 days ago News flash, all of you young communists can go get free shit plus free bus rides in NYC.  Quit bitching on this site about what your parents didn't provide for you. permalink parent award report block reply\nPnw4gotpwd 1 points 7 days ago 100% the Dems must pay and economic misery many Americans now suffer from needs to be fixed. College grads need jobs. American workers need job mobility. Groceries, electricity, housing, insurance and gas prices need to come down. As does the crime rate. And we must take credit for that and make the Dems eat it. We must prosecute the corrupt Dems who spies on us, tormented is, and used the corrupt wheels of the government machine to try to crush us.  Trump needs to play up what he was accomplished via kash Patel, tom homan, Linda McMahon, mete hegseth, et al. Also, Trump needs to not do shit like tear down the East wing and deny he's doing it. Instead be 100% forthright about doing it, and then do it. Trumps messaging has been far from perfect, and some of it has come off like when jd vance called grace chong a \"mouth breathing idiot\". Grace chong is loyal, dedicated, intelligent, and has done a lot for america and for Trump. Plus she's hot... Vance could and should have made his point without insulting her. And trump has suffered some similar failures. permalink parent award report block reply\nNomadicKrow2 1 points 6 days ago Also, if you buy crypto, consider bitcoin dropping 10% as a limited time discount. permalink parent award report block reply\npollsarefake 21 points 7 days ago We didn’t fuck up The elections were rigged just like 2020 They were STOLEN using MASSIVE DUMPS and FRAUD inside the CORRUPT MACHINES permalink parent award report block reply philasoma 17 points 7 days ago Dems are building a coalition of immigrants/minorities and white women and that will actually put them over the top w/o massive cheating. Trump's inroads with latinos and young voters won him the election. I totally agree we need voter ID, no mail-in ballots, and citizen-only voting, but the dems have an angle to win their coalition even a fair election if we are being realistic. permalink parent award report block reply InfinitesimalOrange 1 points 6 days ago \"Without cheating\" Yeah if we consider Importing millions of illegal immigrants to vote. to not be cheating. Fair my fucking ass, they spent 50 years literally illegally changing the demographics of the country to coalesce their power. A fucking fair election, shut the fuck up, I don't think one of those has ever happened. permalink parent award report block reply johnqpublic864 12 points 7 days ago Regardless of how, seats were lost. Your typical Joe Football MAGA lites won't get off their asses and vote in local elections, mid-terms, etc. We're also horrible at getting messaging out on all these smaller elections. Scott Presler and a few posts on here aren't nearly enough against the libtard machine. The GOP machine is ass. permalink parent award report block reply pollsarefake -1 points 7 days ago They weren’t “lost” you doomer faggot They were STOLEN permalink parent award report block reply johnqpublic864 2 points 6 days ago You lack personal accountability. Remember \"Too Big to Rig?\" Of course you don't. Did you even vote in your local elections? Take anyone outside of your household with you? Ballot harvest? Did you door knock? Register any voters? Host or go to any meetings? I'm betting the answer to most/all of those questions is \"no.\" Outside of voting, I didn't do anything, either. Instead of offering excuses and blame, which aren't productive, we should ask \"What can I do between now and mid-terms to help?\" Calling people doomer faggot on Patriots ain't it. permalink parent award report block reply view 2 more comments... PitfallHarry 9 points 7 days ago Citarelli is a cuck faggot for conceding. permalink parent award report block reply Harvestsmiles 5 points 7 days ago You'd think someone would change some election laws to prevent that kind of thing by now. But, they f'ked that up... permalink parent award report block reply Krat 3 points 7 days ago They dont want itnchanged, they want ypu gone and replaced too permalink parent award report block reply Throwawayjan6 5 points 7 days ago Reeeeeeeeeeeegged. Dude, the expected winners won. Shitty candidates and long shots don’t make for rigged elections. permalink parent award report block reply load 9 more comments...\nphilasoma 17 points 7 days ago Dems are building a coalition of immigrants/minorities and white women and that will actually put them over the top w/o massive cheating. Trump's inroads with latinos and young voters won him the election. I totally agree we need voter ID, no mail-in ballots, and citizen-only voting, but the dems have an angle to win their coalition even a fair election if we are being realistic. permalink parent award report block reply InfinitesimalOrange 1 points 6 days ago \"Without cheating\" Yeah if we consider Importing millions of illegal immigrants to vote. to not be cheating. Fair my fucking ass, they spent 50 years literally illegally changing the demographics of the country to coalesce their power. A fucking fair election, shut the fuck up, I don't think one of those has ever happened. permalink parent award report block reply\nInfinitesimalOrange 1 points 6 days ago \"Without cheating\" Yeah if we consider Importing millions of illegal immigrants to vote. to not be cheating. Fair my fucking ass, they spent 50 years literally illegally changing the demographics of the country to coalesce their power. A fucking fair election, shut the fuck up, I don't think one of those has ever happened. permalink parent award report block reply\njohnqpublic864 12 points 7 days ago Regardless of how, seats were lost. Your typical Joe Football MAGA lites won't get off their asses and vote in local elections, mid-terms, etc. We're also horrible at getting messaging out on all these smaller elections. Scott Presler and a few posts on here aren't nearly enough against the libtard machine. The GOP machine is ass. permalink parent award report block reply pollsarefake -1 points 7 days ago They weren’t “lost” you doomer faggot They were STOLEN permalink parent award report block reply johnqpublic864 2 points 6 days ago You lack personal accountability. Remember \"Too Big to Rig?\" Of course you don't. Did you even vote in your local elections? Take anyone outside of your household with you? Ballot harvest? Did you door knock? Register any voters? Host or go to any meetings? I'm betting the answer to most/all of those questions is \"no.\" Outside of voting, I didn't do anything, either. Instead of offering excuses and blame, which aren't productive, we should ask \"What can I do between now and mid-terms to help?\" Calling people doomer faggot on Patriots ain't it. permalink parent award report block reply view 2 more comments...\npollsarefake -1 points 7 days ago They weren’t “lost” you doomer faggot They were STOLEN permalink parent award report block reply johnqpublic864 2 points 6 days ago You lack personal accountability. Remember \"Too Big to Rig?\" Of course you don't. Did you even vote in your local elections? Take anyone outside of your household with you? Ballot harvest? Did you door knock? Register any voters? Host or go to any meetings? I'm betting the answer to most/all of those questions is \"no.\" Outside of voting, I didn't do anything, either. Instead of offering excuses and blame, which aren't productive, we should ask \"What can I do between now and mid-terms to help?\" Calling people doomer faggot on Patriots ain't it. permalink parent award report block reply view 2 more comments...\njohnqpublic864 2 points 6 days ago You lack personal accountability. Remember \"Too Big to Rig?\" Of course you don't. Did you even vote in your local elections? Take anyone outside of your household with you? Ballot harvest? Did you door knock? Register any voters? Host or go to any meetings? I'm betting the answer to most/all of those questions is \"no.\" Outside of voting, I didn't do anything, either. Instead of offering excuses and blame, which aren't productive, we should ask \"What can I do between now and mid-terms to help?\" Calling people doomer faggot on Patriots ain't it. permalink parent award report block reply view 2 more comments...\nPitfallHarry 9 points 7 days ago Citarelli is a cuck faggot for conceding. permalink parent award report block reply\nHarvestsmiles 5 points 7 days ago You'd think someone would change some election laws to prevent that kind of thing by now. But, they f'ked that up... permalink parent award report block reply Krat 3 points 7 days ago They dont want itnchanged, they want ypu gone and replaced too permalink parent award report block reply\nKrat 3 points 7 days ago They dont want itnchanged, they want ypu gone and replaced too permalink parent award report block reply\nThrowawayjan6 5 points 7 days ago Reeeeeeeeeeeegged. Dude, the expected winners won. Shitty candidates and long shots don’t make for rigged elections. permalink parent award report block reply\nSkogin 9 points 7 days ago I fucked up nothing. permalink parent award report block reply starjello 11 points 7 days ago Neither did I. I voted correctly, but I also know we will not vote our way out of this. I also do not drink the kool-aid served here by many. permalink parent award report block reply\nstarjello 11 points 7 days ago Neither did I. I voted correctly, but I also know we will not vote our way out of this. I also do not drink the kool-aid served here by many. permalink parent award report block reply\nPensivePatriot 6 points 7 days ago I’d like to offer the white pill and say that this was the most reactionary election ever, on the democrats behalf. I bet they can’t muster the same strength next year. permalink parent award report block reply\nPitfallHarry 3 points 7 days ago Now that Trump has prices down we’ll sweep the midterms. It won’t even be close. These were all blue states anyway. permalink parent award report block reply Harsh_Truth2 -6 points 7 days ago Are the low prices in the forum with us? Oooooo eggs went down...that was a supply and demand issue, not an exectutive branch issue. Groceries still sky high. Housing still a crisis. Cars still over priced. Gas has stayed level/ticked up not dropped. Please explain what propaganda you're reading to think prices dropped!? permalink parent award report block reply PitfallHarry 4 points 7 days ago Trump told the American people that prices are down. Unless you’re telling me he lied to us all and is gaslighting the American people then President Trump’s words are the only propaganda that’s needed. permalink parent award report block reply\nHarsh_Truth2 -6 points 7 days ago Are the low prices in the forum with us? Oooooo eggs went down...that was a supply and demand issue, not an exectutive branch issue. Groceries still sky high. Housing still a crisis. Cars still over priced. Gas has stayed level/ticked up not dropped. Please explain what propaganda you're reading to think prices dropped!? permalink parent award report block reply PitfallHarry 4 points 7 days ago Trump told the American people that prices are down. Unless you’re telling me he lied to us all and is gaslighting the American people then President Trump’s words are the only propaganda that’s needed. permalink parent award report block reply\nPitfallHarry 4 points 7 days ago Trump told the American people that prices are down. Unless you’re telling me he lied to us all and is gaslighting the American people then President Trump’s words are the only propaganda that’s needed. permalink parent award report block reply\nWar_Hamster 62 points 7 days ago This meme needs to include how MAGA is being attacked from “within”. The whole  “woke right” thing is a neocon attack on the MAGA movement. permalink award report block reply ParadigmShift2070 16 points 7 days ago Call them what they are, Judeo-cons permalink parent award report block reply Iforgot2 -8 points 7 days ago Woke right is people like twinkie and his gay followers like you. permalink parent award report block reply IncredibleMrE1 8 points 7 days ago Neocons are neo-Trotskyists. permalink parent award report block reply Gletkin 1 points 7 days ago Historically accurate. permalink parent award report block reply DeportThemAllForever 0 points 6 days ago They learned to copy the meme war permalink parent award report block reply\nParadigmShift2070 16 points 7 days ago Call them what they are, Judeo-cons permalink parent award report block reply Iforgot2 -8 points 7 days ago Woke right is people like twinkie and his gay followers like you. permalink parent award report block reply\nIforgot2 -8 points 7 days ago Woke right is people like twinkie and his gay followers like you. permalink parent award report block reply\nIncredibleMrE1 8 points 7 days ago Neocons are neo-Trotskyists. permalink parent award report block reply Gletkin 1 points 7 days ago Historically accurate. permalink parent award report block reply\nGletkin 1 points 7 days ago Historically accurate. permalink parent award report block reply\nDeportThemAllForever 0 points 6 days ago They learned to copy the meme war permalink parent award report block reply\nDelendaEstMarxismo 34 points 7 days ago These are all leftist strongholds. Let's not exaggerate the significance of Democrats winning. permalink award report block reply Gletkin 4 points 7 days ago True. I don’t think these were MAGA fuckups, just libtards libbing out in places where they’re dominant. permalink parent award report block reply TooHotToFrost 1 points 6 days ago They got the right whining that Cuomo didn’t win the election. Lol. Psyop successful. permalink parent award report block reply\nGletkin 4 points 7 days ago True. I don’t think these were MAGA fuckups, just libtards libbing out in places where they’re dominant. permalink parent award report block reply\nTooHotToFrost 1 points 6 days ago They got the right whining that Cuomo didn’t win the election. Lol. Psyop successful. permalink parent award report block reply\nPrandogolio 26 points 7 days ago New York City did not vote Democrat.  They voted Muslim Communist. permalink award report block reply Lelleck 17 points 7 days ago They voted the 2025 version of Democrat. permalink parent award report block reply Gletkin 6 points 7 days ago They voted managed decline of America into apocalyptic faggotry. permalink parent award report block reply Lelleck 3 points 7 days ago Is it not working out perfectly fine in London? permalink parent award report block reply Harvestsmiles 9 points 7 days ago Meaning the election was just for show permalink parent award report block reply anotherthing 2 points 6 days ago The Muslim Communist only beat the grandma mass murderer by 9 points. permalink parent award report block reply\nLelleck 17 points 7 days ago They voted the 2025 version of Democrat. permalink parent award report block reply Gletkin 6 points 7 days ago They voted managed decline of America into apocalyptic faggotry. permalink parent award report block reply Lelleck 3 points 7 days ago Is it not working out perfectly fine in London? permalink parent award report block reply\nGletkin 6 points 7 days ago They voted managed decline of America into apocalyptic faggotry. permalink parent award report block reply Lelleck 3 points 7 days ago Is it not working out perfectly fine in London? permalink parent award report block reply\nLelleck 3 points 7 days ago Is it not working out perfectly fine in London? permalink parent award report block reply\nHarvestsmiles 9 points 7 days ago Meaning the election was just for show permalink parent award report block reply\nanotherthing 2 points 6 days ago The Muslim Communist only beat the grandma mass murderer by 9 points. permalink parent award report block reply\nlifeisahologram 23 points 7 days ago Bitcoin dropping is exciting, it just means I get a discount. permalink award report block reply Hanging_Chad 6 points 7 days ago the sub-100k dip is over :/ permalink parent award report block reply lifeisahologram 6 points 7 days ago This is just the warm up before we go back to consistent 70k next year. Get ready to stack in 2026! permalink parent award report block reply Lelleck 4 points 7 days ago It would follow the usual 4 year cycle to be honest. Halving, 6-8 months later a peak, going down slowly, another somewhat peak, finding a new base. Getting excited for coming halving. Fear of missing out. Next halving… permalink parent award report block reply Hanging_Chad 1 points 7 days ago 🎢 permalink parent award report block reply\nHanging_Chad 6 points 7 days ago the sub-100k dip is over :/ permalink parent award report block reply lifeisahologram 6 points 7 days ago This is just the warm up before we go back to consistent 70k next year. Get ready to stack in 2026! permalink parent award report block reply Lelleck 4 points 7 days ago It would follow the usual 4 year cycle to be honest. Halving, 6-8 months later a peak, going down slowly, another somewhat peak, finding a new base. Getting excited for coming halving. Fear of missing out. Next halving… permalink parent award report block reply Hanging_Chad 1 points 7 days ago 🎢 permalink parent award report block reply\nlifeisahologram 6 points 7 days ago This is just the warm up before we go back to consistent 70k next year. Get ready to stack in 2026! permalink parent award report block reply Lelleck 4 points 7 days ago It would follow the usual 4 year cycle to be honest. Halving, 6-8 months later a peak, going down slowly, another somewhat peak, finding a new base. Getting excited for coming halving. Fear of missing out. Next halving… permalink parent award report block reply Hanging_Chad 1 points 7 days ago 🎢 permalink parent award report block reply\nLelleck 4 points 7 days ago It would follow the usual 4 year cycle to be honest. Halving, 6-8 months later a peak, going down slowly, another somewhat peak, finding a new base. Getting excited for coming halving. Fear of missing out. Next halving… permalink parent award report block reply Hanging_Chad 1 points 7 days ago 🎢 permalink parent award report block reply\nHanging_Chad 1 points 7 days ago 🎢 permalink parent award report block reply\nMiskyavine 21 points 7 days ago Virginia sucked though permalink award report block reply IncredibleMrE1 25 points 7 days ago I can't imagine why conservative voters didn't turn out for the anti-Trump black immigrant woman. Or why the government workers in NOVA turned out en masse for Jay \"I want to butcher children in front of their Republican parents\" Jones. permalink parent award report block reply swarleybing 9 points 7 days ago Yup it was similar to trying to get PA republicans excited about Turkish Muslim Dr Oz. (Ironically Fetterman turned into kind of a Dino) permalink parent award report block reply Gletkin 3 points 7 days ago He still votes D, just like Murkowski and Collins. permalink parent award report block reply vote_for_MAGA_2020 2 points 7 days ago I'm glad I'm not the only one who sees Earl Sears as the fraud that she is. permalink parent award report block reply Miskyavine 1 points 6 days ago Yea i dont know the fine details im in Illinois but yea GOP makes some stupid ass decisions permalink parent award report block reply KnoxHarrington 9 points 7 days ago Sears is a retard who ran a shit campaign.  Idk what powerful glue the VA GOP were sniffing when they decided she was our best. permalink parent award report block reply Prandogolio 10 points 7 days ago They were huffing \"let's prove we're not racist!” permalink parent award report block reply ragnarokrobo 2 points 6 days ago Always a winning strategy for boomercons. permalink parent award report block reply TheJakeFroggy 5 points 7 days ago I hardly understand Virginia. In 2021, Terry McAuliffe lost because he told parents that they shouldn't have any involvement in children's education. Then four years later, Jay Jones is revealed to have fantasized about killing someone's children, which is way more disgusting and psychotic than what McAuliffe said, and still somehow manages to win. Did Virginia society just go through rapid moral decay during the last four years? permalink parent award report block reply jcd_007 4 points 7 days ago Virginia has a ridiculous number of government employees, many of whom are currently out of work due to the shutdown. Is it a surprise they voted D? Virginia has also been increasingly overrun by immigrants. permalink parent award report block reply Braineack 0 points 7 days ago Yeah but think about all the good pho and Korean bbq you can eat, while constantly getting into fender benders permalink parent award report block reply\nIncredibleMrE1 25 points 7 days ago I can't imagine why conservative voters didn't turn out for the anti-Trump black immigrant woman. Or why the government workers in NOVA turned out en masse for Jay \"I want to butcher children in front of their Republican parents\" Jones. permalink parent award report block reply swarleybing 9 points 7 days ago Yup it was similar to trying to get PA republicans excited about Turkish Muslim Dr Oz. (Ironically Fetterman turned into kind of a Dino) permalink parent award report block reply Gletkin 3 points 7 days ago He still votes D, just like Murkowski and Collins. permalink parent award report block reply vote_for_MAGA_2020 2 points 7 days ago I'm glad I'm not the only one who sees Earl Sears as the fraud that she is. permalink parent award report block reply Miskyavine 1 points 6 days ago Yea i dont know the fine details im in Illinois but yea GOP makes some stupid ass decisions permalink parent award report block reply\nswarleybing 9 points 7 days ago Yup it was similar to trying to get PA republicans excited about Turkish Muslim Dr Oz. (Ironically Fetterman turned into kind of a Dino) permalink parent award report block reply Gletkin 3 points 7 days ago He still votes D, just like Murkowski and Collins. permalink parent award report block reply\nGletkin 3 points 7 days ago He still votes D, just like Murkowski and Collins. permalink parent award report block reply\nvote_for_MAGA_2020 2 points 7 days ago I'm glad I'm not the only one who sees Earl Sears as the fraud that she is. permalink parent award report block reply\nMiskyavine 1 points 6 days ago Yea i dont know the fine details im in Illinois but yea GOP makes some stupid ass decisions permalink parent award report block reply\nKnoxHarrington 9 points 7 days ago Sears is a retard who ran a shit campaign.  Idk what powerful glue the VA GOP were sniffing when they decided she was our best. permalink parent award report block reply Prandogolio 10 points 7 days ago They were huffing \"let's prove we're not racist!” permalink parent award report block reply ragnarokrobo 2 points 6 days ago Always a winning strategy for boomercons. permalink parent award report block reply\nPrandogolio 10 points 7 days ago They were huffing \"let's prove we're not racist!” permalink parent award report block reply ragnarokrobo 2 points 6 days ago Always a winning strategy for boomercons. permalink parent award report block reply\nragnarokrobo 2 points 6 days ago Always a winning strategy for boomercons. permalink parent award report block reply\nTheJakeFroggy 5 points 7 days ago I hardly understand Virginia. In 2021, Terry McAuliffe lost because he told parents that they shouldn't have any involvement in children's education. Then four years later, Jay Jones is revealed to have fantasized about killing someone's children, which is way more disgusting and psychotic than what McAuliffe said, and still somehow manages to win. Did Virginia society just go through rapid moral decay during the last four years? permalink parent award report block reply jcd_007 4 points 7 days ago Virginia has a ridiculous number of government employees, many of whom are currently out of work due to the shutdown. Is it a surprise they voted D? Virginia has also been increasingly overrun by immigrants. permalink parent award report block reply Braineack 0 points 7 days ago Yeah but think about all the good pho and Korean bbq you can eat, while constantly getting into fender benders permalink parent award report block reply\njcd_007 4 points 7 days ago Virginia has a ridiculous number of government employees, many of whom are currently out of work due to the shutdown. Is it a surprise they voted D? Virginia has also been increasingly overrun by immigrants. permalink parent award report block reply Braineack 0 points 7 days ago Yeah but think about all the good pho and Korean bbq you can eat, while constantly getting into fender benders permalink parent award report block reply\nBraineack 0 points 7 days ago Yeah but think about all the good pho and Korean bbq you can eat, while constantly getting into fender benders permalink parent award report block reply\nCovidrrhea 16 points 7 days ago You kiddin' me?  Only pussies doom about blue cities getting fucked.  I got popcorn for days, I'm going to watch New York sink into the ocean before California, and I ain't even mad. permalink award report block reply FatigueIsReal 6 points 7 days ago Bing bong. permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nFatigueIsReal 6 points 7 days ago Bing bong. permalink parent award report block reply\nNewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\n-f-b-i- 16 points 7 days ago Doom permalink award report block reply deleted 17 points 7 days ago Hanging_Chad 7 points 7 days ago ✊🏻 permalink parent award report block reply MajJamesMcFarlane 2 points 7 days ago Sadly, the solution is kinetic but we're still too soft to reach that point yet permalink parent award report block reply grandfather_nurgle OP 10 points 7 days ago 10 years into this thing and these faggots still piss themselves over every tendie spill permalink parent award report block reply FatigueIsReal 6 points 7 days ago Right there with you. It's tiring watching these retards try to talk everyone else into pissing themselves too so they feel less cowardly. permalink parent award report block reply HOSEQ 0 points 6 days ago I would ask just how STUPID you can be, but then you made this, and now I don't have to ask.... permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply seangalt 5 points 7 days ago ☝️☠️ MAGA 🤙 permalink parent award report block reply ItsFunToSay-M-A-G-A 4 points 7 days ago Live webcam view from inside NYC subway station: https://files.catbox.moe/vau50a.jpg permalink parent award report block reply Hanging_Chad 2 points 7 days ago ban OP and sticky it permalink parent award report block reply load 1 more comments...\ndeleted 17 points 7 days ago Hanging_Chad 7 points 7 days ago ✊🏻 permalink parent award report block reply MajJamesMcFarlane 2 points 7 days ago Sadly, the solution is kinetic but we're still too soft to reach that point yet permalink parent award report block reply\nHanging_Chad 7 points 7 days ago ✊🏻 permalink parent award report block reply\nMajJamesMcFarlane 2 points 7 days ago Sadly, the solution is kinetic but we're still too soft to reach that point yet permalink parent award report block reply\ngrandfather_nurgle OP 10 points 7 days ago 10 years into this thing and these faggots still piss themselves over every tendie spill permalink parent award report block reply FatigueIsReal 6 points 7 days ago Right there with you. It's tiring watching these retards try to talk everyone else into pissing themselves too so they feel less cowardly. permalink parent award report block reply HOSEQ 0 points 6 days ago I would ask just how STUPID you can be, but then you made this, and now I don't have to ask.... permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nFatigueIsReal 6 points 7 days ago Right there with you. It's tiring watching these retards try to talk everyone else into pissing themselves too so they feel less cowardly. permalink parent award report block reply\nHOSEQ 0 points 6 days ago I would ask just how STUPID you can be, but then you made this, and now I don't have to ask.... permalink parent award report block reply\nNewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nseangalt 5 points 7 days ago ☝️☠️ MAGA 🤙 permalink parent award report block reply\nItsFunToSay-M-A-G-A 4 points 7 days ago Live webcam view from inside NYC subway station: https://files.catbox.moe/vau50a.jpg permalink parent award report block reply\nHanging_Chad 2 points 7 days ago ban OP and sticky it permalink parent award report block reply\nTrumpInAus 13 points 7 days ago I keep seeing leftists saying MAGA must be crying, like the far left states voting far left was unexpected permalink award report block reply\nLabTech 10 points 7 days ago I agree, my local elections made me fairly optimistic.  I come from a blue state, and my Mayor's one of the few Republican ones in that state, and she just won re-election over her Democrat rival, who she's beaten before. A lot of the more toxic council members were purged, and more conservative leaning ones got in... and in the grand scheme of things, local politicians matter far more than State or Federal ones, because they're in charge of the day to day affairs on the ground. permalink award report block reply\nVoldemarBGuerta 6 points 7 days ago Friend, this is the copium that we've been huffing for a decade... if things keep up - repubs are going to get stomped in the mid-terms, just like in 2018. We can't vote our way out of this. permalink award report block reply LORDFALCONE 4 points 7 days ago Should have been spending time fixing voting rather than deepthroating the Palantir cock permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nLORDFALCONE 4 points 7 days ago Should have been spending time fixing voting rather than deepthroating the Palantir cock permalink parent award report block reply\nNewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nAmerica_No_1 6 points 7 days ago Thank you, OP.  The Dems didnt win bullshit.  In fact id say this means less than thr 2024 statement.  Far left leaning blue cities remain blue.  Shocker. permalink award report block reply\nTOPDAWG23 5 points 7 days ago Wait Bitcoin drops like 10% every other day. permalink award report block reply\nM-m-m-my-corona 5 points 7 days ago Why vote Republican when republicans won't do anything but support Israel?  You fix that problem and the votes will pour in. permalink award report block reply LORDFALCONE 4 points 7 days ago This. The entire past year has been entirely Israel themed 24/7. 🤢 They even somehow tuned Charlie Kirks death into just praising Israel before the body was even cold. Smh permalink parent award report block reply\nLORDFALCONE 4 points 7 days ago This. The entire past year has been entirely Israel themed 24/7. 🤢 They even somehow tuned Charlie Kirks death into just praising Israel before the body was even cold. Smh permalink parent award report block reply\nXxxRDTPRNxxX 4 points 7 days ago We're not gonna win the coming civil war at the ballot box. I hope you all understand that. permalink award report block reply\nHunterBidensPC 4 points 7 days ago Nah they passed over the democrat and voted straight communist permalink award report block reply\nhenri_derelicte 4 points 7 days ago If the Dems cheat during the midterms, that’s when we cross the Rubicon. Under no circumstances are we giving up control of Congress to Chuck Schumer and Hakeem Jeffries. There will be blood in the streets before that happens. permalink award report block reply unotrumpcard 0 points 6 days ago So they got away with stealing a presidential election but if they cheat in the midterms that's when you are really going to do something? Stop, its pathetic, you will do nothing. permalink parent award report block reply\nunotrumpcard 0 points 6 days ago So they got away with stealing a presidential election but if they cheat in the midterms that's when you are really going to do something? Stop, its pathetic, you will do nothing. permalink parent award report block reply\nESAsher 4 points 7 days ago Carl Benjamin has a great take on New York, especially since basically the same thing happened to London. https://youtu.be/d3X_8KPOO0o?si=lQ698YK8NEBfqDBm https://youtu.be/sY5TecSArYI?si=uc1RgHxAkIT1tCpW permalink award report block reply\njcd_007 4 points 7 days ago BTC is way overdue for a massive crash. permalink award report block reply\n123breadman 4 points 7 days ago Thank fuk you noticed this. This is what I have been telling everyone I know. \"NYC is lost\" lol ok crackhead, when did we ever have NYC? permalink award report block reply\nMoose_Antlers 3 points 7 days ago I get the emotional reaction, but the response is wrong. What we need to do is get organized and start putting forward viable solutions. This all starts locally. We should be active in running our towns and our states. Without that grassroots base, we can't do much of anything at the national level. The Left organize. We don't. We need to learn to canvas neighborhoods, talk about real solutions, fundraise, etc. We're not going to save our republic by replacing it with a dictator and slaughtering all the \"enemies.\" Where's our healthcare plan? Where's our infrastructure modernization plan? Where's our agriculture plan to make sure we're feeding our population and keeping prices down? etc, etc. The Leftists have plans for all of that. They're terrible plans, but they have a vision to work towards whereas we don't. permalink award report block reply\nTophat9000 3 points 7 days ago Personally I'm getting the gut feeling the Democrats by the shot their wad This was their best shot permalink award report block reply\nlionwind 3 points 7 days ago The NY thing should scare you, it is more proof that demographics is destiny. And the demographics are changing permalink award report block reply\nridge3z 3 points 7 days ago Actual MAGA isn't feeling demoralized nor black pilled. Myself, I even voted on online polls that Spanberger and Mamdani would win. But there are a lot of dishonest \"hello fellow MAGA\" actors out there trying to push narratives. Many of which who are progressives coping through such dishonesty because they still know they have lost despite the \"wins\". Even Mark Levin and Dana Loesch (the original anti-MAGA) are doing that again just like they did in 2015, early 2016. But with them.. they are neocons. permalink award report block reply\nIncredibleMrE1 3 points 7 days ago These pansies pissing themselves are annoying. permalink award report block reply\ndonkeyKang 2 points 7 days ago Was the result unexpected? It wasn't to me. Minneapolis didn't elect a Somali pirate, even though they got the same turd they already had. (I'm in MN, but not MPLS), and all of our school levy increases failed spectacularly. The NYC race was closer than anyone is admitting because of the split ticket. Yea, it's not good for NYC, but as soon as the Free $hit Army realizes they aren't getting any ammunition, things will turn. permalink award report block reply seeling0 4 points 7 days ago Here in TX, we just passed a bucketload of constitutional amendments that take an axe to the death tax, cashless bail, illegals voting, etc.. Commies in Dallas, Houston, and Austin are vowing to leave for NYC because TX is clearly \"fascist\". permalink parent award report block reply seangalt 1 points 7 days ago Same.  i haven't heard about the school levies all failing.  You mean all over the state?  That would be good news considering how evil the establishment is here. permalink parent award report block reply\nseeling0 4 points 7 days ago Here in TX, we just passed a bucketload of constitutional amendments that take an axe to the death tax, cashless bail, illegals voting, etc.. Commies in Dallas, Houston, and Austin are vowing to leave for NYC because TX is clearly \"fascist\". permalink parent award report block reply\nseangalt 1 points 7 days ago Same.  i haven't heard about the school levies all failing.  You mean all over the state?  That would be good news considering how evil the establishment is here. permalink parent award report block reply\nja391045 2 points 7 days ago Both the commies and MAGA only turn out when Trump is on the ballot.  Only problem is, in the twisted mind of the commies, Trump is on every ballot, in every race, all the time. When Trump is actually on the ballot, MAGA crushes it. This election revealed  two specific problems: 1.)  The majority of unmarried white women aged 18-39 need deprogramming.  They are full on cultists. I'm not sure if the current crop of AWFLs can ever be swayed.  Wokeism is their religion now.  Maybe GOP can target messaging at younger women so the next generation isn't so one-sided. 2.)  We Republicans need to increase the reliability of the Trump coalition before the midterms.   I think that can only be done by having candjdates that MAGA cares about, plus adopting a more \"vote red no matter who\" attitude.     A lot of people might have a problem with that.   Those people are idiots.   If we don't do that, we lose, plain and simple. permalink award report block reply\nPatrioticVideo 2 points 7 days ago Only dumb people allow fake news that kind of power over their beliefs. permalink award report block reply\nshadypollster 2 points 7 days ago Love it! permalink award report block reply\nCrankyCrab 2 points 7 days ago Exactly! And fuck off to the jack ass(es) down voting those who see through this fake news bullshit. permalink award report block reply\nIAmNotAnAutist 2 points 7 days ago Yeah all our ex-Bernie Bro homos are such pussies.  Wow, NYC voted for the Democrat!  It's all over!!!! permalink award report block reply\nFL4ida-Man 2 points 7 days ago Finally.  Someone else who understands.  MAGA was never going to win in NY and NJ. permalink award report block reply\nbluntedaffect 1 points 6 days ago Seriously. Was everyone hoping that the 50-year career democrat took his turn? Because that was the other possibility. permalink award report block reply\nRoguepepe 1 points 6 days ago I see it the exact opposite. MAGA entered their house (NJ, VA, and NY) and made them flinch. Anyone who is surprised Dem areas voted Dem is an idiot. permalink award report block reply\nrealsolidsnakeoil 1 points 7 days ago I've literally never given a fuck about Bitcoin. It'll always be worthless in crunch time, which is when you'd actually need it. New York has always been dumb and gay. Same with Jersey but they also can't drive for shit. SSDD. permalink award report block reply\nkeeman 1 points 7 days ago I am happy with the NYC election.  Now the world can see what you get when you vote for a upper class twit woke commie.  Will be a nice object lesson for everyone else.  Cuomo would have been far worse.  The slow predictable road to authoritarian communism.  Frog boiled slowly.  Mamdani will boil quickly and frog will notice. permalink award report block reply\nCPT88 1 points 6 days ago The biggest psyop here is the uncle thread trying to make out there are no good women and to give up. That's not true. There good women if you make yourself to be a good man. Don't fall for the modern trap of focusing on easy lifestyle joys. Having a family is the most wholesome purposeful thing you can do, but you need to literally man up and work your ass off to be the best you and a good provider. permalink award report block reply\nnomoreprinkles 1 points 6 days ago By lying about the economy and focusing on retarded world affairs, Trump is nosediving his credibility. permalink award report block reply\nYodaBannon 1 points 7 days ago lol permalink award report block reply\nRusherOfDin 1 points 7 days ago I've been holding on to my Bitcoin since 2017. 10% don't mean shit to me. permalink award report block reply\nSouth_Florida_Guy 1 points 7 days ago Been saying exactly this all day long permalink award report block reply\nTrunks 1 points 7 days ago GA and VA too. permalink award report block reply\nPhantomShield72 1 points 6 days ago Imagine shitting your pants over a leftist retard winning in a leftist retard controlled area that has seen inbound mass migration of illegals combined with outbound mass migration of conservatives... permalink award report block reply\n5DchessWatch 1 points 6 days ago bitcoin dropped 10%  (LOL)   so true! news headline \"Bitcoin crashed to 100k today\"   (GFY) permalink award report block reply\nMajJamesMcFarlane 1 points 7 days ago All the deluded ones on here wouldn't be so angry at doomers if we weren't always right permalink award report block reply sun_wolf 3 points 7 days ago The doomers told us only DeSantis could win in 2024 because he didn’t have “baggage”. The doomers told us 2016 was lost too because of the Access Hollywood tape and Trump just needed to step down and let Pence run so “at least maybe we still hold a couple seats in the House”. Doomers told us Trump made an “unforced error” when he trounced Biden in that debate, and now all was lost because they were going to swap him out for Kamala, who he couldn’t beat. Remember that one? The doomers were SO pissed that Trump trounced Biden in that debate. It sent them into total despair. BEFORE that debate they were dooming in the OTHER direction though. They said Trump never should have agreed to debate Biden on CNN because they were going to make cuts in the live feed to make Trump look bad and Trump was “such an idiot” for walking into an obvious trap, that only the doomers could see. Remember WW3 in Iran a few months ago? According to doomers, America already had “boots on the ground” and Trump was “Bush 2.0”. That’s all been memory-holed and the doomers just kept doomin’ on. permalink parent award report block reply seangalt 1 points 7 days ago Doomers = Always Wrong.  Doomers prove that it's possible to be Always Wrong while attempting to appear always right. permalink parent award report block reply\nsun_wolf 3 points 7 days ago The doomers told us only DeSantis could win in 2024 because he didn’t have “baggage”. The doomers told us 2016 was lost too because of the Access Hollywood tape and Trump just needed to step down and let Pence run so “at least maybe we still hold a couple seats in the House”. Doomers told us Trump made an “unforced error” when he trounced Biden in that debate, and now all was lost because they were going to swap him out for Kamala, who he couldn’t beat. Remember that one? The doomers were SO pissed that Trump trounced Biden in that debate. It sent them into total despair. BEFORE that debate they were dooming in the OTHER direction though. They said Trump never should have agreed to debate Biden on CNN because they were going to make cuts in the live feed to make Trump look bad and Trump was “such an idiot” for walking into an obvious trap, that only the doomers could see. Remember WW3 in Iran a few months ago? According to doomers, America already had “boots on the ground” and Trump was “Bush 2.0”. That’s all been memory-holed and the doomers just kept doomin’ on. permalink parent award report block reply seangalt 1 points 7 days ago Doomers = Always Wrong.  Doomers prove that it's possible to be Always Wrong while attempting to appear always right. permalink parent award report block reply\nseangalt 1 points 7 days ago Doomers = Always Wrong.  Doomers prove that it's possible to be Always Wrong while attempting to appear always right. permalink parent award report block reply\nVanDeKoik -6 points 7 days ago And those are the same sissies that then post like they are bad ass tough dudes when they talk shit about jews and minorities. permalink award report block reply\nFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nKungPaoMcChicken 1 points 7 days ago Comment removed by community filter. permalink award report block reply\nGreenLeader1 1 points 7 days ago Comment removed upon the user being banned. permalink award report block reply\nFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T23:05:22.058338Z"
}