{
  "id": "1ARK5BHy9F",
  "url": "https://patriots.win/p/1ARK5BHy9F/bernie/c",
  "content": "797 Bernie posted 3 days ago by PiratePatriotParrot 46 comments award share report block Politi_Rican 🇵🇷 𝕏 🇺🇸 @TheRicanMemes • 3d 🪈 😭\n46 comments Sort by Top Top New Worst Old Save Ryunnsun 33 points 3 days ago Also Bernie - Please buy me another house. permalink award report block reply realPhantomFuck 15 points 3 days ago Bernie needs another lake house! Three homes aren’t enough for a guy who hasn’t been employed in the private sector since 1982 permalink parent award report block reply SuperUltraMegaMAGA1 7 points 3 days ago He’s made a lot of money from his books permalink parent award report block reply Washington_Redskins 6 points 3 days ago Including his most famous book \"It's free real estate\" permalink parent award report block reply 45fan 2 points 2 days ago Yeah, Soros loved them so much he bought a million copies. permalink parent award report block reply Zskills 4 points 3 days ago I support this. The more he's at his vacation homes, the less he's bloviating at a microphone. permalink parent award report block reply BlackPilledMAGA 4 points 3 days ago \"Let me give you every lame excuse as to why we shoukd keep carrying the corpse Obamacare on our backs instead of shedding that bloated big pharma money laundering machine and replacing it with something honest\" permalink parent award report block reply Rock9Head 6 points 3 days ago It is the “something honest” that scares me. They are incapable. permalink parent award report block reply julianReyes 3 points 3 days ago \"it was only a million\" permalink parent award report block reply taxesaretheft -12 points 3 days ago Bernie has a vacation cabin and people here act like he's part of the Trump/Elon level of billionaire permalink parent award report block reply YouHadMeAtGaming 7 points 3 days ago It’s because he kept screaming “no one should be a millionaire! Nobody needs all these things!” Then people loved him and donated money. He bought all the things he said no one needs, became a millionaire, then ran again saying the same thing but replacing millionaire with billionaire. No one is mad he has a mansion and a vacation house on a lake, or expensive cars, people are pointing out the hypocrisy that he bought those things using money from people who will never have those things, by lying to them about how people with those things are bad. permalink parent award report block reply anotherthing 2 points 2 days ago The fact he has all those thing and has never had a job in the private sector should explain why Bernie Bros are some of the most blind idiots there are. Vermont should be barred from Federal elections just for continually voting for a guy that's honeymoon destination was the Soviet Union during the Cold War. permalink parent award report block reply _Sully_ 1 points 3 days ago Nah the mistake they make is believing the left cares if you think they are hypocrites. They don’t. permalink parent award report block reply julianReyes -2 points 3 days ago Oh LOOK, yet more evidence PDW is just Retarddit in a Scooby Doo monster costume. permalink parent award report block reply BlackJack1776 19 points 3 days ago \"Let's be clear!\". -Any politician [Warning Alarm INTENSIFIES] permalink award report block reply Payasyougo 2 points 2 days ago Why isn't his wife in prison yet? permalink parent award report block reply WarCry 11 points 3 days ago I'll give him this, his grift has always been consistent, I mean total commiefag, but consistent nonetheless. permalink award report block reply MaxineWaters4Prez 8 points 3 days ago He's spent his entire productive adult life sucking the government that. Not only has he never held a real job in his whole life, he's never enacted a meaningful piece of legislation. permalink parent award report block reply LookFatty 4 points 3 days ago He was kicked out of his commune for being too lazy permalink parent award report block reply RStroud 3 points 3 days ago I have to hand it to him, no one plays the cuckold better than Bernie and the dude has remarkable longevity.  That said, it feels like he's a joke and just \"doing the meme\" now.  They were cheering on the assignation of the UnitedHealthcare CEO a few short months ago, now Bernie is pleading to subsidize those same health insurance cartels to the tune of billions. permalink parent award report block reply julianReyes 2 points 3 days ago He takes money from those cartels. \"It was only a million.\" permalink parent award report block reply Viewer01 7 points 3 days ago Fuck this commie. permalink award report block reply taxesaretheft -11 points 3 days ago God forbid Americans had affordable health vare permalink parent award report block reply DirkaDirkaJihad 5 points 3 days ago Pinko. Get a job and pay for your own healthcare. Then when you get a real job, you find out you are paying everyone else’s healthcare. Healthcare is 1/3 fraud payments. It is all a scam. Shutting off the funnels of money is really pissing people off. Follow the money and shut off the well. See what animals scurry out. Some real creatures will come out of the cracks permalink parent award report block reply taxesaretheft -1 points 3 days ago I have a job and pay for my own healthcare. Insurance is the scam. They are the middlemen that are sucking profit from what shouldn't be a profit drive field, providing care to humans. The animals that scurry out are those leeches permalink parent award report block reply chickeninoven 4 points 3 days ago They are the middlemen that are sucking profit from what shouldn't be a profit drive field, providing care to humans. Wake up, bro. The world is fake and gay, and everyone is out to extract as much from you as they can. The idea of purely altruistic doctors and nurses running around is just so far removed from reality, I can't even. permalink parent award report block reply Train_w_no_brakes 2 points 3 days ago The government is the reason it’s unaffordable. It needs to get out of the industry not regulate and subsidize it more you fucking tard permalink parent award report block reply anotherthing 1 points 2 days ago This! I have a feeling u/taxesaretheft doesn't remember health insurance before ObamaCare. Everyone thought it was expensive then, but it was so much cheaper and better then than now. I was paying at least 50% more for a lower tier insurance after ObamaCare with a higher deductible. So much for being able to keep my insurance if I was happy with it, and also so much for it being \"affordable\". permalink parent award report block reply Buff_cousin_Elroy 1 points 3 days ago Shut up commie fag permalink parent award report block reply LabTech 6 points 3 days ago We all know those 20 million he's referring to are either criminal migrants, or Shanequas that haven't worked a day in their lives, aside from popping out 6 future gangbangers. permalink award report block reply MaxineWaters4Prez 5 points 3 days ago So glad they cut that old grifting cuck off. Spare me the \"doubling\" of costs, shits already quadrupled since ACA took hold. permalink award report block reply Hanging_Chad 4 points 3 days ago sit down Bernie permalink award report block reply Nibba2 4 points 3 days ago A doubling in what? I can’t keep up with how fast my expenses fly through the roof for the past 6 years because of these senators. permalink award report block reply rebuildingMyself 2 points 2 days ago They don't care because they just vote themselves a pay raise that's several multiples of inflation increases while their policies make sure that I'm lucky to even keep the same salary I get now permalink parent award report block reply TheRedPilledArtist 2 points 3 days ago Bernie stands for nothing. I'm surprised he's even standing at all anymore. permalink award report block reply taxesaretheft -2 points 3 days ago Higher wages for working families... yep, nothing permalink parent award report block reply Caine 2 points 3 days ago Hasn't had a private sector job in 44 years and is always wrong about everything. permalink award report block reply MawdT20 2 points 3 days ago Be quiet, you moldering Marxist Muppet. permalink award report block reply Rock9Head 2 points 3 days ago The flutophone player was great. The best. permalink award report block reply Ndmand69 2 points 2 days ago He didn’t say oligarchy!!!  WTF? permalink award report block reply Seeing_Red 1 points 3 days ago Burnie Slanders permalink award report block reply barwhack 1 points 2 days ago Bernie keeps reaching for those moobs: he's such a wierdy... permalink award report block reply USDMaga 1 points 3 days ago Bernie:  People are about to learn Obamacare didn't just triple their insurance, it will now go up 6xs what it used to be before Obamacare.   It is irresponsible for the American people to learn how incompetent and stupid I am. permalink award report block reply ifyoustrikemedown 1 points 3 days ago Who's the guy on the bottom right? permalink award report block reply YodaBannon 1 points 3 days ago Bernie you fuckhead permalink award report block reply Mhmm2MoreWeeks -4 points 3 days ago Bernie, on behalf of our Jewish ancestors, will you please just STFU and retire. permalink award report block reply\nRyunnsun 33 points 3 days ago Also Bernie - Please buy me another house. permalink award report block reply realPhantomFuck 15 points 3 days ago Bernie needs another lake house! Three homes aren’t enough for a guy who hasn’t been employed in the private sector since 1982 permalink parent award report block reply SuperUltraMegaMAGA1 7 points 3 days ago He’s made a lot of money from his books permalink parent award report block reply Washington_Redskins 6 points 3 days ago Including his most famous book \"It's free real estate\" permalink parent award report block reply 45fan 2 points 2 days ago Yeah, Soros loved them so much he bought a million copies. permalink parent award report block reply Zskills 4 points 3 days ago I support this. The more he's at his vacation homes, the less he's bloviating at a microphone. permalink parent award report block reply BlackPilledMAGA 4 points 3 days ago \"Let me give you every lame excuse as to why we shoukd keep carrying the corpse Obamacare on our backs instead of shedding that bloated big pharma money laundering machine and replacing it with something honest\" permalink parent award report block reply Rock9Head 6 points 3 days ago It is the “something honest” that scares me. They are incapable. permalink parent award report block reply julianReyes 3 points 3 days ago \"it was only a million\" permalink parent award report block reply taxesaretheft -12 points 3 days ago Bernie has a vacation cabin and people here act like he's part of the Trump/Elon level of billionaire permalink parent award report block reply YouHadMeAtGaming 7 points 3 days ago It’s because he kept screaming “no one should be a millionaire! Nobody needs all these things!” Then people loved him and donated money. He bought all the things he said no one needs, became a millionaire, then ran again saying the same thing but replacing millionaire with billionaire. No one is mad he has a mansion and a vacation house on a lake, or expensive cars, people are pointing out the hypocrisy that he bought those things using money from people who will never have those things, by lying to them about how people with those things are bad. permalink parent award report block reply anotherthing 2 points 2 days ago The fact he has all those thing and has never had a job in the private sector should explain why Bernie Bros are some of the most blind idiots there are. Vermont should be barred from Federal elections just for continually voting for a guy that's honeymoon destination was the Soviet Union during the Cold War. permalink parent award report block reply _Sully_ 1 points 3 days ago Nah the mistake they make is believing the left cares if you think they are hypocrites. They don’t. permalink parent award report block reply julianReyes -2 points 3 days ago Oh LOOK, yet more evidence PDW is just Retarddit in a Scooby Doo monster costume. permalink parent award report block reply\nrealPhantomFuck 15 points 3 days ago Bernie needs another lake house! Three homes aren’t enough for a guy who hasn’t been employed in the private sector since 1982 permalink parent award report block reply SuperUltraMegaMAGA1 7 points 3 days ago He’s made a lot of money from his books permalink parent award report block reply Washington_Redskins 6 points 3 days ago Including his most famous book \"It's free real estate\" permalink parent award report block reply 45fan 2 points 2 days ago Yeah, Soros loved them so much he bought a million copies. permalink parent award report block reply Zskills 4 points 3 days ago I support this. The more he's at his vacation homes, the less he's bloviating at a microphone. permalink parent award report block reply\nSuperUltraMegaMAGA1 7 points 3 days ago He’s made a lot of money from his books permalink parent award report block reply Washington_Redskins 6 points 3 days ago Including his most famous book \"It's free real estate\" permalink parent award report block reply 45fan 2 points 2 days ago Yeah, Soros loved them so much he bought a million copies. permalink parent award report block reply\nWashington_Redskins 6 points 3 days ago Including his most famous book \"It's free real estate\" permalink parent award report block reply\n45fan 2 points 2 days ago Yeah, Soros loved them so much he bought a million copies. permalink parent award report block reply\nZskills 4 points 3 days ago I support this. The more he's at his vacation homes, the less he's bloviating at a microphone. permalink parent award report block reply\nBlackPilledMAGA 4 points 3 days ago \"Let me give you every lame excuse as to why we shoukd keep carrying the corpse Obamacare on our backs instead of shedding that bloated big pharma money laundering machine and replacing it with something honest\" permalink parent award report block reply Rock9Head 6 points 3 days ago It is the “something honest” that scares me. They are incapable. permalink parent award report block reply julianReyes 3 points 3 days ago \"it was only a million\" permalink parent award report block reply\nRock9Head 6 points 3 days ago It is the “something honest” that scares me. They are incapable. permalink parent award report block reply\njulianReyes 3 points 3 days ago \"it was only a million\" permalink parent award report block reply\ntaxesaretheft -12 points 3 days ago Bernie has a vacation cabin and people here act like he's part of the Trump/Elon level of billionaire permalink parent award report block reply YouHadMeAtGaming 7 points 3 days ago It’s because he kept screaming “no one should be a millionaire! Nobody needs all these things!” Then people loved him and donated money. He bought all the things he said no one needs, became a millionaire, then ran again saying the same thing but replacing millionaire with billionaire. No one is mad he has a mansion and a vacation house on a lake, or expensive cars, people are pointing out the hypocrisy that he bought those things using money from people who will never have those things, by lying to them about how people with those things are bad. permalink parent award report block reply anotherthing 2 points 2 days ago The fact he has all those thing and has never had a job in the private sector should explain why Bernie Bros are some of the most blind idiots there are. Vermont should be barred from Federal elections just for continually voting for a guy that's honeymoon destination was the Soviet Union during the Cold War. permalink parent award report block reply _Sully_ 1 points 3 days ago Nah the mistake they make is believing the left cares if you think they are hypocrites. They don’t. permalink parent award report block reply julianReyes -2 points 3 days ago Oh LOOK, yet more evidence PDW is just Retarddit in a Scooby Doo monster costume. permalink parent award report block reply\nYouHadMeAtGaming 7 points 3 days ago It’s because he kept screaming “no one should be a millionaire! Nobody needs all these things!” Then people loved him and donated money. He bought all the things he said no one needs, became a millionaire, then ran again saying the same thing but replacing millionaire with billionaire. No one is mad he has a mansion and a vacation house on a lake, or expensive cars, people are pointing out the hypocrisy that he bought those things using money from people who will never have those things, by lying to them about how people with those things are bad. permalink parent award report block reply anotherthing 2 points 2 days ago The fact he has all those thing and has never had a job in the private sector should explain why Bernie Bros are some of the most blind idiots there are. Vermont should be barred from Federal elections just for continually voting for a guy that's honeymoon destination was the Soviet Union during the Cold War. permalink parent award report block reply\nanotherthing 2 points 2 days ago The fact he has all those thing and has never had a job in the private sector should explain why Bernie Bros are some of the most blind idiots there are. Vermont should be barred from Federal elections just for continually voting for a guy that's honeymoon destination was the Soviet Union during the Cold War. permalink parent award report block reply\n_Sully_ 1 points 3 days ago Nah the mistake they make is believing the left cares if you think they are hypocrites. They don’t. permalink parent award report block reply\njulianReyes -2 points 3 days ago Oh LOOK, yet more evidence PDW is just Retarddit in a Scooby Doo monster costume. permalink parent award report block reply\nBlackJack1776 19 points 3 days ago \"Let's be clear!\". -Any politician [Warning Alarm INTENSIFIES] permalink award report block reply Payasyougo 2 points 2 days ago Why isn't his wife in prison yet? permalink parent award report block reply\nPayasyougo 2 points 2 days ago Why isn't his wife in prison yet? permalink parent award report block reply\nWarCry 11 points 3 days ago I'll give him this, his grift has always been consistent, I mean total commiefag, but consistent nonetheless. permalink award report block reply MaxineWaters4Prez 8 points 3 days ago He's spent his entire productive adult life sucking the government that. Not only has he never held a real job in his whole life, he's never enacted a meaningful piece of legislation. permalink parent award report block reply LookFatty 4 points 3 days ago He was kicked out of his commune for being too lazy permalink parent award report block reply RStroud 3 points 3 days ago I have to hand it to him, no one plays the cuckold better than Bernie and the dude has remarkable longevity.  That said, it feels like he's a joke and just \"doing the meme\" now.  They were cheering on the assignation of the UnitedHealthcare CEO a few short months ago, now Bernie is pleading to subsidize those same health insurance cartels to the tune of billions. permalink parent award report block reply julianReyes 2 points 3 days ago He takes money from those cartels. \"It was only a million.\" permalink parent award report block reply\nMaxineWaters4Prez 8 points 3 days ago He's spent his entire productive adult life sucking the government that. Not only has he never held a real job in his whole life, he's never enacted a meaningful piece of legislation. permalink parent award report block reply LookFatty 4 points 3 days ago He was kicked out of his commune for being too lazy permalink parent award report block reply\nLookFatty 4 points 3 days ago He was kicked out of his commune for being too lazy permalink parent award report block reply\nRStroud 3 points 3 days ago I have to hand it to him, no one plays the cuckold better than Bernie and the dude has remarkable longevity.  That said, it feels like he's a joke and just \"doing the meme\" now.  They were cheering on the assignation of the UnitedHealthcare CEO a few short months ago, now Bernie is pleading to subsidize those same health insurance cartels to the tune of billions. permalink parent award report block reply julianReyes 2 points 3 days ago He takes money from those cartels. \"It was only a million.\" permalink parent award report block reply\njulianReyes 2 points 3 days ago He takes money from those cartels. \"It was only a million.\" permalink parent award report block reply\nViewer01 7 points 3 days ago Fuck this commie. permalink award report block reply taxesaretheft -11 points 3 days ago God forbid Americans had affordable health vare permalink parent award report block reply DirkaDirkaJihad 5 points 3 days ago Pinko. Get a job and pay for your own healthcare. Then when you get a real job, you find out you are paying everyone else’s healthcare. Healthcare is 1/3 fraud payments. It is all a scam. Shutting off the funnels of money is really pissing people off. Follow the money and shut off the well. See what animals scurry out. Some real creatures will come out of the cracks permalink parent award report block reply taxesaretheft -1 points 3 days ago I have a job and pay for my own healthcare. Insurance is the scam. They are the middlemen that are sucking profit from what shouldn't be a profit drive field, providing care to humans. The animals that scurry out are those leeches permalink parent award report block reply chickeninoven 4 points 3 days ago They are the middlemen that are sucking profit from what shouldn't be a profit drive field, providing care to humans. Wake up, bro. The world is fake and gay, and everyone is out to extract as much from you as they can. The idea of purely altruistic doctors and nurses running around is just so far removed from reality, I can't even. permalink parent award report block reply Train_w_no_brakes 2 points 3 days ago The government is the reason it’s unaffordable. It needs to get out of the industry not regulate and subsidize it more you fucking tard permalink parent award report block reply anotherthing 1 points 2 days ago This! I have a feeling u/taxesaretheft doesn't remember health insurance before ObamaCare. Everyone thought it was expensive then, but it was so much cheaper and better then than now. I was paying at least 50% more for a lower tier insurance after ObamaCare with a higher deductible. So much for being able to keep my insurance if I was happy with it, and also so much for it being \"affordable\". permalink parent award report block reply Buff_cousin_Elroy 1 points 3 days ago Shut up commie fag permalink parent award report block reply\ntaxesaretheft -11 points 3 days ago God forbid Americans had affordable health vare permalink parent award report block reply DirkaDirkaJihad 5 points 3 days ago Pinko. Get a job and pay for your own healthcare. Then when you get a real job, you find out you are paying everyone else’s healthcare. Healthcare is 1/3 fraud payments. It is all a scam. Shutting off the funnels of money is really pissing people off. Follow the money and shut off the well. See what animals scurry out. Some real creatures will come out of the cracks permalink parent award report block reply taxesaretheft -1 points 3 days ago I have a job and pay for my own healthcare. Insurance is the scam. They are the middlemen that are sucking profit from what shouldn't be a profit drive field, providing care to humans. The animals that scurry out are those leeches permalink parent award report block reply chickeninoven 4 points 3 days ago They are the middlemen that are sucking profit from what shouldn't be a profit drive field, providing care to humans. Wake up, bro. The world is fake and gay, and everyone is out to extract as much from you as they can. The idea of purely altruistic doctors and nurses running around is just so far removed from reality, I can't even. permalink parent award report block reply Train_w_no_brakes 2 points 3 days ago The government is the reason it’s unaffordable. It needs to get out of the industry not regulate and subsidize it more you fucking tard permalink parent award report block reply anotherthing 1 points 2 days ago This! I have a feeling u/taxesaretheft doesn't remember health insurance before ObamaCare. Everyone thought it was expensive then, but it was so much cheaper and better then than now. I was paying at least 50% more for a lower tier insurance after ObamaCare with a higher deductible. So much for being able to keep my insurance if I was happy with it, and also so much for it being \"affordable\". permalink parent award report block reply Buff_cousin_Elroy 1 points 3 days ago Shut up commie fag permalink parent award report block reply\nDirkaDirkaJihad 5 points 3 days ago Pinko. Get a job and pay for your own healthcare. Then when you get a real job, you find out you are paying everyone else’s healthcare. Healthcare is 1/3 fraud payments. It is all a scam. Shutting off the funnels of money is really pissing people off. Follow the money and shut off the well. See what animals scurry out. Some real creatures will come out of the cracks permalink parent award report block reply taxesaretheft -1 points 3 days ago I have a job and pay for my own healthcare. Insurance is the scam. They are the middlemen that are sucking profit from what shouldn't be a profit drive field, providing care to humans. The animals that scurry out are those leeches permalink parent award report block reply chickeninoven 4 points 3 days ago They are the middlemen that are sucking profit from what shouldn't be a profit drive field, providing care to humans. Wake up, bro. The world is fake and gay, and everyone is out to extract as much from you as they can. The idea of purely altruistic doctors and nurses running around is just so far removed from reality, I can't even. permalink parent award report block reply\ntaxesaretheft -1 points 3 days ago I have a job and pay for my own healthcare. Insurance is the scam. They are the middlemen that are sucking profit from what shouldn't be a profit drive field, providing care to humans. The animals that scurry out are those leeches permalink parent award report block reply chickeninoven 4 points 3 days ago They are the middlemen that are sucking profit from what shouldn't be a profit drive field, providing care to humans. Wake up, bro. The world is fake and gay, and everyone is out to extract as much from you as they can. The idea of purely altruistic doctors and nurses running around is just so far removed from reality, I can't even. permalink parent award report block reply\nchickeninoven 4 points 3 days ago They are the middlemen that are sucking profit from what shouldn't be a profit drive field, providing care to humans. Wake up, bro. The world is fake and gay, and everyone is out to extract as much from you as they can. The idea of purely altruistic doctors and nurses running around is just so far removed from reality, I can't even. permalink parent award report block reply\nTrain_w_no_brakes 2 points 3 days ago The government is the reason it’s unaffordable. It needs to get out of the industry not regulate and subsidize it more you fucking tard permalink parent award report block reply anotherthing 1 points 2 days ago This! I have a feeling u/taxesaretheft doesn't remember health insurance before ObamaCare. Everyone thought it was expensive then, but it was so much cheaper and better then than now. I was paying at least 50% more for a lower tier insurance after ObamaCare with a higher deductible. So much for being able to keep my insurance if I was happy with it, and also so much for it being \"affordable\". permalink parent award report block reply\nanotherthing 1 points 2 days ago This! I have a feeling u/taxesaretheft doesn't remember health insurance before ObamaCare. Everyone thought it was expensive then, but it was so much cheaper and better then than now. I was paying at least 50% more for a lower tier insurance after ObamaCare with a higher deductible. So much for being able to keep my insurance if I was happy with it, and also so much for it being \"affordable\". permalink parent award report block reply\nBuff_cousin_Elroy 1 points 3 days ago Shut up commie fag permalink parent award report block reply\nLabTech 6 points 3 days ago We all know those 20 million he's referring to are either criminal migrants, or Shanequas that haven't worked a day in their lives, aside from popping out 6 future gangbangers. permalink award report block reply\nMaxineWaters4Prez 5 points 3 days ago So glad they cut that old grifting cuck off. Spare me the \"doubling\" of costs, shits already quadrupled since ACA took hold. permalink award report block reply\nHanging_Chad 4 points 3 days ago sit down Bernie permalink award report block reply\nNibba2 4 points 3 days ago A doubling in what? I can’t keep up with how fast my expenses fly through the roof for the past 6 years because of these senators. permalink award report block reply rebuildingMyself 2 points 2 days ago They don't care because they just vote themselves a pay raise that's several multiples of inflation increases while their policies make sure that I'm lucky to even keep the same salary I get now permalink parent award report block reply\nrebuildingMyself 2 points 2 days ago They don't care because they just vote themselves a pay raise that's several multiples of inflation increases while their policies make sure that I'm lucky to even keep the same salary I get now permalink parent award report block reply\nTheRedPilledArtist 2 points 3 days ago Bernie stands for nothing. I'm surprised he's even standing at all anymore. permalink award report block reply taxesaretheft -2 points 3 days ago Higher wages for working families... yep, nothing permalink parent award report block reply\ntaxesaretheft -2 points 3 days ago Higher wages for working families... yep, nothing permalink parent award report block reply\nCaine 2 points 3 days ago Hasn't had a private sector job in 44 years and is always wrong about everything. permalink award report block reply\nMawdT20 2 points 3 days ago Be quiet, you moldering Marxist Muppet. permalink award report block reply\nRock9Head 2 points 3 days ago The flutophone player was great. The best. permalink award report block reply\nNdmand69 2 points 2 days ago He didn’t say oligarchy!!!  WTF? permalink award report block reply\nSeeing_Red 1 points 3 days ago Burnie Slanders permalink award report block reply\nbarwhack 1 points 2 days ago Bernie keeps reaching for those moobs: he's such a wierdy... permalink award report block reply\nUSDMaga 1 points 3 days ago Bernie:  People are about to learn Obamacare didn't just triple their insurance, it will now go up 6xs what it used to be before Obamacare.   It is irresponsible for the American people to learn how incompetent and stupid I am. permalink award report block reply\nifyoustrikemedown 1 points 3 days ago Who's the guy on the bottom right? permalink award report block reply\nYodaBannon 1 points 3 days ago Bernie you fuckhead permalink award report block reply\nMhmm2MoreWeeks -4 points 3 days ago Bernie, on behalf of our Jewish ancestors, will you please just STFU and retire. permalink award report block reply",
  "fetched_at": "2025-11-12T20:58:42.179832Z"
}