{
  "id": "8185522",
  "title": "57Betting Market on New Trump Impeachment Break 50%posted3 hours agobyflashersenpai23 commentsawards",
  "url": "https://patriots.win/p/1ARK9nP4xm/betting-market-on-new-trump-impe/c",
  "content": "57 Betting Market on New Trump Impeachment Break 50% posted 3 hours ago by flashersenpai 23 comments award share report block Kalshi @Kalshi • 4h BREAKING: Odds Trump is impeached again rise above 50%\n23 comments Sort by Top Top New Worst Old Save flashersenpai OP 14 points 3 hours ago This isn't polling. People are putting their actual money on the line on the outcome of this prediction. In a world where America First was actually happening, this would be well below 50%. permalink award report block reply Scipio_Americanus 0 points 3 hours ago At this point, impeaching and removing  him might be for the best. Assuming JD isn't also compromised. permalink parent award report block reply Awakened 11 points 3 hours ago Of course he is or he wouldn't have been handed the role. He is married to an Indian FFS. permalink parent award report block reply YaharaRiver 0 points 2 hours ago Still 1000x better than marrying your brother. permalink parent award report block reply Awakened 2 points 2 hours ago Deflections and whataboutisms really don't work. Do better. permalink parent award report block reply view 4 more comments... Be_The_Change 0 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply FudgyFudgeBots 7 points 3 hours ago if dems are able to cheat and win midterms, Trumps second half will be all about impeachment. Republicans are doing everything they can to avoid implementing trumps agenda until they can conveniently lose power in 2026. permalink award report block reply Lurker404 4 points 1 hour ago Trump himself just threw the midterms with his \"we need H1Pajeets because Americans are dumb\" speech. They don't need to cheat. They just need to run that interview on a loop. permalink parent award report block reply ListenJack 2 points 1 hour ago Deep down I knew Trump cozying up to the tech oligarchs would put him in a position where he didn't have much choice on the H1B position but I was was desperately hoping that wasn't the case. permalink parent award report block reply ListenJack 1 points 1 hour ago MY personal Polymarket odds on this being true are 99.9%. permalink parent award report block reply k-doe3 3 points 3 hours ago the left is like a cornered animal right now . permalink award report block reply Lurker404 3 points 1 hour ago Republicans are like Ernest Hemingway, sucking on a shotgun that has \"Israel and India first\" engraved on it. permalink parent award report block reply sordfysh PRO 2 points 1 hour ago The crazy thing is that all they need to do is to arrest evil people and look out for the best interests of Americans. I guess I should just be happy that they aren't arresting American patriots. permalink parent award report block reply LordCommissarYarrick 2 points 51 minutes ago Give it time. Cynical? Maybe,  but its pretty much opposite day week so who knows. permalink parent award report block reply Be_The_Change 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply geckogreen 2 points 3 hours ago Democrats just use impeachment as a publicity tool so sure it is possible permalink award report block reply SHILL_DETECTOR 2 points 2 hours ago these stupid betting market tweets should be banned from this site permalink award report block reply Grindelwald -1 points 3 hours ago Because the left is using bots and stupid paid actors to post negative information about Trump everywhere.  Have you seen any today? permalink award report block reply YouEssAye 1 points 1 hour ago If you think this criticism is coming from the left then you're part of the problem. permalink parent award report block reply\nflashersenpai OP 14 points 3 hours ago This isn't polling. People are putting their actual money on the line on the outcome of this prediction. In a world where America First was actually happening, this would be well below 50%. permalink award report block reply Scipio_Americanus 0 points 3 hours ago At this point, impeaching and removing  him might be for the best. Assuming JD isn't also compromised. permalink parent award report block reply Awakened 11 points 3 hours ago Of course he is or he wouldn't have been handed the role. He is married to an Indian FFS. permalink parent award report block reply YaharaRiver 0 points 2 hours ago Still 1000x better than marrying your brother. permalink parent award report block reply Awakened 2 points 2 hours ago Deflections and whataboutisms really don't work. Do better. permalink parent award report block reply view 4 more comments... Be_The_Change 0 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nScipio_Americanus 0 points 3 hours ago At this point, impeaching and removing  him might be for the best. Assuming JD isn't also compromised. permalink parent award report block reply Awakened 11 points 3 hours ago Of course he is or he wouldn't have been handed the role. He is married to an Indian FFS. permalink parent award report block reply YaharaRiver 0 points 2 hours ago Still 1000x better than marrying your brother. permalink parent award report block reply Awakened 2 points 2 hours ago Deflections and whataboutisms really don't work. Do better. permalink parent award report block reply view 4 more comments... Be_The_Change 0 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nAwakened 11 points 3 hours ago Of course he is or he wouldn't have been handed the role. He is married to an Indian FFS. permalink parent award report block reply YaharaRiver 0 points 2 hours ago Still 1000x better than marrying your brother. permalink parent award report block reply Awakened 2 points 2 hours ago Deflections and whataboutisms really don't work. Do better. permalink parent award report block reply view 4 more comments...\nYaharaRiver 0 points 2 hours ago Still 1000x better than marrying your brother. permalink parent award report block reply Awakened 2 points 2 hours ago Deflections and whataboutisms really don't work. Do better. permalink parent award report block reply view 4 more comments...\nAwakened 2 points 2 hours ago Deflections and whataboutisms really don't work. Do better. permalink parent award report block reply view 4 more comments...\nBe_The_Change 0 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nFudgyFudgeBots 7 points 3 hours ago if dems are able to cheat and win midterms, Trumps second half will be all about impeachment. Republicans are doing everything they can to avoid implementing trumps agenda until they can conveniently lose power in 2026. permalink award report block reply Lurker404 4 points 1 hour ago Trump himself just threw the midterms with his \"we need H1Pajeets because Americans are dumb\" speech. They don't need to cheat. They just need to run that interview on a loop. permalink parent award report block reply ListenJack 2 points 1 hour ago Deep down I knew Trump cozying up to the tech oligarchs would put him in a position where he didn't have much choice on the H1B position but I was was desperately hoping that wasn't the case. permalink parent award report block reply ListenJack 1 points 1 hour ago MY personal Polymarket odds on this being true are 99.9%. permalink parent award report block reply\nLurker404 4 points 1 hour ago Trump himself just threw the midterms with his \"we need H1Pajeets because Americans are dumb\" speech. They don't need to cheat. They just need to run that interview on a loop. permalink parent award report block reply ListenJack 2 points 1 hour ago Deep down I knew Trump cozying up to the tech oligarchs would put him in a position where he didn't have much choice on the H1B position but I was was desperately hoping that wasn't the case. permalink parent award report block reply\nListenJack 2 points 1 hour ago Deep down I knew Trump cozying up to the tech oligarchs would put him in a position where he didn't have much choice on the H1B position but I was was desperately hoping that wasn't the case. permalink parent award report block reply\nListenJack 1 points 1 hour ago MY personal Polymarket odds on this being true are 99.9%. permalink parent award report block reply\nk-doe3 3 points 3 hours ago the left is like a cornered animal right now . permalink award report block reply Lurker404 3 points 1 hour ago Republicans are like Ernest Hemingway, sucking on a shotgun that has \"Israel and India first\" engraved on it. permalink parent award report block reply sordfysh PRO 2 points 1 hour ago The crazy thing is that all they need to do is to arrest evil people and look out for the best interests of Americans. I guess I should just be happy that they aren't arresting American patriots. permalink parent award report block reply LordCommissarYarrick 2 points 51 minutes ago Give it time. Cynical? Maybe,  but its pretty much opposite day week so who knows. permalink parent award report block reply Be_The_Change 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nLurker404 3 points 1 hour ago Republicans are like Ernest Hemingway, sucking on a shotgun that has \"Israel and India first\" engraved on it. permalink parent award report block reply sordfysh PRO 2 points 1 hour ago The crazy thing is that all they need to do is to arrest evil people and look out for the best interests of Americans. I guess I should just be happy that they aren't arresting American patriots. permalink parent award report block reply LordCommissarYarrick 2 points 51 minutes ago Give it time. Cynical? Maybe,  but its pretty much opposite day week so who knows. permalink parent award report block reply\nsordfysh PRO 2 points 1 hour ago The crazy thing is that all they need to do is to arrest evil people and look out for the best interests of Americans. I guess I should just be happy that they aren't arresting American patriots. permalink parent award report block reply LordCommissarYarrick 2 points 51 minutes ago Give it time. Cynical? Maybe,  but its pretty much opposite day week so who knows. permalink parent award report block reply\nLordCommissarYarrick 2 points 51 minutes ago Give it time. Cynical? Maybe,  but its pretty much opposite day week so who knows. permalink parent award report block reply\nBe_The_Change 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\ngeckogreen 2 points 3 hours ago Democrats just use impeachment as a publicity tool so sure it is possible permalink award report block reply\nSHILL_DETECTOR 2 points 2 hours ago these stupid betting market tweets should be banned from this site permalink award report block reply\nGrindelwald -1 points 3 hours ago Because the left is using bots and stupid paid actors to post negative information about Trump everywhere.  Have you seen any today? permalink award report block reply YouEssAye 1 points 1 hour ago If you think this criticism is coming from the left then you're part of the problem. permalink parent award report block reply\nYouEssAye 1 points 1 hour ago If you think this criticism is coming from the left then you're part of the problem. permalink parent award report block reply"
}