{
  "id": "1ARK0UcAn2",
  "url": "https://patriots.win/p/1ARK0UcAn2/meow-to-that/c",
  "content": "552 MEOW to that! posted 7 days ago by LightBeacons 43 comments award share report block Catturd ™ @catturd2 • 7d I joined the army when I was 17-years-old and have taken care of myself my entire life without any financial help from anyone - so I’m immune to all the crying. When I was broke, which was many years, I ate peanut butter sandwiches for weeks. If that. I was even homeless, one\n43 comments Sort by Top Top New Worst Old Save Around the Web Doctor: A Teaspoon Kills All Worms in Your Body! Paratoxil greenroomsh 17 points 7 days ago Never been homeless, but when my husband was in the Army, we ate Ramen Noodles, Mac and cheese, and meatless hamburger helper (a nickel a pack at the commissary) for three weeks because our car threw a rod.  He went to a junkyard to find replacement parts and used the post garage and their tools to fix it himself. We survived. permalink award report block reply jermzdeejd 3 points 6 days ago Gosh this sounds rough. This really puts things into perspective for yall and for people reading about it. permalink parent award report block reply PhilMcKankles 1 points 6 days ago Really?!?  He just describe my kids preferred menu.   And fixing your own vehicle... wHoA!!!  Hard times. permalink parent award report block reply LLP2 14 points 7 days ago The key to getting people off gibs is to make them less desirable. If you have to drink water and eat what a soup kitchen or cafeteria makes instead of buying a bucket of wings and bottles of soda, you will work to get your own asap. permalink award report block reply Totsugeki 11 points 7 days ago I’m financially successful now because of hard work. You are not here because of \"hard work.\" You are financially successful because the social media algorithms artificially boost your account over your competition the exact same way they boost Ben Shapiro. Everyone else in MAGA got banned pre-Musk, including POTUS himself. It was never about \"hard work.\" Stop lying. permalink award report block reply sordfysh PRO 7 points 7 days ago It's work to get to sleep when you intentionally stab in the back MAGA people for just asking questions of the government. permalink parent award report block reply Ur2sm4rt 8 points 7 days ago Homeless these days gets you killed fast. Like let's be real, turd acting like a boomer again. Snap suck, but stop saying shit like Biden years didn't royally fucked some people up hard. permalink award report block reply YouEssAye 7 points 7 days ago Yeah boomer moment. Not once during this time, did I think the government was responsible If the government isn't ultimately responsible for most of the problems facing the nation, who is? That's not to say government can fix the problems, but they manufacture them to justify their existence. permalink parent award report block reply patrioticwinning3 4 points 7 days ago \"Every bad place I’ve been in my life is because of bad decisions I’ve made...\"  This is true in some cases, but not in others... permalink parent award report block reply HanginChad 2 points 7 days ago For example? permalink parent award report block reply Cheesemaker 7 points 7 days ago Not getting vaccinated and being fired due to government mandates? permalink parent award report block reply HanginChad 1 points 7 days ago That's a reasonable example. However, one could say that could be avoided by having enough savings for unforseen circumstances as one can lose a job for any number of reasons. Some forethought could probably mitigate a lot of these types of situations. I've always made sure to live well below my means no matter how little or how much I earned. permalink parent award report block reply view 3 more comments... FearGodTheAlmighty 2 points 7 days ago I was homeless in America recently for a few months. It's not going to kill you. permalink parent award report block reply PhilMcKankles 1 points 6 days ago Seriously... join a 24hour fitness for $40/month and you're no longer homeless... or splurge and join a Lifetime Fitness.   Hot showers, brand new razors, and clean towels. permalink parent award report block reply ShitAss 1 points 6 days ago He’s not acting permalink parent award report block reply RedPillosopher1776 7 points 7 days ago I really just do not care to hear any boomer struggle fantasy bullshit, times are much harder now, the dollar has much lower economic power, there's far more competition now and a lot less economic mobility. Boomers think couch surfing in their 20s was a struggle, they have no fucking clue. permalink award report block reply FearGodTheAlmighty 4 points 7 days ago One day you'll become a boomer and you'll understand. permalink parent award report block reply RedPillosopher1776 1 points 6 days ago Nope, I'm never going to be the sort of person who pulls the ladder up behind myself then stands on top the roof pissing on everyone left below just to feel some sense of value as a human being by beating down others rather than just admit im not the superman fantasy I constructed in my own head. permalink parent award report block reply FearGodTheAlmighty 0 points 6 days ago You'll understand some day permalink parent award report block reply deleted 3 points 7 days ago RedPillosopher1776 1 points 6 days ago When did I make an excuse for anything, I stated facts. Im not asking for anything from anyone, all I want is government out of my way and the boomers to shut the fuck up since they're largely responsible for the currect situation and the intend to milk the system for every last fucking drop they can on their way out. permalink parent award report block reply Wozzing 1 points 6 days ago Entitled punks have it worse permalink parent award report block reply SisterCovfefeToo 6 points 7 days ago This is a bad take, imo, mostly because it assumes some sort of moral superiority for not using benefits when it's really, there but for the grace of God go I. The guys I serve at the shelter have had unfortunate circumstances. Some self inflicted, others out of their control. For the most part they're older men, the young ones are still strong enough to work their way out of their situation, like Catturd did. permalink award report block reply deleted 6 points 7 days ago 45isthebomb 3 points 6 days ago Old Boomer here.  Whenever I got a job I worked harder than the guy next to me.  Always was asked to move up the ladder.  Went from ground floor to VP.  Now I own and run my own business.  have 10 employees and looking for a couple more. Getting ready to sell and retire.   My motivation always stemmed from the fear of being homeless.  It's a great motivator. permalink parent award report block reply jakebrake 4 points 7 days ago Thank you for your service to our country.\nVeterans Day November 11th, the one day of remembrance to those who served. permalink award report block reply Moebius 4 points 7 days ago I did a 179 day 'TDY' back in the 70's eating little more than PB and Honey sammiches and canned soup...with the 'occasional' box of C-Rats...that's 'Meal, Combat Individual' for the Military Aficionados. When you're hungry enough you'll even eat the 'Spam and Mutherfuckers'... permalink award report block reply Awakened 3 points 7 days ago Sucker. If you paid income taxes throughout your life you should use every opportunity to try to get the money they stole from you back. permalink award report block reply FearGodTheAlmighty 3 points 7 days ago Amen! permalink award report block reply BigIgloo 3 points 7 days ago Gotta be a special sort of stupid to fail as a boomer permalink award report block reply sordfysh PRO 3 points 7 days ago You can tell people who are easy to buy because they build their identity on being financially comfortable. These people are easy to buy because they will justify their blood money as a reward for \"hard work\". You won't need to convince them to ignore the people they are hurting because those people are brokeys who have nobody to blame but themselves. permalink award report block reply Exviper 2 points 6 days ago My wife and I lived off roadkill… we got deer that were hit by cars and I used to butcher them up so we all had meat.  She was a stay at home mom with our 2 children and money was tight.  We do what we need to do.  And no shame here about it at all.  Never asked for a thing from the government. permalink award report block reply bowlerslivesmatter 2 points 6 days ago I lived on loafs of bread with Miracle Whip for over a month once. I hate these freeloaders permalink award report block reply Feelsgood2020 -7 points 7 days ago Was this intended to be a pro-America post? Seems like America failed him. permalink award report block reply Th3Cho0sing0ne 9 points 7 days ago America owed him nothing.  America provided him the opportunity to have all those valuable experiences,  and grow from them.  The cat guy learned to make better choices and figured out that hard work is the best choice for growth. Cat dude would have not been sharpened into a high value human if he had just allowed 'America' (government) to give him handouts allowing him to just sit back and eat... and fuck around. When you say ' America failed him', you are implying that America should have bailed him out with welfare, and stopped him in his tracks. Don't aspire to be a welfare bum. permalink parent award report block reply Maxmax 4 points 7 days ago America never failed him.  He failed himself…then came back bigger and better than ever.  Good for Catturd. permalink parent award report block reply imnotdeadyet 6 points 7 days ago I put myself through college and grad school.  I ate a lot of ramen noodles for meals.  There are a lot of people that did the same thing.  Never had to live out of a car because I didn't have one. I was lucky enough to have decent paying summer jobs to help me pay for school, along with student loans.  Back then, college wasn't crazy expensive like it is now. permalink parent award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\ngreenroomsh 17 points 7 days ago Never been homeless, but when my husband was in the Army, we ate Ramen Noodles, Mac and cheese, and meatless hamburger helper (a nickel a pack at the commissary) for three weeks because our car threw a rod.  He went to a junkyard to find replacement parts and used the post garage and their tools to fix it himself. We survived. permalink award report block reply jermzdeejd 3 points 6 days ago Gosh this sounds rough. This really puts things into perspective for yall and for people reading about it. permalink parent award report block reply PhilMcKankles 1 points 6 days ago Really?!?  He just describe my kids preferred menu.   And fixing your own vehicle... wHoA!!!  Hard times. permalink parent award report block reply\njermzdeejd 3 points 6 days ago Gosh this sounds rough. This really puts things into perspective for yall and for people reading about it. permalink parent award report block reply PhilMcKankles 1 points 6 days ago Really?!?  He just describe my kids preferred menu.   And fixing your own vehicle... wHoA!!!  Hard times. permalink parent award report block reply\nPhilMcKankles 1 points 6 days ago Really?!?  He just describe my kids preferred menu.   And fixing your own vehicle... wHoA!!!  Hard times. permalink parent award report block reply\nLLP2 14 points 7 days ago The key to getting people off gibs is to make them less desirable. If you have to drink water and eat what a soup kitchen or cafeteria makes instead of buying a bucket of wings and bottles of soda, you will work to get your own asap. permalink award report block reply\nTotsugeki 11 points 7 days ago I’m financially successful now because of hard work. You are not here because of \"hard work.\" You are financially successful because the social media algorithms artificially boost your account over your competition the exact same way they boost Ben Shapiro. Everyone else in MAGA got banned pre-Musk, including POTUS himself. It was never about \"hard work.\" Stop lying. permalink award report block reply sordfysh PRO 7 points 7 days ago It's work to get to sleep when you intentionally stab in the back MAGA people for just asking questions of the government. permalink parent award report block reply\nsordfysh PRO 7 points 7 days ago It's work to get to sleep when you intentionally stab in the back MAGA people for just asking questions of the government. permalink parent award report block reply\nUr2sm4rt 8 points 7 days ago Homeless these days gets you killed fast. Like let's be real, turd acting like a boomer again. Snap suck, but stop saying shit like Biden years didn't royally fucked some people up hard. permalink award report block reply YouEssAye 7 points 7 days ago Yeah boomer moment. Not once during this time, did I think the government was responsible If the government isn't ultimately responsible for most of the problems facing the nation, who is? That's not to say government can fix the problems, but they manufacture them to justify their existence. permalink parent award report block reply patrioticwinning3 4 points 7 days ago \"Every bad place I’ve been in my life is because of bad decisions I’ve made...\"  This is true in some cases, but not in others... permalink parent award report block reply HanginChad 2 points 7 days ago For example? permalink parent award report block reply Cheesemaker 7 points 7 days ago Not getting vaccinated and being fired due to government mandates? permalink parent award report block reply HanginChad 1 points 7 days ago That's a reasonable example. However, one could say that could be avoided by having enough savings for unforseen circumstances as one can lose a job for any number of reasons. Some forethought could probably mitigate a lot of these types of situations. I've always made sure to live well below my means no matter how little or how much I earned. permalink parent award report block reply view 3 more comments... FearGodTheAlmighty 2 points 7 days ago I was homeless in America recently for a few months. It's not going to kill you. permalink parent award report block reply PhilMcKankles 1 points 6 days ago Seriously... join a 24hour fitness for $40/month and you're no longer homeless... or splurge and join a Lifetime Fitness.   Hot showers, brand new razors, and clean towels. permalink parent award report block reply ShitAss 1 points 6 days ago He’s not acting permalink parent award report block reply\nYouEssAye 7 points 7 days ago Yeah boomer moment. Not once during this time, did I think the government was responsible If the government isn't ultimately responsible for most of the problems facing the nation, who is? That's not to say government can fix the problems, but they manufacture them to justify their existence. permalink parent award report block reply\npatrioticwinning3 4 points 7 days ago \"Every bad place I’ve been in my life is because of bad decisions I’ve made...\"  This is true in some cases, but not in others... permalink parent award report block reply HanginChad 2 points 7 days ago For example? permalink parent award report block reply Cheesemaker 7 points 7 days ago Not getting vaccinated and being fired due to government mandates? permalink parent award report block reply HanginChad 1 points 7 days ago That's a reasonable example. However, one could say that could be avoided by having enough savings for unforseen circumstances as one can lose a job for any number of reasons. Some forethought could probably mitigate a lot of these types of situations. I've always made sure to live well below my means no matter how little or how much I earned. permalink parent award report block reply view 3 more comments...\nHanginChad 2 points 7 days ago For example? permalink parent award report block reply Cheesemaker 7 points 7 days ago Not getting vaccinated and being fired due to government mandates? permalink parent award report block reply HanginChad 1 points 7 days ago That's a reasonable example. However, one could say that could be avoided by having enough savings for unforseen circumstances as one can lose a job for any number of reasons. Some forethought could probably mitigate a lot of these types of situations. I've always made sure to live well below my means no matter how little or how much I earned. permalink parent award report block reply view 3 more comments...\nCheesemaker 7 points 7 days ago Not getting vaccinated and being fired due to government mandates? permalink parent award report block reply HanginChad 1 points 7 days ago That's a reasonable example. However, one could say that could be avoided by having enough savings for unforseen circumstances as one can lose a job for any number of reasons. Some forethought could probably mitigate a lot of these types of situations. I've always made sure to live well below my means no matter how little or how much I earned. permalink parent award report block reply view 3 more comments...\nHanginChad 1 points 7 days ago That's a reasonable example. However, one could say that could be avoided by having enough savings for unforseen circumstances as one can lose a job for any number of reasons. Some forethought could probably mitigate a lot of these types of situations. I've always made sure to live well below my means no matter how little or how much I earned. permalink parent award report block reply view 3 more comments...\nFearGodTheAlmighty 2 points 7 days ago I was homeless in America recently for a few months. It's not going to kill you. permalink parent award report block reply PhilMcKankles 1 points 6 days ago Seriously... join a 24hour fitness for $40/month and you're no longer homeless... or splurge and join a Lifetime Fitness.   Hot showers, brand new razors, and clean towels. permalink parent award report block reply\nPhilMcKankles 1 points 6 days ago Seriously... join a 24hour fitness for $40/month and you're no longer homeless... or splurge and join a Lifetime Fitness.   Hot showers, brand new razors, and clean towels. permalink parent award report block reply\nShitAss 1 points 6 days ago He’s not acting permalink parent award report block reply\nRedPillosopher1776 7 points 7 days ago I really just do not care to hear any boomer struggle fantasy bullshit, times are much harder now, the dollar has much lower economic power, there's far more competition now and a lot less economic mobility. Boomers think couch surfing in their 20s was a struggle, they have no fucking clue. permalink award report block reply FearGodTheAlmighty 4 points 7 days ago One day you'll become a boomer and you'll understand. permalink parent award report block reply RedPillosopher1776 1 points 6 days ago Nope, I'm never going to be the sort of person who pulls the ladder up behind myself then stands on top the roof pissing on everyone left below just to feel some sense of value as a human being by beating down others rather than just admit im not the superman fantasy I constructed in my own head. permalink parent award report block reply FearGodTheAlmighty 0 points 6 days ago You'll understand some day permalink parent award report block reply deleted 3 points 7 days ago RedPillosopher1776 1 points 6 days ago When did I make an excuse for anything, I stated facts. Im not asking for anything from anyone, all I want is government out of my way and the boomers to shut the fuck up since they're largely responsible for the currect situation and the intend to milk the system for every last fucking drop they can on their way out. permalink parent award report block reply Wozzing 1 points 6 days ago Entitled punks have it worse permalink parent award report block reply\nFearGodTheAlmighty 4 points 7 days ago One day you'll become a boomer and you'll understand. permalink parent award report block reply RedPillosopher1776 1 points 6 days ago Nope, I'm never going to be the sort of person who pulls the ladder up behind myself then stands on top the roof pissing on everyone left below just to feel some sense of value as a human being by beating down others rather than just admit im not the superman fantasy I constructed in my own head. permalink parent award report block reply FearGodTheAlmighty 0 points 6 days ago You'll understand some day permalink parent award report block reply\nRedPillosopher1776 1 points 6 days ago Nope, I'm never going to be the sort of person who pulls the ladder up behind myself then stands on top the roof pissing on everyone left below just to feel some sense of value as a human being by beating down others rather than just admit im not the superman fantasy I constructed in my own head. permalink parent award report block reply FearGodTheAlmighty 0 points 6 days ago You'll understand some day permalink parent award report block reply\nFearGodTheAlmighty 0 points 6 days ago You'll understand some day permalink parent award report block reply\ndeleted 3 points 7 days ago RedPillosopher1776 1 points 6 days ago When did I make an excuse for anything, I stated facts. Im not asking for anything from anyone, all I want is government out of my way and the boomers to shut the fuck up since they're largely responsible for the currect situation and the intend to milk the system for every last fucking drop they can on their way out. permalink parent award report block reply\nRedPillosopher1776 1 points 6 days ago When did I make an excuse for anything, I stated facts. Im not asking for anything from anyone, all I want is government out of my way and the boomers to shut the fuck up since they're largely responsible for the currect situation and the intend to milk the system for every last fucking drop they can on their way out. permalink parent award report block reply\nWozzing 1 points 6 days ago Entitled punks have it worse permalink parent award report block reply\nSisterCovfefeToo 6 points 7 days ago This is a bad take, imo, mostly because it assumes some sort of moral superiority for not using benefits when it's really, there but for the grace of God go I. The guys I serve at the shelter have had unfortunate circumstances. Some self inflicted, others out of their control. For the most part they're older men, the young ones are still strong enough to work their way out of their situation, like Catturd did. permalink award report block reply\ndeleted 6 points 7 days ago 45isthebomb 3 points 6 days ago Old Boomer here.  Whenever I got a job I worked harder than the guy next to me.  Always was asked to move up the ladder.  Went from ground floor to VP.  Now I own and run my own business.  have 10 employees and looking for a couple more. Getting ready to sell and retire.   My motivation always stemmed from the fear of being homeless.  It's a great motivator. permalink parent award report block reply\n45isthebomb 3 points 6 days ago Old Boomer here.  Whenever I got a job I worked harder than the guy next to me.  Always was asked to move up the ladder.  Went from ground floor to VP.  Now I own and run my own business.  have 10 employees and looking for a couple more. Getting ready to sell and retire.   My motivation always stemmed from the fear of being homeless.  It's a great motivator. permalink parent award report block reply\njakebrake 4 points 7 days ago Thank you for your service to our country.\nVeterans Day November 11th, the one day of remembrance to those who served. permalink award report block reply\nMoebius 4 points 7 days ago I did a 179 day 'TDY' back in the 70's eating little more than PB and Honey sammiches and canned soup...with the 'occasional' box of C-Rats...that's 'Meal, Combat Individual' for the Military Aficionados. When you're hungry enough you'll even eat the 'Spam and Mutherfuckers'... permalink award report block reply\nAwakened 3 points 7 days ago Sucker. If you paid income taxes throughout your life you should use every opportunity to try to get the money they stole from you back. permalink award report block reply\nFearGodTheAlmighty 3 points 7 days ago Amen! permalink award report block reply\nBigIgloo 3 points 7 days ago Gotta be a special sort of stupid to fail as a boomer permalink award report block reply\nsordfysh PRO 3 points 7 days ago You can tell people who are easy to buy because they build their identity on being financially comfortable. These people are easy to buy because they will justify their blood money as a reward for \"hard work\". You won't need to convince them to ignore the people they are hurting because those people are brokeys who have nobody to blame but themselves. permalink award report block reply\nExviper 2 points 6 days ago My wife and I lived off roadkill… we got deer that were hit by cars and I used to butcher them up so we all had meat.  She was a stay at home mom with our 2 children and money was tight.  We do what we need to do.  And no shame here about it at all.  Never asked for a thing from the government. permalink award report block reply\nbowlerslivesmatter 2 points 6 days ago I lived on loafs of bread with Miracle Whip for over a month once. I hate these freeloaders permalink award report block reply\nFeelsgood2020 -7 points 7 days ago Was this intended to be a pro-America post? Seems like America failed him. permalink award report block reply Th3Cho0sing0ne 9 points 7 days ago America owed him nothing.  America provided him the opportunity to have all those valuable experiences,  and grow from them.  The cat guy learned to make better choices and figured out that hard work is the best choice for growth. Cat dude would have not been sharpened into a high value human if he had just allowed 'America' (government) to give him handouts allowing him to just sit back and eat... and fuck around. When you say ' America failed him', you are implying that America should have bailed him out with welfare, and stopped him in his tracks. Don't aspire to be a welfare bum. permalink parent award report block reply Maxmax 4 points 7 days ago America never failed him.  He failed himself…then came back bigger and better than ever.  Good for Catturd. permalink parent award report block reply imnotdeadyet 6 points 7 days ago I put myself through college and grad school.  I ate a lot of ramen noodles for meals.  There are a lot of people that did the same thing.  Never had to live out of a car because I didn't have one. I was lucky enough to have decent paying summer jobs to help me pay for school, along with student loans.  Back then, college wasn't crazy expensive like it is now. permalink parent award report block reply\nTh3Cho0sing0ne 9 points 7 days ago America owed him nothing.  America provided him the opportunity to have all those valuable experiences,  and grow from them.  The cat guy learned to make better choices and figured out that hard work is the best choice for growth. Cat dude would have not been sharpened into a high value human if he had just allowed 'America' (government) to give him handouts allowing him to just sit back and eat... and fuck around. When you say ' America failed him', you are implying that America should have bailed him out with welfare, and stopped him in his tracks. Don't aspire to be a welfare bum. permalink parent award report block reply\nMaxmax 4 points 7 days ago America never failed him.  He failed himself…then came back bigger and better than ever.  Good for Catturd. permalink parent award report block reply imnotdeadyet 6 points 7 days ago I put myself through college and grad school.  I ate a lot of ramen noodles for meals.  There are a lot of people that did the same thing.  Never had to live out of a car because I didn't have one. I was lucky enough to have decent paying summer jobs to help me pay for school, along with student loans.  Back then, college wasn't crazy expensive like it is now. permalink parent award report block reply\nimnotdeadyet 6 points 7 days ago I put myself through college and grad school.  I ate a lot of ramen noodles for meals.  There are a lot of people that did the same thing.  Never had to live out of a car because I didn't have one. I was lucky enough to have decent paying summer jobs to help me pay for school, along with student loans.  Back then, college wasn't crazy expensive like it is now. permalink parent award report block reply\nFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply",
  "fetched_at": "2025-11-12T23:12:28.178593Z"
}