{
  "id": "1ARK9hjeOR",
  "url": "https://patriots.win/p/1ARK9hjeOR/blackrock-started-buying-america/c",
  "content": "392 BlackRock started buying American public utility companies posted 2 days ago by Trick 22 comments award share report block Wall Street Apes @WallStreetApes • 3d BlackRock started buying American public utility companies They buy them with debt, when the purchase goes through the debt goes to the power company, not to BlackRock This means entire states power bills will instantly rise to pay off the debt. It’s a racket and it’s started\n22 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno rivetjoint2 22 points 2 days ago I think the government needs to break up blackrock on anti-trust grounds. permalink award report block reply ReleasetheList 9 points 2 days ago Will never happen. Obama gave them immense control during the 08 bailout. permalink parent award report block reply skuts 16 points 2 days ago They seem like a shady outfit up to no good. permalink award report block reply chickeninoven 5 points 2 days ago Started buying up your neighborhood!\nI got in one 50 yr mortgage and my mom got scared,\nShe said, you're moving to a 8x10 smartpod in Bel Air permalink parent award report block reply DestroyerofCobwebs 13 points 2 days ago The whole concept of buying a private company, then using that company to acquire another company while saddling the first company with massive debt, should be illegal.  It happens all the time, and it's 100% always a scam of some sort. permalink award report block reply Standingoak 1 points 2 days ago Debt makes the Fed go round.  38 TRILLION  so far. When it stops growing the musical chairs is over. permalink parent award report block reply HeatherSwanson 11 points 2 days ago Everything private equity touches, they destroy and and drive into bankruptcy. Just look at the shitshow this housing market has become ever since Biden accelerated their hoarding. If anyone needs to be Luigied, it’s the CEOs of Blackstone and Blackrock. permalink award report block reply chickeninoven 2 points 2 days ago Good luck with that. https://www.mitrade.com/insights/news/live-news/article-3-742695-20250407 permalink parent award report block reply Standingoak 2 points 2 days ago \"You will own nothing\" permalink parent award report block reply I_Am_John_Galt 6 points 2 days ago This is what they did to companies like Toys-R-Us permalink award report block reply LaptopDied 6 points 2 days ago UH. Coerced sale? Uh no. permalink award report block reply drmrboy 5 points 2 days ago Maybe our President should do something about BlackRock ... however, they're probably in bed together.   🤓 permalink award report block reply Standingoak 1 points 2 days ago Corporations were all sub-corps of the Corporation that they all incorporated under.  The United States of America , Corporation. Know why the new flags were placed at the White House ? permalink parent award report block reply drmrboy 1 points 2 days ago Besides patriotism ... no. permalink parent award report block reply PatriotSkorzeny 4 points 2 days ago A company selling itself negates all its contracts. permalink award report block reply Ol5nDimer 2 points 2 days ago This is not remotely how these transactions work and Satchel here obviously has no idea. I literally draft purchase agreements for these types of acquisitions on a daily basis. Yes, PE firms acquire companies/utilities/everything under the sun by getting institutional investors to commit money to an investment vehicle. But the billions of dollars we're talking about for these purchases can't all be called up in a flash. So PE shop takes out a subscription facility with a big bank that is secured by the commitments the investors made and makes the actual purchase with the borrowed money. The debt is often paid back within a year but may be drawn in similar scenarios later on. Investors are not buying a piece of a company where all the revenue goes to paying back debt - that is ludicrous on its face - and the negotiated purchase price almost always includes paying off any existing debt the company already had. permalink award report block reply corntortilla 1 points 2 days ago So an investment firm is investing in utilities? Omg! That’s shocking. Somebody needs to stop this. permalink award report block reply PepesJusticeBoner 1 points 2 days ago Suddenly I'm considering a solar panel system again. Would normally take over a decade to come close to breaking even. But if Blackcock is going to meddle we all know electric rates will go up. permalink award report block reply FreedomLubber 1 points 2 days ago My electric provider has been requesting 30% rate increases for the last few years permalink award report block reply PatPede1 -1 points 2 days ago I guess he doesn't like retirees having a stable income in their 401K?  Woody Allen and Mia Farrow's son(maybe Frank Sinatra's)  is not someone I look to for sane commentary. Using capital to buy a company is about as normal as anything else done in the course of business.  Using that acquired company to acquire other companies is totally normal as well.  That is what happens when you sell an asset....the new owner gets to use it as they see fit.  If I sell you my car and you take out a title loan on it to buy another car.....that's none of my business.  If a utility is private and can sell it's assets, that is not much of the business of it's users.  I recommend using a cooperative utility....they are much better for stability....but they still have to buy energy from someone else too. permalink award report block reply Awakened 2 points 2 days ago He does a great job here. Scale is everything. You selling your little car and what Black rock is doing have a very different impact on reality. Part of the government's job is to deal with company's that get too big for their britches. Like immigration, it's a job they refuse to do. permalink parent award report block reply\nrivetjoint2 22 points 2 days ago I think the government needs to break up blackrock on anti-trust grounds. permalink award report block reply ReleasetheList 9 points 2 days ago Will never happen. Obama gave them immense control during the 08 bailout. permalink parent award report block reply\nReleasetheList 9 points 2 days ago Will never happen. Obama gave them immense control during the 08 bailout. permalink parent award report block reply\nskuts 16 points 2 days ago They seem like a shady outfit up to no good. permalink award report block reply chickeninoven 5 points 2 days ago Started buying up your neighborhood!\nI got in one 50 yr mortgage and my mom got scared,\nShe said, you're moving to a 8x10 smartpod in Bel Air permalink parent award report block reply\nchickeninoven 5 points 2 days ago Started buying up your neighborhood!\nI got in one 50 yr mortgage and my mom got scared,\nShe said, you're moving to a 8x10 smartpod in Bel Air permalink parent award report block reply\nDestroyerofCobwebs 13 points 2 days ago The whole concept of buying a private company, then using that company to acquire another company while saddling the first company with massive debt, should be illegal.  It happens all the time, and it's 100% always a scam of some sort. permalink award report block reply Standingoak 1 points 2 days ago Debt makes the Fed go round.  38 TRILLION  so far. When it stops growing the musical chairs is over. permalink parent award report block reply\nStandingoak 1 points 2 days ago Debt makes the Fed go round.  38 TRILLION  so far. When it stops growing the musical chairs is over. permalink parent award report block reply\nHeatherSwanson 11 points 2 days ago Everything private equity touches, they destroy and and drive into bankruptcy. Just look at the shitshow this housing market has become ever since Biden accelerated their hoarding. If anyone needs to be Luigied, it’s the CEOs of Blackstone and Blackrock. permalink award report block reply chickeninoven 2 points 2 days ago Good luck with that. https://www.mitrade.com/insights/news/live-news/article-3-742695-20250407 permalink parent award report block reply Standingoak 2 points 2 days ago \"You will own nothing\" permalink parent award report block reply\nchickeninoven 2 points 2 days ago Good luck with that. https://www.mitrade.com/insights/news/live-news/article-3-742695-20250407 permalink parent award report block reply\nStandingoak 2 points 2 days ago \"You will own nothing\" permalink parent award report block reply\nI_Am_John_Galt 6 points 2 days ago This is what they did to companies like Toys-R-Us permalink award report block reply\nLaptopDied 6 points 2 days ago UH. Coerced sale? Uh no. permalink award report block reply\ndrmrboy 5 points 2 days ago Maybe our President should do something about BlackRock ... however, they're probably in bed together.   🤓 permalink award report block reply Standingoak 1 points 2 days ago Corporations were all sub-corps of the Corporation that they all incorporated under.  The United States of America , Corporation. Know why the new flags were placed at the White House ? permalink parent award report block reply drmrboy 1 points 2 days ago Besides patriotism ... no. permalink parent award report block reply\nStandingoak 1 points 2 days ago Corporations were all sub-corps of the Corporation that they all incorporated under.  The United States of America , Corporation. Know why the new flags were placed at the White House ? permalink parent award report block reply drmrboy 1 points 2 days ago Besides patriotism ... no. permalink parent award report block reply\ndrmrboy 1 points 2 days ago Besides patriotism ... no. permalink parent award report block reply\nPatriotSkorzeny 4 points 2 days ago A company selling itself negates all its contracts. permalink award report block reply\nOl5nDimer 2 points 2 days ago This is not remotely how these transactions work and Satchel here obviously has no idea. I literally draft purchase agreements for these types of acquisitions on a daily basis. Yes, PE firms acquire companies/utilities/everything under the sun by getting institutional investors to commit money to an investment vehicle. But the billions of dollars we're talking about for these purchases can't all be called up in a flash. So PE shop takes out a subscription facility with a big bank that is secured by the commitments the investors made and makes the actual purchase with the borrowed money. The debt is often paid back within a year but may be drawn in similar scenarios later on. Investors are not buying a piece of a company where all the revenue goes to paying back debt - that is ludicrous on its face - and the negotiated purchase price almost always includes paying off any existing debt the company already had. permalink award report block reply\ncorntortilla 1 points 2 days ago So an investment firm is investing in utilities? Omg! That’s shocking. Somebody needs to stop this. permalink award report block reply\nPepesJusticeBoner 1 points 2 days ago Suddenly I'm considering a solar panel system again. Would normally take over a decade to come close to breaking even. But if Blackcock is going to meddle we all know electric rates will go up. permalink award report block reply\nFreedomLubber 1 points 2 days ago My electric provider has been requesting 30% rate increases for the last few years permalink award report block reply\nPatPede1 -1 points 2 days ago I guess he doesn't like retirees having a stable income in their 401K?  Woody Allen and Mia Farrow's son(maybe Frank Sinatra's)  is not someone I look to for sane commentary. Using capital to buy a company is about as normal as anything else done in the course of business.  Using that acquired company to acquire other companies is totally normal as well.  That is what happens when you sell an asset....the new owner gets to use it as they see fit.  If I sell you my car and you take out a title loan on it to buy another car.....that's none of my business.  If a utility is private and can sell it's assets, that is not much of the business of it's users.  I recommend using a cooperative utility....they are much better for stability....but they still have to buy energy from someone else too. permalink award report block reply Awakened 2 points 2 days ago He does a great job here. Scale is everything. You selling your little car and what Black rock is doing have a very different impact on reality. Part of the government's job is to deal with company's that get too big for their britches. Like immigration, it's a job they refuse to do. permalink parent award report block reply\nAwakened 2 points 2 days ago He does a great job here. Scale is everything. You selling your little car and what Black rock is doing have a very different impact on reality. Part of the government's job is to deal with company's that get too big for their britches. Like immigration, it's a job they refuse to do. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:00:37.002313Z"
}