{
  "id": "1ARK9mGxlA",
  "url": "https://patriots.win/p/1ARK9mGxlA/but-not-the-legal-ones-right/c",
  "content": "56 but not the legal ones, right? posted 16 hours ago by Hanging_Chad 4 comments award share download report block\n4 comments Sort by Top Top New Worst Old Save Around the Web discoelmo -3 points 16 hours ago You do realize that actresses are no different from prostitutes right. And its not the shit that they do onscreen. Its the shit that they do off screen as well. permalink award report block reply Toohershat 2 points 15 hours ago But she's popular here because of her traits outside of her acting career permalink parent award report block reply Metal4Freedom 1 points 14 hours ago Sidney and her Sweeneys? permalink parent award report block reply discoelmo -1 points 15 hours ago What traits? There's no such thing as a conservative woman. permalink parent award report block reply\ndiscoelmo -3 points 16 hours ago You do realize that actresses are no different from prostitutes right. And its not the shit that they do onscreen. Its the shit that they do off screen as well. permalink award report block reply Toohershat 2 points 15 hours ago But she's popular here because of her traits outside of her acting career permalink parent award report block reply Metal4Freedom 1 points 14 hours ago Sidney and her Sweeneys? permalink parent award report block reply discoelmo -1 points 15 hours ago What traits? There's no such thing as a conservative woman. permalink parent award report block reply\nToohershat 2 points 15 hours ago But she's popular here because of her traits outside of her acting career permalink parent award report block reply Metal4Freedom 1 points 14 hours ago Sidney and her Sweeneys? permalink parent award report block reply discoelmo -1 points 15 hours ago What traits? There's no such thing as a conservative woman. permalink parent award report block reply\nMetal4Freedom 1 points 14 hours ago Sidney and her Sweeneys? permalink parent award report block reply\ndiscoelmo -1 points 15 hours ago What traits? There's no such thing as a conservative woman. permalink parent award report block reply",
  "fetched_at": "2025-11-12T23:27:09.646940Z"
}