{
  "id": "1ARK9l7Bez",
  "url": "https://patriots.win/p/1ARK9l7Bez/our-founders-spoke-and-wrote-in-/c",
  "content": "484 Our founders spoke and wrote in Latin. They could recite the Iliad, were familiar with the plots of the Theban plays, and quoted Marcus Aurelius. They argued with the words of Hume, Locke, and Descartes. posted 1 day ago by perma-maga 22 comments award share report block memetic_sisyphus @memeticsisyphus • 3d Our founders spoke and wrote in Latin. They could recite the Iliad, were familiar with the plots of the Theban plays, and quoted Marcus Aurelius. They argued with the words of Hume, Locke, and Descartes. Our nation's capitals are inspired by the ancient temples built to honor the maria🦋 @marias_library • 6d Y'all know they mean white Americans and no they don't have culture. You're Ashley, you live in Kentucky and ancient Greek culture has nothing to do with you. It will be a miracle if y'all can even locate some of these places on a map\n22 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Roadpower 29 points 1 day ago The orcs can barely put a full sentence together. permalink award report block reply JesusisLordofAll777 15 points 1 day ago Mumble rap gutteral utterance permalink parent award report block reply perma-maga OP 21 points 1 day ago Our founders spoke and wrote in Latin. They could recite the Iliad, were familiar with the plots of the Theban plays, and quoted Marcus Aurelius. They argued with the words of Hume, Locke, and Descartes. Our nation's capitals are inspired by the ancient temples built to honor the Olympian gods. Our music theory was shaped by Catholic monks in Italy centuries ago, and all Western music flows from this foundation. The concept of human rights, as enshrined in our Constitution, was first articulated by Dominican monks in Spain. European luminaries marveled at young America, seeing it as the emerging cultural heir of Western civilization. Dvořák composed his New World Symphony in tribute, Tocqueville provided a detailed analysis of our society. Americans took this rich cultural heritage and built upon it, creating new art forms, pioneering scientific breakthroughs, exploring the vastness of the heavens, unlocking the secrets of our genome, stepping onto other worlds, and developing technology that connects the globe. Even the most superficial aspects of culture: food, clothing, music, have been transformed by America. We have built a society of technological marvels and material abundance, founded on the best traditions of the Old World. It has taken extraordinary effort and untold amounts of propaganda, to convince people that America is a cultural void. It’s a take as ignorant as it is exhausted. permalink award report block reply yukondave 18 points 1 day ago Yeah I have had it with people false framing what was built here. My first response is, if it is so bad, why is the world scrambling to come here?  It takes some kind of stupid to say this place is not amazing and special. permalink parent award report block reply MastaJoda 4 points 1 day ago too be fair the 3rd world is fighting to get here for the free gibs and the legal ones to steal jobs and wealth from Americans, and they vote to destroy everything America was designed to be. permalink parent award report block reply fuck__cnn 18 points 1 day ago People steeped in White Culture don't even realize how good it is. permalink award report block reply PensivePatriot 6 points 1 day ago People steeped in white culture don’t realize that theirs is downstream of it. Go to Europe or Asia, you’ll know what’s what. permalink parent award report block reply WesternCivilization 14 points 1 day ago \"Ancient Greek culture has nothing to do with you.\" Completely incorrect, retard. permalink award report block reply YT45 7 points 1 day ago By their own logic, the foreign cultures they fetishize have nothing to do with them, either. In actuality, classical Greek and Roman culture and tradition have much more to do with us than anything they’re into. permalink parent award report block reply schnazzmizzle 3 points 23 hours ago I'm sure Alexander the Great would have something to say about that. permalink parent award report block reply 24601 8 points 1 day ago My 14 year old knows Latin and has read the Iliad. Your children can as well.... CLRC Great Books 1: https://www.clrconline.com/great-books-i/ permalink award report block reply LaptopDied 6 points 1 day ago MAGAnificent post. Buy a complete Shakeseare, maybe used, immediately. Yay Western civ! permalink award report block reply 1DontTreadOnMe1 4 points 1 day ago Meanwhile, they keep appropriating White culture while claiming it is their own. permalink award report block reply walls4america 4 points 1 day ago Even Illinois “Americanized” their cities of Cairo and Versailles, which are pronounced like Karo syrup (Kay-row) and “Ver-sails”. permalink award report block reply booblitchutz 3 points 1 day ago Texas looks around nervously permalink parent award report block reply Bullet3250 3 points 1 day ago It's Americanism... America the Virtuous. America the Right. America the Godly. permalink award report block reply Just_dumping_fuel 3 points 1 day ago the ones that can locate these places on a map and have read the works are not the ones being put in positions to educate the next generation. they despise the intelligence of the white culture and bring the whites down to their IQ level because they cannot compete on a intellectual level. anyone that knows they attack them socially permalink award report block reply booblitchutz 1 points 1 day ago lol okay “Maria”. permalink award report block reply bidensmissingbrain 3 points 1 day ago Who's from Dallas, and has even less connection to the ancient Aztecs than Ashley does Greece. permalink parent award report block reply booblitchutz 4 points 1 day ago These wetback pieces of shit couldn’t even trace their lineage beyond the fence jumper that knocked up her Mama. permalink parent award report block reply Dantalian 1 points 1 day ago Average IQ - for the modern era, anyway - peaked in the 1880s. permalink award report block reply Ch3f4554551n 0 points 1 day ago ...and were Deists. Praise the Monad. permalink award report block reply\nRoadpower 29 points 1 day ago The orcs can barely put a full sentence together. permalink award report block reply JesusisLordofAll777 15 points 1 day ago Mumble rap gutteral utterance permalink parent award report block reply\nJesusisLordofAll777 15 points 1 day ago Mumble rap gutteral utterance permalink parent award report block reply\nperma-maga OP 21 points 1 day ago Our founders spoke and wrote in Latin. They could recite the Iliad, were familiar with the plots of the Theban plays, and quoted Marcus Aurelius. They argued with the words of Hume, Locke, and Descartes. Our nation's capitals are inspired by the ancient temples built to honor the Olympian gods. Our music theory was shaped by Catholic monks in Italy centuries ago, and all Western music flows from this foundation. The concept of human rights, as enshrined in our Constitution, was first articulated by Dominican monks in Spain. European luminaries marveled at young America, seeing it as the emerging cultural heir of Western civilization. Dvořák composed his New World Symphony in tribute, Tocqueville provided a detailed analysis of our society. Americans took this rich cultural heritage and built upon it, creating new art forms, pioneering scientific breakthroughs, exploring the vastness of the heavens, unlocking the secrets of our genome, stepping onto other worlds, and developing technology that connects the globe. Even the most superficial aspects of culture: food, clothing, music, have been transformed by America. We have built a society of technological marvels and material abundance, founded on the best traditions of the Old World. It has taken extraordinary effort and untold amounts of propaganda, to convince people that America is a cultural void. It’s a take as ignorant as it is exhausted. permalink award report block reply yukondave 18 points 1 day ago Yeah I have had it with people false framing what was built here. My first response is, if it is so bad, why is the world scrambling to come here?  It takes some kind of stupid to say this place is not amazing and special. permalink parent award report block reply MastaJoda 4 points 1 day ago too be fair the 3rd world is fighting to get here for the free gibs and the legal ones to steal jobs and wealth from Americans, and they vote to destroy everything America was designed to be. permalink parent award report block reply\nyukondave 18 points 1 day ago Yeah I have had it with people false framing what was built here. My first response is, if it is so bad, why is the world scrambling to come here?  It takes some kind of stupid to say this place is not amazing and special. permalink parent award report block reply MastaJoda 4 points 1 day ago too be fair the 3rd world is fighting to get here for the free gibs and the legal ones to steal jobs and wealth from Americans, and they vote to destroy everything America was designed to be. permalink parent award report block reply\nMastaJoda 4 points 1 day ago too be fair the 3rd world is fighting to get here for the free gibs and the legal ones to steal jobs and wealth from Americans, and they vote to destroy everything America was designed to be. permalink parent award report block reply\nfuck__cnn 18 points 1 day ago People steeped in White Culture don't even realize how good it is. permalink award report block reply PensivePatriot 6 points 1 day ago People steeped in white culture don’t realize that theirs is downstream of it. Go to Europe or Asia, you’ll know what’s what. permalink parent award report block reply\nPensivePatriot 6 points 1 day ago People steeped in white culture don’t realize that theirs is downstream of it. Go to Europe or Asia, you’ll know what’s what. permalink parent award report block reply\nWesternCivilization 14 points 1 day ago \"Ancient Greek culture has nothing to do with you.\" Completely incorrect, retard. permalink award report block reply YT45 7 points 1 day ago By their own logic, the foreign cultures they fetishize have nothing to do with them, either. In actuality, classical Greek and Roman culture and tradition have much more to do with us than anything they’re into. permalink parent award report block reply schnazzmizzle 3 points 23 hours ago I'm sure Alexander the Great would have something to say about that. permalink parent award report block reply\nYT45 7 points 1 day ago By their own logic, the foreign cultures they fetishize have nothing to do with them, either. In actuality, classical Greek and Roman culture and tradition have much more to do with us than anything they’re into. permalink parent award report block reply\nschnazzmizzle 3 points 23 hours ago I'm sure Alexander the Great would have something to say about that. permalink parent award report block reply\n24601 8 points 1 day ago My 14 year old knows Latin and has read the Iliad. Your children can as well.... CLRC Great Books 1: https://www.clrconline.com/great-books-i/ permalink award report block reply\nLaptopDied 6 points 1 day ago MAGAnificent post. Buy a complete Shakeseare, maybe used, immediately. Yay Western civ! permalink award report block reply\n1DontTreadOnMe1 4 points 1 day ago Meanwhile, they keep appropriating White culture while claiming it is their own. permalink award report block reply\nwalls4america 4 points 1 day ago Even Illinois “Americanized” their cities of Cairo and Versailles, which are pronounced like Karo syrup (Kay-row) and “Ver-sails”. permalink award report block reply booblitchutz 3 points 1 day ago Texas looks around nervously permalink parent award report block reply\nbooblitchutz 3 points 1 day ago Texas looks around nervously permalink parent award report block reply\nBullet3250 3 points 1 day ago It's Americanism... America the Virtuous. America the Right. America the Godly. permalink award report block reply\nJust_dumping_fuel 3 points 1 day ago the ones that can locate these places on a map and have read the works are not the ones being put in positions to educate the next generation. they despise the intelligence of the white culture and bring the whites down to their IQ level because they cannot compete on a intellectual level. anyone that knows they attack them socially permalink award report block reply\nbooblitchutz 1 points 1 day ago lol okay “Maria”. permalink award report block reply bidensmissingbrain 3 points 1 day ago Who's from Dallas, and has even less connection to the ancient Aztecs than Ashley does Greece. permalink parent award report block reply booblitchutz 4 points 1 day ago These wetback pieces of shit couldn’t even trace their lineage beyond the fence jumper that knocked up her Mama. permalink parent award report block reply\nbidensmissingbrain 3 points 1 day ago Who's from Dallas, and has even less connection to the ancient Aztecs than Ashley does Greece. permalink parent award report block reply booblitchutz 4 points 1 day ago These wetback pieces of shit couldn’t even trace their lineage beyond the fence jumper that knocked up her Mama. permalink parent award report block reply\nbooblitchutz 4 points 1 day ago These wetback pieces of shit couldn’t even trace their lineage beyond the fence jumper that knocked up her Mama. permalink parent award report block reply\nDantalian 1 points 1 day ago Average IQ - for the modern era, anyway - peaked in the 1880s. permalink award report block reply\nCh3f4554551n 0 points 1 day ago ...and were Deists. Praise the Monad. permalink award report block reply",
  "fetched_at": "2025-11-12T21:15:37.961727Z"
}