{
  "id": "1ARK57rgOM",
  "url": "https://patriots.win/p/1ARK57rgOM/it-shouldnt-be-illegal-for-me-to/c",
  "content": "321 It shouldn’t be illegal for me to sell my neighbor a pork chop or a pound of ground beef from an animal born, raised and processed on my farm.\n\nI will not comply.\n\nFood is fundamental to life and government shouldn’t be involved in a food transaction between neighbors. SAVE AMERICA posted 4 days ago by blue5707 18 comments award share report block Homesteading4sovereignty @sovernTranch • 6d It shouldn’t be illegal for me to sell my neighbor a pork chop or a pound of ground beef from an animal born, raised and processed on my farm I will not comply Food is fundamental to life and government shouldn’t be involved in a food transaction between neighbors\n18 comments Sort by Top Top New Worst Old Save Around the Web Hair Grows Back in A Few Days! At Any Stage of Baldness HaloGrow AfterGlow 13 points 4 days ago I'd be there and buying. permalink award report block reply shadypollster 8 points 4 days ago Yeah if I had a cool farmer neighbor who butchered I'd totally buy from them. permalink parent award report block reply Madnote1984 11 points 4 days ago The issue is that big agriculture producers lobby for more and more restrictions to undercut small farms and independent producers. Tyson chicken famously lobbied the USDA/FDA to pass vaccine mandates on chickens that cost them 10's of millions a year because they knew that market competitors couldn't afford the cost. It drove many of them out of the market. Now you've essentially got Tyson and Perdue controlling 95% of national poultry production. permalink award report block reply thelastlast 5 points 4 days ago and both companies are disgusting, both their chicken and to their workers permalink parent award report block reply NadlersNads 10 points 4 days ago How free were we ever? permalink award report block reply CommonSenseAmerican 2 points 4 days ago Before the internet there wasn't a snitch spyware device in everyone's pockets. It was more of a put up or shut up world. permalink parent award report block reply Flataxandmaga 9 points 4 days ago But that would cut out all those middle men. permalink award report block reply FatBeagleMars 1 points 4 days ago Amen brother! permalink parent award report block reply Waxfactory 5 points 4 days ago I seen this meme. Only 20 years ago on an expose on alex jones show. I hope all yall understand this defiance will be met with swift raids and executed on site livestock permalink award report block reply Waxfactory 4 points 4 days ago Also a big red and yellow sticker that says \"this facility closed for non compliance \" hope ya like that f350 in local impound, oh yea and bank of America line of credit closed. Enjoy starving who ite supremacist permalink parent award report block reply RedStoneDeepState 4 points 4 days ago Meat processing regulations need relaxed but to some degree should still exist. I would strongly prefer it to be de-regulated to the primal level for beef -  chuck, rib, loin, round, flank, plate, brisket, and shank - and for hogs shoulder, loin, belly, and leg. You can sell a whole brisket to your neighbor and they can grind it, but not ground beef. To be clear, I don't buy ground beef when I am in 3rd world countries for this reason. permalink award report block reply utfanx2 2 points 4 days ago Should of included the whole body in the 2nd and not just arms. Meat being necessary to the healthy consumption and welfare of a free state. The right of the people to keep and bear breasts and thighs shall not be infringed. permalink award report block reply FearGodTheAlmighty 1 points 4 days ago Amen! permalink award report block reply blitzkrieg1 1 points 4 days ago Never asked for permission and never gonna. permalink award report block reply Standingoak 1 points 4 days ago They came for the Amish...but you weren't Amish , Then they came... permalink parent award report block reply Maga305_47 1 points 4 days ago I want to buy moose from hunters up north but no can do permalink award report block reply mikethemarine 1 points 4 days ago absafuckinglutly, But the government doesn't want to give this food control up, WHY cause the food supply is required to be controlled by the government to have a communist government, we really don't need money to survive, we do need our guns water food, even medical isn't totally needed, antibiotics is the biggest medical breakthrough in history infections killed more people in war than even the bullets, till antibiotics permalink award report block reply Butttoucha9k 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nAfterGlow 13 points 4 days ago I'd be there and buying. permalink award report block reply shadypollster 8 points 4 days ago Yeah if I had a cool farmer neighbor who butchered I'd totally buy from them. permalink parent award report block reply\nshadypollster 8 points 4 days ago Yeah if I had a cool farmer neighbor who butchered I'd totally buy from them. permalink parent award report block reply\nMadnote1984 11 points 4 days ago The issue is that big agriculture producers lobby for more and more restrictions to undercut small farms and independent producers. Tyson chicken famously lobbied the USDA/FDA to pass vaccine mandates on chickens that cost them 10's of millions a year because they knew that market competitors couldn't afford the cost. It drove many of them out of the market. Now you've essentially got Tyson and Perdue controlling 95% of national poultry production. permalink award report block reply thelastlast 5 points 4 days ago and both companies are disgusting, both their chicken and to their workers permalink parent award report block reply\nthelastlast 5 points 4 days ago and both companies are disgusting, both their chicken and to their workers permalink parent award report block reply\nNadlersNads 10 points 4 days ago How free were we ever? permalink award report block reply CommonSenseAmerican 2 points 4 days ago Before the internet there wasn't a snitch spyware device in everyone's pockets. It was more of a put up or shut up world. permalink parent award report block reply\nCommonSenseAmerican 2 points 4 days ago Before the internet there wasn't a snitch spyware device in everyone's pockets. It was more of a put up or shut up world. permalink parent award report block reply\nFlataxandmaga 9 points 4 days ago But that would cut out all those middle men. permalink award report block reply FatBeagleMars 1 points 4 days ago Amen brother! permalink parent award report block reply\nFatBeagleMars 1 points 4 days ago Amen brother! permalink parent award report block reply\nWaxfactory 5 points 4 days ago I seen this meme. Only 20 years ago on an expose on alex jones show. I hope all yall understand this defiance will be met with swift raids and executed on site livestock permalink award report block reply Waxfactory 4 points 4 days ago Also a big red and yellow sticker that says \"this facility closed for non compliance \" hope ya like that f350 in local impound, oh yea and bank of America line of credit closed. Enjoy starving who ite supremacist permalink parent award report block reply\nWaxfactory 4 points 4 days ago Also a big red and yellow sticker that says \"this facility closed for non compliance \" hope ya like that f350 in local impound, oh yea and bank of America line of credit closed. Enjoy starving who ite supremacist permalink parent award report block reply\nRedStoneDeepState 4 points 4 days ago Meat processing regulations need relaxed but to some degree should still exist. I would strongly prefer it to be de-regulated to the primal level for beef -  chuck, rib, loin, round, flank, plate, brisket, and shank - and for hogs shoulder, loin, belly, and leg. You can sell a whole brisket to your neighbor and they can grind it, but not ground beef. To be clear, I don't buy ground beef when I am in 3rd world countries for this reason. permalink award report block reply\nutfanx2 2 points 4 days ago Should of included the whole body in the 2nd and not just arms. Meat being necessary to the healthy consumption and welfare of a free state. The right of the people to keep and bear breasts and thighs shall not be infringed. permalink award report block reply\nFearGodTheAlmighty 1 points 4 days ago Amen! permalink award report block reply\nblitzkrieg1 1 points 4 days ago Never asked for permission and never gonna. permalink award report block reply Standingoak 1 points 4 days ago They came for the Amish...but you weren't Amish , Then they came... permalink parent award report block reply\nStandingoak 1 points 4 days ago They came for the Amish...but you weren't Amish , Then they came... permalink parent award report block reply\nMaga305_47 1 points 4 days ago I want to buy moose from hunters up north but no can do permalink award report block reply\nmikethemarine 1 points 4 days ago absafuckinglutly, But the government doesn't want to give this food control up, WHY cause the food supply is required to be controlled by the government to have a communist government, we really don't need money to survive, we do need our guns water food, even medical isn't totally needed, antibiotics is the biggest medical breakthrough in history infections killed more people in war than even the bullets, till antibiotics permalink award report block reply\nButttoucha9k 1 points 4 days ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:10:23.323431Z"
}