{
  "id": "1ARK9mFJGY",
  "url": "https://patriots.win/p/1ARK9mFJGY/its-been-2-months-with-no-answer/c",
  "content": "223 It’s been 2 months with no answers 🤡🌎  HONK  HONK  🌎🤡 posted 22 hours ago by iteachfuckinscience 4 comments award share download report block\n4 comments Sort by Top Top New Worst Old Save kekapoo1 4 points 22 hours ago ''waiting on some leads that point in a direction we want to go'' ka$h and the bois and grrls of the d.o.j. and the f.i.b. permalink award report block reply YouEssAye 3 points 21 hours ago You didn't get the memo? We're not talking about it anymore. Its open and shut. Our guy Kash got the lone wolf. In fact, I'm getting sleepy. Aren't you getting sleepy anon? permalink award report block reply AmericanMestizo 2 points 21 hours ago I don't get why the tranny boyfriend disappearing is a surprise. He's now on a lot of people's metaphorical and literal hit lists. I'd disappear to if I was in a similar situation. Law enforcement probably knows where this guy is and knows where to find him. There really isn't any reason for the public to know his whereabouts. permalink award report block reply SCHULTZ 1 points 21 hours ago Comment removed by community moderators. permalink award report block reply\nkekapoo1 4 points 22 hours ago ''waiting on some leads that point in a direction we want to go'' ka$h and the bois and grrls of the d.o.j. and the f.i.b. permalink award report block reply\nYouEssAye 3 points 21 hours ago You didn't get the memo? We're not talking about it anymore. Its open and shut. Our guy Kash got the lone wolf. In fact, I'm getting sleepy. Aren't you getting sleepy anon? permalink award report block reply\nAmericanMestizo 2 points 21 hours ago I don't get why the tranny boyfriend disappearing is a surprise. He's now on a lot of people's metaphorical and literal hit lists. I'd disappear to if I was in a similar situation. Law enforcement probably knows where this guy is and knows where to find him. There really isn't any reason for the public to know his whereabouts. permalink award report block reply\nSCHULTZ 1 points 21 hours ago Comment removed by community moderators. permalink award report block reply",
  "fetched_at": "2025-11-12T23:28:19.411162Z"
}