{
  "id": "1ARK9nPdWl",
  "url": "https://patriots.win/p/1ARK9nPdWl/sorry-not-sorry-but-laura-ingrah/c",
  "content": "75 Sorry (NOT sorry😉), but Laura Ingraham is absolutely right here. There's nothing MAGA about over half a billion Chinese spies....er, students... coming to the U.S. And if \"half the universities go broke\" without Chinese money? As Ingraham says, SO WHAT?😏 (rumble.com) posted 2 hours ago by mateus 5 comments award share report block\n5 comments Sort by Top Top New Worst Old Save blitzkrieg1 6 points 1 hour ago There are over 1.2 million foreign students here now. permalink award report block reply Cdope45 5 points 32 minutes ago His answer was even more retarded. Who cares if HBCU go broke? They're not taking in Chinese students and shouldn't exist in the first place. permalink award report block reply JoeMcCarthyWasRight 2 points 19 minutes ago Hey Donald, go visit one of your precious HBCUs and see how much they love you back. I want 2015 Trump back not this fucking globalist cuck. permalink award report block reply ImYourHuckleberry24 2 points 32 minutes ago One is unacceptable, but 600k is not \"half a billion\". Learn maths. permalink award report block reply schism 1 points 19 minutes ago I'd like to hear him clarify how closing off our universities to 600,000 Chinese would force historically black colleges to close.  Do HBCU's really accept that many Chinese students? permalink award report block reply\nblitzkrieg1 6 points 1 hour ago There are over 1.2 million foreign students here now. permalink award report block reply\nCdope45 5 points 32 minutes ago His answer was even more retarded. Who cares if HBCU go broke? They're not taking in Chinese students and shouldn't exist in the first place. permalink award report block reply\nJoeMcCarthyWasRight 2 points 19 minutes ago Hey Donald, go visit one of your precious HBCUs and see how much they love you back. I want 2015 Trump back not this fucking globalist cuck. permalink award report block reply\nImYourHuckleberry24 2 points 32 minutes ago One is unacceptable, but 600k is not \"half a billion\". Learn maths. permalink award report block reply\nschism 1 points 19 minutes ago I'd like to hear him clarify how closing off our universities to 600,000 Chinese would force historically black colleges to close.  Do HBCU's really accept that many Chinese students? permalink award report block reply",
  "fetched_at": "2025-11-12T20:39:36.915636Z"
}